{"title":"Emma Watson - The Biography - David Nolan","uid":11822092,"size":1496063,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:000302b73a622739ba8a5fc0010bfcade227cbea&amp;dn=Emma+Watson+-+The+Biography+-+David+Nolan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1429300371,"description":"Now, as the most successful film franchise of all time comes to an end, author David Nolan takes an in-depth look at Emma's fascinating life and asks what's next for the GBP20 million a year actress...a young woman who admits she's not even sure she wants to act anymore.She's Hollywood's highest-paid female star with millions of fans all over the world and she's barely out of her teens. Emma Watson's life has been an incredible story, one in which a girl whose parents divorced when she was very young ended up finding stability on a film set among the cast and crew of the Harry Potter movies. A film set that became her home for the next ten years. Like her fellow stars of the franchise, she has had to live her early years out in public. As a nine-year-old, she had never acted professionally before she was cast as Hermione Granger - the character that author JK Rowling based on herself. These days Emma Watson has grown up to be a sleek, international star dealing with being part of a global phenomenon that shows no sign of diminishing even as it reaches its story's end. As much at home at a fashion show as she is at a film premiere, Emma Watson's every utterance is news - even her hairstyle makes headlines around the world. She's already been the face of Burberry and her passion for fashion runs very deep","torrent":{"xt":"urn:btih:000302b73a622739ba8a5fc0010bfcade227cbea","amp;dn":"Emma+Watson+-+The+Biography+-+David+Nolan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"000302b73a622739ba8a5fc0010bfcade227cbea","infoHashBuffer":{"type":"Buffer","data":[0,3,2,183,58,98,39,57,186,138,95,192,1,11,252,173,226,39,203,234]},"announce":[],"urlList":[]}}