{"title":"Gustav Holst - 'The Planets', 'A Somerset Rhapsody'; Colin M","uid":6656763,"size":165589432,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:004a18987699328caf4abac81b870d261822877b&amp;dn=Gustav+Holst+-+%5C%27The+Planets%5C%27%2C+%5C%27A+Somerset+Rhapsody%5C%27%3B+Colin+M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"ConCQWZ","files":9,"time":1315348622,"description":"Gustav Holst composed The Planets (1914-1916) well before the discovery of Pluto in 1930; though he lived until 1934, he felt no desire to extend his seven-movement suite to include a new piece devoted to it. However, at the urging of conductor Kent Nagano, composer and Holst scholar Colin Matthews has created an optional eighth movement -- Pluto, the Renewer -- to close out the work. His completion of Holst's tour of the solar system may make sense to the astronomically and astrologically minded, but artistically, its value is debatable. With Holst's ending, Neptune, the Mystic, the cycle ends with an eerie, unresolved fade-out that is lovely in expression and suggestive of the mysteries of space. Matthews' Pluto, marked Prestissimo scorrevole and composed in a chaotic, atonal style, brings The Planets to a violent and disturbing conclusion; though its final measures are as unresolved as Holst's, this ending is disheartening and a little frightening. Apart from this, the performance by the Cambridge Singers and the Royal Philharmonic Orchestra, conducted by Owain Arwel Hughes, is attractive and occasionally arresting in its beautiful colors. Unfortunately, the sound quality is on the soft side, so periodic volume adjustments may be necessary.\n\nThe Planets, Op. 32, is a seven-movement orchestral suite by the English composer Gustav Holst, written between 1914 and 1916. Each movement of the suite is named after a planet of the Solar System and its corresponding astrological character as defined by Holst. With the exception of Earth, which is not observed in astrological practice, all the planets are represented.\nFrom its premiere to the present day, the suite has been enduringly popular, influential, widely performed and the subject of numerous recordings. However, it had a protracted birth. There were four performances between September 1918 and October 1920, but they were all either private (the first performance, in London) or incomplete (two others in London and one in Birmingham). The premiere was at the Queen's Hall on 29 September 1918, conducted by Holst's friend Adrian Boult to an invited audience of about 250 people. The first complete public performance was given in London on 15 November 1920, with the London Symphony Orchestra conducted by Albert Coates.\n\n\n1 Mars, the Bringer of War\n2 Venus, the Bringer of Peace\n3 Mercury, the Winged Messenger\n4 Jupiter, the Bringer of Jollity\n5 Saturn, the Bringer of Old Age\n6 Uranus, the Magician\n7 Neptune, the Mystic\n8 Pluto, the Renewer (Colin Matthews)\n\n9 A Somerset Rhapsody\n\nCD 1 of 1 mp3 320kbps","torrent":{"xt":"urn:btih:004a18987699328caf4abac81b870d261822877b","amp;dn":"Gustav+Holst+-+%5C%27The+Planets%5C%27%2C+%5C%27A+Somerset+Rhapsody%5C%27%3B+Colin+M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"004a18987699328caf4abac81b870d261822877b","infoHashBuffer":{"type":"Buffer","data":[0,74,24,152,118,153,50,140,175,74,186,200,27,135,13,38,24,34,135,123]},"announce":[],"urlList":[]}}