{"title":"Wondrous Realms of the Aegean (History Art Ebook).pdf","uid":10483439,"size":32638238,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00676756d6f9208ce8374a06c374cda980d1c442&amp;dn=Wondrous+Realms+of+the+Aegean+%28History+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1404428365,"description":"Pdf / English / Series Lost Civilizations / 168 pag / 1993 / 31 MB\n\nWondrous Realms of the Aegean is one of twenty-four volumes in the Time-Life books series Lost Civilizations. This series explores the worlds of the past, using the finds of archaeologists and other scientists to bring ancient peoples and their cultures vividly to life. This volume is an overview of the Bronze Age (3500 BC-1050 BC) cultures of the Aegean Sea.\n\nThe opening chapter portrays German archaeologist Heinrich Schliemann and his excavations of Troy in present-day Turkey and Mycenae in Greece; English archaeologist Sir Arthur Evans and his excavation of Knossos on Crete are also featured. Chapter Two describes the excavation of the village of Akrotiri on the island of Thera; the origins of the story of the lost continent of Atlantis are also discussed in this chapter. Chapter Three focuses on the culture and society of Minoan Crete. The concluding chapter looks at the culture and economy of Mycenaean Greece and the translation of Linear B (the Mycenaeans' written language). Homer's Iliad and Odyssey are frequently referred to in the narrative.\n\nAs with other books in this series, numerous photographs of art, pottery, weapons, and other artifacts supplement the narrative. The book includes a time line, bibliography, and several maps. In sum, Wondrous Realms of the Aegean is a great introduction to the archaeology of the Aegean cultures of the Bronze Age.\n\nAmazon","torrent":{"xt":"urn:btih:00676756d6f9208ce8374a06c374cda980d1c442","amp;dn":"Wondrous+Realms+of+the+Aegean+%28History+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00676756d6f9208ce8374a06c374cda980d1c442","infoHashBuffer":{"type":"Buffer","data":[0,103,103,86,214,249,32,140,232,55,74,6,195,116,205,169,128,209,196,66]},"announce":[],"urlList":[]}}