{"title":"B.O.C. - Fire Of Unknown Origin [1981][2012][320 KBPS]","uid":8575993,"size":99581958,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0067c090b77e889322f1115437e6239441f1512b&amp;dn=B.O.C.+-+Fire+Of+Unknown+Origin+%5B1981%5D%5B2012%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"LameDuck69","files":12,"time":1371276809,"description":"Blue Oyster Cult - Fire Of Unknown Origin [1981][2012]\n\n\n\n\n\n01. Fire Of Unknown Origin    \n02. Burnin' For You    \n03. Veteran Of The Psychic Wars    \n04. Sole Survivor  \n05. Heavy Metal: The Black And Silver   \n06. Vengeance (The Pact)  \n07. After Dark    \n08. Joan Crawford   \n09. Don't Turn Your Back \n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nBlue Ã–yster Cult (often abbreviated BÃ–C) is an American rock band from Long Island, New York, United States, best known for such hard rock and heavy metal songs as &quot;(Don't Fear) The Reaper&quot;, &quot;Godzilla&quot; and &quot;Burnin' for You&quot;, . Since the release of their self-titled debut album in 1972, the band has sold over 24 million albums worldwide, including 7 million in the United States alone.[citation needed] The band's music videos, especially &quot;Burnin' for You&quot;, received heavy rotation on MTV when the music television network premiered in 1981, cementing the band's contribution to the development and success of the music video in modern pop culture. Today, BÃ–C's music continues to be played on AOR-friendly radio stations as well as in movies, television shows, and commercials, and even during sporting events.\n\nBlue Ã–yster Cult's current lineup includes long-time members Donald &quot;Buck Dharma&quot; Roeser (lead guitar, vocals) and Eric Bloom (lead vocals, rhythm guitar, keyboard), as well as Jules Radino (drums, percussion), Richie Castellano (keyboard, guitar, vocals), and Kasim Sulton (bass guitar).\n\n-----------------------------------------------------------------------------------\n\nFire of Unknown Origin is the eighth album by the American hard rock band Blue Ã–yster Cult, released in 1981. It was produced by Martin Birch.\n\nThe album, which included the top 40 hit &quot;Burnin' for You&quot; represented a resurgence of the group's commercial standing after two albums with disappointing sales. Fire of Unknown Origin would be the final studio LP featuring the band's original lineup; during the subsequent tour, the band fired original drummer Albert Bouchard.\n\nThe album continues BÃ–C's tendency to write quirky songs, from the title track (featuring lyrics by Patti Smith) to &quot;Joan Crawford&quot;. Many of the songs were intended for the soundtrack of the animated film Heavy Metal, such as &quot;Vengeance (The Pact)&quot;, whose lyrics follow in detail the plot of the &quot;Taarna&quot; segment of the movie. However, only the song &quot;Veteran of the Psychic Wars&quot; (co-written by science fiction author Michael Moorcock) ended up in the film's final version and soundtrack.\n\n\n\n","torrent":{"xt":"urn:btih:0067c090b77e889322f1115437e6239441f1512b","amp;dn":"B.O.C.+-+Fire+Of+Unknown+Origin+%5B1981%5D%5B2012%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0067c090b77e889322f1115437e6239441f1512b","infoHashBuffer":{"type":"Buffer","data":[0,103,192,144,183,126,136,147,34,241,17,84,55,230,35,148,65,241,81,43]},"announce":[],"urlList":[]}}