{"title":"Igor Ledochowski - World Class Hypnotic Storyteller","uid":11768055,"size":4158547475,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:00796c97cde2337fe8e1b7e73ff454b654c612d2&amp;dn=Igor+Ledochowski+-+World+Class+Hypnotic+Storyteller&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"acer47x","files":23,"time":1426946250,"description":"After discovering this you too will say...\n&quot;Use This NEW &quot;Fusion Hypnosis&quot; To Influence &amp; Control People's Primal Decision Making Process...&quot;\nBest part: you can use it in everyday social conversations... as well as serious business meetings... to have an &quot;influential hold&quot; over other people...\nAnd yet: nobody will ever feel like you are putting ideas in their head or influencing them in any way...\nWhat is printed on this webpage will likely make you very envious.\n\nIt's not my intention to make you envious. But the people mentioned on this page will, I'm afraid, have something of that effect on you.\n\nTake &quot;Mr. O&quot; for example:\n\n&quot;Mr. O&quot; (his full name is omitted to protect his privacy) is a high-stakes investment bounty hunter.\n\nHe pitches for (and gets) hundreds of millions of dollars of investment capital from steely-eyed executives at major corporations -- including (but not limited to) Bear Stearns, Boeing, Disney, Honda, Texas Instruments, and Yamaha.\n\nHe also has ice-cold Russian Oligarchs and iconic billionaires (from Yahoo! And Google and the like) practically falling over themselves to invest in his ventures.\n\nAll in all, &quot;Mr. O&quot; is rather good at what he does. So good in fact that he grew his boutique investment company from $100,000,000 to $400,000,000...\nDuring The Biggest Banking Collapse In World History!\n\nHow To Be A World Class Hypnotic\nStoryteller Home Study\nVideo Course\nThe Key To Effortless Hypnosis For Instant Influence\n\nMaster Hypnotist Storyteller\n\nI guarantee you'll never... and I mean never... find these practical secrets in any hypnosis course anywhere in the world.\n\nWhy do I say that?\n\nWell, because no one teaches what Robin knows. What's more, he and I teamed up on this project. Our objective was to combine his storytelling process... with... my covert hypnosis principles.\n\nThe result: A surefire system for easy hypnosis that leads to total compliance","torrent":{"xt":"urn:btih:00796c97cde2337fe8e1b7e73ff454b654c612d2","amp;dn":"Igor+Ledochowski+-+World+Class+Hypnotic+Storyteller","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00796c97cde2337fe8e1b7e73ff454b654c612d2","infoHashBuffer":{"type":"Buffer","data":[0,121,108,151,205,226,51,127,232,225,183,231,63,244,84,182,84,198,18,210]},"announce":[],"urlList":[]}}