{"title":"Russian Orthodoxy on the Eve of Revolution","uid":11811085,"size":4942440,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00a07a8088978f898fc0db4c7e71cb9baa43e936&amp;dn=Russian+Orthodoxy+on+the+Eve+of+Revolution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1428789243,"description":"Since the collapse of the Soviet Union, Orthodox Christianity in Russia has enjoyed a remarkable resurgence. Many Russians are now looking to the history of their faith as they try to rebuild a lost way of life. Vera Shevzov has spent ten years researching Orthodoxy as it was lived in the years before the 1917 Revolution. In Russian Orthodoxy on the Eve of Revolution, she draws on a rich variety of previously untapped archival sources and published works unavailable in the West to reconstruct the religious world of lay people.\n\nShevzov traces the means by which men and women shaped their religious lives in an ecclesiastical system that was often dominated by bureaucrats and monastic bishops. She finds vivid displays of resistance to the official system and equally vivid affirmations of faith. Focusing on various &quot;centers&quot; of religious life--the church temple, chapels, feasts, icons, and the Virgin Mary--she traces the rituals, beliefs, and communal dynamics that lent these centers meaning. Shevzov also presents the conflicting voices of ecclesiastical officials. She questions the notion that the only challenge to Orthodoxy at the end of the ancien regime came from outsiders such as Marxist revolutionaries, atheistic intellectuals, and urban factor workers. Instead, she shows that a different but equally great challenge emerged within the faith community itself. Indeed, the late nineteenth and early twentieth century is revealed as one of the most dynamic periods in the history of Russian Orthodoxy, characterized by debates analogous to the Reformation or the era of Vatican II. Russian Orthodoxy on the Eve of Revolution breaks new ground by giving voice to the previously-ignored common people during this period immediately preceding one of the most important events of the twentieth century","torrent":{"xt":"urn:btih:00a07a8088978f898fc0db4c7e71cb9baa43e936","amp;dn":"Russian+Orthodoxy+on+the+Eve+of+Revolution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00a07a8088978f898fc0db4c7e71cb9baa43e936","infoHashBuffer":{"type":"Buffer","data":[0,160,122,128,136,151,143,137,143,192,219,76,126,113,203,155,170,67,233,54]},"announce":[],"urlList":[]}}