{"title":"Modern Vampires of the City","uid":8446705,"size":106511667,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:00e15901a7a68d60d6389abc91d978310edab709&amp;dn=Modern+Vampires+of+the+City&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bloodhold","files":12,"time":1367907731,"description":"This is a leaked version of the new Vampire Weekend album, &quot;Modern Vampires of the City&quot;.\n\n\nIF YOU LIKE THIS ALBUM, PLEASE SUPPORT THE BAND AND BUY THE ALBUM WHEN IT IS RELEASED!\n\n\nAll audio files are MPEG-3, 320 kbps bit rate. Properly tagged.\n\n\nInfo from Wikipedia:\nModern Vampires of the City is the third studio album by the American rock band Vampire Weekend, released May 6, 2013 through XL Recordings. Following their sophomore effort Contra (2010), the band toured and began writing their next effort during sound checks. After a period in which the quintet pursued different musical projects, they regrouped and began work on their third record in 2011. Working with no deadline in mind, the band brought in outside record producer for the first time, Ariel Rechtshaid.\nRecorded in various locations, including New York, Los Angeles, Martha's Vineyard and apartments, Modern Vampires of the City is an attempt to distance the band from the sound they became heavily associated with following their 2008 debut and Contra. Broadly experimental, the sound featured on the record is the result of a variety of unconventional recording assets, including pitch shifting. The cover art is a 1966 photograph by Neal Boenzi of the smoggiest day in New York City history, on which the air pollution killed at least 169 people. Announced in a New York Times classified in February 2013, two singles have thus far been released: &quot;Diane Young&quot;/&quot;Step&quot;, and &quot;Ya Hey&quot;.\n\n\nTracklisting:\n\n1. Obvious Bicycle\n2. Unbelievers\n3. Step\n4. Diane Young\n5. Don't Lie\n6. Hannah Hunt\n7. Everlasting Arms\n8. Finger Back\n9. Worship You\n10. Ya Hey\n11. Hudson\n12. Young Lion","torrent":{"xt":"urn:btih:00e15901a7a68d60d6389abc91d978310edab709","amp;dn":"Modern+Vampires+of+the+City","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00e15901a7a68d60d6389abc91d978310edab709","infoHashBuffer":{"type":"Buffer","data":[0,225,89,1,167,166,141,96,214,56,154,188,145,217,120,49,14,218,183,9]},"announce":[],"urlList":[]}}