{"title":"There's More to Life Than This [2013][Theresa Caputo][mobi/epub]","uid":9093122,"size":1597371,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0132eea5a68a57e06969440df18f0950e6ea82de&amp;dn=There%27s+More+to+Life+Than+This+%5B2013%5D%5BTheresa+Caputo%5D%5Bmobi%2Fepub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1382641302,"description":"There's More to Life Than This: Healing Messages, Remarkable Stories, and Insight About the Other Side from the Long Island Medium - Theresa Caputo\n\n\nFormat: mobi/epub\nLength: 256 pages\nGenre: Non-Fiction/Spirituality\nDate: 1 October 2013\n\nBrassy and beloved medium Theresa Caputo, star of the hit television show Long Island Medium, opens the door to her world and invites you to experience her exceptional gift of communicating with those who've crossed over to the Other Side.\n\nThe always funny, frank, and down-to-earth medium - whether she's talking to her family, the local butcher, or the souls of those who've passed on - began communicating with Spirit at the age of four, but didn't fully accept her gift until she was thirty-three years old. She had a good life as a busy wife and working mom, but also suffered from chronic anxiety that, as it turned out, came from ignoring her abilities. Once Theresa began channeling, she realized that she felt much better after delivering a message from Spirit and releasing that energy. Since then she's used her extraordinary gift to help people heal from the loss of their loved ones.\n\nThere?s More to Life Than This lends insight on how Theresa's mediumship works, what happens to your soul when you die, what Spirit says Heaven is like, what the deceased want you to know, the importance of living a positive life, and the many roles that your family, friends, angels, guides, souls of faith, and God play here and in the afterlife. It also explores how to safely connect with Spirit, so that you can recognize when your loved ones are reaching out.\n\nAuthor:\n\nTheresa Caputo was born and raised on Long Island in Hicksville, New York, and lives there today with her husband and two children. She is the star of Long Island Medium, a reality television show about her life that airs on TLC. Theresa has been a practicing medium for more than ten years and is a certified medium with the Forever-Family Foundation.\n","torrent":{"xt":"urn:btih:0132eea5a68a57e06969440df18f0950e6ea82de","amp;dn":"There%27s+More+to+Life+Than+This+%5B2013%5D%5BTheresa+Caputo%5D%5Bmobi%2Fepub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0132eea5a68a57e06969440df18f0950e6ea82de","infoHashBuffer":{"type":"Buffer","data":[1,50,238,165,166,138,87,224,105,105,68,13,241,143,9,80,230,234,130,222]},"announce":[],"urlList":[]}}