{"title":"The Bernini Mystery Unraveled (ENG)(NL SUBS) 2Lions-Team","uid":5236743,"size":4486088036,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0136f10fd3eeda20450c9548f56d41ce70cb9a58&amp;dn=The+Bernini+Mystery+Unraveled+%28ENG%29%28NL+SUBS%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":-1,"time":1261526781,"description":"Het Bernini Mysterie Ontrafeld \n\nThe Bernini Mystery Unraveled      \n\n \n  In het boek 'Het Bernini Mysterie' voert Dan Brown zijn lezers een wereld binnen van verborgen boodschappen. Deze komen zowel voor in kerken als op beeldhouwwerken in Rome. Een mysterieus kerkelijk genootschap komt in dit boek opnieuw tot leven. Het doel van deze genootschap is de verwoesting van het Vaticaan. \n\nMaar wat zijn nu feiten en wat is fictie? Wie was de beeldhouwer Bernini en staan er echt verborgen boodschappen op de beelden? Bestaat er inderdaad een geheim genootschap onder de naam Illuminati? Schuilt er werkelijkheid in de bescreven geheime rituelen en bestaan de ondergrondse doorgangen in het Vaticaan ook in het echt? \n\nIn deze bijzondere documentaire gaat onderzoeker Simon Cox in op bijna alle belangrijke facetten uit het boek en onderscheidt hij de feiten van de fictie. Voor de liefhebbers van het boek van Dan Brown is deze dvd dan ook een bron van extra informatie om zo de geheimen achter de legende van de Illuminati te ontdekken.\n\n\nThe Bernini Mystery Unraveled\n\n \n  In the book &quot;Angels and Demons&quot; Dan Brown introduces his readers a world of hidden messages. These are both in churches and on sculptures in Rome. A mysterious religious society in this book comes back to life. The purpose of this society is the destruction of the Vatican.\n\nBut what are facts and what is fiction? Who was the sculptor Bernini and are really hidden messages on images? Is there really a secret society called Illuminati? Is there reality in bescreven secret rituals and the subways are in the Vatican in real life?\n\nIn this special documentary researcher Simon Cox in most major facets of the book and distinguishes the facts from the fiction. For lovers of the book by Dan Brown, this DVD also a source of additional information as to the secrets behind the legend of the Illuminati to discover.\n\n \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\nGenre: Documentaire \nLeeftijd: Alle Leeftijden        \nRegio: 2 \nBeeld: PAL - Kleur  \nJaar Van Uitgifte:  2005 \nSpeelduur Ca.: 48 min.  \n\n \nOndertitels : Nederlands (Extern)\n \nGenre : Documentaire\n \nWeblink : http://www.dvdparadijs.nl/info/bernini-mysterie-ontrafeld-het-4991.html \n\n \n","torrent":{"xt":"urn:btih:0136f10fd3eeda20450c9548f56d41ce70cb9a58","amp;dn":"The+Bernini+Mystery+Unraveled+%28ENG%29%28NL+SUBS%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0136f10fd3eeda20450c9548f56d41ce70cb9a58","infoHashBuffer":{"type":"Buffer","data":[1,54,241,15,211,238,218,32,69,12,149,72,245,109,65,206,112,203,154,88]},"announce":[],"urlList":[]}}