{"title":"The Art of War by Sun Tzu","uid":8738242,"size":197256,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01cba6de387e39119d837f52290242fcd23cfe76&amp;dn=The+Art+of+War+by+Sun+Tzu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"OrajelJunkie","files":-1,"time":1374721578,"description":"Written in China more than 2,000 years ago, Sun Tzu's classic The Art of War is the first known study of the planning and conduct of military operations. These terse, aphoristic essays are unsurpassed in comprehensiveness and depth of understanding, examining not only battlefield maneuvers, but also relevant economic, political, and psychological factors. Indeed, the precepts outlined by Sun Tzu can be applied outside the realm of military theory. It is read avidly by Japanese businessmen and in fact was touted in the movie Wall Street as the corporate raider's bible. \nIn addition to an excellent translation of Sun Tzu's text, Samuel Griffith also provides commentaries written by Chinese strategists, plus several thought-provoking essays on topics such as the influence of Sun Tzu on Mao Tse-tung and on Japanese military thought, the nature of warfare in Sun Tzu's time, and the life of Sun Tzu and other important commentators. Remarkable for its clear organization, lucid prose, and the acuity of its intellectual and moral insights, The Art of War is the definitive study of combat.","torrent":{"xt":"urn:btih:01cba6de387e39119d837f52290242fcd23cfe76","amp;dn":"The+Art+of+War+by+Sun+Tzu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01cba6de387e39119d837f52290242fcd23cfe76","infoHashBuffer":{"type":"Buffer","data":[1,203,166,222,56,126,57,17,157,131,127,82,41,2,66,252,210,60,254,118]},"announce":[],"urlList":[]}}