{"title":"Soundtrack - Shaft In Africa (1973) MP3@320","uid":10390799,"size":64626377,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:020d013659b8315b64eb1388a88278f8a6752dc6&amp;dn=Soundtrack+-+Shaft+In+Africa+%281973%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"AaronVincent","files":13,"time":1403195049,"description":"Great album/soundtrack from 1973!\n\n&quot;Welcome to the world of blaxploitation: a place where thin plot lines and the inevitable wah-wah pedal are never far out of sight. A place as well, where movies are sometimes overruled by their inspired soundtracks. Soundtracks in turn can go pale compared to the accompanying album covers. While Shaft is probably best remembered for the genre's exemplary theme song, the thing about Shaft in Africa that instantly meets the eye is the over-the-top artwork. Though generally expensive, no soul collection should do without at least a few of these. Released in 1971, the original Shaft was one of the first movies centered on a black private investigator. Addressing social issues or taking a political stance isn't what they were about; an entertaining thriller with a wink to the Roger Moore-era James Bond is closer to the truth, including, that is, cameras turning away most privately when those inevitable scenes between the sheets are about to take place. The third Shaft movie was an attempt to take the story to an international level: Shaft investigating slave trading between America, Europe, and Africa, hence Shaft in Africa. The soundtrack was a more humble affair, as score composer Johnny Pate probably knew there was no point taking it up against Isaac Hayes' earlier effort. He definitely could do better than Shaft's Big Score director Gordon Parks, who took the ill-fated step of producing that soundtrack himself. At least Pate had some credentials, being an arranger of several albums for the Impressions. Add to that the more than satisfying job he did on the Brother on the Run soundtrack from a year earlier. Shaft in Africa is largely seen by fans as one of the undisputed classics of the blaxploitation genre. Pate didn't have any Bar-Kays at hand like Hayes, but most of the instrumental cuts sound damn potent. Moreover, the soundtrack bears the tough anthem &quot;Are You Man Enough&quot; by the Four Tops, which reduces many a Bond theme to music suitably only for the fireplace. It might be an acquired taste, but it just takes a sense of humor carrying yourself through a blaxploitation soundtrack. Calling this soundtrack a &quot;bad mother&quot; would be missing the point, so shut yo mouth, sit back, and enjoy the ride!&quot;/Allmusic","torrent":{"xt":"urn:btih:020d013659b8315b64eb1388a88278f8a6752dc6","amp;dn":"Soundtrack+-+Shaft+In+Africa+%281973%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"020d013659b8315b64eb1388a88278f8a6752dc6","infoHashBuffer":{"type":"Buffer","data":[2,13,1,54,89,184,49,91,100,235,19,136,168,130,120,248,166,117,45,198]},"announce":[],"urlList":[]}}