{"title":"Pandemonium 2 GOG","uid":8727059,"size":176756004,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:03009b7cf4d9dc22e90b212857527e033403bf7e&amp;dn=Pandemonium+2+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"IAmsoICan","files":2,"time":1374527694,"description":"What's cool about it:\n\n    Explore vast levels of bizarre, hallucinogenic, and alien landscapes!\n    Devastating power-ups, deadly fireballs, awesome lightning, and the dreaded yet effective  Pump-a-sid  attack!\n    Collect enough treasure and unlock a bonus level,  Boarder Run , where you can test your skills and gain extra lives.\n\nOverview:\n\nThe year of Cheese has arrived and with it, the advent of the Comet of Infinite Possibilities as foretold by the great prophet, Nosewasinit. The young sorceress Nikki decides it would be much easier to steal the source of the comet s power instead of devoting herself to dull and dreary studies. Along with her friend Fargus and his sidekick Sid (who really knows how to stick around), the trio goes off to find the comet. They won t be the only ones racing for the comet as the evil Goon Queen has set her sights on the comet as well. The race for power is on!\n\nFeaturing 2.5D platforming gameplay, Pandemonium 2 offers more bang for your buck. Choose between either Nikki or Fargus for each level as each has their set of abilities that you can use. Nikki is more agile and can jump higher while Fargus wields his puppet Sid with deadly efficiency. Acquire power-ups, such as lightning or fireballs, collect tons of treasure, and even take control of a tank all the while wreaking pandemonium in this colorful and crazy platformer adventure!","torrent":{"xt":"urn:btih:03009b7cf4d9dc22e90b212857527e033403bf7e","amp;dn":"Pandemonium+2+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03009b7cf4d9dc22e90b212857527e033403bf7e","infoHashBuffer":{"type":"Buffer","data":[3,0,155,124,244,217,220,34,233,11,33,40,87,82,126,3,52,3,191,126]},"announce":[],"urlList":[]}}