{"title":"Piriform CCleaner Professional Plus v4.12.4657 ML Incl Keymaker-","uid":9941777,"size":14458595,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:033695037e01902ed617408a4ce3ff411d329bf8&amp;dn=Piriform+CCleaner+Professional+Plus+v4.12.4657+ML+Incl+Keymaker-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TorDigger","files":12,"time":1397260164,"description":"CCleaner Professional Edition\n\nCCleaner is our system optimization, privacy and cleaning tool. It removes unused files from your system - allowing Windows to run faster and freeing up valuable hard disk space. It also cleans traces of your online activities such as your Internet history. Additionally it contains a fully featured registry cleaner. But the best part is that it's fast (normally taking less than a second to run) and contains NO Spyware or Adware!\n\nCleans the following:\n\nInternet Explorer\nTemporary files, history, cookies, super cookies, Autocomplete form history, index.dat files.\n\nFirefox\nTemporary files, history, cookies, super cookies, download history, form history.\n\nGoogle Chrome\nTemporary files, history, cookies, super cookies, download history, form history.\n\nOpera\nTemporary files, history, cookies, super cookies, download history.\n\nSafari\nTemporary files, history, cookies, super cookies, form history.\n\nOther Supported Browsers\nK-Meleon, Rockmelt, Flock, Google Chrome Canary, Chromium, SeaMonkey, Chrome Plus, SRWare Iron, Pale Moon, Phoenix, Netscape Navigator, Avant and Maxthon.\n\nWindows\nRecycle Bin, Recent Documents, Temporary files, Log files, Clipboard, DNS Cache, Error Reporting, Memory Dumps, Jump Lists.\n\nRegistry Cleaner\nAdvanced features to remove unused and old entries, including File Extensions, ActiveX Controls, ClassIDs, ProgIDs, Uninstallers, Shared DLLs, Fonts, Help Files, Application Paths, Icons, Invalid Shortcuts and more...\n\nThird-party applications\nRemoves temp files and recent file lists (MRUs) from many apps including Windows Media Player, eMule, Google Toolbar, Microsoft Office, Nero, Adobe Acrobat, WinRAR, WinAce, WinZip and many more...\n\n100% Spyware FREE\nThis software does NOT contain any Spyware, Adware or Viruses\n\nChangeLog:\n\nv4.12.4657 (25 Mar 2014)\n- Added Opera 15 and newer Saved Form Information cleaning. \n- Added Opera Developer Channel support. \n- Improved ActiveX and Class Issue Registry cleaning. \n- Added Facebook and Twitter cookies to Intelligent Cookie Scan. \n- Improved Scheduler management (CCleaner Professional only). \n- Added Xilisoft Video Converter and DVD Ripper, dBpoweramp and SyncBackFree cleaning. \n- Improved Internet Download Manager, Oxygen XML Editor, Orbit Downloader, CA Anti-Virus, Microsoft AntiSpyware, and Vuze cleaning. \n- Minor GUI Improvements. \n- Minor bug fixes.\n\nSupported OS:\n\nWindows 8.1, 8, 7, Vista and XP. Including both 32-bit and 64-bit versions, but not RT tablet editions.\n\nHomepage: http://www.piriform.com/\n\nInstallation Instructions: \n\n1. Install program.\n2. Use given keygen to get valid serial to register application.\n3. Done. Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:033695037e01902ed617408a4ce3ff411d329bf8","amp;dn":"Piriform+CCleaner+Professional+Plus+v4.12.4657+ML+Incl+Keymaker-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"033695037e01902ed617408a4ce3ff411d329bf8","infoHashBuffer":{"type":"Buffer","data":[3,54,149,3,126,1,144,46,214,23,64,138,76,227,255,65,29,50,155,248]},"announce":[],"urlList":[]}}