{"title":"Gareth Emery Discography","uid":4953868,"size":1766751189,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:033d8af15863bdf044b38e3e866ff736ac15283d&amp;dn=Gareth+Emery+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zeiten","files":114,"time":1245013908,"description":"Gareth Emery Discography\n\nGood Quality\nGareth Emery - Podcast Annual 2007 contains cue file for splitting the tracks.\n\n\nEP's:\n\nAlbert Vorne - Formentera What (Incl Gareth Emery Remix)\nAshley Wallbridge ft. Meighan Nealon - I Believe\nCupa - Mass Panic (Incl Gareth Emery Remix)\nDarude ft. Blake Lewis - I Ran (So Far Away)\nDelerium ft. Gareth Emery - This Is That Silence\nDestination X - Dangerous (Incl Gareth Emery Remix)\nDigital Deliquents - Forever\nEchano - Nothing To Live For (Incl Gareth Emery Remix)\nGareth Emery - More Than Anything\nGareth Emery - Podcast Annual 2007\nGareth Emery - The Ego Surfing\nGareth Emery And Jon Obir - Bouncebackability\nGareth Emery And Jon Obir - Escapade\nGareth Emery And Kirsch - Lose Yourself (Incl Will Holland Remix)\nGareth Emery And Mark Dedross Pres. Wirefly - The Verdict\nGareth Emery And Nicholas Bennison - Interlok\nGareth Emery And Rue De Gar - Soul Symbol\nGareth Emery Pres. Runaway - Outrageous\nGTR - Reason To Believe\nLange ft. Gareth Emery - Another You Another Me\nLange ft. Gareth Emery - Back On Track &amp; Three\nLange ft. Gareth Emery - This Is New York (X Equals 69)\nMartin Roth &amp; Alex Bartlett - Off The World (Incl Gareth Emery Remix)\nMenno de Jong ft. Re Locate - Solid State &amp; Spirit\nMike Foyle - Shipwrecked\nMyon And Shane 54 ft. Carrie Skipper- Vampire\nNu-Nrg - Dreamland 2005 (Incl Gareth Emery ft. Brisky Remix)\nQuadraphonic - I Can Feel Your Love (Incl GTR Remix)\nRosie And The Goldbug - Heartbreak (Incl Gareth Emery Remix)\nStowers And Young - The Second Coming (Incl Gareth Emery Remix)\nThe Shrink - Nervous Breakdown Reloaded\nWill Holland - Magicka\n\nSingel Tracks:\n\nAndrew Bennett ft. Tatana ft. Tiff Lacey - Closer Than A Heartbeat (Andrew Bennett Vocal Mix)\nBobina - Time And Tide (Gareth Emery Remix)\nDj Orkidea - Metaverse (Gareth Emery Remix)\nDT8 Project - Tomorrow Never Comes (Gareth Emery Remix)\nEstuera - Travels (Gareth Emery Remix)\nGareth Emery - Exposure\nGareth Emery - Grate My Cheese In The Morning (Gareth Emerys Cheesy Remix)\nGareth Emery - This Is That (Original Mix)\nGareth Emery &amp; Jon O Bir - No Way Back (Ali Wilsons Tekelec Remix)\nGareth Emery ft. Way Out West - More Than Killa (Next Dj Mashup)\nVinny Troia ft. Jaidene Veda - Flow (Gareth Emery Remix)\n\nAll Tracks:\n\n1. Albert Vorne - Formentera What (Club Mix) (7:52)\n2. Albert Vorne - Formentera What (Gareth Emery Remix) (8:00)\n3. Albert Vorne - Formentera What (M.I.K.E. NYC Mix (8:10)\n4. Andrew Bennett ft. Tatana ft. Tiff Lacey - Closer Than A Heartbeat (Andrew Bennett Vocal Mix) (7:31)\n5. Ashley Wallbridge ft. Meighan Nealon - I Believe (Gareth Emery Dub Remix) (8:18)\n6. Ashley Wallbridge ft. Meighan Nealon - I Believe (Gareth Emery Radio Edit) (4:00)\n7. Ashley Wallbridge ft. Meighan Nealon - I Believe (Gareth Emery Remix) (9:04)\n8. Ashley Wallbridge ft. Meighan Nealon - I Believe (Original Mix) (6:19)\n9. Ashley Wallbridge ft. Meighan Nealon - I Believe (Sied Van Riel Remix) (8:12)\n10. Bobina - Time And Tide (Gareth Emery Remix) (7:18)\n11. Cupa - Mass Panic (Concept Mix) (7:29)\n12. Cupa - Mass Panic (Gareth Emery Remix) (7:47)\n13. Darude ft. Blake Lewis - I Ran (Gareth Emery Remix) (8:15)\n14. Darude ft. Blake Lewis - I Ran (JS16 Remix) (7:11)\n15. Darude ft. Blake Lewis - I Ran (Original Mix) (7:50)\n16. Darude ft. Blake Lewis - I Ran (Radio Edit) (3:31)\n17. Darude ft. Blake Lewis - I Ran (Randy Boyer Remix) (7:33)\n18. Darude ft. Blake Lewis - I Ran (Tech Mix) (6:23)\n19. Darude ft. Blake Lewis - I Ran (Weirdness Remix) (6:51)\n20. Delerium ft. Gareth Emery - This Is That Silence (Black Army Mashup Radio Edit) (4:30)\n21. Delerium ft. Gareth Emery - This Is That Silence (Myon Collision) (7:49)\n22. Destination X - Dangerous (Gareth Emery Radio Edit) (3:51)\n23. Destination X - Dangerous (Gareth Emery Remix) (8:58)\n24. Destination X - Dangerous (Original Mix) (8:17)\n25. Destination X - Dangerous (Sied Van Riel Remix) (9:13)\n26. Digital Deliquents - Forever (Gareth Emery Remix) (8:09)\n27. Digital Deliquents - Forever (J.O.C Remix) (9:12)\n28. Dj Orkidea - Metaverse (Gareth Emery Remix) (9:21)\n29. DT8 Project - Tomorrow Never Comes (Gareth Emery Remix) (8:39)\n30. Echano - Nothing To Live For (Gareth Emery Remix) (8:31)\n31. Echano - Nothing To Live For (Original Mix) (9:30)\n32. Estuera - Travels (Gareth Emery Remix) (10:08)\n33. Gareth Emery - Backlash (7:37)\n34. Gareth Emery - Between Dreams (7:58)\n35. Gareth Emery - Exposure (7:37)\n36. Gareth Emery - Grate My Cheese In The Morning (Gareth Emerys Cheesy Remix) (8:07)\n37. Gareth Emery - History Of A Day (4:12)\n38. Gareth Emery - More Than Anything (Christopher Norman Dj Tool Remix) (3:54)\n39. Gareth Emery - More Than Anything (Christopher Norman Dub Remix) (7:05)\n40. Gareth Emery - More Than Anything (Christopher Norman Remix) (7:01)\n41. Gareth Emery - More Than Anything (Dj Observer And Dan Heatcliff Dub Mix) (7:58)\n42. Gareth Emery - More Than Anything (Dj Observer And Dan Heatcliff Vocal Mix) (9:45)\n43. Gareth Emery - More Than Anything (Gareth Emery's Fiveam Remix) (7:59)\n44. Gareth Emery - More Than Anything (Jerome Isma AE Remix) (7:22)\n45. Gareth Emery - More Than Anything (Neil Kolo Remix) (4:33)\n46. Gareth Emery - More Than Anything (Original Vocal Mix) (7:54)\n47. Gareth Emery - More Than Anything (Radio Edit) (4:14)\n48. Gareth Emery - More Than Anything (Stoneface And Terminal Remix) (6:28)\n49. Gareth Emery - Podcast Annual 2007 (72:12)\n50. Gareth Emery - Podcast Annual 2007 (68:14)\n51. Gareth Emery - This Is That (Original Mix) (7:30)\n52. Gareth Emery - Tribalism (7:51)\n53. Gareth Emery &amp; Jon O Bir - No Way Back (Ali Wilsons Tekelec Remix) (7:11)\n54. Gareth Emery And Jon Obir - Bouncebackability (Mind Remix) (8:59)\n55. Gareth Emery And Jon Obir - Bouncebackability (Original Mix) (7:59)\n56. Gareth Emery And Jon Obir - Escapade (Cern Remix) (8:14)\n57. Gareth Emery And Jon Obir - Escapade (Original Mix) (7:43)\n58. Gareth Emery And Kirsch - Lose Yourself (Gareth Emery Remix) (8:45)\n59. Gareth Emery And Kirsch - Lose Yourself (Will Holland Remix) (8:03)\n60. Gareth Emery And M.Dedross Pres. Wirefly - The Verdict (Octagens Revision) (9:19)\n61. Gareth Emery And M.Dedross Pres. Wirefly - The Verdict (Original Mix) (7:51)\n62. Gareth Emery And Nicholas Bennison - Interlok (Gazs Dubbed Out Mix) (8:17)\n63. Gareth Emery And Nicholas Bennison - Interlok (Original Mix) (7:49)\n64. Gareth Emery And Rue De Gar - Soul Symbol (Mohawk Remix) (6:55)\n65. Gareth Emery And Rue De Gar - Soul Symbol (Original Mix) (6:41)\n66. Gareth Emery And Rue De Gar - Soul Symbol (Tasadi And Storyteller Remix) (6:50)\n67. Gareth Emery ft. Way Out West - More Than Killa (Next Dj Mashup) (6:28)\n68. Gareth Emery Pres. Runaway - Outrageous (Original Mix) (7:36)\n69. Gareth Emery Pres. Runaway - Outrageous (Shiloh Remix) (9:00)\n70. GTR - Reason To Believe (Gareth Emery Remix) (9:07)\n71. GTR - Reason To Believe (Original Mix) (9:38)\n72. Lange ft. Gareth Emery - Another You Another Me (Gavyn Mytchel Remix) (7:09)\n73. Lange ft. Gareth Emery - Another You Another Me (Orginal Mix) (7:47)\n74. Lange ft. Gareth Emery - Another You Another Me (Terranova And Austin Leeds Mix) (7:27)\n75. Lange ft. Gareth Emery - Back On Track (7:32)\n76. Lange ft. Gareth Emery - This Is New York (7:26)\n77. Lange ft. Gareth Emery - This Is New York (X Equals 69 Remix) (6:44)\n78. Lange ft. Gareth Emery - Three (8:11)\n79. Martin Roth &amp; Alex Bartlett - Off The World (Gareth Emery Remix) (8:11)\n80. Martin Roth &amp; Alex Bartlett - Off The World (Lange Remix) (10:02)\n81. Martin Roth &amp; Alex Bartlett - Off The World (Mrs Exclusive Intro Mix) (4:13)\n82. Menno de Jong ft. Re Locate - Solid State (Gareth Emery Remix) (7:50)\n83. Menno de Jong ft. Re Locate - Solid State (Spirit Paul Miller Remix) (7:51)\n84. Mike Foyle - Shipwrecked (Gareth Emery Remix) (7:40)\n85. Mike Foyle - Shipwrecked (John O'Callaghan ft. Mike Foyle Remix) (7:46)\n86. Mike Foyle - Shipwrecked (Sean Tyas Remix) (8:10)\n87. Myon And Shane 54 ft. Carrie Skipper - Vampire (Club Mix) (9:25)\n88. Myon And Shane 54 ft. Carrie Skipper - Vampire (Gareth Emery's Garuda Remix) (8:11)\n89. Nu-Nrg - Dreamland 2005 (Gareth Emery ft. Brisky Remix) (7:47)\n90. Nu-Nrg - Dreamland (Original Mix) (8:00)\n91. Quadraphonic - I Can Feel Your Love (Gareth Emery's GTR Remix) (7:44)\n92. Quadraphonic - I Can Feel Your Love (Shane 54's Monster Mix) (7:39)\n93. Rosie And The Goldbug - Heartbreak (Arnej Remix) (6:37)\n94. Rosie And The Goldbug - Heartbreak (Arnej Tech Dub Mix) (6:37)\n95. Rosie And The Goldbug - Heartbreak (Digital Dog Club Remix) (5:35)\n96. Rosie And The Goldbug - Heartbreak (Digital Dog Radio Edit) (4:17)\n97. Rosie And The Goldbug - Heartbreak (Digital Dog Remix) (7:03)\n98. Rosie And The Goldbug - Heartbreak (Gareth Emery Dub Remix) (8:24)\n99. Rosie And The Goldbug - Heartbreak (Gareth Emery Radio Edit) (3:16)\n100. Rosie And The Goldbug - Heartbreak (Gareth Emery Remix) (9:21)\n101. Rosie And The Goldbug - Heartbreak (Radio Edit) (3:17)\n102. Stowers And Young - The Second Coming (Albert Vorne Remix) (8:02)\n103. Stowers And Young - The Second Coming (Andysecret Remix) (9:41)\n104. Stowers And Young - The Second Coming (Gareth Emery Remix) (8:22)\n105. Stowers And Young - The Second Coming (Gavyn Mytchel Remix) (8:03)\n106. Stowers And Young - The Second Coming (Original Mix) (7:51)\n107. The Shrink - Nervous Breakdown Reloaded (John Marks Mix) (6:36)\n108. The Shrink - Nervous Breakdown Reloaded (Maarten de Jong Mix) (7:54)\n109. Vinny Troia ft. Jaidene Veda - Flow (Gareth Emery Remix) (7:39)\n110. Will Holland - Magicka (2004 Reworks) (7:08)\n111. Will Holland - Magicka (Gareth Emery Remix) (8:06)\n112. Will Holland - Magicka (Will Hollands Satori Remake) (8:49)\n\n112 tracks in playlist, average track length: 8:38\nPlaylist length: 16 hours 7 minutes 1 second\n\nAny request? Let me know\nEnjoy","torrent":{"xt":"urn:btih:033d8af15863bdf044b38e3e866ff736ac15283d","amp;dn":"Gareth+Emery+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"033d8af15863bdf044b38e3e866ff736ac15283d","infoHashBuffer":{"type":"Buffer","data":[3,61,138,241,88,99,189,240,68,179,142,62,134,111,247,54,172,21,40,61]},"announce":[],"urlList":[]}}