{"title":"Stand Up and Cheer (1934) Xvid 1cd - Shirley Temple Film [DDR]","uid":9366222,"size":735830016,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0348d7bb91dfc99fb88f20441117aaa7697d6230&amp;dn=Stand+Up+and+Cheer+%281934%29+Xvid+1cd+-+Shirley+Temple+Film+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"SaM","files":-1,"time":1387416780,"description":"Stand Up and Cheer (1934) 1cd - Shirley Temple Film [DDR]\n\nStand Up and Cheer! is a 1934 American musical film directed by Hamilton MacFadden. \nThe screenplay by Lew Brown and Ralph Spence was based upon a story idea by Will Rogers and Philip Klein. \nThe film is about efforts undertaken during the Great Depression to boost the morale of the country. \n It is essentially a vehicle for a string of vaudeville acts and a few musical numbers.\n\n    CAST:-\n    Warner Baxter as Lawrence Cromwell\n    Madge Evans as Mary Adams\n    Shirley Temple as Shirley Dugan\n    James Dunn as Jimmy Dugan\n    Nigel Bruce as Eustis Dinwiddle\n    Ralph Morgan as Secretary to President\n    Steppin Fetchit as George Bernard Shaw\n    Tess Gardella as Aunt Jemima\n    Scotty Beckett as Auditioning Boy\n    John Boles as Himself\n    Nick Foran as Himself\n\nDirected by Hammilton MacFadden\nProduced by Winfield Sheehan\nWritten by Dialogue:, , Lew Brown, Ralph Spence, \nStory: Will Rogers, Philip Klein\nMusic by Lew Brown, Jay Gorney\n\nMOVIE REVIEW:- Stand Up and Cheer (1934)\nThe President of the United States decides that the true cause of the Great Depression (raging when the film was released) is a loss of &quot;optimism&quot; as a result of a plot by financiers and bankers who are getting rich from the Depression. The President then appoints Lawrence Cromwell as secretary for the newly created Department of Amusement. Cromwell creates an army of entertainers and sends them out across the country. Much of the action centers around Cromwell auditioning acts in his office (with interruptions from janitor &quot;George Bernard Shaw&quot; played by Steppin Fetchit). At the end, as a musical production number breaks forth, Cromwell looks out of his office window and sees the Depression literally, instantaneously lift.\n\nUpon release the film was given a strong endorsement by Variety, especially the work of &quot;newcomer&quot; Shirley Temple, whom they cited as the film's &quot;unofficial star.&quot; Although modern scholars often point to the film as an example of typical Great Depression entertainment, Variety expressed reservations about its theme. &quot;This musical is a hodge-podge principally handicapped by a national depression premise. Americans now like to think of themselves in the light of being on the upturn and having rounded that long-awaited corner, so Cheer's plot motivation is basically questionable [and] open to debate.&quot;\n\nThe film had eleven minutes of footage deleted for modern home video release, most of it racial in nature. In 2009, the film was available on both videocassette and DVD in the original black-and-white version and a computer-colorized version of the original. Some versions included theatrical trailers and other special features.\n\nBased on an idea by Will Rogers, the story concerns the efforts by the President of the United States to get the public's mind off the Depression. To this end, he appoints Broadway impresario Lawrence Cromwell (Warner Baxter) to the new cabinet position of &quot;Secretary of Amusement.&quot; Wasting no time, Cromwell sets about to nationalize the entertainment industry, organizing singers, dancers, actors and other variety artists into batallion-like touring units. Cromwell is fought at every turn by a cartel of wealthy industrialists, who've been profiting from the Depression and have no desire to see America pull itself upward. Happily, every effort to bribe or cajole Cromwell into giving up his mission is thwarted and the Department of Amusement goes on to help the the country at a time when its citizens most needed it. Among the highlights are an energetic &quot;revival-meeting&quot; musical number by Aunt Jemima (Theresa Gardella), and 6-year-old Shirley Temple's rendition of &quot;Baby Take a Bow.&quot; Originally released at 80 minutes, Stand Up and Cheer was edited to 69 minutes for reissue, then to 65 minutes (removing most of Stepin Fetchit's scenes) for television: it was this last version which was computer-colorized in 1987.\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 80 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 80 mins","torrent":{"xt":"urn:btih:0348d7bb91dfc99fb88f20441117aaa7697d6230","amp;dn":"Stand+Up+and+Cheer+%281934%29+Xvid+1cd+-+Shirley+Temple+Film+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0348d7bb91dfc99fb88f20441117aaa7697d6230","infoHashBuffer":{"type":"Buffer","data":[3,72,215,187,145,223,201,159,184,143,32,68,17,23,170,167,105,125,98,48]},"announce":[],"urlList":[]}}