{"title":"A Sunny Day in Glasgow - Sea When Absent [2014] [EAC/FLAC]","uid":10553616,"size":332698858,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0370a43886b4ee8f089bf3c1cf44a1a9cbc18d5c&amp;dn=A+Sunny+Day+in+Glasgow+-+Sea+When+Absent+%5B2014%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":-1,"time":1405365386,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Lefse Records #LEFSE 065-2\nCountry:UK\nYear: June 23, 2014\nGenre: ambient, dream.pop, shoegaze, electro.pop\nFormat: CD, Album,\n\n[b]\n\n1. Byebye, Big Ocean (The End) (04:16)\n02. In Love With Useless (The Timeless Geometry in the Tradition of Passing) (05:07)\n03. Crushin' (04:42)\n04. MTLOV (Minor Keys) (04:06)\n05. The Things They Do To Me (05:04)\n06. Boys Turn Into Girls (Initiation Rites) (05:06)\n07. Never Nothing (It's Alright [It's OK]) (05:04)\n08. Double Dutch (01:35)\n09. The Body, It Bends (???????????!) (03:44)\n10. Oh, I'm a Wrecker (What to Say to Crazy People) (04:08)\n11. Golden Waves (04:08)\n\n\n\nThe release of A Sunny Day in Glasgow's fourth album, Sea When Absent, brought with it some major changes in the way the band operate. It's their first album to be made in a studio with a real producer; their first where the group's usual mastermind Ben Daniels removed himself from the day-to-day recording process (thanks to his living on a different continent), and the first where Daniels didn't write the vocal melodies and lyrics. Philadelphia mainstay Jeff Ziegler recorded the band, longtime ASDIG member Josh Meakim took over as the chief architect of sound with help from bassist Ryan Newmyer, and vocalist Jen Goma stepped into the role of lyricist. More importantly than all of this, the band decided to strip away much of the reverb and effects that their records always had as their main focus. Sea When Absent is the group's most direct, most melodic, and easiest-to-get-a-full-grasp-on album yet, and it works just as well as anything they've done. Though Daniels may have stepped back a bit, the record still holds true to the band's diffuse and difficult shoegaze approach, while taking full advantage of the facets the new way of working provides. The clearer sound allows Goma and co-vocalist Anne Fredrickson to shine, whether singing in sweet, ringing leads or twining together in angel-pure harmonies. The focus on melody and the simpler arrangements help the songs to have more emotional impact than ever before, and Sea When Absent reaches some truly epic levels of feel on tracks like &quot;Never Nothing (It's Alright [It's OK])&quot; and &quot;MTLOV (Minor Keys).&quot; Despite the changes that resonate throughout the album, there's nothing going on that would chase away a fan of their earlier work. It's still dense and challenging, still packed with surprising sonic feints and shifts, still overloaded with great songs that nod back to the glory days of shoegaze, but it sounds fully up to date and not in the least derivative. Best of all, it's the work of a band who refuse to sit still and churn out the same record time and time again. Just as they did on their best album, Ashes Grammar, the band takes risks and makes leaps, and the results on Sea When Absent prove that they are one of the best, most interesting under-the-radar bands of their era.","torrent":{"xt":"urn:btih:0370a43886b4ee8f089bf3c1cf44a1a9cbc18d5c","amp;dn":"A+Sunny+Day+in+Glasgow+-+Sea+When+Absent+%5B2014%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0370a43886b4ee8f089bf3c1cf44a1a9cbc18d5c","infoHashBuffer":{"type":"Buffer","data":[3,112,164,56,134,180,238,143,8,155,243,193,207,68,161,169,203,193,141,92]},"announce":[],"urlList":[]}}