{"title":"Encyclopedia of Archaeology (3 Volume Set) (2007).pdf Gooner","uid":12146626,"size":158519877,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03b765e8cd96f10372c42291c24b26b48444c351&amp;dn=Encyclopedia+of+Archaeology+%283+Volume+Set%29+%282007%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1437488657,"description":"Publisher: Academic Press; 1 edition (November 6, 2007)\nLanguage: English\nISBN-10: 012548030X\nISBN-13: 978-0125480307\n\nArchaeology is a subject that fascinates us. From Egyptian tombs to a frozen Alpine wayfarer, from cities buried under volcanic ash to stone arrow heads turned up by the plow, archaeology is in the news and in our backyards. It is paradoxical that a subject that so easily captures the imagination is so difficult for the serious layman to access. Superficial media treatments and picture-book atlases and site guides on the one hand, jargon-heavy scholarly books and narrowly focused articles on the other-there are few ways to learn about the real world of archaeology outside the college classroom or the dig site. \n\nThe Encyclopedia of Archaeology changes this, in making all aspects of archaeology accessible to a broad audience of the general scientific community, educators, students, and avocational archaeologists. Professional archaeologists and anthropologists will also find the encyclopedia a ready source of up-to-date information on specialities outside their own expertise. \n\nThe Encyclopedia of Archaeology encompasses all aspects of archaeology, including the nature and diversity of archaeology as a scientific discipline, the practice of archaeology, archaeology in the everyday world, and the future of the discipline. Featured in the Encyclopedia of Archaeology are articles by leading authors that summarize archaeological knowledge at the beginning the 21st century, highlighting important sites and issues, and tracing the development of prehistoric cultures around the globe. No existing work provides the breadth and depth of coverage as the Encyclopedia of Archaeology.\n\nAlso available online via ScienceDirect (2007) - featuring extensive browsing, searching, and internal cross-referencing between articles in the work, plus dynamic linking to journal articles and abstract databases, making navigation flexible and easy. For more information, pricing options and availability visit www.info.sciencedirect.com. \n\nÂ· The first and only reference work to cover all elements of archaeology, over 280 articles have been specifically commissioned for this reference work \nÂ· Distinguished Editorial Board headed by Editor-in-Chief Professor Deborah Pearsall, University of Missouri, along with many other prominent scientists serving as editorial advisors \nÂ· Breadth and depth of coverage ensures that professional archaeologists will find the Encyclopedia a ready source of up-to-date information on specialties outside their own expertise \nÂ· Each article has been reviewed to ensure accuracy, comprehensiveness, and up-to-date content. \nÂ· Articles are written to be accessible to the educated general public with jargon-free presentation of subjects \nÂ· Beautiful 4-color photography and informational figures throughout \nÂ· Topics are arrange A-Z for easy reference \nÂ· Geographic overview articles are grouped by continent or region to allow easy reference \nÂ· Glossary entries explain key terms \nÂ· Further Reading lists appear at the end of each entry","torrent":{"xt":"urn:btih:03b765e8cd96f10372c42291c24b26b48444c351","amp;dn":"Encyclopedia+of+Archaeology+%283+Volume+Set%29+%282007%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03b765e8cd96f10372c42291c24b26b48444c351","infoHashBuffer":{"type":"Buffer","data":[3,183,101,232,205,150,241,3,114,196,34,145,194,75,38,180,132,68,195,81]},"announce":[],"urlList":[]}}