{"title":"The Economics of Enough: How to Run the Economy as if the Future","uid":6815999,"size":1081757,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03be4e9289e15fb7e16b55e7b4229f1548f52025&amp;dn=The+Economics+of+Enough%3A+How+to+Run+the+Economy+as+if+the+Future&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"jakcreed2","files":1,"time":1321208717,"description":"The world's leading economies are facing not just one but many crises. The financial meltdown may not be over, climate change threatens major global disruption, economic inequality has reached extremes not seen for a century, and government and business are widely distrusted. At the same time, many people regret the consumerism and social corrosion of modern life. What these crises have in common, Diane Coyle argues, is a reckless disregard for the future--especially in the way the economy is run. How can we achieve the financial growth we need today without sacrificing a decent future for our children, our societies, and our planet? How can we realize what Coyle calls &quot;the Economics of Enough&quot;?\n\nRunning the economy for tomorrow as well as today will require a wide range of policy changes. The top priority must be ensuring that we get a true picture of long-term economic prospects, with the development of official statistics on national wealth in its broadest sense, including natural and human resources. Saving and investment will need to be encouraged over current consumption. Above all, governments will need to engage citizens in a process of debate about the difficult choices that lie ahead and rebuild a shared commitment to the future of our societies.\n\nCreating a sustainable economy--having enough to be happy without cheating the future--won't be easy. But The Economics of Enough starts a profoundly important conversation about how we can begin--and the first steps we need to take.\nEnjoy and seed","torrent":{"xt":"urn:btih:03be4e9289e15fb7e16b55e7b4229f1548f52025","amp;dn":"The+Economics+of+Enough%3A+How+to+Run+the+Economy+as+if+the+Future","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03be4e9289e15fb7e16b55e7b4229f1548f52025","infoHashBuffer":{"type":"Buffer","data":[3,190,78,146,137,225,95,183,225,107,85,231,180,34,159,21,72,245,32,37]},"announce":[],"urlList":[]}}