{"title":"The Seduction of Unreason: The Intellectual Romance With Fascism","uid":11726774,"size":1223100,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03d61d2e94877787f6f03dcb683c523406fc495b&amp;dn=The+Seduction+of+Unreason%3A+The+Intellectual+Romance+With+Fascism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425095003,"description":"Fifteen years ago, revelations about the political misdeeds of Martin Heidegger and Paul de Man sent shock waves throughout European and North American intellectual circles. Ever since, postmodernism has been haunted by the specter of a compromised past. In this intellectual genealogy of the postmodern spirit, Richard Wolin shows that postmodernism's infatuation with fascism has been widespread and not incidental. He calls into question postmodernism's claim to have inherited the mantle of the left--and suggests that postmodern thought has long been smitten with the opposite end of the political spectrum.\n\nIn probing chapters on C. G. Jung, Hans-Georg Gadamer, Georges Bataille, and Maurice Blanchot, Wolin discovers an unsettling commonality: during the 1930s, these thinkers leaned to the right and were tainted by a proverbial &quot;fascination with fascism.&quot; Frustrated by democracy's shortcomings, they were seduced by fascism's grandiose promises of political regeneration. The dictatorships in Italy and Germany promised redemption from the uncertainties of political liberalism. But, from the beginning, there could be no doubting their brutal methods of racism, violence, and imperial conquest.\n\nPostmodernism's origins among the profascist literati of the 1930s reveal a dark political patrimony. The unspoken affinities between Counter-Enlightenment and postmodernism constitute the guiding thread of Wolin's suggestive narrative. In their mutual hostility toward reason and democracy, postmodernists and the advocates of Counter-Enlightenment betray a telltale strategic alliance--they cohabit the fraught terrain where far left and far right intersect.\n\nThose who take Wolin's conclusions to heart will never view the history of modern thought in quite the same way","torrent":{"xt":"urn:btih:03d61d2e94877787f6f03dcb683c523406fc495b","amp;dn":"The+Seduction+of+Unreason%3A+The+Intellectual+Romance+With+Fascism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03d61d2e94877787f6f03dcb683c523406fc495b","infoHashBuffer":{"type":"Buffer","data":[3,214,29,46,148,135,119,135,246,240,61,203,104,60,82,52,6,252,73,91]},"announce":[],"urlList":[]}}