{"title":"The Suffering 1 &amp; 2 [Ntsc], Ps2","uid":5464290,"size":5784524026,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:03e884986418b46007e4cbd49e2722a167bc93a4&amp;dn=The+Suffering+1+%26+2+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":4,"uploader":"Big_dude","files":-1,"time":1269564990,"description":"The Suffering 1 &amp; 2 for the Ps2                                   Rel. 2004 &amp; 2005\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         2\nImage:         MDS/ISO\nGenre.:        Action, Horror\nRating:        M (Mature)\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Both Games were tested and work.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description The Suffering:\n\nThe Suffering is an all-new next-generation entry in the survival horror genre, and the first game of its kind to probe the very unsettling and seedy underbelly of a maximum-security penitentiary, which is haunted by horrific and grotesque apparitions, all represented by the unique and disturbing executions that previously befell them.\n\nYou play the role of Torque, a death row inmate with an ambiguous past who has been imprisoned for slaying his ex-wife and children. Shortly after being interred in a new prison on Carnate Island, an earthquake appears to release demonic creatures based on the many modes of execution used in the sordid history of the island. These creatures proceed to eliminate much of the prison population, leaving only you and a scant few other inmates and guards to eliminate the horde and find out what has happened.\n\n\nFeatures:\n\n* Nine gritty and terrifying levels, transverse indoor and outdoor terrain and \n  horror lurking in every dark corner. \n\n* Amazing character-morphing effect - fill your rage meter and transform into a \n  hideous and powerful creature. \n\n* Over 10 deadly weapons from the shiv to the flamethrower to help you survive \n  this nightmare. \n\n* A dozen horrific monsters - each representing the means of execution that befell \n  them - stalk your every move. \n\n* Powerful boss monsters will challenge your ability to stay alive. \n\n* Blood and gore galore, dripping, pooling and splattering every level of your \n  frightening journey. \n\n* Interact with hardened criminals featuring advanced AI; garner their assistance \n  or end their life on your path to freedom - it's your choice. \n\n* Three distinct endings dependent on how you play the game. Are you a \n  cold-blooded killer, a man wrongfully accused or something else? \n\n* Intricate levels featuring moveable and destructible environments. \n\n* Over 20 hours of gameplay.\n\n\nGame Description The Suffering Ties That Bind:\n\nThe Suffering Ties That Bind follows in the footsteps of its predecessor by combining a disturbing horror atmosphere with action/shooter gameplay. Players can switch between third person and first person depending on their preference, and will shoot a lot of hideous demonic manifestations of evil before the game is done. The player is also able to transform into a hideous creature at key times in the game, which allows him to engage in intense melee combat. The game includes a morality system which records the player's actions during gameplay and changes the story accordingly, and also alters the player's creature form. Everything from the first The Suffering has been refined and turned up a notch for the sequel. \n\nThe story picks up right where the first game left off. The player once again takes on the role of Torque, former death row inmate with a mysterious past. Now returning to his home town of Baltimore, Torque must confront the mysterious Blackmore, the man who may or may not have killed Torque's family. But it won't be easy, as the hideous creatures from the first game have now overrun the streets of Baltimore. Will Torque finally be able to come to grips with his past? \n \n\nFeatures:\n\n* JOURNEY INTO MADNESS: Delve deep into Torque's past with flashbacks and define\n  his future path while battling inner demons, rage, and a tenuous grip on sanity. \n\n* DISTURBING CHARACTERS AND CREATURES: A plethora of brand new ferocious fiends in\n  addition to several returning favorites designed to depict tough societal \n  problems like street crimes, gun violence and riots that prosper in poverty \n  stricken slums. \n\n* CHOOSE YOUR PATH - CHOOSE YOUR PLOT: Define the true story behind the nature of\n  Torque's crimes and his journey into madness with game-defining moral choices \n  that affect the game's outcome - each path providing a completely different \n  gaming experience. \n\n* MASTER THE RAGE: New multi-leveled insanity mode is tied directly to players\n  actions, creating the most deadly weapon in the game - Torque's inner demon.\n  This giant, horrific creature goes from normal to brutal and bloodthirsty \n  depending on the moral path that players choose to follow. \n\n* A SEEDY, URBAN WORLD: Explore the gritty slums, streets, and prisons of \n  Baltimore, battling urban injustices and demons spawned from historical events \n  of urban squalor. \n\n* REFINED AND ENHANCED GAMEPLAY: Featuring a redesigned and streamlined inventory,\n  expanded player movement mechanics, refined controls, more varied and advanced\n  enemy AI and a large arsenal of weapons Ties that Bind melds big action \n  sequences with vi1sceral horror elements.\n\n\nGame Pics Included.\n\n\nBurn both Games with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:03e884986418b46007e4cbd49e2722a167bc93a4","amp;dn":"The+Suffering+1+%26+2+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03e884986418b46007e4cbd49e2722a167bc93a4","infoHashBuffer":{"type":"Buffer","data":[3,232,132,152,100,24,180,96,7,228,203,212,158,39,34,161,103,188,147,164]},"announce":[],"urlList":[]}}