{"title":"[BangBus] Isabella Madison - Amateur girl sucks and fucks for ca","uid":9874695,"size":607015623,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:042e1becb48b0fa43d501aec4d187402948f0189&amp;dn=%5BBangBus%5D+Isabella+Madison+-+Amateur+girl+sucks+and+fucks+for+ca&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"xuluhulu","files":1,"time":1396463116,"description":"This week we were hunting around the various shopping areas around Doral, when Fucknutt told me he had to use the bathroom. Fucking Fucknutt didnt think to stop to use the bathroom before we set out. Hes not the brains in this operation, obviously. We circled round back and dropped him off between cars. That's when my driver Jesus aka (the second cumming) spotted a nice piece of ass across the parking area. She was a gorgeous thick brunette who was playing on her phone. We had to go talk to her. After Fucknutt finished his business we rode out to the spot and found that she was even better up close but she wouldn't talk to us. She was too busy playing on her phone. Well im not going to let some piece of crap tech stop me from whats mine. I pried her out with the only thing that will beat being on a social network. Money. She was all for the money too. here's the funny thing when we found out what she did, we looked like a bunch of broke losers. She made mad money as a real estate agent, but go figure she was also a part time model for lingerie. It was her dream or something fucking stupid like that. Anyway back to my story, she loved money and didn't care where it came from so we offered her money and she was ready to show off all her body, every piece of skin too. She liked modeling and you can tell it was her passion to pose naked and have her head centimeters away form a hard cock. You can tell she was a natural w----. Well then if you have see where this is leading then you know I'm not going to reveal the juicy parts to you. you're gonna have to tune in and watch. Enjoy! Oh yeah one more thing...put your smartphones down once in a while people! You look like a bunch of tech zombies.\n\nSCREENS;\n &lt;a href=&quot;\nhttp://www.imghoney.com/viewer.php?file=82528019327023372661.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imghoney.com/viewer.php?file=82528019327023372661.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imghoney.com/viewer.php?file=39272862752819156689.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imghoney.com/viewer.php?file=39272862752819156689.jpg&lt;/a&gt;\n\n\nSEED &amp; ENJOY!!!","torrent":{"xt":"urn:btih:042e1becb48b0fa43d501aec4d187402948f0189","amp;dn":"%5BBangBus%5D+Isabella+Madison+-+Amateur+girl+sucks+and+fucks+for+ca","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"042e1becb48b0fa43d501aec4d187402948f0189","infoHashBuffer":{"type":"Buffer","data":[4,46,27,236,180,139,15,164,61,80,26,236,77,24,116,2,148,143,1,137]},"announce":[],"urlList":[]}}