{"title":"Joy Division - Unknown Pleasures [24 bit FLAC] vinyl","uid":8224470,"size":836818206,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:04716f52f0b67ffd33e9bb27b83cd3c24291c5a7&amp;dn=Joy+Division+-+Unknown+Pleasures+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"24.96","files":-1,"time":1362560870,"description":"  Joy Division - Unknown Pleasures (1979) [24 bit FLAC] vinyl\n\n  Released: 1979\n  Genre: Pop/Rock\n  Style: Post-Punk, Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Disorder\n  A2. Day Of The Lords\n  A3. Candidate\n  A4. Insight\n  A5. New Dawn Fades\n\n  B1. She's Lost Control\n  B2. Shadowplay\n  B3. Wilderness\n  B4. Interzone\n  B5. I Remember Nothing\n\n  It even looks like something classic, beyond its time or place of origin even as it was a clear product of both -- one of Peter Saville's earliest and best designs, a transcription of a signal showing a star going nova, on a black embossed sleeve. If that were all Unknown Pleasures was, it wouldn't be discussed so much, but the ten songs inside, quite simply, are stone-cold landmarks, the whole album a monument to passion, energy, and cathartic despair. The quantum leap from the earliest thrashy singles to Unknown Pleasures can be heard through every note, with Martin Hannett's deservedly famous production -- emphasizing space in the most revelatory way since the dawn of dub -- as much a hallmark as the music itself. Songs fade in behind furtive noises of motion and activity, glass breaks with the force and clarity of doom, minimal keyboard lines add to an air of looming disaster -- something, somehow, seems to wait or lurk beyond the edge of hearing. But even though this is Hannett's album as much as anyone's, the songs and performances are the true key. Bernard Sumner redefined heavy metal sludge as chilling feedback fear and explosive energy, Peter Hook's instantly recognizable bass work at once warm and forbidding, Stephen Morris' drumming smacking through the speakers above all else. Ian Curtis synthesizes and purifies every last impulse, his voice shot through with the desire first and foremost to connect, only connect -- as &quot;Candidate&quot; plaintively states, &quot;I tried to get to you/You treat me like this.&quot; Pick any song: the nervous death dance of &quot;She's Lost Control&quot;; the harrowing call for release &quot;New Dawn Fades,&quot; all four members in perfect sync; the romance in hell of &quot;Shadowplay&quot;; &quot;Insight&quot; and its nervous drive toward some sort of apocalypse. All visceral, all emotional, all theatrical, all perfect -- one of the best albums ever.","torrent":{"xt":"urn:btih:04716f52f0b67ffd33e9bb27b83cd3c24291c5a7","amp;dn":"Joy+Division+-+Unknown+Pleasures+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04716f52f0b67ffd33e9bb27b83cd3c24291c5a7","infoHashBuffer":{"type":"Buffer","data":[4,113,111,82,240,182,127,253,51,233,187,39,184,60,211,194,66,145,197,167]},"announce":[],"urlList":[]}}