{"title":"HISTORY OF POP AND ROCK MUSIC - part 582","uid":12095251,"size":830474421,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:04e2aea2a143c367d6b7e07bf09c37c694e4a922&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+582&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pupovaczlatko","files":9,"time":1436130614,"description":" \n\n                         PART 582\n\n\n                RAINBOW  -  Stargazer (1976) \n                BLACK SABBATH  -  Hard Road  (1978)\n                RAINBOW  -  Can't Happen Here (1981)  \n\n\n\n            &quot;Stargazer&quot; is the fifth track from Rainbow's 1976 album Rising. An epic song narrating the story of a wizard whose attempt to fly by constructing a tower to the stars led to the enslavement of vast numbers of people, it is notable for its musical qualities as well, with the guitar and drum solos cited as important examples of the qualities of guitarist Ritchie Blackmore and drummer Cozy Powell.\nAllMusic and MusicHound  describe the song as one of Rainbow's classics, AllMusic calling it a &quot;bombastic, strings-enriched epic&quot;. Vincent DeMasi, transcribing part of Blackmore's solo as an example of his taste for &quot;classical drama&quot; with a &quot;Middle Eastern flavor&quot;, calls the song an &quot;operatic blockbuster&quot;. Jeff Perkins argues that the &quot;incredible epic&quot;, one of the band's highlights, derives its strength from Blackmore's guitarplaying, Dio's lyrics and vocals, and Powell's drumming. \n\n           &quot;Hard Road&quot; is a single by Black Sabbath. It reached 33 on the UK singles charts. The song, being the last single recorded with Ozzy Osbourne on vocals until Psycho Man (Black Sabbath song) in 1998. The song is a reflection upon the band's career, and how it had been a &quot;hard road&quot; to get to where they were and the success they were receiving at the time.\n\n         &quot;Can't Happen Here&quot;, is a song by Rainbow from the album &quot;Difficult to Cure&quot;  It is the fifth studio album by  Rainbow, and was released in 1981. The album material was started with singer Graham Bonnet still in the band, getting as far as recording an early version of &quot;I Surrender&quot;, before Bonnet left the band due to his dissatisfaction over the material. American singer Joe Lynn Turner, formerly of Fandango was recruited and sang over already completed musical tracks. Turner stated that, because of this, he was singing in higher keys than he would do normally .&quot;I Surrender&quot; would be the band's highest charting single in the UK, reaching No. 3","torrent":{"xt":"urn:btih:04e2aea2a143c367d6b7e07bf09c37c694e4a922","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+582","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04e2aea2a143c367d6b7e07bf09c37c694e4a922","infoHashBuffer":{"type":"Buffer","data":[4,226,174,162,161,67,195,103,214,183,224,123,240,156,55,198,148,228,169,34]},"announce":[],"urlList":[]}}