{"title":"WILDC.A.T.S volume 5 (2008-2011) 01-30 Complete (DC Wildstorm)","uid":8242880,"size":545975569,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:056a9b18f2875cd815640a467f6df74aa98e2387&amp;dn=WILDC.A.T.S+volume+5+%282008-2011%29+01-30+Complete+%28DC+Wildstorm%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"STFmaryville","files":-1,"time":1362998601,"description":"This fills a request for riverchase ... and I dunno, probably someone else. Please seed and share with our friends here at TPB.  --STFmaryville\n\n------\n\nFrom Wikipedia:\n\nWildcats, sometimes rendered WildCats or WildC.A.T.s, is a fictional superhero team created by the American comic book artist Jim Lee and writer Brandon Choi.\n\nThe team first appeared in 1992 in the first issue of their eponymous comic book WildC.A.T.s: Covert Action Teams, published by Image Comics. It was Image founding partner Jim Lee's first work published by the newly-launched company, and his first creator owned project. The Wildcats were the starting point for Lee's menagerie of interconnected superhero creations which became the foundation of the Wildstorm Universe. The Wildcats comics, launched at the apex of a speculator-fuelled comics sales boom, was wildly popular at its inception, with wholesale sales to comic book stores above one million copies for early issues.\n\nIn 1998, ownership of the Wildcats concepts and characters were sold to DC Comics, a subsidiary of Time Warner, as part of DC's acquisition of Lee's company Wildstorm Productions.\n\n------\n\nFrom Comic Vine:\n\nFollowing the cataclysmic conclusion to NUMBER OF THE BEAST comes the dawn of a whole new age: WORLD'S END! The heroes failed to save the planet from destruction and now struggle to survive in a brutal, post-apocalyptic environment ... but with humanity largely dead and the Earth broken, what does the term &quot;hero&quot; even mean?","torrent":{"xt":"urn:btih:056a9b18f2875cd815640a467f6df74aa98e2387","amp;dn":"WILDC.A.T.S+volume+5+%282008-2011%29+01-30+Complete+%28DC+Wildstorm%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"056a9b18f2875cd815640a467f6df74aa98e2387","infoHashBuffer":{"type":"Buffer","data":[5,106,155,24,242,135,92,216,21,100,10,70,127,109,247,74,169,142,35,135]},"announce":[],"urlList":[]}}