{"title":"Lonely Planet - Austria","uid":3883757,"size":180957646,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05f2a63931e288c593553e9421d8de084a472ca6&amp;dn=Lonely+Planet+-+Austria&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"h5499","files":2,"time":1194796227,"description":"This is a photographed copy of the latest Lonely Planet Austria book (copy details below). A picture was taken of each page and in the second file there is a large-format, high-quality picture of EVERY city map provided by the guide.\n\nBook Info:\n# Paperback: 400 pages\n# Publisher: Lonely Planet Publications; 4 edition (March 30, 2005)\n# Language: English\n# ISBN-10: 1740594843\n# ISBN-13: 978-1740594844\n# Product Dimensions: 7.6 x 5.1 x 0.9 inches \n\nEditorial Reviews\nMidwest Book Review\nAustria provides excellent coverage of accommodation from camping and hostels to five-star establishments. It provides maps of cities, provinces and rail routes. Also featured is comprehensive information on architecture and the arts, from the splendor of Vienna&amp;#039;s St. Stephen&amp;#039;s Cathedral to the sites of Salzburg. Details on spectacular skiing and mountaineering locations in the Alps are provided. An extensive guide to Vienna&amp;#039;s famous coffee houses as well as traditional wine taverns throughout the country are noted. Austria is also a very practical guide to navigating the breathtaking Hohe Tauern National Park. Whether a backpacker, business traveler, or simple tourist, Austria is highly recommend. --This text refers to an out of print or unavailable edition of this title.\n\nBook Description\nSlalom the ski slopes at Kitzbuhel, hike the trails through the Tyrol and explore the musical heritage from Salzburg to Vienna. Whether you&amp;#039;re here for the cities or to fill your lungs with pure mountain air, this inspiring guide will help you connect with the heart of the country.\n\n? CARVE UP THE SLOPES or saunter along woodland trails with a dedicated chapter to help plan your outdoor activities\n\n? DREAM SWEETLY in Alpine chalets and exclusive boutique hotels - reviews to suit every taste and budget\n\n? ESCAPE THE COUNTRY and explore the cities - from Linz to Graz and Innsbruck to Salzburg, all the information you need for great city breaks\n\n? SOUND OF MUSIC or the Vienna Boys&amp;#039; Choir? Get beyond the cliches, or embrace them, with extensive entertainment listings for a wide range of musical events\n\n? GET AROUND with itineraries suggestions and comprehensive maps to help you plan your own grand tour","torrent":{"xt":"urn:btih:05f2a63931e288c593553e9421d8de084a472ca6","amp;dn":"Lonely+Planet+-+Austria","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05f2a63931e288c593553e9421d8de084a472ca6","infoHashBuffer":{"type":"Buffer","data":[5,242,166,57,49,226,136,197,147,85,62,148,33,216,222,8,74,71,44,166]},"announce":[],"urlList":[]}}