{"title":"BBC - Putin, Russia and the West 1. Taking control XviD AC3.avi","uid":6969859,"size":734371840,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:05f398a01d8ad1040eccc8482655d0951ece2b0f&amp;dn=BBC+-+Putin%2C+Russia+and+the+West+1.+Taking+control+XviD+AC3.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Pharos01","files":1,"time":1327056335,"description":"59:09\n\n1 of 3 \n\nVladimir Putin, after eight years as president of Russia and four more as prime minister, is stubbornly holding onto power. He has announced his intention to return as president and declared his party the winner in parliamentary elections that are widely seen as fraudulent. In Moscow 100,000 protesters have taken to the streets in the largest demonstrations since Putin took office.\n\nPutin began his career as a KGB spy but when he became president, he made himself a valued ally of the West. How did he do it? And what made Washington and London turn against him?\n\nThis four-part series is made by Norma Percy and the team at Brook Lapping with a track record for getting behind closed doors with multi-award-winning series like The Death of Yugoslavia, The Second Russian Revolution, and Iran and the West. For the first time Putin's top colleagues - and the Western statesmen who eventually clashed with him - tell the inside story of one of the world's most powerful men.\n\nIn this episode, George W Bush meets Putin in June 2001 and declares he looked him in the eye and 'got a sense of his soul'. Colin Powell and Condoleezza Rice recall their discomfort. But Rice, the only Bush adviser in the private talks, reveals that, three months before 9/11, Putin gave Bush a prophetic warning about Pakistan, Afghanistan and the Taliban. After 9/11, Putin describes how he convinced his shocked colleagues that Russia should align with the West. Sergei Ivanov, Russian's defence minister, tells how the Taliban secretly offered to join forces with Russia against America.\n\n\nSource: BBC-HD\n\n\nA/R (WxH): 1:1.78 (720x400)\nVCodec: XviD (2 pass MPEG)\nACodec: AC3 2ch 192Kbps\n\nHD downsized/resized: 1440*1080 to 720*400\n\nFlawless encoding\n\nPls help seed to keep torrent alive!\t\t\n","torrent":{"xt":"urn:btih:05f398a01d8ad1040eccc8482655d0951ece2b0f","amp;dn":"BBC+-+Putin%2C+Russia+and+the+West+1.+Taking+control+XviD+AC3.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05f398a01d8ad1040eccc8482655d0951ece2b0f","infoHashBuffer":{"type":"Buffer","data":[5,243,152,160,29,138,209,4,14,204,200,72,38,85,208,149,30,206,43,15]},"announce":[],"urlList":[]}}