{"title":"The Roman Emperors (Channel 4 - 2003 - Complete)","uid":9212111,"size":1597048983,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:05f7a6fb412be8178ed9b2846d13aff355db8d51&amp;dn=The+Roman+Emperors+%28Channel+4+-+2003+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Robin1966","files":11,"time":1384807163,"description":"TV : Documentary : TV quality : English\n\n\nFour-part series looking at three Roman Emperors: Caesar (2 episodes), Caligula and Nero.\n\nEpisode 1: Julius Caesar part 1\nTony Robinson travels to Rome, Egypt, Greece, France and beyond to investigate the epic life and death of the man he calls &quot;one of the most complex, driven people in the whole of human history&quot;.\n\nEpisode 2: Julius Caesar Part 2\nChronicling the latter years of Julius Caesar, when his power stretched far and wide after a string of military victories. Separating fact from fiction, he reveals the global impact of his reign, unearths the truth behind the legendary meeting with Cleopatra, and asks if the ill-fated leader's last words really were 'Et tu, Brute?'.\n\nEpisode 3: Caligula\nA more complex picture of emperor Caligula than the popular image of an increasingly outrageous, power-mad tyrant. Was Caligula truly mad? Overseeing an imperial court rife with paranoia, violence and betrayal, Caligula commanded respect, but never loyalty. It took a series of campaigns against the Barbarians north of the Rhine to get the army on his side and, having won their hearts and minds, he quickly made plans for an invasion of Britain. It's with this aborted campaign that one of the great Caligula legends was born: on the beach of Boulogne he ordered his troops to collect as many sea shells as they could carry back to Rome, before turning around and heading back for home. Rather than an act of bizarre eccentricity, Robinson sees Caligula's actions as a way of humiliating a legion of men too nervous to cross the Channel (then seen as the edge of the world); perhaps even his way of facing down a potential mutiny. Claiming to be a god however, was a different matter and, when he began to poke fun at the head of the Praetorian Guard's effeminate voice, the emperor's days were numbered.\n\nEpisode 4: Nero\n&quot;In the final part of his series, Tony Robinson looks at the most infamous of all the emperors: Nero. A well-connected childhood (Caligula was his uncle), Nero came to power at just 16 years old, and the new emperor was treated like a rock star; a glamorous, young figure cutting a dash through his court. But away from the adulation, his life had taken on all the elements of an OTT soap opera. His mother was found murdered after a rift over a mistress - power was steadily starting to corrupt him, absolutely. As Robinson explains, the great image of Nero, fiddling while Rome burns, was set in motion by resentment following the emperor's decision to impose a fire tax, part of his rebuilding programme after the great fire that destroyed the city. As unrest grew, he looked for a scapegoat, settling on the burgeoning Christian sect. Things came to a head when he set off on an artistic tour of Greece, a folly which appalled the Romans. Coupled with a reluctance to tour military outposts, which angered the generals, and led to rebellions in far flung reaches of the empire, Nero sealed his doom when both Senate and Praetorian Guard turned their backs on him. While not exactly sympathetic, the profile of Nero Robinson presents is one of a peace lover, enlightened art appreciator and dynamic man of the people&quot;.\n\nFilesize....: 1.48GB (1,596,729,344 bytes)\nDuration..: 46min each\nVideo......: XviD 528x336 25fps, 990Kbps, 0.223bits/(pixel*frame), Aspect Error 0.1%, W-Zoom 100%\nAudio.....: MP3 128Kbps VBR\n\nProduced for Channel 4.\n\n\nIf you don't know who Tony Robinson is, he's the Baldrick character in Blackadder.\nHe has a keen interest in archaeology and ancient history.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:05f7a6fb412be8178ed9b2846d13aff355db8d51","amp;dn":"The+Roman+Emperors+%28Channel+4+-+2003+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05f7a6fb412be8178ed9b2846d13aff355db8d51","infoHashBuffer":{"type":"Buffer","data":[5,247,166,251,65,43,232,23,142,217,178,132,109,19,175,243,85,219,141,81]},"announce":[],"urlList":[]}}