{"title":"Una Mujer Sin Amor (Woman Without Love) - Bunuel","uid":4354993,"size":1467217022,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0607c977942953308ca2946b859aefa92afbc237&amp;dn=Una+Mujer+Sin+Amor+%28Woman+Without+Love%29+-+Bunuel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"mfccorrea","files":2,"time":1219367135,"description":"Una mujer sin amor (English: A Woman Without Love) is a 1952 Mexican film directed by Spanish-born filmmaker Luis BuÃƒÂ±uel. It is based on Guy de Maupassant&amp;#039;s story &quot;Pierre et Jean.&quot;\n\nThe film, like much of BuÃƒÂ±uel&amp;#039;s work, criticizes bourgeois values, especially those of the highly superficial Don Carlos Montero.\n\nPlot\n\nThe film opens in Mexico, in the home of a upper-class antiques salesman named Don Carlos Montero and his wife Rosario, whose son, Carlos or Carlitos, is accused of stealing by the principal of his school. Carlitos is scolded harshly by his father when he comes home, and is locked in his room. Carlitos runs away, but is found by an engineer named Julio Mistral who works in the forest. Julio returns the boy to his parents, and Don Carlos is very grateful. Julio becomes great friends with the Montero family, but in private asks Rosario why she really married such a harsh mannered and older man.\n\nOne day, Rosario and Carlitos pay a visit to Julio in the forest, while Don Carlos spends the day in town on business. Carlitos enjoys himself immensely, fishing for trout. Rosario and Julio converse privately, and Julio notes how unhappy she is. Rosario reveals that she is unhappy because she married Don Carlos for his money when she was very young. Julio sympathizes her plight as a woman who has never truly loved, and they fall in love with each other.\n\nRosario and Julio begin an affair, and Julio tries to convince her to run away with him to Brazil. She eventually agrees, but decides to wait, after Don Carlos suffers a severe heart attack. Don Carlos ultimately lives, and Rosario refuses to go with Julio, unable to separate Carlitos from his father, who had grown close since his illness.\n\nThe film skips about 20 years into the future, where Carlos, and his younger brother, Miguel (not introduced in the first part of the film), have graduated from medical school. One day, news arrives that Julio Mistral has died and decided to will all of his money to Miguel. Initially, everybody is perplexed at this action, as Julio had never met Miguel.\n\nThough it is not explicitly stated in the film, Carlos soon pieces together that Miguel was willed this money because he is the illegitimate child of Julio and his mother, Rosario. Carlos refuses Miguel&amp;#039;s offer to share his inheritance, which he uses to build a new clinic, and begins acting bitter towards his mother and brother. Miguel becomes engaged to be married to a woman who Carlos is convinced wants to marry him for his money. At his wedding, Don Carlos collapses and dies from a heart attack.\n\nThe film comes to a conclusion as Carlos finally discloses the truth about the inheritance to Miguel, who becomes very angry and fights Carlos. Rosario breaks up the fight, and confirms what Carlos has said. Miguel is distraught, and Rosario unapologetically tells them that Julio was the only man she ever loved. The brothers reconcile their differences at the sight of their emotional mother, wrought with sadness. Carlos leaves for the tropics to do research, and the film ends with Rosario placing a picture of Julio on her mantelpiece.\n\n\n   General\n      Complete name : WomanWithoutLove.avi\n      Format : AVI\n      Format/Info : Audio Video Interleave\n      Format/Family : RIFF\n      File size : 1.37 GiB\n      PlayTime : 1h 25mn\n      Bit rate : 2292 Kbps\n      StreamSize : 7.52 MiB\n      Writing application : FairUse Wizard - http://fairusewizard.com\n      Writing library : The best and REALLY easy backup tool\n   Video #0\n      Codec : XviD\n      Codec/Family : MPEG-4\n      Codec/Info : XviD project\n      Codec profile : Streaming Video Profile/Level 1\n      Codec settings/PacketBitStream : Yes\n      Codec settings/BVOP : Yes\n      Codec settings/QPel : No\n      Codec settings/GMC : 0\n      Codec settings/Matrix : Default\n      PlayTime : 1h 25mn\n      Bit rate : 2159 Kbps\n      Width : 640 pixels\n      Height : 464 pixels\n      Display Aspect ratio : 1.379\n      Frame rate : 23.976 fps\n      Resolution : 8 bits\n      Chroma : 4:2:0\n      Interlacement : Progressive\n      Bits/(Pixel*Frame) : 0.302\n      StreamSize : 1.28 GiB\n   Audio #1\n      Codec : MPEG-1 Audio layer 3\n      Codec profile : Joint stereo\n      PlayTime : 1h 25mn\n      Bit rate : 126 Kbps\n      Bit rate mode : CBR\n      Channel(s) : 2 channels\n      Sampling rate : 48 KHz\n      Resolution : 16 bits\n      StreamSize : 77.0 MiB\n      Writing library : LAME3.97b\n      Encoding settings : CBR\n\nSpanish audio, English subtitles","torrent":{"xt":"urn:btih:0607c977942953308ca2946b859aefa92afbc237","amp;dn":"Una+Mujer+Sin+Amor+%28Woman+Without+Love%29+-+Bunuel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0607c977942953308ca2946b859aefa92afbc237","infoHashBuffer":{"type":"Buffer","data":[6,7,201,119,148,41,83,48,140,162,148,107,133,154,239,169,42,251,194,55]},"announce":[],"urlList":[]}}