{"title":"Light In The Shadow Of Jihad - Ravi Zacharias","uid":11726783,"size":8956514,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:069bcd23940fa2d871908285db03a665fed5bdfc&amp;dn=Light+In+The+Shadow+Of+Jihad+-+Ravi+Zacharias&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":1,"time":1425096180,"description":"\n The terrorists who brought death to thousands said they did it in God's name. Thousands of Christians around the world gathered in churches to pray for peace, while others blamed the very idea of God for the tragedy. Ravi Zacharias deals with five of the major questions on people's minds after September 11: - Is this true Islam or a fanatical counterfeit? - In what ways does the relation of church and state change a nation's view of religion and affect its culture? - Is this Islam or a pollution of it? Is religion dangerous to a culture? - Was there a prophecy that this would happen? - Where does this leave the future?&quot;If we find those answers,&quot; writes Zacharias, &quot;they will spell life, steadying the soul even though the heart still aches.&quot;\n\n\nAbout the author:\n For over thirty-five years, Ravi Zacharias has spoken all over the world in great halls and universities, notably Harvard, Princeton, and numerous universities internationally. He is listed as a Senior Research Fellow at Wycliffe Hall, Oxford university. He has appeared on CNN and other international broadcasts. The author of several books for adults and children, he powerfully mixes biblical teaching and Christian apologetics. His most recent works include Walking from East to West, a memoir; The Grand Weaver, an exploration of God's intention in both the ordinary and the startling elements of life; and The End of Reason, a rebuttal of the claims of the so-called New Atheists. His weekly radio program, Let My People Think, is broadcast on 1,692 stations worldwide, and his weekday program, Just Thinking, is on 412. He is founder and chairman of the board of Ravi Zacharias International Ministries, headquartered in Atlanta, Georgia, with additional offices in Canada, Hong Kong, India, Singapore, the United Kingdom, and the United Arab Emirates. Dr. Zacharias and his wife, Margie, have three grown children and reside in Atlanta","torrent":{"xt":"urn:btih:069bcd23940fa2d871908285db03a665fed5bdfc","amp;dn":"Light+In+The+Shadow+Of+Jihad+-+Ravi+Zacharias","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"069bcd23940fa2d871908285db03a665fed5bdfc","infoHashBuffer":{"type":"Buffer","data":[6,155,205,35,148,15,162,216,113,144,130,133,219,3,166,101,254,213,189,252]},"announce":[],"urlList":[]}}