{"title":"InfiniteSkills Dynamic Web Design with PHP and MySQL","uid":8665305,"size":1876435859,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0767909ab439de5ad34395051a7c895193f5d0d6&amp;dn=InfiniteSkills+Dynamic+Web+Design+with+PHP+and+MySQL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"EliteBeast","files":-1,"time":1373396844,"description":"In this PHP - MYSQL training course you will learn how to leverage PHP and MySQL for your website development to create dynamic, interactive websites. This training is designed for the savvy developer, you should have some experience with programming languages, and familiarity with PHP and MySQL, as well as HTML.\n\nAuthor Steve Perry starts with some basics on PHP, and integrating it into a website form. The tutorial continues on with some PHP programming fundamentals, covering the most often used functions - IF, ELSE, AND, OR, NOT, and others. You then cover looping, arrays and functions. As you continue on in this video training course, you cover the basics of MySQL - adding, deleting and updating data to tables. You will then combine PHP and MySQL together for managing your data. You finish off with some CSS, javascript and Ajax integration to bring it all together to make your site interactive.\n\nThroughout this video tutorial, you will complete assignments that will help you apply everything you are learning along the way. By the end of this video course, you will have a solid understanding of how to apply PHP and MySQL together to create a dynamic website. Extensive working files are provided to allow you to follow along and create a project with the author in this Dynamic Web Design Course with PHP and MySQL.\n\n01. Introduction\n02. Interface\n03. PHP Basics\n04. PHP Programming Fundamentals\n05. Advanced PHP Constructs\n06. Functions, Arrays, And Strings\n07. Introduction To MySQL\n08. PHP With MySQL\n09. PHP With Advanced MySQL\n10. PHP With CSS, JavaScript And Ajax\n11. Conclusion","torrent":{"xt":"urn:btih:0767909ab439de5ad34395051a7c895193f5d0d6","amp;dn":"InfiniteSkills+Dynamic+Web+Design+with+PHP+and+MySQL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0767909ab439de5ad34395051a7c895193f5d0d6","infoHashBuffer":{"type":"Buffer","data":[7,103,144,154,180,57,222,90,211,67,149,5,26,124,137,81,147,245,208,214]},"announce":[],"urlList":[]}}