{"title":"Manchu Princess, Japanese Spy: The Story of Kawashima (2015)","uid":11972838,"size":1227936,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07dd7b14663f4e623b608e5c70e057ac36d0fd62&amp;dn=Manchu+Princess%2C+Japanese+Spy%3A+The+Story+of+Kawashima+%282015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"bookzilla","files":1,"time":1432899514,"description":"Manchu Princess, Japanese Spy: The Story of Kawashima Yoshiko, the Cross-Dressing Spy Who Commanded Her Own Army \n\n2015 epub\n\nAisin Gioro Xianyu (1907-1948) was the fourteenth daughter of a Manchu prince and a legendary figure in China's bloody struggle with Japan. After the fall of the Manchu dynasty in 1912, Xianyu's father gave his daughter to a Japanese friend who was sympathetic to his efforts to reclaim power. This man raised Xianyu, now known as Kawashima Yoshiko, to restore the Manchus to their former glory. Her fearsome dedication to this cause ultimately got her killed.\n\n Yoshiko had a fiery personality and loved the limelight. She shocked Japanese society by dressing in men's clothes and rose to prominence as Commander Jin, touted in Japan's media as a new Joan of Arc. Boasting a short, handsome haircut and a genuine military uniform, Commander Jin was credited with many daring exploits, among them riding horseback as leader of her own army during the Japanese occupation of China.\n\n While trying to promote the Manchus, Yoshiko supported the puppet Manchu state established by the Japanese in 1932--one reason she was executed for treason after Japan's 1945 defeat. The truth of Yoshiko's life is still a source of contention between China and Japan: some believe she was exploited by powerful men, others claim she relished her role as political provocateur. China holds her responsible for unspeakable crimes, while Japan has forgiven her transgressions. This biography presents the richest and most accurate portrait to date of the controversial princess spy, recognizing her truly novel role in conflicts that transformed East Asia","torrent":{"xt":"urn:btih:07dd7b14663f4e623b608e5c70e057ac36d0fd62","amp;dn":"Manchu+Princess%2C+Japanese+Spy%3A+The+Story+of+Kawashima+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07dd7b14663f4e623b608e5c70e057ac36d0fd62","infoHashBuffer":{"type":"Buffer","data":[7,221,123,20,102,63,78,98,59,96,142,92,112,224,87,172,54,208,253,98]},"announce":[],"urlList":[]}}