{"title":"Rome And Civil Liberty - J. A. Wylie","uid":11714316,"size":16725663,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07f5ea42295bfda40d4f6cbdb3afef51078ce0e9&amp;dn=Rome+And+Civil+Liberty+-+J.+A.+Wylie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1424484914,"description":"\n\nRome and Civil Liberty: Or, the Papal Aggression in Its Relation to the Sovereignty of the Queen and the Independence of the Nation\n\nAbout the author:\nRev. James Aitken Wylie (1808-1890) was a Scottish historian of religion and Presbyterian minister. He was a prolific writer and is most famous for writing The History of Protestantism. Wylie was born in Kirriemuir, Scotland and his father, James Aitken was an Auld Licht Antiburgher minister in the Original Secession Church. Wylie was educated at Marischal College, University of Aberdeen where he stayed for three years before studying at St. Andrews under Thomas Chalmers. He followed his father's example, entering the Original Secession Divinity Hall, Edinburgh in 1827, and was ordained in 1831. In 1852, after joining the Free Church of Scotland, Wylie edited their Free Church Record until 1860. He published his book The Papacy: Its History, Dogmas, Genius, and Prospects in 1851. The Protestant Institute appointed him Lecturer on Popery in 1860. He continued in this role until his death in 1890, publishing in 1888 his work The Papacy is the Antichrist. Wylie's classic work, The History of Protestantism (1878), went out of print in the 1920s. It has received praise from a number of influential figures","torrent":{"xt":"urn:btih:07f5ea42295bfda40d4f6cbdb3afef51078ce0e9","amp;dn":"Rome+And+Civil+Liberty+-+J.+A.+Wylie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07f5ea42295bfda40d4f6cbdb3afef51078ce0e9","infoHashBuffer":{"type":"Buffer","data":[7,245,234,66,41,91,253,164,13,79,108,189,179,175,239,81,7,140,224,233]},"announce":[],"urlList":[]}}