{"title":"Nevada Barr-Boar Island","uid":15728325,"size":355188640,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0800c1f05058fd273b271d841893c7f344978b9c&amp;dn=Nevada+Barr-Boar+Island&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"twocows","files":15,"time":1472748860,"description":"Boar Island\r\nby Nevada Barr\r\n\r\n    Barbara Rosenblat\r\n\r\n\r\n\r\nAnna Pigeon, in her career as a National Park Service Ranger, has had to deal with all manner of crimes and misdemeanors, but cyber-bullying and stalking is a new one. The target is Elizabeth, the adopted teenage daughter of her friend Heath Jarrod. Elizabeth is driven to despair by the disgusting rumors spreading online and bullying texts. Until, one day, Heath finds her daughter Elizabeth in the midst of an unsuccessful suicide attempt. And then she calls in the cavalry—her aunt Gwen and her friend Anna Pigeon. While they try to deal with the fragile state of affairs—and find the person behind the harassment—the three adults decide the best thing to do is to remove Elizabeth from the situation. Since Anna is about to start her new post as Acting Chief Ranger at Acadia National Park in Maine, the three will join her and stay at a house on the cliff of a small island near the park, Boar Island.\r\n\r\nBut the move east doesn't solve the problem. The stalker has followed them east. And Heath (a paraplegic) and Elizabeth aren't alone on the otherwise deserted island. At the same time, Anna has barely arrived at Acadia before a brutal murder is committed by a killer uncomfortably close to her. Boar Island is a brilliant intertwining of past and present, of victims and killers, in a compelling audiobook that could only come from Nevada Barr","torrent":{"xt":"urn:btih:0800c1f05058fd273b271d841893c7f344978b9c","amp;dn":"Nevada+Barr-Boar+Island","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0800c1f05058fd273b271d841893c7f344978b9c","infoHashBuffer":{"type":"Buffer","data":[8,0,193,240,80,88,253,39,59,39,29,132,24,147,199,243,68,151,139,156]},"announce":[],"urlList":[]}}