{"title":"Daniels and Worthingham's Muscle Testing, 9E [PDF] [StormRG]","uid":11174369,"size":56855576,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0819cf283b4786922d424d3dbad7dc0ba49e77e8&amp;dn=Daniels+and+Worthingham%27s+Muscle+Testing%2C+9E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":-1,"time":1412756491,"description":"TITLE/EDITIONDaniels and Worthingham's Muscle Testing: Techniques of Manual Examination and Performance Testing, 9e \nAuthor: Helen Hislop PhD ScD FAPTA (Author), Dale Avers PT DPT PhD (Author), Marybeth Brown PT PhD FACSM FAPTA (Author)\nSeries: Daniels &amp; Worthington's Muscle Testing (Hislop)\nSpiral-bound: 528 pages\nPublisher: Saunders; 9 edition (January 29, 2013)\nLanguage: English\nISBN-10: 1455706159\nISBN-13: 978-1455706150\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n________________________________________________________________________________\n\n\nA practical handbook on evaluating muscular strength and function, Daniels and Worthingham's Muscle Testing: Techniques of Manual Examination and Performance Testing, 9th Edition makes it easy to understand and master procedures in manual muscle testing and performance testing. Clear, illustrated instructions provide a guide to patient positioning, direction of motion, and direction of resistance. In addition to muscle testing of normal individuals and others with weakness or paralysis, this edition includes new coverage of alternative strength tests and performance tests for older adults and others with functional decline (such as the inactive and obese).\n\nDrawings and arrows along with clear written directions make it easy to understand and perform muscle testing procedures, allowing you to assess deficits in strength, balance, and range of motion.\nMore than 600 illustrations clearly show testing sequences, muscle anatomy, and muscle innervation.\nVideo clips of over 100 muscle tests on the Evolve companion website demonstrate the art and technique of muscle testing in a clinical setting.\nDetails of muscle anatomy and innervation help in linking muscle topography with function.\nHelpful Hints and Substitutions boxes provide additional tips and highlight muscle substitutions that may occur during a test to ensure greater accuracy in testing.\nA constant reference number clearly identifies each muscle in the body, indexed in the Alphabetical List of Muscles by Region as well as in the Ready Reference Anatomy Manual on Evolve, to speed cross-referencing and help you quickly identify any muscle.\nNEW chapters on performance testing cover functional strength testing in older adults and those with functional decline, and testing muscle performance in various clinical settings.\nNEW chapters on manual muscle testing address when to use manual muscle testing, the limitations of manual muscle testing, and alternatives to manual muscle testing.\nUPDATED references for each chapter include the most current evidence-based information.","torrent":{"xt":"urn:btih:0819cf283b4786922d424d3dbad7dc0ba49e77e8","amp;dn":"Daniels+and+Worthingham%27s+Muscle+Testing%2C+9E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0819cf283b4786922d424d3dbad7dc0ba49e77e8","infoHashBuffer":{"type":"Buffer","data":[8,25,207,40,59,71,134,146,45,66,77,61,186,215,220,11,164,158,119,232]},"announce":[],"urlList":[]}}