{"title":"Around the World in 80 Years - Eric Newby (Travels Photography).","uid":8542148,"size":31748194,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0828a4b520aec7660895dc7b590120831d077281&amp;dn=Around+the+World+in+80+Years+-+Eric+Newby+%28Travels+Photography%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1370425398,"description":"\nEric Newby, &quot;Around the World in 80 Years&quot;\nISBN: 0002572230 | 2000 | EPUB | 176 pages | 30 MB\n\nBorn in London in 1919, Eric Newby was educated at St Paul's School. He began his travelling career in a perambulator commuting between Hammersmith Bridge and such seaside resorts as Frinton. In 1938 he persuaded his father to have him apprenticed to the four-masted Finnish barque Moshulu and, with camera in tow, sailed in the last Grain Race from Australia to Europe by way of Cape Horn - the beginning of a lifelong passion for both travel and photography. During the war Newby served in the Black Watch and the Special Boat Service and was awarded the Military Cross. It was as a prisoner of war in Italy that he first met Wanda, his beloved wife and travelling companion of many years. Following the War he spent ten years as a commercial traveller and in a London couture house before resuming his travelling career when he decided to take &quot;A Short Walk in the Hindu Kush&quot;. Whatever else he was doing, he has always travelled on a grand scale, whether under his own steam or as Travel Editor of the &quot;Observer&quot;. Over the years he has mined the richly comic seam of his varied experiences to produce many popular travel classics, such as &quot;Slowly Down the Ganges&quot;, &quot;Love and War in the Apennines&quot;, &quot;A Traveller's Life&quot;, &quot;A Small Place in Italy&quot; and &quot;A Merry Dance Around the World&quot;. In all of his adventures his camera has never been far from his side, and the 250 photographs reproduced in this volume represent some of his finest work. Newby's accompanying recollections are full of his trademark self-deprecating humour and highly observant sense of the incongruous.","torrent":{"xt":"urn:btih:0828a4b520aec7660895dc7b590120831d077281","amp;dn":"Around+the+World+in+80+Years+-+Eric+Newby+%28Travels+Photography%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0828a4b520aec7660895dc7b590120831d077281","infoHashBuffer":{"type":"Buffer","data":[8,40,164,181,32,174,199,102,8,149,220,123,89,1,32,131,29,7,114,129]},"announce":[],"urlList":[]}}