{"title":"Jazz - Fletcher Henderson 1923-38","uid":4839673,"size":709233803,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:085eb804d6c908700ba9c6632eb67ca7a7c432e3&amp;dn=Jazz+-+Fletcher+Henderson+1923-38&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"tamroi","files":174,"time":1239411298,"description":"Fletcher Henderson was very important to early jazz as leader of the first great jazz big band, as an arranger and composer in the 1930s, and as a masterful talent scout. Between 1923-1939, quite an all-star cast of top young black jazz musicians passed through his orchestra, including trumpeters Louis Armstrong, Joe Smith, Tommy Ladnier, Rex Stewart, Bobby Stark, Cootie Williams, Red Allen, and Roy Eldridge; trombonists Charlie Green, Benny Morton, Jimmy Harrison, Sandy Williams, J.C. Higginbottham, and Dickie Wells; clarinetist Buster Bailey; tenors Coleman Hawkins (1924-1934), Ben Webster, Lester Young (whose brief stint was not recorded), and Chu Berry; altoists Benny Carter, Russell Procope, and Hilton Jefferson; bassists John Kirby and Israel Crosby; drummers Kaiser Marshall, Walter Johnson, and Sid Catlett; guest pianist Fats Waller; and such arrangers as Don Redman, Benny Carter, Edgar Sampson, and Fletcher's younger brother Horace Henderson. And yet, at the height of the swing era, Henderson's band was little-known.\n\nFletcher Henderson had a degree in chemistry and mathematics, but when he came to New York in 1920 with hopes of becoming a chemist, the only job he could find (due to the racism of the times) was as a song demonstrator with the Pace-Handy music company. AMG\n","torrent":{"xt":"urn:btih:085eb804d6c908700ba9c6632eb67ca7a7c432e3","amp;dn":"Jazz+-+Fletcher+Henderson+1923-38","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"085eb804d6c908700ba9c6632eb67ca7a7c432e3","infoHashBuffer":{"type":"Buffer","data":[8,94,184,4,214,201,8,112,11,169,198,99,46,182,124,167,167,196,50,227]},"announce":[],"urlList":[]}}