{"title":"Joan as Police Woman - Real Life [2006] [FLAC]","uid":8468488,"size":239549632,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:08af0d699863894c76f0a99985d9dbb774f55dd2&amp;dn=Joan+as+Police+Woman+-+Real+Life+%5B2006%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":12,"time":1368421116,"description":"Artist: Joan as Police Woman \nRelease: Real Life\nReleased: 2006\nLabel: Reveal Records\nCatalog#: Reveal 10\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: UK\nStyle: Alternative Rock, Acoustic, Indie Rock\n\n\n\n\n1. Real Life\n2. Eternal Flame\n3. Feed the Light\n4. The Ride\n5. I Defy\n6. Flushed Chest\n7. Christobel\n8. Save Me\n9. Anyone\n10. We Dont Own It \n\nJoan Wasser spent most of the '90s and 2000s playing with everyone from the Dambuilders to Antony and the Johnsons to Jeff Buckley (with whom she was involved when he died), but of all the projects she's been involved in, Joan as Police Woman is the the finest. Real Life seems like an immediately brilliant debut, but, as is usually the case, years of experience went into it. You can hear it in Wasser's voice, womanly and raspy; in the way she and the rest of the band fuse soul, post-punk, and '70s-style singer/songwriter pop into something familiar, unique, and seemingly effortless; and in the remarkable vulnerability and strength on display throughout. Wasser took &quot;beauty is the new punk rock&quot; as the manifesto for Joan as Police Woman, and while it's certainly catchy and describes the group's music, there's more to it than that: in Joan as Police Woman's world, it's more challenging, more unexpected, to honor hope and beauty instead of just tearing things down. Real Life's music and words are filled with plenty of spine-tingling beauty, as well as honesty, from how the simmering strings slowly overtake the lilting piano melody on the title track, to the way Wasser offers up her heart on &quot;Anyone&quot;: &quot;Try me please/I'm a better dancer than it seems.&quot; Even in the supposedly confessional realm of singer/songwriters, it's rare to hear this kind of genuine, nuanced emotion; it's even rarer to have it surrounded by music that's beautifully structured and elegantly played. There is no contrived edginess in Joan as Police Woman's work -- in fact, Real Life's warmth and accessibility might be the most (pleasantly) surprising thing about it. Most of the album is rapturously quiet, drawing listeners into powerful yet gentle songs like &quot;The Ride&quot; and &quot;Feed the Light,&quot; which breezes in and out on delicate piano and strings that feel like sunbeams. The band raises the volume for a few gently powerful moments like the smoldering &quot;I Defy,&quot; a duet between Wasser and Antony Hegarty that is equal parts drama and intimacy, and the brilliantly guitar- and yearning-driven &quot;Christobel.&quot; While most of Real Life shines with hard-won optimism and hope, Joan as Police Woman deals with more difficult emotions just as eloquently. &quot;Eternal Flame&quot; sets a tale of having the strength to walk away from a potentially disastrous relationship, no matter how appealing it seems, to luminous guitars and backing vocals, while &quot;We Don't Own It&quot;'s subtly profound acceptance of the ends of things (&quot;it's in the mystery&quot;) makes it the perfect final song. Real Life is an almost eerily flawless album, but as intense as it is, it's also incredibly comforting. This album is necessary.","torrent":{"xt":"urn:btih:08af0d699863894c76f0a99985d9dbb774f55dd2","amp;dn":"Joan+as+Police+Woman+-+Real+Life+%5B2006%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08af0d699863894c76f0a99985d9dbb774f55dd2","infoHashBuffer":{"type":"Buffer","data":[8,175,13,105,152,99,137,76,118,240,169,153,133,217,219,183,116,245,93,210]},"announce":[],"urlList":[]}}