{"title":"(PSX-PSP) Resident Evil 3: Nemesis converted properly [ResourceR","uid":5042611,"size":447589325,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:0917ef62e5c3fe2a22bd74eacaa8a11ce029b007&amp;dn=%28PSX-PSP%29+Resident+Evil+3%3A+Nemesis+converted+properly+%5BResourceR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"toxicjuggalo","files":2,"time":1249456778,"description":"You MUST use 3.40 POPS for this release to work\n\n\nRESIDENT EVIL 3 - NEMESIS:\n\nWith the gruesome T-Virus finally dormant, Jill Valentine has resigned from S.T.A.R.S. and is going to leave what's left of Raccoon City. Much to her dismay, her exit has been delayed by the same flesh-eating zombies that plagued her counterparts in the first two games! This time, however, the undead are augmented by bloodthirsty hunters, evil hellhounds, and other terrors of the night. As Jill, you'll meet up with a lot of new faces, and some old ones too. Carlos Olivera, for example, is an Umbrella Biohazard Countermeasure Service Agent that seems to want to help you out; whether you trust him or not is up to you. Each time you meet up with an enemy, you can either confront it or evade it, but your choices all add up in this immersing tale of terror. Of course, you do have some pretty powerful ammo to back you up, and the game even lets you combine weapons to make your own firepower. The third installment in the popular RESIDENT EVIL series, this one boasts improved graphics, sound, and overall gameplay. Hidden at the end of the adventure is a bonus Mercenaries game but you'll be lucky if you live to see it.\n\nHave you been looking for that classic PSX game but just can't seem to find it anywhere? How about those &quot;rare&quot; titles that were only released in certain regions? Better yet, would you like to be able to have those games playable on your PSP so you can play them anywhere you want? Want to get those conversions directly from the source instead of through &quot;unsafe&quot; torrent browsers? Come and request them at\n\n                         www.reputation-resource.com\n","torrent":{"xt":"urn:btih:0917ef62e5c3fe2a22bd74eacaa8a11ce029b007","amp;dn":"%28PSX-PSP%29+Resident+Evil+3%3A+Nemesis+converted+properly+%5BResourceR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0917ef62e5c3fe2a22bd74eacaa8a11ce029b007","infoHashBuffer":{"type":"Buffer","data":[9,23,239,98,229,195,254,42,34,189,116,234,202,168,161,28,224,41,176,7]},"announce":[],"urlList":[]}}