{"title":"Ane Brun - Duets 2005","uid":6887913,"size":220348471,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0958c6a7ae88f9688d24c4ca4421fa6c9113d121&amp;dn=Ane+Brun+-+Duets+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"barber9","files":-1,"time":1323897769,"description":"After growing up in Molde, Norway, Ane Brun moved from her home town in 1995 and spent the next few years moving between Barcelona, Oslo and Bergen. In Bergen she began writing her own material while at university (jumping between courses in Spanish, law and music) as well as making a living working in record shops and bars.\n\nAfter playing a few minor shows and recording her first demos in Bergen in 1999, she moved to Sweden, firstly to Uppsala and then to Stockholm in 2001, where she started to take her musical career seriously.\n\nAne recorded her debut album Spending Time with Morgan in 2002 in both Stockholm and back in Uppsala, with engineers and producers Katharina Nuttall, Cecile Grudet and Kim Nelson. It was released on the label, DetErMine, which she formed with Ellekari Larsson from Swedish band The Tiny. The debut album came out in 11 European countries in 2003 through a licence/distribution deal with V2 Music.\n\nAfter releasing the first album Ane toured around Europe but soon took some time out. She had been working intensively for two years and felt somewhat burnt out and in need of a break. After a six month breather she started touring around Europe again and within the next year had her second album ready. A Temporary Dive was again produced by Katharina Nuttall and was released in 2005 throughout Europe, followed by the UK and the US in 2006, and in Japan in 2007. This album took the darker themes of Spending Time With Morgan further, through songs like The Fight Song and title track A Temporary Dive, but there was also space for the lighter Song No. 6, a duet with Ron Sexsmith.\n\nA Temporary Dive was well received all over the world, picking up good reviews in magazines and newspapers from Time Magazine to The Independent. She received award nominations from all over Europe too, and that year took home the Spellemannpris, the equivalent of the Norwegian Grammies, for Best Female Artist.\n\nAfter enjoying the collaboration on the previous few duets she had recorded, Ane was inspired to ask some artists whom she adored to sing with her on a full album called Duets. This album was released in November 2005 and besides another recording with Ron Sexsmith it also included songs with artists such as Syd Matters and Teitur. The collaboration with the band Madrugada on the single Lift Me, gained her another Norwegian Grammy. (wikipedia)\n\n- - -\n\nAne Brun - Duets 2005\n(Stockholm DetErMine/VP)\n\n 1. Little Lights ( with Syd Matters)\n 2. Lift Me ( with Madrugada)\n 3. Ruber &amp; Soul ( with Teitur)\n 4. This Road ( with Lars Bygden)\n 5. Stop ( with Liv Widell )\n 6. Across the Bridge ( with the Tiny)\n 7. Easier ( with Tingsek)\n 8. Love and Misery ( with Tobias Froberg)\n 9. Common Bird ( with Ron Sexsmith)\n10. Song No 6 ( with Ron Sexsmith)\n","torrent":{"xt":"urn:btih:0958c6a7ae88f9688d24c4ca4421fa6c9113d121","amp;dn":"Ane+Brun+-+Duets+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0958c6a7ae88f9688d24c4ca4421fa6c9113d121","infoHashBuffer":{"type":"Buffer","data":[9,88,198,167,174,136,249,104,141,36,196,202,68,33,250,108,145,19,209,33]},"announce":[],"urlList":[]}}