{"title":"1916  Two-stroke engine manual.pdf","uid":8946930,"size":25202549,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09c392f10cf010d1dcc6f4f5c847d7dde4a7b86e&amp;dn=1916++Two-stroke+engine+manual.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"cojon","files":1,"time":1379797422,"description":"A 1916 MANUAL OF THE COMING FORM\nOF TWO-CYCLE INTERNAL COMBUSTION ENGINES\n\nBy Dr. A. M. LOW, A.C.G.L, D.Sc,. etc.\n\n    -----About 200 pages-----\n\n  \nPublished by: \n\nTEMPLE PRESS LTD., Proprietors of &quot;The\nMotor,&quot; &quot;The Light car and Cyclecar,\n&quot;Motor Cycling,&quot; etc.\n  __________________________________________\n\n\nPublished in 1916 this book of engine development \nprovides ancient roots for what we see in two-cycle \nmotorcycles today. It was a book of interest in it's time \nand from it came the beginning of the worldwide \nmotorcycle revolution.\n\nFilled with 'technical' text, drawings, and oauthentic \nadvertizing of that period, it is extremely interesting \nreading. This would make one of the best home printed \nbooks to set on your mantel as everyone into today's \nmodern 200 HP wheels of thunder would love it.\n  __________________________________________\n\n\nHere is a small sample of text. \n\n  __________________________________________\n\n(page 19)\n\nPractically speaking,there are very few engines on the \nmarket other than those with crankcase compression, and \nthis is possibly a proof of the value of THE TWO-STROKE \nENGINE simplicity, although we must bear in mind that it \nis largely controlled by questions of price, for there is no \nreason why a two-stroke engine should be looked upon \nas one having only crankcase compression.\n\nIn fact there can be no doubt that this misunderstanding\nis responsible for many hard things that have been said \nfrom time to time about the two-stroke.\n\nThere are many dozens of engines on the market, but \nfrom a scientific point of view they differ very slightly in \ntheir mechanical details, and it is therefore interesting to  \nnotice how their working is affected by their construction.\n\nThe great object of all designers has very naturally been the \nproduction of a smooth impulse engine, and one, moreover, \nwhich is capable of producing its power at low speeds, \nthereby avoiding many of the losses which are due to the \nshock and general irregular running of the four-stroke, or \nmuch more irregular impulse engine, at low speeds.\n\nThe ordinary standard four-stroke engine when running \nslowly wastes a terrible amount of power through shock, \nand becomes a most unmechanical proposition at a speed \nof revolution far higher than that at which the two-stroke \nis capable of averaging with reasonable economy, and with \npossibilities of petrol consumption which can be more \nvaried to suit running conditions.\n__________________________________________\n\n\n\nI think you can easily see what the original engineers \nwent through on the way to producing the extreme \ntwo strokes we have seen before most were made \nillegal due to emissions a few years back.  \n\nThis also clearly illustrates the early problems of developing \neffective, smooth and powerful four-stroke engines. \n\nImagine what would be said if were we to take something like \na modern Ducati, Honda, Yamaha, Kawasaki or Suzuki back in \ntime.  What about one of the V-8 versions of motorcycles with \n700HP, or perhaps an S&amp;S Harley Davidson big bore stroker with \ntwin turbos shoving out something like 450HP yet idling at 500 \nRPM with that distinctive potato-potato-potato-potato sound? \n\nAt that time in motorcycling a BMW R 27 with 18 HP would be \nthe same as bringing back to our time a thought invoked, atom \npowered computer the size of a ladies wrist watch sporting \nall the knowledge of the world transmitted to the mind via \na nearly invisible implant.  \n\n                   ********************\n\nThe development of motorcycles has come a very long way in \nthe ninety-seven years between 1916 and 2013 has it not?\n\n\n\n\nPlease download and enjoy!\n\nSeed at least a week so that all interested \nmotorcyclists can enjoy this ancient piece of \nour incredible history. \n\nCojon \n\n","torrent":{"xt":"urn:btih:09c392f10cf010d1dcc6f4f5c847d7dde4a7b86e","amp;dn":"1916++Two-stroke+engine+manual.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09c392f10cf010d1dcc6f4f5c847d7dde4a7b86e","infoHashBuffer":{"type":"Buffer","data":[9,195,146,241,12,240,16,209,220,198,244,245,200,71,215,221,228,167,184,110]},"announce":[],"urlList":[]}}