{"title":"Z. A. Recht - The Morningstar Strain Trilogy","uid":8803548,"size":967900740,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0a128a41b6b7546a386ec7edbdad04248d65bdec&amp;dn=Z.+A.+Recht+-+The+Morningstar+Strain+Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"jimi88","files":-1,"time":1376268843,"description":"Z. A. Recht - The Morningstar Strain Trilogy (Audiobooks):\n--------------------------------------------------------\n\n1) Plague of the Dead:\n----------------------\nThe end begins with a viral outbreak unlike anything mankind has ever encountered before. The infected are subject to delirium, fever, a dramatic increase in violent behavior, and a one-hundred percent mortality rate. Death. But it doesn't end there. The victims return from death to walk the earth.\nWhen a massive military operation fails to contain the plague of the living dead it escalates into a global pandemic. In one fell swoop, the necessities of life become much more basic. Gone are petty everyday concerns. Gone are the amenities of civilized life. Yet a single law of nature remains: Live, or die. Kill, or be killed. On one side of the world, a battle-hardened General surveys the remnants of his command: a young medic, a veteran photographer, a brash Private, and dozens of refugees, all are his responsibility-all thousands of miles from home. Back in the United States, an Army Colonel discovers the darker side of Morningstar virus and begins to collaborate with a well-known journalist to leak the information to the public...The Morningstar Saga has begun.\n----------------------------------------\nNarrator: Oliver Wyman\nListening Length: 10 hours and 56 minutes\nProgram Type: Audiobook\nVersion: Unabridged\nPublisher: Audible Frontiers\nAudible.com Release Date: August 25, 2009\nLanguage: English\nASIN: B002MVI0P2\n----------------\n\n2) Thunder and Ashes:\n---------------------\nA lot can change in three months: wars can be decided, nations can be forged... or entire species can be brought to the brink of annihilation. The Morningstar Virus, an incredibly virulent disease, has swept the face of the planet, infecting billions. Its hosts rampage, attacking anything that remains uninfected. Even death can't stop the virus-its victims as cannibalistic shamblers. Scattered across the world, embattled groups have persevered. For some, surviving is the pinnacle of achievement. Others hoard goods and weapons. And still others leverage power over the remnants of humanity in the form of a mysterious cure for Morningstar.\nFrancis Sherman and Anna Demilio want only a vaccine, but to find it, they must cross a countryside in ruins, dodging not only the infected, but also the lawless living. The bulk of the storm has passed over the world, leaving echoing thunder and softly drifting ashes. But for the survivors, the peril remains, and the search for a cure is just beginning...\n-------------------------------\nNarrator: Oliver Wyman\nListening Length: 11 hours and 43 minutes\nProgram Type: Audiobook\nVersion: Unabridged\nPublisher: Audible Frontiers\nAudible.com Release Date: August 25, 2009\nLanguage: English\nASIN: B002MVI0PC\n----------------\n\n3) Survivors: \n-------------\nSurvivors is the all-new soul-shattering climax to the postapocalyptic trilogy, featuring a deadly virus, military action, global devastation - and zombies.\n\nA lot can change in three months: Wars can be decided, nations can be forged...or entire species can be brought to the brink of annihilation. The Morningstar Virus, an incredibly virulent disease, has swept the face of the planet, infecting billions. The infected hosts rampage, attacking anything that remains uninfected. Even death can't stop the virus - its victims become frightening and deadly cannibals. Scattered across the world, embattled groups have persevered. For some, surviving is the pinnacle of achievement. Others hoard goods and weapons. And still others leverage power over the remnants of humanity in the form of a mysterious cure for Morningstar. For the survivors, the peril remains, and the search for a cure goes on...\n---------------\nExtra Writer: Thom Brannan\nNarrator: Oliver Wyman\nListening Length: 12 hours and 5 minutes\nProgram Type: Audiobook\nVersion: Unabridged\nPublisher: Audible Frontiers\nAudible.com Release Date: June 19, 2012\nLanguage: English\nASIN: B008CLSPUG\n----------------\nThe first two books get 9/10. The final book get's an 7.5/10, mostly because the change in writer (Z A Recht died before he could finish).\nHave Fun and if you love the audiobook buy the paper! \n\nGreetz Jimi\t","torrent":{"xt":"urn:btih:0a128a41b6b7546a386ec7edbdad04248d65bdec","amp;dn":"Z.+A.+Recht+-+The+Morningstar+Strain+Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a128a41b6b7546a386ec7edbdad04248d65bdec","infoHashBuffer":{"type":"Buffer","data":[10,18,138,65,182,183,84,106,56,110,199,237,189,173,4,36,141,101,189,236]},"announce":[],"urlList":[]}}