{"title":"Supersuckers - Devil's Food (2005) 320 vtwin88cube","uid":6113726,"size":112809933,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0a214bea1daa96f23590cfa9e697be16b60995fb&amp;dn=Supersuckers+-+Devil%5C%27s+Food+%282005%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1295463483,"description":"Supersuckers\nDevil's Food (2005)\n\nSomething of an anomaly on the Sub Pop roster, the Supersuckers bore a limited surface resemblance to grunge, but they were a party band at heart, donning cowboy hats and kicking out a gleefully trashy brand of throttling, rockabilly-flavored garage punk. Their lyrics were a raucous, over-the-top celebration of all the attendant evils of rock &amp; roll -- sex, booze, drugs, Satan, and whatever other vices the band could think of, all glorified with tongue planted firmly in cheek. Save for an abrupt and temporary detour into hardcore honky tonk, their approach stayed relatively consistent through the '90s, as did their quality control.\n\nThe Supersuckers were formed in Tucson, AZ, in 1988 by high-school friends Eddie Spaghetti (born Edward Carlyle Daly III, bass, vocals), Ron Heathman (guitar), Dan &quot;Thunder&quot; Bolton (guitar), Dancing Eagle (born Dan Seigal, drums), and Eric Martin (lead vocals). After playing the local scene for about a year under the name the Black Supersuckers (taken from a pornographic novel), the band moved to Seattle, ostensibly in search of a climate more conducive to leather jackets. Martin left the band not long after, and Eddie Spaghetti took his place on lead vocals. Shortening their name to the Supersuckers, the band recorded singles for several indie labels, including eMpTy, Sympathy for the Record Industry, and Lucky; these were collected on the eMpTy compilation The Songs All Sound the Same, which became the band's first CD release in 1992. That year, they signed to Sub Pop and issued their proper debut album, The Smoke of Hell, which was produced by Jack Endino and featured cover art by renowned comic artist Daniel Clowes. Featuring one of the band's best-known songs in &quot;Coattail Rider,&quot; the record also spun off the single &quot;Hell City, Hell,&quot; whose B-side was a fan-favorite cover of Ice Cube's &quot;Dead Homiez.&quot;\n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\n\nFormat:\t\t\tMp3\nGenre:\t\t\tRock\t\t\nM3U Playlist:\t\tYes\n\nOnce you get past their resin-soaked detour into country music, Must've Been High, the Supersuckers aren't a band offering much in the way of surprises -- put on one of their records, and you'll get big slabs of high-swagger Rawk, with hard rock guitar punch bolted to hardcore speed-jive while a cloud of smart-ass humor hovers over the top. With this kind of consistency of vision, it shouldn't come as a shock that Devil's Food, an odds 'n' sods collection of single sides, Internet-only tracks, covers, and unreleased tunes, hangs together with the focus of a &quot;real&quot; album instead of a compilation, but what should genuinely raise eyebrows is that nothing here sounds like a throwaway that didn't make the cut elsewhere. Originals like &quot;Gato Negro,&quot; &quot;Can Pipe,&quot; and &quot;Kid's Got It Comin'&quot; bring the rock in grand style, the &quot;country&quot; remakes of &quot;Born With a Tail&quot; and &quot;Doublewide&quot; boast large portions of both twang and cojones, and the covers are inspired, especially the fifth-gear run through Jerry Reed's &quot; &quot;Eastbound and Down&quot; (you know, that song from Smokey and the Bandit) and a hard rockin' but faithful version of OutKast's &quot;Hey Ya!&quot; Crack open a beer, crank up the stereo, slap this in the player, and make with those Devil's horns -- the Supersuckers are still kickin' it out, and Devil's Food shows they've got the goods and then some.\n\n01.Gato Negro\n02.Shake It Off\n03.Hey Ya!\n04.Teenage Shutdown\n05.Double Wide (Country)\n06.Team Man\n07.Can Pipe\n08.Rubber Biscuit\n09.Born With A Tail (Country Version)\n10.Devil's Food\n11.Sail On\n12.Kid's Got It Comin'\n13.Eastbound &amp; Down\n14.Then I'm Gone\n15.Flyin' Into The Mid-Day Sun\n16.End Of An Era\n\n\nCheers!","torrent":{"xt":"urn:btih:0a214bea1daa96f23590cfa9e697be16b60995fb","amp;dn":"Supersuckers+-+Devil%5C%27s+Food+%282005%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a214bea1daa96f23590cfa9e697be16b60995fb","infoHashBuffer":{"type":"Buffer","data":[10,33,75,234,29,170,150,242,53,144,207,169,230,151,190,22,182,9,149,251]},"announce":[],"urlList":[]}}