{"title":"The Race of My Life: An Autobiography by Milkha Singh","uid":10792428,"size":1626612,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a31bbe0f8655d308d4e978168277a6c1c750e97&amp;dn=The+Race+of+My+Life%3A+An+Autobiography+by+Milkha+Singh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Jallentino","files":2,"time":1408264635,"description":"Book Details:\nName: The Race of My Life: An Autobiography\nLength: 168 pages\nPublisher: Rupa Publications\nLanguage: English\nISBN-10: 8129129108\nISBN-13: 978-8129129109\nFile Size: 1.6 MB | File Format: ePUB\n\nBook Description:\nMilkha Singh has led a life dominated by running, running, running... From a boy who narrowly escaped death during Partition (most of his family was not so lucky), to a juvenile delinquent who stole and outran the police, to a young Army recruit who ran his very first race to win special privileges for himself (a daily glass of milk). After that first race, Milkha Singh became an athlete by default. And what followed was the stuff legends are made of.\n\nIn this remarkably candid autobiography, Milkha Singh shares the amazing highs of winning India s first ever gold in athletics at the Commonwealth Games, the unbridled joy of being hailed as the Flying Sikh in Pakistan, as well as the shattering low of failure at the Olympics.\n\nSimple, yet ambitious; famous, yet grounded; temptations all around him, yet remaining celibate so he could focus on racing; a rich and beautiful girl who was desperate for him, yet fighting the world to marry his lady love, Nimmi even as the on-field drama found its way into his personal life, Milkha was a man who defined his own destiny. And yet, for a man whose life was dominated by sports, he continues to remain disillusioned with the way sports is run...\n\nPowerful and gripping, The Race of My Life documents the journey of an impoverished refugee who rose to become one of the most towering figures in Indian sports.\n &lt;a href=&quot;\nhttp://i.imgur.com/8ztjGfN.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/8ztjGfN.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:0a31bbe0f8655d308d4e978168277a6c1c750e97","amp;dn":"The+Race+of+My+Life%3A+An+Autobiography+by+Milkha+Singh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a31bbe0f8655d308d4e978168277a6c1c750e97","infoHashBuffer":{"type":"Buffer","data":[10,49,187,224,248,101,93,48,141,78,151,129,104,39,122,108,28,117,14,151]},"announce":[],"urlList":[]}}