{"title":"FSX FS2004 Tropicalsim Trieste LIPQ .rar","uid":6719956,"size":63619667,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0a688997063425e18130f60814b6d3ff9051bd6a&amp;dn=FSX+FS2004+Tropicalsim+Trieste+LIPQ+.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mickyfinny","files":1,"time":1317754651,"description":"Tropicalsim brings you her second European airport, after Porto/LPPR being such an amazing success. This time, Italian Trieste/LIPQ. This nice scenery has two independent installers in just one pack, as always: one for FS9 and another for FSX. Choose your version and fly to Trieste/LIPQ.\n\nConveniently located 33 km / 21 miles north-west of Trieste and 110 km / 69 miles east of Venice, Trieste Friuli Venetia Giulia Airport (Aeroporto Friuli-Venezia Giulia) is a modern and increasingly popular transport hub, serving over 700,000 passengers a year. Situated close to the borders with Slovenia and Croatia, Trieste Airport (TRS) is also close to Begliano, Cassegliano, Redipuglia, Ronchi dei Legionari, San Pier d'Isonzo and Turriaco.\n\nTrieste Airport is officially called Aeroporto Friuli-Venezia Giulia, named after the Italian region in which it is located. The airport is also sometimes known as Ronchi dei Legionari after the immediate locality. Its IATA code is TRS. Trieste is a handy airport for visiting this north-eastern corner of Italy, or for travelling into Slovenia. Since Ryanair flights from London Stansted to Trieste are usually cheap, it's an alternative to the area's more popular airports like Venice and Verona, and makes a good budget start or end to a travelling holiday.\n\nTrieste Airport (TRS) caters for domestic and international flights through its passenger terminal and airlines operating include Air Dolomiti, Air France, Alitalia, Lufthansa, Ryanair with Paris-Charles de Gaulle, Naples, Rome-Fiumicino, London-Stansted, Birmingham, Belgrade and Munich being popular destinations that are served.\n\nI know its not the best Scenery,but better than default :+)","torrent":{"xt":"urn:btih:0a688997063425e18130f60814b6d3ff9051bd6a","amp;dn":"FSX+FS2004+Tropicalsim+Trieste+LIPQ+.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a688997063425e18130f60814b6d3ff9051bd6a","infoHashBuffer":{"type":"Buffer","data":[10,104,137,151,6,52,37,225,129,48,246,8,20,182,211,255,144,81,189,106]},"announce":[],"urlList":[]}}