{"title":"Leisure Suit Larry Reloaded (2-click run)","uid":8625346,"size":610243574,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0a75945e06898481bef3f38c315a8c3b953061a3&amp;dn=Leisure+Suit+Larry+Reloaded+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"The_Duck1","files":-1,"time":1372492795,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDescription:\nLeisure Suit Larry is one of the most iconic characters in the history  of\ncomputer gaming\n\nThe first game in the series, Leisure Suit Larry in the Land of the Lounge\nLizards, was published\nin 1987 and helped build the Sierra On-Line dynasty. Featured in  a  score\nof original software titles since then (not counting numerous  anthologies\nand cameo appearances), the series' hero, Larry  Laffer,  is  a  bumbling,\npersistent everyman who  just  wants  to  be  loved.  Is  that  so  wrong\n\nFrom original designer  Al  Lowe  (designer  of  all  of  Larry's  classic\nadventures) and writer Josh\nMandel, Replay Games is  remaking  the  landmark  first  game  for  a  new\ngeneration. Expanded\nand enhanced in every detail and ready for both mobile  devices  and  PCs\nLeisure\nSuit Larry: Reloaded is being reborn for the  players  who  might've  seen\ntheir parents (or\ngrandparents) playing Larry behind closed doors\n\nFeatures\n=========\n\nExpanded Content - Who says a remake has to just be the same game with\nnew graphics? Leisure Suit Larry: Reloaded enters the 21st century and\nbrings with it expanded puzzles, locations, women, humor,and gameplay\nModern, Hand-Drawn Graphics - Larry was great in big fat pixels 25 years\nago, but this is the age of the retina display. Leisure Suit Larry\nReloaded has gorgeous hi-res, hand-drawn art, and animation to show off\nhis irresistible face and the stunning women he meets\nIt wouldn't be Leisure Suit Larry without the humor - Larry is the\nultimate Casanova wannabe, but his &quot;flirting&quot; rarely goes as planned\nAlong with rejections, fans will laugh at thousands of hilarious\nresponses while they explore everything on screen. Non-mobile players\nwill hear professional voiceover actors\nA Symphony for the Ears - Gamers will hear an all-new Vegas-style\nmusical score from Grammy-nominated, BAFTA-winning composer Austin\nWintory. The soundtrack features all authentic instrumentation and Al\nLowe guest-starring on the sax\nNaughty, but Nice - Larry is a man on the make, and the game drips with\ninnuendos, flirts with perversity, and oozes sexuality. But Larry has\nalways been about comedy, and never been explicit. Leisure Suit Larry\nReloaded retains that standard. There's no full-frontal nudity, no\nfour-letter words, and no on-screen sex\n\n\nInstallation instructions:\n1. Execute the Leisure Suit Larry Reloaded (2-click run).exe file.\n2. Click next.\n3. answer Larry's questions.\n3. Enjoy the game.","torrent":{"xt":"urn:btih:0a75945e06898481bef3f38c315a8c3b953061a3","amp;dn":"Leisure+Suit+Larry+Reloaded+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a75945e06898481bef3f38c315a8c3b953061a3","infoHashBuffer":{"type":"Buffer","data":[10,117,148,94,6,137,132,129,190,243,243,140,49,90,140,59,149,48,97,163]},"announce":[],"urlList":[]}}