{"title":"Ender's Game EPUB version","uid":6138834,"size":456603,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a92dfa4c10187b111f8e1ae576028d870475d9f&amp;dn=Ender%5C%27s+Game+EPUB+version&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"amateuruser","files":-1,"time":1296415384,"description":"In order to develop a secure defense against a hostile alien race's next attack, government agencies breed child geniuses and train them as soldiers. A brilliant young boy, Andrew &quot;Ender&quot; Wiggin lives with his kind but distant parents, his sadistic brother Peter, and the person he loves more than anyone else, his sister Valentine. Peter and Valentine were candidates for the soldier-training program but didn't make the cut--young Ender is the Wiggin drafted to the orbiting Battle School for rigorous military training.\n\nEnder's skills make him a leader in school and respected in the Battle Room, where children play at mock battles in zero gravity. Yet growing up in an artificial community of young soldiers Ender suffers greatly from isolation, rivalry from his peers, pressure from the adult teachers, and an unsettling fear of the alien invaders. His psychological battles include loneliness, fear that he is becoming like the cruel brother he remembers, and fanning the flames of devotion to his beloved sister. Back on Earth, Peter and Valentine forge an intellectual alliance and attempt to change the course of history.\n\nThis futuristic tale involves aliens, political discourse on the Internet, sophisticated computer games, and an orbiting battle station. Yet the reason it rings true for so many is that it is first and foremost a tale of humanity; a tale of a boy struggling to grow up into someone he can respect while living in an environment stripped of choices. Ender's Game is a must-read book for science fiction lovers, and a key conversion read for their friends who &quot;don't read science fiction.&quot;\n\nEnder's Game won both the Hugo and the Nebula the year it came out. Writer Orson Scott Card followed up this honor with the first-time feat of winning both awards again the next year for the sequel, Speaker for the Dead.","torrent":{"xt":"urn:btih:0a92dfa4c10187b111f8e1ae576028d870475d9f","amp;dn":"Ender%5C%27s+Game+EPUB+version","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a92dfa4c10187b111f8e1ae576028d870475d9f","infoHashBuffer":{"type":"Buffer","data":[10,146,223,164,193,1,135,177,17,248,225,174,87,96,40,216,112,71,93,159]},"announce":[],"urlList":[]}}