{"title":"Guy Maddin - Cowards Bend the Knees","uid":4689416,"size":734022337,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0ae60d532270ba365f2bc81ab3ed0ea6fc664da3&amp;dn=Guy+Maddin+-+Cowards+Bend+the+Knees&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pcscarpa","files":2,"time":1233342423,"description":"Straight from the guilt mines of Guy Maddin's psyche to the collective unconscious of stunned audiences, &quot;Cowards Bend the Knee&quot; is film autobiography at its most hilariously creative. Like all of Maddin's opuses, &quot;Cowards&quot; vamps silent cinema, here German Expressionism -- though its 10-part episodic structure, secret passageways and exclamation point-riddled intertitles owe as much to Feuillade's &quot;Fantomas&quot; or &quot;Vampires&quot; serials. Pic's hour length may limit it to fests, indie cable and, natch, retrospectives of the mad maestro's work.\n\nConceived as an art installation in Toronto, the voyeuristic &quot;Cowards&quot; was fittingly shown through nickelodeon-style peepholes at the Toronto gallery and later at the Rotterdam and Tribeca fests, with conventional full-screen unspoolings also on tap. Surrealistic action takes place in a hockey arena and an odd beauty parlor. (Maddin's father was a hockey coach, and Maddin as a child lived above his aunt's and mother's beauty parlor.) The rink houses a forgotten wax museum and is crisscrossed by studiolike catwalks, where ghosts of dead lovers stroll. The beauty salon doubles as a bordello, while behind one-way porthole mirrors a demented doctor in a corset (who also serves as medico to the hockey team) performs abortions.\n\nHero (named Maddin), a slave to lust and cowardice, is shamefully capable of abandoning his old girlfriend in mid-abortion to pursue a new flame. The object of this newfound infatuation is madly in love with her dead father and unwilling to let our hero touch her until he's had his hands chopped off and replaced by her father's blue ones (hence the film's subtitle: &quot;The Blue Hands&quot; ). This leads to quite perverse variations on the killer hands of &quot;Beast With Five Fingers.&quot; Events unfold with the logic of a fever-dream, fetishizing cultural artifacts and selected body parts interchangeably through close-ups, spotlights, irises-in, repetitions, double-exposures and all manner of flickering low-tech special effects. The camera travels with anarchic glee past reflective surfaces, gleaming scissors and oiled tresses in this harem-like hothouse of femininity to, somehow, find the unconscious links between beauty parlors and back-room abortion clinics.\n\nUltimately, psychotically inventive pic is a formidable addition to the ever-evolving Maddin oeuvre.\n\n\n----***----\n\n\n\nFile Name .........................................: CowardsBendTheKnee.avi\nFile Size (in bytes) ............................: 734,005,248 bytes\nRuntime ............................................: 1:03:57\n\nVideo Codec ...................................: XviD 1.1.0 Beta 2\nFrame Size ......................................: 560x416 (AR: 1.346)\nFPS .................................................: 23.976\nVideo Bitrate ...................................: 1395 kb/s\nBits per Pixel ...................................: 0.250 bpp\nB-VOP, N-VOP, QPel, GMC.............: [B-VOP], [], [], []\n\nAudio Codec ...................................: 0x0055 MPEG-1 Layer 3\nSample Rate ...................................: 48000 Hz\nAudio Bitrate ...................................: 128 kb/s [2 channel(s)] CBR\nNo. of audio streams .......................: 1\n\n\n\n----***----\n\n\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE","torrent":{"xt":"urn:btih:0ae60d532270ba365f2bc81ab3ed0ea6fc664da3","amp;dn":"Guy+Maddin+-+Cowards+Bend+the+Knees","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ae60d532270ba365f2bc81ab3ed0ea6fc664da3","infoHashBuffer":{"type":"Buffer","data":[10,230,13,83,34,112,186,54,95,43,200,26,179,237,14,166,252,102,77,163]},"announce":[],"urlList":[]}}