{"title":"Low Pressure by Sandra Brown","uid":7632065,"size":1081931,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b110e9f1b098094b1bd29c34a267a09de56389c&amp;dn=Low+Pressure+by+Sandra+Brown&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"azizex666","files":-1,"time":1347559382,"description":"Bellamy Lyston was only 12 years old when her older sister Susan was killed on a stormy Memorial Day. Bellamy's fear of storms is a legacy of the tornado that destroyed the crime scene along with her memory of what really happened during the day's most devastating moments.\n\nNow, 18 years later, Bellamy has written a sensational, bestselling novel based on Susan's murder. Because the book was inspired by the tragic event that still pains her family, she published it under a pseudonym to protect them from unwanted publicity. But when an opportunistic reporter for a tabloid newspaper discovers that the book is based on fact, Bellamy's identity is exposed along with the family scandal.\n\nMoreover, Bellamy becomes the target of an unnamed assailant who either wants the truth about Susan's murder to remain unknown or, even more threatening, is determined to get vengeance for a man wrongfully accused and punished.\n\nIn order to identify her stalker, Bellamy must confront the ghosts of her past, including Dent Carter, Susan's wayward and reckless boyfriend -- and an original suspect in the murder case. Dent, with this and other stains on his past, is intent on clearing his name, and he needs Bellamy's sealed memory to do it. But her safeguarded recollections -once unlocked-pose dangers that neither could foresee and puts both their lives in peril.\n\n\n                             Format 1 - .ePUB\n\n                             Format 2 - .Mobi\n\n\n           **Support Your Favorite Authors By Buying Their Books**\n\n             Check out all my Magazine and ebook uploads here.\n\n                &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;","torrent":{"xt":"urn:btih:0b110e9f1b098094b1bd29c34a267a09de56389c","amp;dn":"Low+Pressure+by+Sandra+Brown","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b110e9f1b098094b1bd29c34a267a09de56389c","infoHashBuffer":{"type":"Buffer","data":[11,17,14,159,27,9,128,148,177,189,41,195,74,38,122,9,222,86,56,156]},"announce":[],"urlList":[]}}