{"title":"The Women's Encyclopedia of Myths and Secrets by Barbara Walker","uid":8543498,"size":68203309,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b48bbb225999e47e4d91b96e9bdb11cb044df97&amp;dn=The+Women%27s+Encyclopedia+of+Myths+and+Secrets+by+Barbara+Walker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"kundalini666","files":1,"time":1370458212,"description":"Do You Know...\n\n    where the legend of a cat's nine lives comes from?\n\n    why &quot;mama&quot; is a word understood in nearly all languages?\n\n    how the custom of kissing began?\n\n    whether there really was a female pope?\n\n    why Cinderella's glass slipper was so important to the Prince? \n\nThe answers to these and countless other intriguing questions are given in this compulsively readable, feminist encyclopedia. Twenty-five years in preparation, this unique, comprehensive sourcebook focuses on mythology anthropology, religion, and sexuality to uncover precisely what other encyclopedias leave out or misrepresent. The Woman's Encyclopedia presents the fascinating stories behind word origins, legends, superstitions, and customs. A browser's delight and an indispensable resource, it offers 1,350 entries on magic, witchcraft, fairies, elves, giants, goddesses, gods, and psychological anomalies such as demonic possession; the mystical meanings of sun, moon, earth, sea, time, and space; ideas of the soul, reincarnation, creation and doomsday; ancient and modern attitudes toward sex, prostitution, romance, rape, warfare, death and sin, and more.\n\nTracing these concepts to their prepatriarchal origins, Barbara G. Walker explores a &quot;thousand hidden pockets of history and custom in addition to the valuable material recovered by archaeologists, orientalists, and other scholars.&quot;\n\nNot only a compendium of fascinating lore and scholarship, The Woman's Encyclopedia is a revolutionary book that offers a rare opportunity for both women and men to see our cultural heritage in a fresh light, and draw upon the past for a more humane future.","torrent":{"xt":"urn:btih:0b48bbb225999e47e4d91b96e9bdb11cb044df97","amp;dn":"The+Women%27s+Encyclopedia+of+Myths+and+Secrets+by+Barbara+Walker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b48bbb225999e47e4d91b96e9bdb11cb044df97","infoHashBuffer":{"type":"Buffer","data":[11,72,187,178,37,153,158,71,228,217,27,150,233,189,177,28,176,68,223,151]},"announce":[],"urlList":[]}}