{"title":"Chocolate and Health - R. Paoletti, et. al., (Springer, 2012)","uid":10413060,"size":1499425,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b5685736bbe13177397ba82492f42431196fbe3&amp;dn=Chocolate+and+Health+-+R.+Paoletti%2C+et.+al.%2C+%28Springer%2C+2012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"nosnavis","files":1,"time":1403563254,"description":"Chocolate and Health\n\nRodolfo Paoletti, Andrea Poli, Ario Conti, Francesco Visioli (Editors) \nPublication Date: November 15, 2011\nPDF\n\n\n\n\nCocoa and chocolate are the subjects of much research in the fields of food chemistry, food technology, and health science. We now know that cocoa contains a remarkable number of bioactive compounds, and these are being tested in humans to verify their disease prevention characteristics.\n\nThis state of the art text thoroughly explores the different aspects of the relationship between chocolate and health. After introductory discussion of the historical background, careful attention is devoted to technological developments designed to improve the health-giving qualities of chocolate and biochemical and clinical trials of cocoa and its components. Various health impacts of cocoa and chocolate are thoroughly evaluated, including acute vascular effects and effects on blood pressure, blood lipids, and platelets. Psychological drivers of chocolate consumption and craving are also considered.\n\nReaders will find this book to be a rich source of essential information on cocoa and chocolate, their purported health-giving qualities, and the advances that are being made in this area.\n","torrent":{"xt":"urn:btih:0b5685736bbe13177397ba82492f42431196fbe3","amp;dn":"Chocolate+and+Health+-+R.+Paoletti%2C+et.+al.%2C+%28Springer%2C+2012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b5685736bbe13177397ba82492f42431196fbe3","infoHashBuffer":{"type":"Buffer","data":[11,86,133,115,107,190,19,23,115,151,186,130,73,47,66,67,17,150,251,227]},"announce":[],"urlList":[]}}