{"title":"Springer Service Level Agreements for Cloud Computing 2012","uid":7622419,"size":12321975,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b98cb79caee4622c8fd883cfbbb7561c18c298e&amp;dn=Springer+Service+Level+Agreements+for+Cloud+Computing+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"renatosistema","files":-1,"time":1347361616,"description":"\nService Level Agreements for Cloud Computing provides a unique combination of business-driven application scenarios and advanced research in the area of service-level agreements for Clouds and service-oriented infrastructures. Current state-of-the-art research findings are presented in this book, as well as business-ready solutions applicable to Cloud infrastructures or ERP (Enterprise Resource Planning) environments. Service Level Agreements for Cloud Computing contributes to the various levels of service-level management from the infrastructure over the software to the business layer, including horizontal aspects like service monitoring. This book provides readers with essential information on how to deploy and manage Cloud infrastructures. Case studies are presented at the end of most chapters. Service Level Agreements for Cloud Computing is designed as a reference book for high-end practitioners working in cloud computing, distributed systems and IT services. Advanced-level students focused on computer science will also find this book valuable as a secondary text book or reference. ","torrent":{"xt":"urn:btih:0b98cb79caee4622c8fd883cfbbb7561c18c298e","amp;dn":"Springer+Service+Level+Agreements+for+Cloud+Computing+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b98cb79caee4622c8fd883cfbbb7561c18c298e","infoHashBuffer":{"type":"Buffer","data":[11,152,203,121,202,238,70,34,200,253,136,60,251,187,117,97,193,140,41,142]},"announce":[],"urlList":[]}}