{"title":"The Motion of Puppets - Keith Donohue [EN EPUB MOBI] [ebook] [p_","uid":15970491,"size":2173725,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0c248efa64099f9e71d7f0f3b2c2a640138f6107&amp;dn=The+Motion+of+Puppets+-+Keith+Donohue+%5BEN+EPUB+MOBI%5D+%5Bebook%5D+%5Bp_&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"perfect_stan","files":3,"time":1475774418,"description":"The Motion of Puppets by Keith Donohue\r\nEnglish | 2016 | Fantasy &amp; Mystery | 2 MB\r\n\r\n\r\nFrom the bestselling author of The Boy Who Drew Monsters and The Stolen Child comes a modern take on the Orpheus and Eurydice myth—a suspenseful tale of romance and enchantment\r\nIn the Old City of Québec, Kay Harper falls in love with a puppet in the window of the Quatre Mains, a toy shop that is never open. She is spending her summer working as an acrobat with the cirque while her husband, Theo, is translating a biography of the pioneering photographer Eadweard Muybridge. Late one night, Kay fears someone is following her home. Surprised to see that the lights of the toy shop are on and the door is open, she takes shelter inside.\r\nThe next morning Theo wakes up to discover his wife is missing. Under police suspicion and frantic at her disappearance, he obsessively searches the streets of the Old City. Meanwhile, Kay has been transformed into a puppet, and is now a prisoner of the back room of the Quatre Mains, trapped with an odd assemblage of puppets from all over the world who can only come alive between the hours of midnight and dawn. The only way she can return to the human world is if Theo can find her and recognize her in her new form. So begins a dual odyssey: of a husband determined to findhis wife, and of a woman trapped in a magical world where her life is not her own.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:0c248efa64099f9e71d7f0f3b2c2a640138f6107","amp;dn":"The+Motion+of+Puppets+-+Keith+Donohue+%5BEN+EPUB+MOBI%5D+%5Bebook%5D+%5Bp_","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c248efa64099f9e71d7f0f3b2c2a640138f6107","infoHashBuffer":{"type":"Buffer","data":[12,36,142,250,100,9,159,158,113,215,240,243,178,194,166,64,19,143,97,7]},"announce":[],"urlList":[]}}