{"title":"Raoul Ruiz - Hypothesis of the Stolen Painting (1979)","uid":3870897,"size":733203824,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0c587ae416476d53da86e6db3faff8aec167b14c&amp;dn=Raoul+Ruiz+-+Hypothesis+of+the+Stolen+Painting+%281979%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clownmonkey","files":5,"time":1194086839,"description":"An off-camera narrator is invited at the request of an unnamed art collector (Jean Rougeul) to study a series of seemingly innocuous paintings for which impeccably constructed tableaux vivants (a theatrical performance art that literally translates as &amp;#039;living pictures&amp;#039; consisting of formally staged re-enacted images using live, statuesque actors) by an unremarkable nineteenth century artist named Frederic Tonnerre had once caused the artist to run afoul with French authorities. As the narrator critically surveys the six stylistically and thematically dissimilar paintings in search of potentially controversial characteristics that may have led to the exhibition&amp;#039;s notorious reception and premature closure (and to Tonnerre&amp;#039;s subsequent prosecution), the collector repeatedly interrupts the narrator&amp;#039;s train of thought by tersely, yet adamantly proposing that there are, in fact, seven paintings involved in the ill-fated exhibition. The collector then presents his elaborate case for the existence of the unseen, &amp;#039;stolen&amp;#039; painting using Tonnerre&amp;#039;s similar media of artwork and tableaux vivants, as well as a salacious period novel to prove his own hypothesis, and examining several subtle, cursory details illustrated in the six extant paintings. Mapping an allusive (and invariably complex) trajectory through the unusual artistic embellishments within each painting, the collector contends that the curious details, in fact, provide visually associative cues that link the artworks together and point towards a sinister convergence - the depiction of various stages of a clandestine ceremony - a fragmentary window to a medieval ceremonial puzzle that has been deliberately left incomplete and indecipherable with the absence of serially critical missing link: the undefined (and indefinable) fourth painting.\n\nInspired by the idiosyncratic personality of author, theorist, and artist Pierre Klossowski whose densely cerebral erotic fiction was influenced by such notorious literary figures as the Marquis de Sade and the excommunicated surrealist Georges Bataille, as well as Klossowski&amp;#039;s final novel La Baphomet, The Hypothesis of the Stolen Painting is an indelibly haunting, endlessly fascinating, and maddeningly abstruse composition on Pirandellian ambiguity and the inherent subjectivity of perspective. Raoul Ruiz&amp;#039;s ingenious use of baroque, compositional tableaux vivants that intrinsically meld static art and corporeal physicality creates a blurred delineation between reality and fiction that, in turn, conflates the multi-layered existential relativity between subject and viewer, operating as both an aesthetic evaluation of the paintings and as a psychological portrait of the eccentric logic behind the conspiracy-obsessed collector. (Note a similar narrative permutation in Ruiz&amp;#039;s surreal whimsical fable, Love Torn in Dream.) Ruiz further fuses art and reality by visually creating an equally ominous atmosphere from the perspective of the collector (his perception of the existence of the covert medieval fraternity of the Order of the Knights Templar that was denounced during the Inquisition for charges of occultism and demonology) and the audience (the cognitive aberration implicit in the collector&amp;#039;s knowledgeable and articulate, but monomaniacal hypothesis) that is also manifested through the exquisitely formalized chiaroscuro lighting of both the collector&amp;#039;s residence and the tableaux vivants. Ostensibly presented through the conventional narrative framework of a complexly interwoven mystery, the film evolves into a sublime and intricate exposition on the reflexivity between art and life, the indefinable essence of artistic creativity, and the inexactness of personal interpretation.\n\nÂ© Acquarello 2003. All rights reserved. &lt;a href=&quot;\nhttp://www.filmref.com/directors/dirpages/ruiz.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.filmref.com/directors/dirpages/ruiz.html&lt;/a&gt;\n\nMy rip! \n\nFile Name:                                      hypothesis of the stolen painting.avi                     \nFile Size (in bytes):                           733,147,136                     \n                                                                                \n--- Container Information ---                                                   \nBase Type (e.g &quot;AVI&quot;):                          AVI(.AVI)                 \nSubtype (e.g &quot;OpenDML&quot;):                        OpenDML (AVI v2.0),                   \nInterleave (in ms):                             33          \nPreload (in ms):                                504       \nAudio alignment(&quot;split across interleaves&quot;):    Aligned         \nTotal System Bitrate (kbps):                    0            \nBytes Missing (if any):                         0            \nNumber of Audio Streams:                        1       \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Type(e.g. &quot;DIV3&quot;):                  XVID              \nVideo Codec Name(e.g. &quot;DivX 3, Low-Motion&quot;):    XviD 1.1.2 Final                   \nDuration (hh:mm:ss):                            1:03:05                \nFrame Count:                                    113415             \nFrame Width (pixels):                           720                  \nFrame Height (pixels):                          544                  \nStorage Aspect Ratio(&quot;SAR&quot;)&quot;                    1.324                     \nPixel Aspect Ratio (&quot;PAR&quot;):                     1.000                     \nDisplay Aspect Ratio (&quot;DAR&quot;):                   1.324                     \nFields Per Second:                                        \nFrames Per Second:                              29.970          \nPics Per Second:                                29.970            \nVideo Bitrate (kbps):                           1431                 \nMPEG-4 (&quot;MPEG-4&quot; or &quot;&quot;):                        MPEG-4                   \nB-VOP (&quot;B-VOP&quot; or &quot;&quot;):                          B-VOP   \nQuality Factor (bits/pixel)/frame:              0.122&quot;                     \n                                                                                \n--- Audio Information ---                                                            \nAudio Codec (e.g. &quot;AC3&quot;):                       0x0055 MPEG-1 Layer 3                   \nAudio Sample Rate (Hz):                         48000             \nAudio Bitrate(kbps):                            104                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):            VBR            \nAudio Channel Count (e.g. &quot;2&quot; for stereo):      2           \n\n************************* FREAKYFLICKS **************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art to the\nwidest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039; ","torrent":{"xt":"urn:btih:0c587ae416476d53da86e6db3faff8aec167b14c","amp;dn":"Raoul+Ruiz+-+Hypothesis+of+the+Stolen+Painting+%281979%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c587ae416476d53da86e6db3faff8aec167b14c","infoHashBuffer":{"type":"Buffer","data":[12,88,122,228,22,71,109,83,218,134,230,219,63,175,248,174,193,103,177,76]},"announce":[],"urlList":[]}}