{"title":"Frank Zappa - Zoot Allures TQMP","uid":5105638,"size":300906664,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0c6ce7e872676f41e531c0cda9581b7eef2a8b65&amp;dn=Frank+Zappa+-+Zoot+Allures+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"zootallure","files":21,"time":1254341812,"description":"Zoot Allures, released in October 1976, is mostly a studio album (there are some basic live tracks, as in the title track and &quot;Black Napkins&quot;) featuring a revolving cast of musicians who, oddly, do not correspond to the ones pictured on the album cover (for instance, Patrick O'Hearn and Eddie Jobson did not contribute). Compared to previous releases like One Size Fits All, Roxy &amp; Elsewhere, or even Over-Nite Sensation, and to upcoming ones such as Zappa in New York, Studio Tan, or Sheik Yerbouti, Zoot Allures sounds very stripped down to bare essentials. Zappa focused on limited instrumentation, lots of bass, and whispered vocals to create a masterpiece of dark, slow, sleazy rock. Except for the opening and closing numbers (&quot;Wind Up Workin' in a Gas Station&quot; and &quot;Disco Boy&quot;), all the material is slow to medium tempo with Zappa delivering the closest he'll ever get to a crooner vocal performance. &quot;The Torture Never Stops&quot; is the highlight, ten minutes of suggestive lyrics, crawling riffs, searing solos, and female screams of pain. That song and &quot;Disco Boy&quot; became classic tracks; &quot;Black Napkins&quot; and &quot;Zoot Allures&quot; rate among the man's best guitar solos. Historical note: The album was first devised as a two-LP set and would have included &quot;Sleep Dirt,&quot; &quot;Filthy Habits,&quot; and &quot;The Ocean Is the Ultimate Solution,&quot; which all also fit the mood. Although humor has not been completely evacuated, Zoot Allures comes through as a much more serious rock record. Yet, it is more than a transitional album; it represents one of Zappa's strongest accomplishments.\n\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:       &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:0c6ce7e872676f41e531c0cda9581b7eef2a8b65","amp;dn":"Frank+Zappa+-+Zoot+Allures+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c6ce7e872676f41e531c0cda9581b7eef2a8b65","infoHashBuffer":{"type":"Buffer","data":[12,108,231,232,114,103,111,65,229,49,192,205,169,88,27,126,239,42,139,101]},"announce":[],"urlList":[]}}