{"title":"Stop The Next War Now - Arundhati Roy, Alice Walker, Medea Benja","uid":8881907,"size":3522013,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0c7d26b363b9b98a425f07c16f5b89d8d469626d&amp;dn=Stop+The+Next+War+Now+-+Arundhati+Roy%2C+Alice+Walker%2C+Medea+Benja&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1378347963,"description":"How can we humanize each other and act as responsible global citizens? What are appropriate and effective responses to terrorism? How should media figures report on terrorism and war? How should elected officials respond? What can ordinary citizens do?\n\nHow to Stop the Next War Now, edited by renowned CODEPINK peace activists Medea Benjamin and Jodie Evans, shares expert insight on the issues and powers-that-be that can lead us to war---including the media, our elected politicians, global militarization, and the pending scarcity of national resources. It aims to educate and reflect on the effectiveness of peace movement activities and offers hope, through shared ideas, action steps, and checklists to transition from a culture of violence to a culture of peace.\n\nFull of practical, proven suggestions to promote education, awareness, activism, and political change, drawn from experts from every walk of life who have passionately devoted their lives to peace. Contributors include elected officials, media personalities and reporters, public intellectuals, and ordinary citizens, all who are eager to find the most appropriate and effective responses to terrorism (other than bombing the hell out of third-world countries). Includes short essays, interviews, poems, illustrations, Q&amp;As, action tips, and more.","torrent":{"xt":"urn:btih:0c7d26b363b9b98a425f07c16f5b89d8d469626d","amp;dn":"Stop+The+Next+War+Now+-+Arundhati+Roy%2C+Alice+Walker%2C+Medea+Benja","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c7d26b363b9b98a425f07c16f5b89d8d469626d","infoHashBuffer":{"type":"Buffer","data":[12,125,38,179,99,185,185,138,66,95,7,193,111,91,137,216,212,105,98,109]},"announce":[],"urlList":[]}}