{"title":"The Man in the Rockefeller Suit- The Astonishing Rise and Specta","uid":11580165,"size":11376238,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0cbbc1af459bf5dc693162bce6a55ec22ec5f3a0&amp;dn=The+Man+in+the+Rockefeller+Suit-+The+Astonishing+Rise+and+Specta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1417116724,"description":"A real-life Talented Mr. Ripley, the unbelievable thirty-year run of a shape-shifting con man.\n\nThe story of Clark Rockefeller is a stranger-than-fiction twist on the classic American success story of the self-made man-because Clark Rockefeller was totally made up. The career con man who convincingly passed himself off as Rockefeller was born in a small village in Germany. At seventeen, obsessed with getting to America, he flew into the country on dubious student visa documents and his journey of deception began.\n\nOver the next thirty years, boldly assuming a series of false identities, he moved up the social ladder through exclusive enclaves on both coasts-culminating in a stunning twelve-year marriage to a rising star businesswoman with a Harvard MBA who believed she'd wed a Rockefeller.\n\nThe imposter charmed his way into exclusive clubs and financial institutions-working on Wall Street, showing off an extraordinary art collection-until his marriage ended and he was arrested for kidnapping his daughter, which exposed his past of astounding deceptions as well as a connection to the bizarre disappearance of a California couple in the mid-1980s.\n\nThe story of The Man in the Rockefeller Suit is a probing and cinematic exploration of an audacious imposer-and a man determined to live the American dream by any means necessary","torrent":{"xt":"urn:btih:0cbbc1af459bf5dc693162bce6a55ec22ec5f3a0","amp;dn":"The+Man+in+the+Rockefeller+Suit-+The+Astonishing+Rise+and+Specta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cbbc1af459bf5dc693162bce6a55ec22ec5f3a0","infoHashBuffer":{"type":"Buffer","data":[12,187,193,175,69,155,245,220,105,49,98,188,230,165,94,194,46,197,243,160]},"announce":[],"urlList":[]}}