{"title":"La Luz - It's Alive [2013][EAC/FLAC]","uid":10473700,"size":238783926,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0cc02b778ad29a7c919db167abb9320a7eceaacd&amp;dn=La+Luz+-+It%27s+Alive+%5B2013%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":-1,"time":1404296646,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Hardly Art / HAR-076\nCountry: USA\nYear: October 15, 2013\nGenre: pop/Rock\nFormat: CD, Album,\n\n[b]\n\n01. Sure As Spring\n02. All the Time\n03. Morning High\n04. What Good Am I?\n05. Sunstroke\n06. It's Alive\n07. Big Big Blood\n08. Call Me in the Day\n09. Pink Slime\n10. Phantom Feelings\n11. You Can Never Know\n\n\n\nAfter years of hearing people describe indie rock and pop bands who drench their sound in reverb as &quot;surf,&quot; it's refreshing to hear an indie pop band who actually plays surf music. The landlocked Seattle quartet La Luz certainly have spent their time with the works of Dick Dale and the Ventures, and it shows on their debut album It's Alive. Surf aficionados will thrill to guitarist Shana Cleveland's sparkling, shoot-the-curl lead lines, and the twangy glee with which the band attacks the uptempo tracks like &quot;Sure as Spring&quot; or &quot;Pink Slime.&quot; Fans of moodier fare will be glad that the group doesn't ignore the dark side of the beach and there are a number of softly sad ballads that feel as if they were filtered through grainy Super 8 film (&quot;What Good Am I&quot;) and spooky instrumentals that could have been lifted from the soundtrack of Teen Beach Bunnies vs. Dracula (&quot;Phantom Feelings&quot;). Add in a couple sandy girl group tracks that sound like the Shangri La's on a bummer summer vacation (&quot;Call Me in the Day,&quot; &quot;All the Time&quot;) and you've got an album that's very firmly retro but played with enough energy and style to make it fully modern as well. Cleveland's guitar work is definitely the main draw, but the organ skills of Alice Sandahl are impressive and both Cleveland's aching lead vocals and the group's harmonies are wonderfully pretty and sweet. Johnny Goss' stylish production is also pretty great too; he manages to make lo-fi sound hi-fi without losing any of the raw power and gritty soul an album like this needs to keep from sounding like an exercise in studied nostalgia. Instead, it's a living document of the good that can come from loving a sound and an era, filtering it through a modern sensibility, then playing and singing the hell out of it. It's Alive is a debut that should appeal to both lovers of old-school surf pop and anyone who's into the modern &quot;surf&quot; noise-pop style, but always wanted more waves and less whine.","torrent":{"xt":"urn:btih:0cc02b778ad29a7c919db167abb9320a7eceaacd","amp;dn":"La+Luz+-+It%27s+Alive+%5B2013%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cc02b778ad29a7c919db167abb9320a7eceaacd","infoHashBuffer":{"type":"Buffer","data":[12,192,43,119,138,210,154,124,145,157,177,103,171,185,50,10,126,206,170,205]},"announce":[],"urlList":[]}}