{"title":"Sam The Sham &amp; The Pharaohs  101 Songs 1963-1968","uid":4814854,"size":576929154,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0cc77e69eef9490a5010d75f14db7b8a3902851a&amp;dn=Sam+The+Sham+%26+The+Pharaohs++101+Songs+1963-1968&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"tamroi","files":114,"time":1238507282,"description":"Best known for their 1965 smash &quot;Wooly Bully,&quot; which helped introduce Tex-Mex rhythms to mainstream rock &amp; roll, Sam the Sham and the Pharaohs were formed in Dallas by lead singer Domingo Samudio, who took the name Sam the Sham from a joke about his inability as a vocalist. The Pharaohs consisted of guitarist Ray Stinnet, bassist David Martin, saxophonist Butch Gibson, and drummer Jerry Patterson. Before hitting it big with &quot;Wooly Bully,&quot; a song about Samudio's cat, the band recorded the independent single &quot;Haunted House,&quot; which helped them get a deal with MGM. Following &quot;Wooly Bully,&quot; the group recorded a series of largely novelty singles, but only &quot;Li'l Red Riding Hood&quot; approached the success of its predecessor. Frustrated at being perceived as a talentless novelty act, Samudio broke up the Pharaohs in 1967 and recorded as the Sam the Sham Revue, and adopted the name Sam Domingo in 1970. His lone solo LP, Sam, Hard and Heavy, featured slide guitarist Duane Allman, but failed to establish him as a major talent. Samudio contributed two songs to the 1982 film The Border and later moved to Memphis and became a street preacher. &quot;Wooly Bully,&quot; of course, remains a bar band staple. --AMG\n","torrent":{"xt":"urn:btih:0cc77e69eef9490a5010d75f14db7b8a3902851a","amp;dn":"Sam+The+Sham+%26+The+Pharaohs++101+Songs+1963-1968","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cc77e69eef9490a5010d75f14db7b8a3902851a","infoHashBuffer":{"type":"Buffer","data":[12,199,126,105,238,249,73,10,80,16,215,95,20,219,123,138,57,2,133,26]},"announce":[],"urlList":[]}}