{"title":"The Unpredictable Species: What Makes Humans Unique (2013)","uid":9641738,"size":2333469,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d6539527185a7f7b07e22100129e3545ce6f375&amp;dn=The+Unpredictable+Species%3A+What+Makes+Humans+Unique+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bookzilla","files":1,"time":1392935905,"description":"epub\n\n\nThe Unpredictable Species argues that the human brain evolved in a way that enhances our cognitive flexibility and capacity for innovation and imitation. In doing so, the book challenges the central claim of evolutionary psychology that we are locked into predictable patterns of behavior that were fixed by genes, and refutes the claim that language is innate. Philip Lieberman builds his case with evidence from neuroscience, genetics, and physical anthropology, showing how our basal ganglia--structures deep within the brain whose origins predate the dinosaurs--came to play a key role in human creativity. He demonstrates how the transfer of information in these structures was enhanced by genetic mutation and evolution, giving rise to supercharged neural circuits linking activity in different parts of the brain. Human invention, expressed in different epochs and locales in the form of stone tools, digital computers, new art forms, complex civilizations--even the latest fashions--stems from these supercharged circuits.\n\n The Unpredictable Species boldly upends scientifically controversial yet popular beliefs about how our brains actually work. Along the way, this compelling book provides insights into a host of topics related to human cognition, including associative learning, epigenetics, the skills required to be a samurai, and the causes of cognitive confusion on Mount Everest and of Parkinson's disease.","torrent":{"xt":"urn:btih:0d6539527185a7f7b07e22100129e3545ce6f375","amp;dn":"The+Unpredictable+Species%3A+What+Makes+Humans+Unique+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d6539527185a7f7b07e22100129e3545ce6f375","infoHashBuffer":{"type":"Buffer","data":[13,101,57,82,113,133,167,247,176,126,34,16,1,41,227,84,92,230,243,117]},"announce":[],"urlList":[]}}