{"title":"Bible Believer's Archaeology, Volume 1-3 - John Argubright","uid":11773386,"size":5878996,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e0c580443adc776e513e71422e9439a8111860f&amp;dn=Bible+Believer%27s+Archaeology%2C+Volume+1-3+-+John+Argubright&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":3,"time":1427166204,"description":"\nVolume 1: Behold the historical evidence that proves the Bible. Chapters cover Jesus, John the Baptist, Herod, Moses, Joshua, King David, the prophet Balaam, King Hezekiah, Jeremiah the prophet and many more. Filled with illustrations of biblical archaeology artifacts, inscriptions and quotes from early historians.\n\nVolume 2: Seeking Truth? One of the first questions people have is, &quot;Can I really trust the Bible? This book answers the question with proofs compiled from ancient history and archaeology revealing it's accuracy. Evidences for Pontius Pilate, Tiberius Caesar, Quirinius, Sergius Paulus, King Herod, the high priest Annas, The Flood, The Tower of Babel, The Ark of the Covenant, the prophet Jeremiah's enemy, King Cyrus, King Jehu, King Uzziah, Manasseh, King Ahaz and many others.\n\nVolume 3: Ever hear people say that the Bible is just a bunch of made up stories? This book proves otherwise. Evidences compiled from ancient history and archeology reveal the accuracy of the Bible. Evidences for Queen Esther, Mordecai, Agrippa and his sister Bernice, Sergius Paulus, the Plague of Boils on Egypt, the Exodus, the Hebrews, King Joash, King Menahem, Josiah's battle with Necho, Tirhakah king of Ethiopia, the men who tried to kill Jeremiah the prophet, and many others.\n\n\nAbout the author:\nJohn Argubright is a researcher and author of the three volume series &quot;Bible Believer's Archaeology.&quot; He lives in La Salle, Illinois","torrent":{"xt":"urn:btih:0e0c580443adc776e513e71422e9439a8111860f","amp;dn":"Bible+Believer%27s+Archaeology%2C+Volume+1-3+-+John+Argubright","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e0c580443adc776e513e71422e9439a8111860f","infoHashBuffer":{"type":"Buffer","data":[14,12,88,4,67,173,199,118,229,19,231,20,34,233,67,154,129,17,134,15]},"announce":[],"urlList":[]}}