{"title":"Christianity And Islam (DivX)","uid":6502367,"size":1622354090,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1039b4bb40373d2765d02268dcc7fa00563f640d&amp;dn=Christianity+And+Islam+%28DivX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"JustPirateBay2011","files":-1,"time":1309292676,"description":"Christianity And Islam (DivX)\n\nBased on the best-selling book, IS THE FATHER OF JESUS THE GOD OF MUHAMMAD? by Dr. Timothy George.\nWords unfamiliar to most Americans are now heard daily on the evening news: jihad, Islam, Allah, Quran, fatwa, imam, ummah, Ramadan. Today, there are approximately seven million Muslims, and more than 13,000 mosques in North America. Now that Muslims are our neighbors, how do we talk to them about Christ? What do Muslims think about Jesus? Which beliefs do we share in common with Muslims and where do we differ from them? Do we worship the same God they worship? Is the Father of Jesus the God of Muhammad?\n\nNoted theologian, best-selling author, editor, and Dean of Beeson Divinity School at Samford University, Dr. Timothy George, teams with T N Mohan, producer-director of the award winning films, Hanged on a Twisted Cross, Here I Stand, For One English Officer, to answer these and other in this visually rich four-part TV series. Dr. George is dean of Beeson Divinity School of Samford University and an executive editor of Christianity Today.\n\nThe series avoids the angry condemnation of all Muslims on the one hand, or a compromising of Christian truth-claims on the other. Muslim views are stated fairly and objectively from Muslim scholars who appear in the series. The programs set forth basic and foundational differences between Christianity and Islam and the implications for how we understand God, Christ, and the meaning of salvation.\n\nFour 25-minute programs\n\n1. The Tenets of Islam\n2. The Trinity\n3. The Bible and the Incarnation\n4. The Cross and Salvation\n\n32-page study guide included ","torrent":{"xt":"urn:btih:1039b4bb40373d2765d02268dcc7fa00563f640d","amp;dn":"Christianity+And+Islam+%28DivX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1039b4bb40373d2765d02268dcc7fa00563f640d","infoHashBuffer":{"type":"Buffer","data":[16,57,180,187,64,55,61,39,101,208,34,104,220,199,250,0,86,63,100,13]},"announce":[],"urlList":[]}}