{"title":"Chocolat (2000) H.264 720p (moviesbyrizzo) French audio + subs","uid":6994674,"size":922697415,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:10dd53ce6987ad7f50e390b906bc614116cdd2ca&amp;dn=Chocolat+%282000%29+H.264+720p+%28moviesbyrizzo%29+French+audio+%2B+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1327831739,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0241303/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0241303/&lt;/a&gt;\n\nWe downloaded this movie as an 720p mp4 as we only have a 480p ENG-FRE DVD\nof it here We chose a smaller sized torrent as it boasts great quality\nvideo (considering the small file size). With some movies you can get away with it \nespecially if the movie is not too long, and if it was produced in nicer quality\non the disc from which to make share-able versions with, and nicely converted.\n\nWhen a movie is set in France, it should be in French I believe, likewise in German or Italian too on the same basis. I believe all peoples of Europe should all be fluent in English - one and all - as a common bridge for communication with equal understanding of true merit - that said - I don't believe that anyone should ever give up on French German or Italian dutch etc as their second language or primary language for now - as there is wisdom in these cultures too that doesn't exist on the planet otherwise.\n\nWe therefore chose to swap out the 128k English only audio track the movie\ncame with on the download - with a French audio track instead - taken from\nthe DVD at 224k The great video is 1280 X 720 even at only 786k bitrate\n\nIt took only a few moments to do. We demuxed the mp4 to extract the h.264 video   in 60 seconds flat. We then remuxed the video along with the french audio track using mkvmerge - took about one minute. We could I suppose have used tsmuxer instead as it creates true-bluray format files for all bluray players using\nh.264 video as it is the standard for use with the bluray format container\nWe added in English subtitles during this process.\n\nWe first tried converting to DivX HD however the source file bitrate was below\nthe minimum the converter was willing to make use of. We didn't want to\nsuperficially up-convert without just cause - the quality would have been only degraded instead. We tried to produce an XviD HD however once again we got poor\nquality results from the small file and Xilisoft converter. So remuxing as\nindicated was the solution we used for expediency.\n\nThis movie is a nice movie for the beautiful children of France that\nare seen in it and we bring it to you for that reason alone - as sufficient\nin any event.\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n","torrent":{"xt":"urn:btih:10dd53ce6987ad7f50e390b906bc614116cdd2ca","amp;dn":"Chocolat+%282000%29+H.264+720p+%28moviesbyrizzo%29+French+audio+%2B+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10dd53ce6987ad7f50e390b906bc614116cdd2ca","infoHashBuffer":{"type":"Buffer","data":[16,221,83,206,105,135,173,127,80,227,144,185,6,188,97,65,22,205,210,202]},"announce":[],"urlList":[]}}