{"title":"Stryper - Live at the Whisky  mp3  (2014)","uid":11157251,"size":181325379,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:10fa99a86caefac94b7b3f99ed60ec550ed43ec5&amp;dn=Stryper+-+Live+at+the+Whisky++mp3++%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"analogkid6103","files":17,"time":1412451925,"description":"\n\nHeavy metal has been associated with ol' Beelzebub ever since its inception, but a few acts took the opposite route and put their Christian beliefs in hard rocking songs, such as Stryper. Formed in Orange County, California, in 1983, the group was originally known as Roxx Regime, and consisted of singer/guitarist/main songwriter Michael Sweet, drummer Robert Sweet, lead guitarist Oz Fox, and bassist Timothy Gaines. It wasn't until the group changed its name to Stryper (which stood for &quot;Salvation Through Redemption Yielding Peace, Encouragement, and Righteousness&quot; that things really began taking off for the quartet. Specializing in the melodic Van Halen/Def Leppard style (with heart-wrenching power ballads tossed in), dressed in all black-and-yellow outfits, and spreading their religious message even further by tossing bibles out into the crowd at their shows, Stryper were signed by the Enigma label in 1984. The same year, the group's debut recording, a six-track mini-album titled The Yellow &amp; Black Attack, was issued.\n\n\n\nThe album created a buzz for the group among metalheads, which was only heightened with the release of the band's first full-length album, 1985's Soldiers Under Command. The first Stryper release to crack the Billboard charts, its success led to the re-release of The Yellow &amp; Black Attack (which included an extra two tracks and new artwork) in 1986. Later the same year, Stryper issued their sophomore full-length, To Hell with the Devil, which many consider to be the group's finest hour. Turning out to be the highest-charting album of their career (barely missing the Top 30), the platinum-certified album benefited by MTV's repeated airings of the videos for &quot;Calling on You&quot; and the syrupy ballad &quot;Honestly&quot; (the latter of which peaked at number 23 on the U.S. singles charts). Despite possessing a different message than their peers, by this point Stryper fit in perfectly with the other popular pop/hair metal bands of the day (Bon Jovi, White Lion, Dokken, etc.).\nYet just as it appeared that Stryper could possibly break through on a massive scale, such new metal styles as thrash (Metallica) and more stripped-down rock (Guns N' Roses) began to usurp Stryper's pop-metal audience. As a result, Stryper's next release, 1988's In God We Trust, failed to expand their following, nor did it live up to promise of its predecessor (although it did manage to earn gold certification). Sensing this, the group adopted a harder-edged sound and look for 1990's Against the Law, and even covered the Earth, Wind &amp; Fire funk classic &quot;Shining Star.&quot; Neither managed to cross over to the top of the charts. A greatest-hits set, Can't Stop the Rock, followed in 1991, but with Nirvana just about to ring the death knell for pop-metal bands, Michael Sweet decided to leave the group for a solo career. Surprisingly, the remaining members of Stryper opted to carry on as a three-piece (with Fox handling lead vocal duties), and continued to tour for a spell. The Michael Sweet-less version didn't last long however, as Stryper officially called it quits in 1992.\n\n\n\n\n\nIn the wake of the band's split, its members remained busy. Michael Sweet's solo career never scaled the same heights as Stryper's, although solo releases appeared on a somewhat regular basis, with 1994's Michael Sweet, 1995's Real, and 2001's Truth. Robert Sweet issued a solo recording, Love Trash, in addition to studio work, while Fox and Gaines formed a new group, Sin Dizzy, who issued a rock opera (concerning the crucifixion of Jesus Christ) titled He's Not Dead.\nDuring the intervening years, a large core of devoted fans remained intact, resulting in all of Stryper's albums being reissued by Hollywood Records. In 1999 Sin Dizzy played a show with Michael Sweet, which ended in an off-the-cuff jam session of old Stryper tunes -- resulting in reunion rumors. And with a heightened nostalgic interest regarding '80s-era metal bands during the early 21st century, Stryper agreed to sporadically reunite for a &quot;Stryper Expo,&quot; which has since turned into an annual event. Stryper's second greatest-hits collection, 7: The Best of Stryper, was issued in 2003, and included a pair of new tunes recorded especially for the collection, &quot;Something&quot; and &quot;For You.&quot; Fueled by a renewed interest in the Christian rock scene, the band returned to the studio for 2005's Reborn and again in 2009 for Murder by Pride, the latter released in celebration of the band's 25th anniversary. In 2011 Stryper released The Covering, featuring covers of songs by bands that inspired them, including a take on Black Sabbath's 1980 hit &quot;Heaven and Hell.&quot;\n\n\nDiscography:\nThe Yellow and Black Attack!    1984\nSoldiers Under Command    1985\nTo Hell with the Devil   1986\nIn God We Trust   1988\nAgainst the Law   1990\nReborn   2005\nMurder by Pride   2009\nThe Covering   2011\nSecond Coming   2013\nNo More Hell to Pay   2013\nLive - At The Whiskey a Go-Go   2014\n\n\nLine-Up:\nMichael Sweet\nRobert Sweet\nOz Fox\nTim Gaines\n\n\nInfo\n\nArtist: Stryper\nAlbum: Shine\nGenre: Heavy Metal, Hard Rock,\nSubgenre: Christian, Contemporary Rock\nCountry Of Origin: USA\nYear: 2014\nAudio codec: MP3\nRiptype: Tracks\nBitrate: 320 kbps\nPlaying Time: 1.15.14\nSize: 173 MB\n\n\nTracklist\n01. Legacy\n02. Marching Into Battle\n03. You Know What To Do\n04. Loud And Clear\n05. Reach Out\n06. Calling On You\n07. Free\n08. More Than A Man\n09. The Rock That Makes Me Roll\n10. No More Hell To Pay\n11. Jesus Is Just Alright\n12. Always There For You\n13. All For One\n14. The Way\n15. To Hell With The Devil\n16. Soldiers Under Command\n\n\n","torrent":{"xt":"urn:btih:10fa99a86caefac94b7b3f99ed60ec550ed43ec5","amp;dn":"Stryper+-+Live+at+the+Whisky++mp3++%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10fa99a86caefac94b7b3f99ed60ec550ed43ec5","infoHashBuffer":{"type":"Buffer","data":[16,250,153,168,108,174,250,201,75,123,63,153,237,96,236,85,14,212,62,197]},"announce":[],"urlList":[]}}