{"title":"Aetheric Mechanics (2008) (Digital GN) (Zone-Empire)","uid":10122188,"size":85062313,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:10fcfc6bf4f2fcab5297f8969710a74dffe46b2d&amp;dn=Aetheric+Mechanics+%282008%29+%28Digital+GN%29+%28Zone-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1399692567,"description":"Promotional info - &quot;The newest addition to Warren Ellis' Apparat line of original graphic novels has arrived! The year is 1907, and Britain has entered into a terrifying war with Ruritania, whose strange metal planes darken the skies, and whose monstrous war engines cast looming shadows from across the channel. Doctor Robert Watcham, lately returned to London from the front, makes his homecoming to Dilke Street. There lives his old friend, and England's greatest amateur detective, Sax Raker. Even as his beloved city prepares for war, Raker is himself about to embark on the strangest (and, perhaps, the most important) investigation of his career: The case of the man who wasn't there. This is no simple matter of murder - Sax Raker faces haunting questions to which there are no cut and dried answers. Is the mysterious killer, at last, evidence for Raker's long-held belief in a secret criminal mastermind? Is it some apparition uniquely belonging to this singular city, a place that seems to have lost all semblance of sense two years ago? Or do all the signs point to something much, much worse? Following up the huge success of Crecy, Ellis turns his spark of mad genius to bring us a fantastical tale in this all-new original graphic novel illustrated in detailed perfection by Gianluca Pagliarani.&quot;\n\nThis digital copy is thanks to Zone-Empire. Please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:10fcfc6bf4f2fcab5297f8969710a74dffe46b2d","amp;dn":"Aetheric+Mechanics+%282008%29+%28Digital+GN%29+%28Zone-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10fcfc6bf4f2fcab5297f8969710a74dffe46b2d","infoHashBuffer":{"type":"Buffer","data":[16,252,252,107,244,242,252,171,82,151,248,150,151,16,167,77,255,228,107,45]},"announce":[],"urlList":[]}}