{"title":"Tales From The Front Line- Hambrook, Michael  2012","uid":9668571,"size":36700044,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10fd0e871ffadfbdbf1b1137ab87b5af2685a9eb&amp;dn=Tales+From+The+Front+Line-+Hambrook%2C+Michael++2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"sidmal","files":-1,"time":1393424747,"description":"Hambrook, Michael - On the Front Line - Real Life Stories of Spying, Escaping and Surviving War\n New Holland Publishers | 2012 | ISBN: 1742572871 | 361 pages | PDF | 35.8 MB\n \n &quot;Tales From The Front Line&quot; is an extraordinary collection of stories from the wars and conflicts of the 20th Century that shaped the modern world. Not your average history book, these astonishing real life tales are told by witnesses on the ground, underground, in the air and at sea. The books appeal is drawn from the variety of subjects as the book is not only told from the perspective of the common soldier, but also from prisoners of war, slaves in German work camps, war administrators, under-cover spies and ordinary citizens who witnessed historical events first hand. The book boasts a rare assembly of 20 war stories. In addition, each tale is brought to life by artefacts that author Michael Hambrook worked tirelessly to obtain, from a rare photograph of the pilot who dropped the atomic bomb on Nagasaki to poems written by British POWs. The standout, however, is a never-before (and probably never to be again) published greeting card from Germany in 1939, which was personally signed by Adolf Hitler and confirmed by Christies of London as a genuine signature. \n","torrent":{"xt":"urn:btih:10fd0e871ffadfbdbf1b1137ab87b5af2685a9eb","amp;dn":"Tales+From+The+Front+Line-+Hambrook%2C+Michael++2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10fd0e871ffadfbdbf1b1137ab87b5af2685a9eb","infoHashBuffer":{"type":"Buffer","data":[16,253,14,135,31,250,223,189,191,27,17,55,171,135,181,175,38,133,169,235]},"announce":[],"urlList":[]}}