{"title":"Scarcity (Audiobook) By Mullainatham and Shafir 2013 mp3","uid":8898515,"size":253205211,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1103ea3d816ef439444849830de5dfef0cfe6c60&amp;dn=Scarcity+%28Audiobook%29+By+Mullainatham+and+Shafir+2013+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":16,"time":1378758834,"description":"Scarcity: Why Having Too Little Means So Much (Audiobook) By Sendhil Mullainatham and Eldar Shafir, read by Robert Petkoff\nUnabridged edition 2013 | 8 hours and 47 mins | ISBN: 1442368225 | MP3 64 kbps | 241 MB\n\nA surprising and intriguing examination of how scarcity and our flawed responses to itshapes our lives, our society, and our culture Why do successful people get things done at the last minute? Why does poverty persist? Why do organizations get stuck firefighting? Why do the lonely find it hard to make friends? These questions seem unconnected, yet Sendhil Mullainathan and Eldar Shafir show that they are all are examples of a mind-set produced by scarcity. Drawing on cutting-edge research from behavioral science and economics, Mullainathan and Shafir show that scarcity creates a similar psychology for everyone struggling to manage with less than they need. Busy people fail to manage their time efficiently for the same reasons the poor and those maxed out on credit cards fail to manage their money. The dynamics of scarcity reveal why dieters find it hard to resist temptation, why students and busy executives mismanage their time, and why sugarcane farmers are smarter after harvest than before. Once we start thinking in terms of scarcity and the strategies it imposes, the problems of modern life come into sharper focus. Mullainathan and Shafir discuss how scarcity affects our daily lives, recounting anecdotes of their own foibles and making surprising connections that bring this research alive. Their book provides a new way of understanding why the poor stay poor and the busy stay busy, and it reveals not only how scarcity leads us astray but also how individuals and organizations can better manage scarcity for greater satisfaction and success. ","torrent":{"xt":"urn:btih:1103ea3d816ef439444849830de5dfef0cfe6c60","amp;dn":"Scarcity+%28Audiobook%29+By+Mullainatham+and+Shafir+2013+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1103ea3d816ef439444849830de5dfef0cfe6c60","infoHashBuffer":{"type":"Buffer","data":[17,3,234,61,129,110,244,57,68,72,73,131,13,229,223,239,12,254,108,96]},"announce":[],"urlList":[]}}