{"title":"Stevie Nicks/24 Karat Gold-Songs From The...[2014][320KBPS][DE]","uid":11306224,"size":178926325,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:11848c4e40518a52e12b2238c5616ed589ffd81c&amp;dn=Stevie+Nicks%2F24+Karat+Gold-Songs+From+The...%5B2014%5D%5B320KBPS%5D%5BDE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"LameDuck69","files":19,"time":1414473403,"description":"Stevie Nicks - 24 Karat Gold-Songs From The Vault [2014]\n\n\n\n\n\n01  Starshine    \n02  If You Were My Love    \n03  Mabel Normand   \n04  Twisted  \n05  24 Karat Gold   \n06  Belle Fleur    \n07  All The Beautiful Worlds  \n08  Lady    \n09  I Don't Care   \n10  Watch Chain   \n11  Hard Advice   \n12  Carousel  \n13  Blue Water   \n14  Cathouse Blues  \n15  The Dealer   \n16  She Loves Him Still  \n\n\n\n\n\n320 KBPS [CBR]\n\n\nFrom Wikipedia:\n\n\n Stephanie Lynn &quot;Stevie&quot; Nicks (born May 26, 1948) is an American singer and songwriter who in the course of her work with Fleetwood Mac and her extensive solo career has produced over forty Top 50 hits and sold over 140 million albums. She was deemed &quot;The Reigning Queen of Rock and Roll&quot; and one of the &quot;100 Greatest Singers of All Time&quot; by Rolling Stone, and, as a member of Fleetwood Mac, was inducted into the Rock and Roll Hall of Fame in 1998. As a solo artist, she has garnered eight Grammy Award nominations and, with Fleetwood Mac, a further five.\n\nNicks joined Fleetwood Mac in 1975 along with her romantic partner Lindsey Buckingham. Fleetwood Mac's second album after the incorporation of Nicks and Buckingham, Rumours, released in 1977, was the best-selling album of the year of its release and, to date, made sales of 40 million copies worldwide, which makes it the sixth biggest selling studio album of all time. The album remained at No. 1 on the American albums chart for 31 weeks and reached the top spot in various countries worldwide. The album won Album of the Year in 1978 and produced four U.S. Top 10 singles, with Nicks' &quot;Dreams&quot; being the band's first and only U.S. number one hit.\n\nNicks began her solo career in 1981 with the album Bella Donna, which reached Platinum status less than three months after its release, and has since been certified quadruple-platinum. She has released a total of eight solo studio albums to date, with her most recent titled 24 Karat Gold: Songs from the Vault, released in October 2014. Nicks is known for her distinctive voice, mystical visual style, and symbolic lyrics.\n\n--------------------------------------------------------------------------------\n\n24 Karat Gold: Songs from the Vault is the eighth solo studio album by the American singer-songwriter and Fleetwood Mac vocalist Stevie Nicks, released on September 30, 2014, through Reprise Records. The album includes new versions of demos that Nicks recorded between 1969 and 1995. Also included is a cover of the Vanessa Carlton song &quot;Carousel&quot;, which Nicks put on the album because it was her mother's favorite song in her later days. Nicks was inspired to record the album after her assistant showed her YouTube videos of demos that Nicks had recorded but been circulated, often without her permission. The track &quot;Blue Water&quot; features Lady Antebellum on vocals.\n\nOn October 15, 2014, Billboard announced that the album had sold 33,000 copies in its first week of release and debuted at number seven on the Billboard 200, giving Nicks her sixth top ten album on that chart.\n\nThe album was released as standard and deluxe editions. The deluxe edition features two bonus tracks in addition to 48 pages of never-before-released photos.\n\nSeveral promotional singles were made available for download from the album prior to its release. &quot;The Dealer&quot;, was released on August 5, 2014, followed by &quot;Lady&quot; on August 25, &quot;Starshine&quot;, on September 16, and the title track on September 23, 2014.\n\n--------------------------------------------------------------------------------\n\nPersonnel:\n\n\nDave Stewart: Guitar\n\nWaddy Wachtel: Guitar, backing vocals\n\nStevie Nicks: Vocals\n\nSharon Celani: Backing vocals\n\nLady Antebellum: Backing vocals on &quot;Blue Water&quot;\n\nLori Nicks: Backing vocals\n\nMichael Campbell: Guitar on &quot;Starshine&quot; and &quot;I Don't Care&quot;\n\nDavey Johnstone: Guitar on &quot;Belle Fleur&quot; and &quot;If You Were My Love&quot;\n\nAnn Marie Calhoun: Violin\n\nTom Bukovac: Guitar\n\nMichael Rhodes: Bass\n\nDan Dugmore: Banjo\n\nChad Cromwell: Drums\n\nBenmont Tench: Keyboards\n\nLenny Castro: Percussion","torrent":{"xt":"urn:btih:11848c4e40518a52e12b2238c5616ed589ffd81c","amp;dn":"Stevie+Nicks%2F24+Karat+Gold-Songs+From+The...%5B2014%5D%5B320KBPS%5D%5BDE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11848c4e40518a52e12b2238c5616ed589ffd81c","infoHashBuffer":{"type":"Buffer","data":[17,132,140,78,64,81,138,82,225,43,34,56,197,97,110,213,137,255,216,28]},"announce":[],"urlList":[]}}