{"title":"N.W.A. - Straight Outta Compton [24 bit FLAC] vinyl","uid":8426702,"size":1722174868,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:11d76b10991b8dcd8bdab5b00a1fad52270ba7fc&amp;dn=N.W.A.+-+Straight+Outta+Compton+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"politux","files":-1,"time":1367365281,"description":"Straight Outta Compton wasn't quite the first gangsta rap album, but it was the first one to find a popular audience, and its sensibility virtually defined the genre from its 1988 release on. It established gangsta rap -- and, moreover, West Coast rap in general -- as a commercial force, going platinum with no airplay and crossing over with shock-hungry white teenagers. Unlike Ice-T, there's little social criticism or reflection on the gangsta lifestyle; most of the record is about raising hell -- harassing women, driving drunk, shooting it out with cops and partygoers. All of that directionless rebellion and rage produces some of the most frightening, visceral moments in all of rap, especially the amazing opening trio of songs, which threaten to dwarf everything that follows. Given the album's sheer force, the production is surprisingly spare, even a little low-budget -- mostly DJ scratches and a drum machine, plus a few sampled horn blasts and bits of funk guitar. Although they were as much a reaction against pop-friendly rap, Straight Outta Compton's insistent claims of reality ring a little hollow today, since it hardly ever depicts consequences. But despite all the romanticized invincibility, the force and detail of Ice Cube's writing makes the exaggerations resonate. Although Cube wrote some of his bandmates' raps, including nearly all of Eazy-E's, each member has a distinct delivery and character, and the energy of their individual personalities puts their generic imitators to shame. But although Straight Outta Compton has its own share of posturing, it still sounds refreshingly uncalculated because of its irreverent, gonzo sense of humor, still unfortunately rare in hardcore rap. There are several undistinguished misfires during the second half, but they aren't nearly enough to detract from the overall magnitude. It's impossible to overstate the enduring impact of Straight Outta Compton; as polarizing as its outlook may be, it remains an essential landmark, one of hip-hop's all-time greatest.","torrent":{"xt":"urn:btih:11d76b10991b8dcd8bdab5b00a1fad52270ba7fc","amp;dn":"N.W.A.+-+Straight+Outta+Compton+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11d76b10991b8dcd8bdab5b00a1fad52270ba7fc","infoHashBuffer":{"type":"Buffer","data":[17,215,107,16,153,27,141,205,139,218,181,176,10,31,173,82,39,11,167,252]},"announce":[],"urlList":[]}}