{"title":"Crosby, Stills, Nash &amp; Young-4 Way Street(1992)[EAC-FLAC][TWR120","uid":4838142,"size":706664947,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1291f26b1b1dc4676f30226ca2f429baccfa7b6a&amp;dn=Crosby%2C+Stills%2C+Nash+%26+Young-4+Way+Street%281992%29%5BEAC-FLAC%5D%5BTWR120&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"thewall68","files":46,"time":1239396590,"description":"Releaser: thewall\n\nExtractor: EAC 0.99 prebeta 4  \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD \nArtwork:  Full Scans 300dp \n\n\n4 WAY STREET caught Crosby, Stills, Nash &amp; Young on their 1970 concert tour at the height of their success. Even with its included bits of audience patter and a few overlong tracks (&quot;Southern Man&quot; and &quot;Carry On&quot;), the album is varied and exciting, ...    Full Descriptionand perfectly captures the quartet's remarkable singer/songwriter chemistry and sparkling harmonies. Stephen Still's classics like &quot;Suite: Judy Blue Eyes&quot; and &quot;Love the One You're With&quot; abut David Crosby tunes like the beautiful &quot;Laughing&quot; and Graham Nash's positive, instructional &quot;Teach Your Children.&quot;\n\nBut the real treat of 4 WAY STREET is the inclusion of Neil Young's solo material, including &quot;Cowgirl In the Sand&quot; from Young's first solo album, and the riveting &quot;Ohio,&quot; about the Kent State student massacre. (The CD reissue also includes the Young medley &quot;The Loner/Cinnamon Girl/Down By The River.&quot;) By the time the album came out, however, Young had already left the group, and Crosby, Stills &amp; Nash began to work on solo and duo projects. 4 WAY STREET captures the end of an era, then, and remains an essential part of any folk and singer/songwriter collection.\n\nRecording information: Fillmore East, New York, New York (06/02/1970 - 06/07/1970); The Forum, Los Angeles, California (06/26/1970 - 06/28/1970); Chicago Auditorium, Chicago, Illinois (07/05/1970).\n\nCrosby, Stills, Nash &amp; Young: David Crosby, Graham Nash, Neil Young, Stephen Stills (vocals, guitar).\n\nAdditional personnel: Calvin Samuels (bass instrument); Johnny Barbata (drums).\n\nRolling Stone (5/27/71, p.47) - &quot;...a surprisingly good album...Crosby, Stills, Nash and Young are all performers of unquestionable talent, and--mostly because they stay out of each other's way--4 WAY STREET must surely be their best album to date...&quot; \n\n[Editoral review]\n\n\nFrom the very beginning of their fateful collaboration, it was clear that this was to be the first of the new super-groups, composed of discontented refugees who either quit or were bounced from monster groups like the Byrds, Buffalo Springfield, and the Hollies. And after an initial success with a first album the group added Still's former partner in crime from the Buffalo Springfield group Neil young to the line-up, the strange witches brew of creative energy and talent that resulted exploded onto the contemporary rock scene at Woodstock to an amazed audience with such power and originality. Of course, this number one album was the result of their original collaboration, and it shot to the top of the charts, where it remained for years!\n\nThis live album is full of smash hits and breath-taking sounds, from the opening truncated version of &quot;Suite Judy Blue Eyes&quot; to the elegiac &quot;Teach Your Children&quot; to the provocative notion of multiple lover relationships in David Crosby's &quot;Triad'. They are really live here, as you can tell by the occasional faux-pas or corny references, and the album is an honest snapshot of CSN&amp; Y live, as they were for those of us old enough and lucky enough to have seen them before they started playing exclusively in ball parks and arenas. What the listener also gets here is an intriguing look at each of the members of the band as a solo artist, and I was glad to see that in the CD version they added a nice Graham Nash song or two, since he is often the least covered of the four superstars comprising the group. Of course, the real reason to buy this long, long CD is the electric jamming between Stills and Young on a number of later songs, like &quot;Southern Man&quot;, &quot;Ohio&quot;, and &quot;Carry On&quot;. There are some extended riffs and exchanges between the two that really showcase their mutual magic as well as the brilliance of the band at its best moments. This is a terrific albeit mixed bag of an album, and one everyone who calls himself (or herself) a rock fan should have it on his or her shelf. Enjoy! \n\n[Amazon user]\n\n\nTRACKLIST:\n\n1. Suite: Judy Blue Eyes\n2. On the Way Home\n3. Teach Your Children\n4. Triad\n5. Lee Shore\n6. Chicago/We Can Change the World\n7. Right Between the Eyes\n8. Cowgirl in the Sand\n9. Don't Let It Bring You Down\n10. 49 Bye-Byes/America's Children\n11. Love the One You're With\n12. King Midas in Reverse\n13. Laughing\n14. Black Queen\n15. Medley: The Loner/Cinnamon Girl/Down by the River\n16. Pre-Road Downs\n17. Long Time Gone\n18. Southern Man\n19. Ohio\n20. Carry On\n21. Find the Cost of Freedom\n\n\n\n\n","torrent":{"xt":"urn:btih:1291f26b1b1dc4676f30226ca2f429baccfa7b6a","amp;dn":"Crosby%2C+Stills%2C+Nash+%26+Young-4+Way+Street%281992%29%5BEAC-FLAC%5D%5BTWR120","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1291f26b1b1dc4676f30226ca2f429baccfa7b6a","infoHashBuffer":{"type":"Buffer","data":[18,145,242,107,27,29,196,103,111,48,34,108,162,244,41,186,204,250,123,106]},"announce":[],"urlList":[]}}