{"title":"Peter Boghossian a manual for creating atheists.pdf","uid":9197501,"size":3158544,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12936749f517021b07f4b281aca062611b1660c9&amp;dn=Peter+Boghossian+a+manual+for+creating+atheists.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"georgestrawson33","files":1,"time":1384474265,"description":"For thousands of years, the faithful have honed proselytizing strategies and talked people into believing the truth of one holy book or another. Indeed, the faithful often view converting others as an obligation of their faith--and are trained from an early age to spread their unique brand of religion. The result is a world broken in large part by unquestioned faith. As an urgently needed counter to this tried-and-true tradition of religious evangelism, A Manual for Creating Atheists offers the first-ever guide not for talking people into faith--but for talking them out of it. Peter Boghossian draws on the tools he has developed and used for more than twenty years as a philosopher and educator to teach how to engage the faithful in conversations that will help them value reason and rationality, cast doubt on their religious beliefs, mistrust their faith, abandon superstition and irrationality, and ultimately embrace reason.\n\nUp to now, most atheists have simply criticized religion in various ways, but the point is to dispel it.  In A Manual For Creating Atheists, &quot;Peter Boghossian fills that gap, telling the reader how to become a 'street epistemologist' with the skills to attack religion at its weakest point: its reliance on faith rather than evidence. This book is essential for nonbelievers who want to do more than just carp about religion, but want to weaken its odious grasp on the world.&quot; --Jerry Coyne, Ph.D., author of Why Evolution is True\n\n&quot;Dr. Peter Boghossian's 'A Manual for Creating Atheists' is a precise, passionate, compassionate and brilliantly reasoned work that will illuminate any and all minds capable of openness and curiosity. This is not a bedtime story to help you fall asleep, but a wakeup call that has the best chance of bringing your rational mind back to \nlife.&quot;--Stefan Molyneux, host of Freedomain Radio, the largest and most popular philosophy show on the web\n\n&quot;A book so great you can skip it and just read the footnotes. Pure genius.&quot; --Christopher Johnson, co-founder, The Onion\n\n&quot;A 'how to' book for the ages. Boghossian manages to take a library's worth of information and mold it into a concise and practical tome to guide through the murky waters of magical thinking, docking the reader safely on the shores of reason, logic and understanding. I thoroughly enjoyed reading this, and highly recommend it.&quot;--Al Stefanelli, author of A Voice of Reason In An Unreasonable Word-The Rise of Atheism On Planet Earth and Free Thoughts-A Collection Of Essays By An American Atheist\n\n&quot;All of these dear brothers and sisters have faithfully trusted Jesus for their salvation, but most are unable to defend what they believe (or how they came to their belief) when approached by aggressive skeptics, particularly those who have been trained by Boghossian.&quot;--J. Warner Wallace, author of Cold Case Christianity\n\n&quot;There is nothing else on the market like this book that helps atheists talk believers out of their faith. Every atheist interested in doing so, or who talks to believers about faith at all, should read it. It's both needed and brilliant!&quot; --John W. Loftus, author of Why I Became an Atheist and The Outsider Test for Faith\n\n&quot;Boghossian has provided an indispensible chart book for all of us who must navigate the rising sea of magical thinking that is inundating America today.&quot; --Victor Stenger, Ph.D., author of God: The Failed Hypothesis and God and the Atom\n\n&quot;If we want to live in world that is safer and more rational for all, then this is the guidebook we have been waiting for. Relying on extensive experience and a deep concern for humanity, Peter Boghossian has produced a game changer. This is not a book to read while relaxing in a hammock on a sunny afternoon. This is the how-to manual to take into the trenches of everyday life where minds are won and lost in the struggle between reason and madness.&quot; --Guy P. Harrison, author of 50 Simple Questions for Every Christian and Race and Reality ","torrent":{"xt":"urn:btih:12936749f517021b07f4b281aca062611b1660c9","amp;dn":"Peter+Boghossian+a+manual+for+creating+atheists.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12936749f517021b07f4b281aca062611b1660c9","infoHashBuffer":{"type":"Buffer","data":[18,147,103,73,245,23,2,27,7,244,178,129,172,160,98,97,27,22,96,201]},"announce":[],"urlList":[]}}