{"title":"Gore Vidal - Creation, Revised Edition (pdf)","uid":8699876,"size":6861061,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1297e87805eff29aa37bba836d32546d3988028f&amp;dn=Gore+Vidal+-+Creation%2C+Revised+Edition+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1374037135,"description":"Gore Vidal - Creation, Revised Edition (Doubleday, 1981, 2002). 574 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nHistorical novel that takes place in the fifth century BC; characters include Socrates, Confucius and the Buddha.\n\nNote: there's a high quality epub/mobi version of this novel around, but the text is that of the 1981 edition. In 2002 the &quot;revised&quot; edition, which is in this torrent, was published. It adds in to the text several chapters that had been removed by editors from the first edition.\n\ndescription:\n\nOnce again the incomparable Gore Vidal interprets and animates history -- this time in a panoramic tour of the 5th century B.C. -- and embellishes it with his own ironic humor, brilliant insights, and piercing observations. We meet a vast array of historical figures in a staggering novel of love, war, philosophy, and adventure . . . \n\n&quot;There isn't a page of CREATION that doesn't inform and very few pages that do not delight.&quot; -- John Leonard, The New York Times\n\n\nReview\n\nIn 445 B.C., Cyrus Spitama, the grandson of the prophet Zoroaster, is the Persian ambassador to the city of Athens. He has a rather caustic appreciation of his situation: &quot;I am blind. But I am not deaf. Because of the incompleteness of my misfortune, I was obliged yesterday to listen for nearly six hours to a self-styled historian whose account of what the Athenians like to call 'the Persian Wars' was nonsense of a sort that were I less old and more privileged, I would have risen to my seat at the Odeon and scandalized all Athens by answering him.&quot; Having thus dismissed Herodotus, Cyrus then dictates his life story to his nephew, Democritus, with similar disdain for the Greeks--whom we in the modern world have come to view as the progenitors of civilization, but whom Cyrus considers to be bad-smelling rabble.\n\nOf course, Cyrus Spitama speaks with a very modern, ironic voice supplied to him by Gore Vidal--and the political intrigues in which Cyrus finds himself immersed are likewise familiar territory for fans of Vidal's historical fiction. But the narrator's delightfully wicked observations are the icing on a narrative of truly epic scope--out of his desire to understand the origins of the world, Cyrus undertakes journeys to India, where he encounters disciples of the Buddha, and China, where he engages Confucius in philosophical conversation while the great sage fishes by the riverside. Creation offers insights into classical history laced with scintillating wit and narrative brio.\n","torrent":{"xt":"urn:btih:1297e87805eff29aa37bba836d32546d3988028f","amp;dn":"Gore+Vidal+-+Creation%2C+Revised+Edition+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1297e87805eff29aa37bba836d32546d3988028f","infoHashBuffer":{"type":"Buffer","data":[18,151,232,120,5,239,242,154,163,123,186,131,109,50,84,109,57,136,2,143]},"announce":[],"urlList":[]}}