{"title":"Sarah’s Key audiobook by Tatiana de Rosnay EarReaders","uid":13207741,"size":143136624,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:12b39e20df0684116fa788bb5ea36a92ebb61dfd&amp;dn=Sarah%26rsquo%3Bs+Key+audiobook+by+Tatiana+de+Rosnay+EarReaders&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"jsk123","files":2,"time":1452614799,"description":"Written by Tatiana de Rosnay\r\n\r\nDe Rosnay's U.S. debut fictionalizes the 1942 Paris roundups and deportations, in which thousands of Jewish families were arrested, held at the Vélodrome d'Hiver outside the city, then transported to Auschwitz. Forty-five-year-old Julia Jarmond, American by birth, moved to Paris when she was 20 and is married to the arrogant, unfaithful Bertrand Tézac, with whom she has an 11-year-old daughter. Julia writes for an American magazine and her editor assigns her to cover the 60th anniversary of the Vél' d'Hiv' roundups. Julia soon learns that the apartment she and Bertrand plan to move into was acquired by Bertrand's family when its Jewish occupants were dispossessed and deported 60 years before. She resolves to find out what happened to the former occupants: Wladyslaw and Rywka Starzynski, parents of 10-year-old Sarah and four-year-old Michel. The more Julia discovers—especially about Sarah, the only member of the Starzynski family to survive—the more she uncovers about Bertrand's family, about France and, finally, herself. Already translated into 15 languages, the novel is De Rosnay's 10th (but her first written in English, her first language). It beautifully conveys Julia's conflicting loyalties, and makes Sarah's trials so riveting, her innocence so absorbing, that the book is hard to put down","torrent":{"xt":"urn:btih:12b39e20df0684116fa788bb5ea36a92ebb61dfd","amp;dn":"Sarah%26rsquo%3Bs+Key+audiobook+by+Tatiana+de+Rosnay+EarReaders","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12b39e20df0684116fa788bb5ea36a92ebb61dfd","infoHashBuffer":{"type":"Buffer","data":[18,179,158,32,223,6,132,17,111,167,136,187,94,163,106,146,235,182,29,253]},"announce":[],"urlList":[]}}