{"title":"Femina India - 2 August 2016 (gnv64)","uid":15376572,"size":26994681,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12cd0c6e3efaf2e60a5bcb91b48537ff2caba8f2&amp;dn=Femina+India+-+2+August+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gnv65","files":4,"time":1469194002,"description":"Femina India - 2 August 2016\r\nEnglish | 92 pages | True PDF | 25.7 mb\r\n\r\n9 INDIA'S MOST POWERFUL WOMEN Women have taken centrestage this year. From holding top positions in multinational companies to shaping our culture, these high-flyers are redefining gender roles\r\n10 OWNING THE WORLD Whether it’s as a singer, TV star or our favourite Bollywood actor, Priyanka Chopra is redefining what it means to be a performer. We talk to her about her plans for world domination\r\n\r\nFASHION\r\n50 Front row - PRINT PARTY Breathe new life into your workwear favourites by piling on the prints\r\n51 Front row - MAD RUSH Not just for the gym, this season’s hottest athleisure pieces will guarantee you a win in the boardroom\r\n52 Front row - RAZZLE DAZZLE Brighten up your Monday meeting with some sparkle\r\n53 Front row - WHITE HOT Nothing says you’re in con like a sharp white wardrob Power women aren't afraid to stand out\r\n55 Jewellery - SELF PARADE Ear rings, neckpieces and m e. Get into the swing of the season with these t ssled danglers\r\n58 Trend metre - PEEP SHOW Show some skin. There’s a new set of erogenous zones that’s turning up the heat\r\n60 Fashion - TRENDING Stay in the loop with a latest fashion buzz\r\n\r\nBEAUTY\r\n70 Masterclass - GET THE LOOK Hairstylist Roberto Casey shows us the DIY trick to creating a bun using a sock\r\n72 Nail edit - SHADOW PLAY Cross over to the dark side with these shades of black nail polish\r\n74 Beauty - HOT RIGHT NOW All you need on your beauty shelf\r\n76 Makeup mantra - POP PRINCESS Jacqueline Fernandez knows how to go from brunch to cocktail hour in just a few steps\r\n77 Beauty blast - CHIN UP DARLING It’s all you need for a good selfie. We help you get the perfect, sculpted jawline\r\n79 Fitness bulletin - 7 MINUTES TO FIT Hold the excuses. You can get in shape in a matter of minutes.\r\n\r\nRECOMMENDATIONS\r\n82 Reviews - RECOMMENDED READS Add these new releases to your reading list\r\n84 Reviews - HUNGER PANGS Recipe apps to turn your phone into a personal kitchen assistant\r\n\r\nLIVING\r\n86 Food - MANGO MADNESS These desserts with the kind of fruits will have you licking your lips\r\n90 Interiors - BRIGHT AND BRILLIANT Chase away rainy day blues with a splash of colour\r\n92 The buzzmakers - ZAREEN KHAN FROM FLAB TO FIT The actor tells us about her new fitness regime and her plans to make a comeback in Bollywood\r\n\r\nIN EVERY ISSUE\r\n2 EDITOR’S LETTER\r\n3 TOMBSTONE\r\n6 INBOX\r\n73 BEAUTY MANDATE\r\n \nhttps://s31.postimg.org/gqm9udwtn/Femina_India_2_August_2016.jpg","torrent":{"xt":"urn:btih:12cd0c6e3efaf2e60a5bcb91b48537ff2caba8f2","amp;dn":"Femina+India+-+2+August+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12cd0c6e3efaf2e60a5bcb91b48537ff2caba8f2","infoHashBuffer":{"type":"Buffer","data":[18,205,12,110,62,250,242,230,10,91,203,145,180,133,55,255,44,171,168,242]},"announce":[],"urlList":[]}}