{"title":"Maria Schneider Orchestra - Sky Blue (2007) [EAC-FLAC]","uid":10642637,"size":506725576,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:13d5af487abb83bc4a80713b05beae59c850c499&amp;dn=Maria+Schneider+Orchestra+-+Sky+Blue+%282007%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"pucholoco","files":-1,"time":1406495303,"description":"               Maria Schneider Orchestra - Sky Blue (2007) [EAC-FLAC]\n                  EAC rip (secure mode) | FLAC+CUE+LOG -&gt; 298 Mb\n                       Full Artwork @ 400 dpi (jpg) -&gt; 208 Mb\n\n\nTraditional big band arranging focuses on give and take between sections - trumpets, trombones and reeds - with rhythm support. Spiced with counterpoint and polyrhythms, this approach still produces some very exciting music. That's not where Maria Schneider is at. She cuts across sections and emphasizes ensemble color and sound, a way pioneered by Ellington, and developed by her mentor, Gil Evans. In liner notes as moving as her music, Schneider describes her starting point. &quot;...I cast out a few exploratory tones in search of meaningful sound. Given a little gestation time, the seeds of each piece started to pop, revealing something very personal. I found myself either on a journey back in time or deep inside myself, the music exposing even more than I'd consciously felt from any of the actual experiences. The experiences transmuted into sound...&quot;.\n\nLike Ellington, Schneider uses the orchestra as her instrument and often considers the sound of individual players as she composes. This is evident in Sky Blue, Schneider's second ArtistShare release. The first,the 2004Concert in the Garden, was also the first recording to win a Grammy with no in-store distribution. Fan support is what ArtistShare is all about.\n\nSky Blue contains five extended works, four commissioned. The music is melodic, unconventional, and above all, emotional. &quot;The 'Pretty' Road&quot; opens with a simple theme. The arrangement and Ingrid Jensen's magnificent contributions on flugelhorn and trumpet build in intensity as childhood memories are recalled on a musical journey with a peaceful ending. &quot;Aires de Lando&quot; is an intricate arrangement suggestive of Peru with Scott Robinson doing remarkable things on clarinet from start to finish on a melody which Schneider thought &quot; almost impossible to play.&quot; Rich Perry's tenor sound and the magic carpet provided by the orchestra make &quot;Rich's Piece&quot; majestic and beautiful. The mystery of bird migration is the subject of the 22-minute tone poem, &quot;Cerulean Skies.&quot; \n\nIt opens with the sounds of the awakening rain forest and ends with the real call of one cerulean warbler. The arrangement is percussive as Donny McCaslin's tenor describes gathering and flight. Accordion and piano tones (Gary Versace and Frank Kimbrough) suggest night travel as experienced by one small bird. The excitement of arrival is apparent as the arrangement becomes hymn-like and Charles Pillow's alto sings out. &quot;Sky Blue,&quot; with Steve Wilson on soprano, describes the renewal of joy and hope communicated by the bluest of skies following the passing of a dear friend.\n\nListening during the review process, I was constantly reminded of the sky: ever-changing, awe-inspiring, requiring no analysis. Now it's time to just sit back, relax and absorb those beautiful sounds created by Maria Schneider. Again, and again.\n\n\n-----------------------------------------------------------------------------------\nTracklist:\n-----------------------------------------------------------------------------------\n\n01. The 'Pretty' Road\n02. Aires de Lando\n03. Rich's Piece\n04. Cerulean Skies\n05. Sky Blue\n\n*2007 Maria Schneider / ArtistShare | AS0065\n\n\n\n\nEnjoy, Seed and Sharing. Thanks!\n\n\n","torrent":{"xt":"urn:btih:13d5af487abb83bc4a80713b05beae59c850c499","amp;dn":"Maria+Schneider+Orchestra+-+Sky+Blue+%282007%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13d5af487abb83bc4a80713b05beae59c850c499","infoHashBuffer":{"type":"Buffer","data":[19,213,175,72,122,187,131,188,74,128,113,59,5,190,174,89,200,80,196,153]},"announce":[],"urlList":[]}}