{"title":"Work Stress","uid":6551499,"size":2741539,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13d6b3bc912a1d199f6176904c936c8ef6063a5a&amp;dn=Work+Stress&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"_F1_","files":-1,"time":1311081265,"description":"Work Stress: The Making of a Modern Epidemic by David Wainwright, Michael Calnan\nOpen University Press | 2002 | ISBN: 0335207073 | English | 240 pages | PDF | 2.61 MB\n\n We are facing an epidemic of work stress. But why should problems at work which previously led to industrial disputes and political activity now be experienced as a cause of physical or mental illness? This book combines a critique of the scientific evidence relating to work stress, with an account of the social, historical and cultural changes that produced this phenomenon. The analysis is grounded in workers' accounts of their experiences of work stress, derived from the authors' qualitative research. Sociological theories of embodiment, emotions and medicalization are employed to explore the role of subjectivity in mediating the relationship between work and ill health.\n\n This book concludes with an exploration of the consequences of adopting the passive identity of 'work stress victim', and the extent to which individuals resist the medicalization of their problems. It will be of interest to a range of students and researchers in the social sciences, particularly those with an interest in medical sociology, sociology of work, management studies and industrial relations.","torrent":{"xt":"urn:btih:13d6b3bc912a1d199f6176904c936c8ef6063a5a","amp;dn":"Work+Stress","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13d6b3bc912a1d199f6176904c936c8ef6063a5a","infoHashBuffer":{"type":"Buffer","data":[19,214,179,188,145,42,29,25,159,97,118,144,76,147,108,142,246,6,58,90]},"announce":[],"urlList":[]}}