{"title":"Crocodiles - Crimes of Passion (2013) [FLAC]","uid":8883444,"size":275102170,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:146c847030f0ce8c70641580887e2c904be6f98f&amp;dn=Crocodiles+-+Crimes+of+Passion+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1378391408,"description":"\n  Crocodiles - Crimes of Passion (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Noise Pop\n  Source: WEB\n  Codec: FLAC\n  Bit Rate: ~ 900\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 I Like It in the Dark \n  02 Marquis de Sade \n  03 Cockroach \n  04 Heavy Metal Clouds\n  05 Teardrop Guitar \n  06 She Splits Me Up \n  07 Me And My Machine Gun \n  08 Gimme Some Annihilation \n  09 Virgin \n  10 Un Chant D'Amour\n\n  After Crocodiles started their life as a relatively unfocused and raw noise pop duo that referenced all the great noisy pop groups that came before them (Jesus and Mary Chain, Spacemen 3, Echo &amp; the Bunnymen), each of their albums has refined and broadened their sound more and more. After 2012's Endless Flowers took them almost as far as one could imagine into the realm of catchy pop songs slightly scuffed and dreamily rendered, they just kept going. Hiring the Raveonettes' Sune Rose Wagner to oversee and add his golden touch to the recordings, Brandon Welchez and Charles Rowell deliver their most focused and immediate album to date with 2013's Crimes of Passion, boiling the songs down to their three-chord, three-and-a-half-minute cores, with familiar-feeling melodies lifted from the JAMC songbook and noisy but not abrasive guitars filling the air. Once they have the diamond-hard center all sorted, they add horns and swirling keyboards, layer in cheerful vocal harmonies, and fill the edges with jangling tambourines and percussion. \n\n  It's a perfect mix of song and production that, when combined with Welchez's lighter than usual vocal delivery, becomes a perfect example of just how true it is that a spoonful of sugar helps the medicine go down. See, the lyrics are still the usual gloomy mix of depression and bummer times, but unless you are really paying attention, the sweet surface sound might distract you from the darkness and let the songs bounce past like happy little bunnies. Almost. When you get right down to it, it's hard to ignore the troubled soul behind songs like &quot;Gimme Some Annihilation&quot; and &quot;Me and My Machine Gun,&quot; tough to not get choked up by the ode to his wife's pain on &quot;She Splits Me Up,&quot; and almost impossible to dismiss the overall gloom and doom that lurk behind the bubblegum snap of the production and the needle-sharp hooks of the songwriting. Crimes of Passion works on two levels then, both as an expression of the duo's uneasy, uncompromising vision and as a catchy, easy-to-digest pop album. Crocodiles have never been content to stick to one sound and ride it into the ground; they always seem to be searching for the perfect way to transmit their brand of noise and pop. They just might have found it here.","torrent":{"xt":"urn:btih:146c847030f0ce8c70641580887e2c904be6f98f","amp;dn":"Crocodiles+-+Crimes+of+Passion+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"146c847030f0ce8c70641580887e2c904be6f98f","infoHashBuffer":{"type":"Buffer","data":[20,108,132,112,48,240,206,140,112,100,21,128,136,126,44,144,75,230,249,143]},"announce":[],"urlList":[]}}