{"title":"The Aghora Trilogy by Robert E. Svoboda [Tantra]","uid":12637888,"size":56744558,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:146da471fdb761d4b7e20dda678c541d0e154a71&amp;dn=The+Aghora+Trilogy+by+Robert+E.+Svoboda+%5BTantra%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Horisarte","files":6,"time":1445952952,"description":"The Aghora Trilogy by Robert E. Svoboda [Tantra]\r\n\r\nThe Aghora books have been embraced world-wide for their frankness in broaching subjects generally avoided and their facility for making the &quot;unseen&quot; real. By story and living example the Aghori Vimalananda transports us into the true reality while stripping away the unreal. In the process of revealing essence behind substance, countless questions are answered for the spiritual aspirant.\r\n\r\nBooks:\r\n__\r\n\r\n1. Aghora: At the Left Hand of God \r\n \nhttp://www.brotherhoodoflife.com/styled-2/files/Aghora-full-image.1150px.gif\r\n\r\nAghora: At the Left Hand of God is the first book in the Aghora trilogy. Written almost entirely in Vimalananda's own words, it presents events from his life, tenets of his philosophy, and highlights from his spiritual practices. Designed partly to shock and partly to comfort, but wholly as an offering to his Beloved, Aghora is as clear a picture as possible of a man who was a riddle wrapped up in an enigma. Vimalananda insisted that this book be published only after his demise, that he might be spared pursuit by those whose curiosity might be inflamed by some of the sensational events described within. He believed in devoting his all to the pursuit of the direct perception of Reality, and advised others to be similarly dedicated to attaining personal experience of God. To readers he offered this warning: &quot;Don't take anything I say as gospel truth. I am human, I make mistakes. Test on yourselves what I've told you. Try it out, experience it, and then you will know whether or not I'm telling you the truth.&quot;\r\n\r\n2. Aghora II: Kundalini\r\n \nhttps://d.gr-assets.com/books/1388217143l/217492.jpg\r\n\r\nThis, the second volume in the Aghora series, focuses on Kundalini, the transformative power of the enlightened self. Kundalini, the root from which all spiritual experiences sprout, has remained secret for so long because it cannot be explained, only experienced. This book recounts how Vimalananda introduced me to Kundalini, and took me step by step through the practices used to awaken Her. It examines mantras, yantras, tantric practices, and shows how normally mundane things like music, food, and even the noise of trains rumbling down tracks can be turned to one's spiritual benefit. For Vimalananda Kundalini was not some sort of impersonal serpent energy, but rather took the form of his beloved deity Smashan Tara, the &quot;Saviouress of the Cemetery.&quot; He trusted Kundalini implicitly, and She never let him down. \r\n\r\n3. Aghora III: Laws Of Karma\r\n \nhttps://d.gr-assets.com/books/1347718554l/677453.jpg\r\n\r\nIn this third volume of the Aghora trilogy the Aghori Vimalananda uses the Bombay racetrack as a metaphor for the ultimate game of life","torrent":{"xt":"urn:btih:146da471fdb761d4b7e20dda678c541d0e154a71","amp;dn":"The+Aghora+Trilogy+by+Robert+E.+Svoboda+%5BTantra%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"146da471fdb761d4b7e20dda678c541d0e154a71","infoHashBuffer":{"type":"Buffer","data":[20,109,164,113,253,183,97,212,183,226,13,218,103,140,84,29,14,21,74,113]},"announce":[],"urlList":[]}}