{"title":"Donald Fagen - Morph The Cat (2006) 24-96-FLAC","uid":10934272,"size":1176936819,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:148dec5373f9aff38dd4a7428eb919991fd6b923&amp;dn=Donald+Fagen+-+Morph+The+Cat+%282006%29+24-96-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"hal4000","files":-1,"time":1409423471,"description":"Donald Jay Fagen (born January 10, 1948) is an American musician and songwriter, best known as the co-founder (along with partner Walter Becker) and lead singer of the rock band Steely Dan.\n\nThere are no surprises in sound and style on Morph the Cat, Donald Fagen's long-awaited third solo album, nor should any be expected, ever since Steely Dan's 1980 masterwork, Gaucho, his work, either on his own or with longtime collaborator Walter Becker, has been of a piece. Each record has been sleek, sophisticated, and immaculately produced, meticulously recorded and arranged, heavy on groove and mood, which tends to mask the sly wit of the songs. When it works well, as it did on Fagen's peerless 1982 solo debut, The Nightfly, or on Steely Dan's 2001 comeback, Two Against Nature, the results go down smoothly upon first listen and reveal their complexity with each spin; when it doesn't quite succeed, both 1993's Kamakiriad and the Dan's 2003 effort Everything Must Go didn't quite gel, the albums sound good but samey on the surface and don't quite resonate. Morph the Cat belongs in the first group: at first it sounds cozily familiar, almost too familiar, but it digs deep, both as music and song.\n\nSonically, at least superficially, it is very much a continuation of the two Steely Dan records of the new millennium, not only does it share Fagen's aesthetic, but it was recorded with many of the same musicians who have shown up on the Dan projects. There are slight differences, without Becker around, there's a greater emphasis on keyboards and the songs stretch on a bit longer than anything on Everything Must Go, but this, at least on pure sonics, could have functioned as a sequel to Two Against Nature. But Morph the Cat is very much a solo affair, fitting comfortably next to his first two solo albums as a conclusion to what he calls a trilogy. If The Nightfly concerned the past and Kamakiriad was set in a hazy future, Morph the Cat is rooted in the present, teeming with the fears and insecurities of post-9/11 America. Fagen doesn't camouflage his intent with the gleefully enigmatic rhymes that have been his trademark: his words, while still knowingly sardonic, are direct, and in case you don't want to bother reading the lyrics or listening closely, he helpfully offers brief explanations of the songs (for instance, on &quot;Mary Shut the Garden Door,&quot; he writes &quot;Paranoia blooms when a thuggish cult gains control of the government,&quot; a statement that's not exactly veiled). On top of this unease, Fagen faces mortality throughout the album, he talks with the ghost of Ray Charles, borrows W.C. Fields' phrase for death for &quot;Brite Nitegown,&quot; writes about attempted suicides, and every song seems to be about things drawing to a close.\n\nIt's a little disarming to hear Fagen talk so bluntly, although he came close to doing so on the deliberately nostalgic The Nightfly, the fact that he was writing about the past kept him at a bit of a distance, but despite the abundance of morbid themes, Morph the Cat never sounds dour or depressing. In large part this is due to Fagen's viewpoint, he never succumbs to mawkishness, always preferring to keep things witty and sardonic, which helps keep things from getting too heavy, but it's also due to his smooth jazz-rock, which always sounds nimble and light. This, of course, is how Fagen's music always sounds, but here, it not only functions as a counterpoint to the darkness creeping on the edges of the album, but it's executed expertly: as spotless as this production is, it never sounds sterile, and when the songs start stretching past the five-minute mark, two cuts are over seven minutes, it never gets boring, because there's a genuine warmth to the clean, easy groove. More so than on Kamakiriad, or on the tight Everything Must Go, there is a sense of genuine band interplay on this record, which helps give it both consistency and heart, something appropriate for an album that is Fagen's most personal song cycle since The Nightfly, and quite possibly his best album since then.\n\nOfficial high-resolution digital download PCM 24 bit 96 Khz FLAC.\n\nI noticed a small typo in my &quot;sunken Condos&quot; upload.\nI forgot a space in Mr's Fagen name.\nSo if you search for &quot;Donald Fagen&quot;, you'll not see it.\nHere is the link for anyone who's interested.\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10927168/DonaldFagen-Sunken_Condos%282012%29_24-88.2-FLAC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10927168/DonaldFagen-Sunken_Condos%282012%29_24-88.2-FLAC&lt;/a&gt;\n","torrent":{"xt":"urn:btih:148dec5373f9aff38dd4a7428eb919991fd6b923","amp;dn":"Donald+Fagen+-+Morph+The+Cat+%282006%29+24-96-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"148dec5373f9aff38dd4a7428eb919991fd6b923","infoHashBuffer":{"type":"Buffer","data":[20,141,236,83,115,249,175,243,141,212,167,66,142,185,25,153,31,214,185,35]},"announce":[],"urlList":[]}}