{"title":"Trader Vic: Methods of a Wall Street Master","uid":9313774,"size":2989453,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:15515733d3242ec89f21b094cd2c1b589053876a&amp;dn=Trader+Vic%3A+Methods+of+a+Wall+Street+Master&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1386442402,"description":"ABOUT THIS BOOK\nTrader Vic -- Methods of a Wall Street Master Investment strategies from the man Barron's calls &quot;The Ultimate Wall Street Pro&quot; &quot;Victor Sperandeo is gifted with one of the finest minds I know. No wonder he's compiled such an amazing record of success as a money manager. Every investor can benefit from the wisdom he offers in his new book. Don't miss it!&quot; --Paul Tudor Jones Tudor Investment Corporation &quot;Here's a simple review in three steps: 1. Buy this book! 2. Read this book! 3. See step 2. For those who can't take a hint, Victor Sperandeo with T. Sullivan Brown has written a gem, a book of value for everyone in the markets, whether egghead, novice or seasoned speculator.&quot; --John Sweeney Technical Analysis of Stocks and Commodities &quot;Get Trader Vic-Methods of a Wall Street Master by Victor Sperandeo, read it over and over and you'll never have a losing year again.&quot; --Yale Hirsch Smart Money &quot;I have followed Victor Sperandeo's advice for ten years, and the results have been outstanding. This book is a must for any serious investor.&quot; --James J. Hayes, Vice President, Investments Prudential Securities Inc. &quot;This book covers all the important aspects of making money and integrates them into a unifying philosophy that includes economics, Federal Reserve policy, trading methods, risk, psychology, and more. It's a philosophy everyone should understand.&quot; --T. Boone Pickens, General Partner Mesa Limited Partnership &quot;This book gave me a wealth of new insights into trading. Whether you're a short-term trader or a long-term investor, you will improve your performance by following Sperandeo's precepts.&quot; --Louis I. Margolis Managing Director, Salomon Brothers, Inc.","torrent":{"xt":"urn:btih:15515733d3242ec89f21b094cd2c1b589053876a","amp;dn":"Trader+Vic%3A+Methods+of+a+Wall+Street+Master","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15515733d3242ec89f21b094cd2c1b589053876a","infoHashBuffer":{"type":"Buffer","data":[21,81,87,51,211,36,46,200,159,33,176,148,205,44,27,88,144,83,135,106]},"announce":[],"urlList":[]}}