{"title":"[ExploitedCollegeGirls] Felicity","uid":11673847,"size":855551089,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:1569fd1cfa67bf8c586bccafd5aeea100828b84d&amp;dn=%5BExploitedCollegeGirls%5D+Felicity&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Upl0ad3rR","files":1,"time":1422762853,"description":"---:More From My Torrent's Here:---  &lt;a href=&quot;\nhttps://thepiratebay.se/user/Upl0ad3rR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/Upl0ad3rR&lt;/a&gt;\n\n---:ScreeNshotS:---  &lt;a href=&quot;\nhttp://image-tpb.com/img-54cd955ea5212.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-54cd955ea5212.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://image-tpb.com/img-54cd955fe9f37.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-54cd955fe9f37.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://image-tpb.com/img-54cd95607ac1c.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-54cd95607ac1c.html&lt;/a&gt; \n\nExCoGi is thrilled to unleash sexual tornado Felicity on you; a stunning, sunny, dancing sex pot, with a tight body and big natural tits and she is up for anything when the cameras get rolling. From showing off her perfect C cups as she gets ready to bending her long legs in semi naked yoga poses to getting pounded with a dildo or splashed with cum, this girl approaches everything like it's a party and she's the guest of honor.\nIt's a testament to Jay's recruiting skills that a girl this naturally pretty and with a body this banging will make the bad decision to star in an Ex Co Gi update, but just look at her tattoos, this girl is full of bad decisions and clearly doesn't know the definition of the word regret. Felicity is definitely one of the hottest girls on the site: great tits, great ass, great abs, pretty face, perfect peach pussy?she's even got a perfect balloon knot butthole.\nDuring the interview she tells Jay that she's never used a dildo but is totally down to on camera. Jay grabs one and before he can ask what type of lube she likes, she's already orgasmed twice in a row. Which leaves her pussy so sensitive that it clenches up and she needs a break. After two real, huge orgasms (and a quick pee) Felicity gets to her knees for an enthusiastic BJ that ends with a nice bout of face fucking, shown both from Jay's POV and in replays of alternate camera angles.\nFace fucking quickly turns to real fucking as Jay takes her from behind in doggy style. Then he lays her flat and fucks her on her back. He manages to capture the action and her big tits bouncing from an overhead camera and her facial expressions as she gets fucked from a second camera. Then, after he pulls her on his lap for a good jackhammering in cowgirl, Jay has Felicity get back to her knees for a little more oral and then a huge, splashdown facial.\nIt's rare that we get a girl that's both as fine looking and as sexually uninhibited as Felicity, but if there's a New Year's resolution we're gonna try to stick to it's to search for a few more girls like Felicity. Side note, we are funding a Kickstarter campaign to hunt down the guy who applied those horrible tattoos to this girl's taut, tan body. We're thinking it will cost about $25,000 to hire an ex-Navy SEAL to track the guy down and have a serious &quot;talk&quot; with him because a girl this good is going to show up on some other site soon enough and we're hoping it's with less bad ink and not more","torrent":{"xt":"urn:btih:1569fd1cfa67bf8c586bccafd5aeea100828b84d","amp;dn":"%5BExploitedCollegeGirls%5D+Felicity","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1569fd1cfa67bf8c586bccafd5aeea100828b84d","infoHashBuffer":{"type":"Buffer","data":[21,105,253,28,250,103,191,140,88,107,204,175,213,174,234,16,8,40,184,77]},"announce":[],"urlList":[]}}