{"title":"Actual Window Manager v8.1.2","uid":9744059,"size":11715379,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:158bccbedcc90334ba0b24c163208419308a27c8&amp;dn=Actual+Window+Manager+v8.1.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"NokTham","files":1,"time":1394556501,"description":"Virtual Desktops for Effective Work\nIf you have a lack of workspace on the desktop, use virtual desktops included in Actual Window Manager. This tool allows you to create the desired number on virtual desktops and increase your workspace.\nUnlimited number of additional desktops\nEach virtual desktop is individual and fully-functional\nTwo modes of multiple monitor support: Classic and Independent\n\nFully-Functional Desktop Environment for Multiple Monitors\nUsing Actual Window Manager, you will have a fully-functional taskbar for each monitor and many other features to improve the multiple monitorsÎ“Ã‡Ã– desktop environment.\nFully-functional taskbar for each display\nDesktop Background and Screen Saver management\nAdditional mouse features for multiple monitors management\nDesktop profiles\nAnd much more...\n\nImproved Windows Folder Navigation\nActual Window Manager allows the use of two additional title buttons for each window. These special buttons improve Windows Folder Navigation, so you do not need to use long mouse manipulation to follow through to the desired folder.\nRecent Folders\nFavorite Folders\n\nNew Title Buttons for Improving Each Window\nMany additional title buttons available to you with Actual Window Manager:\nMinimize to the system tray\nMove to the next monitor\nAlways on top\nResize a window\nAnd much more...\n\nConfigure Each Window Individually\nConfigure your OS as you wish. With Actual Window Manager, you can set many parameters for each window individually.\nSet startup mode and position\nSet window priority.\nIgnore deactivation\nAnd much more...\n\nSplit Your Desktop\nThe divider allows you to split the entire large desktop or each monitor into several non-intersecting areas (tiles). If you place a window into one of such tiles, the window will expand up to tileÎ“Ã‡Ã–s borders only.\nYou can create as many custom tile layouts as you need and activate them on the fly, as circumstances require.\n  &lt;a href=&quot;\nhttp://s19.postimg.org/49u0zhiar/screenshot_146.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s19.postimg.org/49u0zhiar/screenshot_146.png&lt;/a&gt;\n\nActual Window Manager 8.1.2 (04.03.2014)\n---------------------------------------------------------------------------\n[+] Ability to display the picture source in desktop background slideshow\n    is added. You can open any current slideshow picture file in your default\n    picture viewer by using the &quot;Open slide&quot; command in the Desktop context\n    menu.\n[+] The automatic rotation/flipping of pictures in desktop background slideshow\n    to their original orientation is added.\n[+] Ability to specify file masks (using the &quot;*&quot; and &quot;?&quot; symbols)\n    for the Program target window criterion is added.\n[*] Windows 7: Actual Taskbar is compatible with ClassicShell Start menu.\n[*] Additional title buttons are now compatible with Stardock WindowFX.\n[*] Compatiblity with Agnitum Outpost Security Suite is restored.\n[*] Compatibility with Foxit PDF Reader is improved.\n[*] Windows 8/8.1: Actual Taskbar now correctly handles the 0% transparency\n    value and can be made opaque.\n[*] Windows 8/8.1: Now switching between running applications while keeping\n    Alt-Tab pressed is faster.\n[*] Opening the Favorite Folders context menu with many shortcuts to network\n    folders is sped up.\n[-] Windows 8/8.1: Internet Explorer 11 closed immediately when running\n    in Metro mode.\n[-] In some cases opening a new window of Internet Explorer 11 also opened\n    additional unwanted IE window.\n[-] In some cases Start menu on the main taskbar could not be invoked\n    by pressing Win or Ctrl-Esc.\n[-] Adobe Flash Installer crashed after clicking the Quit button\n    if Actual Window Manager was running.\n[-] PuTTYSessionManager crashed after closing it automatically on\n    window deactivation.\n[-] It was impossible to drop the dragged Google Chrome tab back into window\n    when the Desktop Divider facility was active.\n[-] In some cases scrolling a Google Chrome window changed unwantedly\n    the zoom level first before the scrolling started.\n[-] When scrolling a Cyberfox window with the Drag to Scroll feature\n    made the feature stuck if the mouse went outside the window.\n[-] Terratec Home Cinema window got hung if the Scroll Inactive Windows feature\n    was active.\n[-] Running Actual Window Manager stole the focus from the active window.\n[-] Gather All Windows command stopped working.\n[-] In some cases changing Actual Window Manager language made some of\n    additional title buttons and window menu commands disappear.\n[-] Some windows (like Query Builder in MS Visual Studio 2010) were falsely\n    incompatible with Desktop Divider.\n[-] Windows 8.1: Desktop Divider did not work with individual per-monitor DPI.\n[-] Desktop Divider tile preview was drawn incorrectly (without considering\n    the layout frame width).\n[-] Applying the AltMinimize feature to aBurner window did not hide its taskbar\n    button.","torrent":{"xt":"urn:btih:158bccbedcc90334ba0b24c163208419308a27c8","amp;dn":"Actual+Window+Manager+v8.1.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"158bccbedcc90334ba0b24c163208419308a27c8","infoHashBuffer":{"type":"Buffer","data":[21,139,204,190,220,201,3,52,186,11,36,193,99,32,132,25,48,138,39,200]},"announce":[],"urlList":[]}}