{"title":"German Stoner Comedy: Lammbock (English Subtitles)","uid":4719290,"size":736422957,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:15f50c3938da5f1917cba8c1a4b56d4291733d2d&amp;dn=German+Stoner+Comedy%3A+Lammbock+%28English+Subtitles%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Tall Midget","files":2,"time":1234444323,"description":"Dialogue heavy German stoner comedy with English .srt subtitles. The original subtitles made the movie unwatchable because of spelling errors and grammar in them so I corrected the English subtitles immensely. The director is influenced by Tarantino and Kevin Smith and there's even a German Jay and Silent Bob in the movie.\n\nIf you're watching this and are wondering what &quot;ÃƒÂ¤ugeln&quot; (From The German Word &quot;ÃƒÂ¤uge&quot; for Eye) means in the movie as its not easily translatable. It means to have sex with somebody in the eye socket who is missing an eye; it's also supposedly some sort of Das Boot reference.\n\nVariety Review: Wobbling between slackerish hijinx and adult sobriety, not unlike its protags, &quot;Lammbock&quot; ends up heavier on quirks than consequence. Still, amiable comedy about young pot-growing venture capitalists provides a pleasant buzz en route, bolstered by attractive cast of rising thesps. Released in late August to strong biz at German and Swiss hardtops, pic should further the fortunes of debuting helmer Christian Zubert, who co-wrote last year's similarly youth-skewed home-grown B.O. champ &quot;Girls on Top.&quot;\n\nBest buds Stefan (Lucas Gregorowicz) and Kai (Moritz Bleibtreu of &quot;Das Experiment&quot; and &quot;Run Lola Run&quot;) run a pizza delivery service that's really a front for their dealing in all things cannibis-related. Stefan, whose father is a criminal court judge, takes the threat of prosecution rather more seriously than his pal. Neither, however, suspects that new amigo Achim (Julian Weigend) is an undercover cop until it's almost too late. Pic ends on a throwaway note, with crisis all too conveniently averted. But cast makes for agreeable company, while humor avoids rote grossout material (one ill-judged incest joke aside) in favor of dialogue riffing and nicely sketched relationship conflicts. Soundtrack full o' good rock tracks completes breezy package.","torrent":{"xt":"urn:btih:15f50c3938da5f1917cba8c1a4b56d4291733d2d","amp;dn":"German+Stoner+Comedy%3A+Lammbock+%28English+Subtitles%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15f50c3938da5f1917cba8c1a4b56d4291733d2d","infoHashBuffer":{"type":"Buffer","data":[21,245,12,57,56,218,95,25,23,203,168,193,164,181,109,66,145,115,61,45]},"announce":[],"urlList":[]}}