{"title":"The Last Challenge 1967 DvdRip Mp4 Lee1001","uid":9885404,"size":842364154,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:16304184173fc7e052e69d8d15d949fad285be06&amp;dn=The+Last+Challenge+1967+DvdRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"xultfoad","files":2,"time":1396582920,"description":"The Last Challenge 1967 DvdRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0061893/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0061893/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/The_Last_Challenge_(1967)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/The_Last_Challenge_(1967)&lt;/a&gt;\nThe Last Challenge is an American western first released in 1967, directed by Richard Thorpe. The film is based on a novel by Albert Maltz and stars Glenn Ford, Angie Dickinson, Chad Everett, Gary Merrill and Jack Elam.\nA young gun wants to make his name by shooting it out with the town marshal.\n\nThe veteran Thorpe's last film, a Western gallantly attempting to ring the changes on an old situation, with Ford as the gunfighter turned marshal and yearning to settle down, Everett as the feisty youngster out to challenge him, and Dickinson as the saloon gal who doesn't want him dead.\n\nA cocky young man from Tennessee, Lot McGuire (Chad Everett), seeks to back up his notion that he's the fastest gun there is. &quot;If a man is second best, he might as well be dead,&quot; says McGuire. He travels to a town with the intention of forcing a duel with Marshal Dan Blaine (Ford), who's renowned for his skill with a gun.\n\nBrothel owner Lisa Denton (Dickinson) loves Blaine, has marriage in mind and will do anything to ensure that happens. She hires a down-and-out drifter, Scarnes (Jack Elam), to kill McGuire. Scarnes and Blaine did time together in prison for a bank robbery many years ago, after which Blaine decided to do something good with his life, and became a lawman.\n\nOutside of town, Scarnes ambushes McGuire and kills his horse, but during a shootout is gut-shot. McGuire finds out from a dying Scarnes that Lisa hired him. Lisa tells of her love for Blaine and asks Lot to leave town. He refuses.\n\nKnowing a showdown is coming, Lisa grabs a Derringer pistol and decides to kill McGuire, but a disgusted Blaine takes the gun away. The two men meet at the bar and the showdown occurs there rather than in the street. McGuire draws his revolver (which is worn in a reverse fashion) first and fires. Blaine shoots him in the chest. A stunned McGuire dies, eyes open and speechless.\n\nBlaine notices he has been shot in the side, but it is not fatal. The next day as McGuire's casket is being lowered into the ground, Blaine removes his gun and holster and throws it all into the grave. He rides out of town without a gun, as Lisa watches from the saloon steps, crying.\n\nVIDEO\nSize.... 803mb\nDuration.... 01:35:46\nCodec.... h264\nFrame Width..... 720\nFrame Height.... 358\nData Rate....1053kbps\nFrame Rate.... 23F/S\nAUDIO\nBit Rate.... 113kbps\n2 Channel Stereo\nAudio Sample Rate.... 48KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:16304184173fc7e052e69d8d15d949fad285be06","amp;dn":"The+Last+Challenge+1967+DvdRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16304184173fc7e052e69d8d15d949fad285be06","infoHashBuffer":{"type":"Buffer","data":[22,48,65,132,23,63,199,224,82,230,157,141,21,217,73,250,210,133,190,6]},"announce":[],"urlList":[]}}