{"title":"Love &amp; War - James Carville and Mary Matalin - Audiobook MP3","uid":10425296,"size":298211395,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:16bae7fff498a23c224591d13b3b8f41952330c2&amp;dn=Love+%26amp%3B+War+-+James+Carville+and+Mary+Matalin+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1403693739,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\nIf you need the single MP3 file chopped up into smaller segments, you can use Audiobook Cutter.\n\n\nLove &amp; War: Twenty Years, Three Presidents, Two Daughters and One Louisiana Home\n\nWritten by: James Carville, Mary Matalin\nNarrated by: James Carville, Mary Matalin\nLength: 10 hrs and 19 mins\nFormat: Unabridged\nRelease Date:01-07-14\nProgram Type: Audiobook\n\nFor twenty years, James Carville and Mary Matalin have held the mantle of the nation's most politically opposed, ideologically mismatched, and intensely opinionated couple. In this follow-up to their groundbreaking All's Fair: Love, War, and Running for President, Carville and Matalin take a look at how they - and America - have changed in the last two decades. If nothing else, this new collaboration proves that after twenty years of marriage they can still manage to agree on a few things.\n\nLove &amp; War traces, in their two distinct voices, James and Mary's story from the end of the 1992 presidential campaign - where he managed Bill Clinton's electoral triumph while she suffered defeat as George H. W. Bush's key strategist - till now. Mary focuses on issues of family, faith, and foreign enemies and offers insights from her kitchen table as well as the White House Cabinet Room, while James's concentration is politics and love - the triumphant and troubled Clinton era, George W. Bush's complicated presidency, the election of Barack Obama, the rise of the corrosive partisanship that dominates political life in Washington today, and the overriding, abiding romance he holds for his native Louisiana and his wife and children.\n\nTogether, the Carville-Matalins reflect on raising two daughters in the pressure cooker of the nation's capital, and their momentous 2008 decision to leave D.C. and move their family to New Orleans. Post-Katrina, James and Mary's efforts to rebuild and promote that city have become a central part of their lives - and a poignant metaphor for moving the nation forward.\n\nA fascinating look at the last two decades in American politics and an intimate, quick-witted primer on grown-up relationships and values, Love &amp; War provides unprecedented insight into one of our nation's most intriguing and powerful couples. With their natural charm and sharp intelligence, Carville and Matalin have undoubtedly written the most spirited memoir of the year. ","torrent":{"xt":"urn:btih:16bae7fff498a23c224591d13b3b8f41952330c2","amp;dn":"Love+%26amp%3B+War+-+James+Carville+and+Mary+Matalin+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16bae7fff498a23c224591d13b3b8f41952330c2","infoHashBuffer":{"type":"Buffer","data":[22,186,231,255,244,152,162,60,34,69,145,209,59,59,143,65,149,35,48,194]},"announce":[],"urlList":[]}}