{"title":"USB to Ethernet Connector 3.0","uid":4564755,"size":4308220,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:16fc5dbb756f48230b8629e65273d39ec79d115d&amp;dn=USB+to+Ethernet+Connector+3.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"world2106","files":-1,"time":1228828300,"description":"Share any USB device with others by using USB to Ethernet Connector solution\n\n    * Connect to any USB device that is located on the remote PC. Say, you need to use the USB scanner or any other USB device that is located on the remote PC. In the old days you had to get up from your seat and walk through the whole office to scan one document. Now, using USB to Ethernet technology you can simply connect to the remote USB device and work with it as it was connected directly to your local PC.\n    * Share the same USB device over network.If you own a USB printer, it doesn&amp;#039;t mean only you can use it. You can use it being in the office and your daughter can use it from her room. USB to Ethernet Connector makes it possible to share any USB device over network. Using our solution you can save money and stop buying additional equipment, as now all USB devices can be shared.\n    * &quot;Hot&quot; Plug-and-Play installation.USB to Ethernet Connector ensures hot plug-and-play installation. Thanks to it when someone plugs in the device you can connect to it from your computer (remote host). Then the device is detached and the new one is plugged in instead. The new device will automatically appear as if it was plugged in your computer. Single license of USB to Ethernet Connector allows you to install this application on two computers to provide client-server architecture.\n\nOverview\n\n    * Share an unlimited number of USB devices new!\n    * Isochronous devices are supported now new!\n    * Share your USB device with others over local network or Internet using single application\n    * Auto-connect to new USB devices whenever you plug them in\n    * Network traffic encryption for secure devices sharing\n    * Cross-connectivity: ability to connect to a USB device which is shared on x64 PC from Windows XP x32, and vice versa new!\n    * Shared USB ports are automatically re-configured every time you boot your PC\n    * Fully compatible with Windows 2000/XP/2003/x64/Vista\n    * OHCI, UHCI and EHCI standards are supported\n    * Fully compatible with HyperThreaded and multi-processor systems\n    * Works under virtual machine\n    * Single license allows you to install this application on two computers to provide client-server architecture\n    * Integrate USB to Ethernet technology into your own applications (OEM license only)\n    * Fully commented source code and lots of examples provided (OEM license only)\n\nSupported USB Devices\n\n    * Cameras\n    * Scanners\n    * Webcams\n    * USB Drives\n    * Multifunctionals\n    * Handhelds\n    * USB to Com Cables\n    * Card Readers\n    * Fingerprint Readers ","torrent":{"xt":"urn:btih:16fc5dbb756f48230b8629e65273d39ec79d115d","amp;dn":"USB+to+Ethernet+Connector+3.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16fc5dbb756f48230b8629e65273d39ec79d115d","infoHashBuffer":{"type":"Buffer","data":[22,252,93,187,117,111,72,35,11,134,41,230,82,115,211,158,199,157,17,93]},"announce":[],"urlList":[]}}