{"title":"The trailblazers (Time-Life, The Old West Series).pdf","uid":11777776,"size":47669592,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:17419b3803d847dea01d3e0f4eda9737986bc41b&amp;dn=The+trailblazers+%28Time-Life%2C+The+Old+West+Series%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":1,"time":1427401192,"description":"pdf / English / 1973 Time-Life / 236 pages / 45.4 MB\n\nA highly attractive book from its leather engraved cover to its beautiful illustrations, maps and sketches. The subject matter is very well written and structured, especially for the novice of western U.S. exploration. We see, through the efforts of many men and decades of hit and miss exploratory attempts, how the many pieces of the geographical puzzle gradually come together to shape what we know today as the American West. From the unyielding endeavors of Lewis and Clark, the fur trappers/traders, military, surveyors, etc. this is a wonderful and easily readable book. The only ostentatious scar in the readings is how Gilbert once again, (see reviews under his &quot;Westering Man: The Life of Joseph Walker&quot; on Amazon) downplays the character, efforts and accomplishments of Jedediah Smith in favor of his hero, Joseph Walker. With all due respect, and without a doubt, Walker was amongst the giants of early western expansionism and contributed immensely to geographical knowledge. There is, in my opinion, no reason to incessantly reiterate the magnificance or idiosyncrasies of one over the other, both men contributed so much to the geography of the west","torrent":{"xt":"urn:btih:17419b3803d847dea01d3e0f4eda9737986bc41b","amp;dn":"The+trailblazers+%28Time-Life%2C+The+Old+West+Series%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17419b3803d847dea01d3e0f4eda9737986bc41b","infoHashBuffer":{"type":"Buffer","data":[23,65,155,56,3,216,71,222,160,29,62,15,78,218,151,55,152,107,196,27]},"announce":[],"urlList":[]}}