{"title":"National Geographic - D-Day_Men and Machines [DVDRIP][Spa-Eng]","uid":3371271,"size":748849314,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1863ffd46e49198a7fc166bb5471aae0db8f6ff7&amp;dn=National+Geographic+-+D-Day_Men+and+Machines+%5BDVDRIP%5D%5BSpa-Eng%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pctorrent","files":5,"time":1124327347,"description":"D-Day: Men and Machines\n? Windfall Films for NGCI and Five\n? Producer/ director: Mark Lewis\n? Producer: Ana ? Paula Lloyd\n? Executive producer: Ian Duncan\n? Running time: 95 mins\n\nD-Day: Men and Machines, a feature-length factual drama has been produced by award-winning UK independent, Windfall Films.\n\nCommissioned by Five?s Controller of History, Alex Sutherland, and NGCI?s Janet Han Vissering, Senior VP of Program Sales &amp; Co-Financing, D-Day: Men and Machines will air first on Five, followed on multichannel, National Geographic Channel on the D-Day anniversary - Sunday 06 June.\n\nUsing epic drama to tell a factual story, D-Day: Men and Machines reveals how the attack was planned and executed, not only by the greatest military minds and fearless soldiers but by a maverick collection of inventors and boffins, toiling away behind the scenes.\n\nProduced and directed by Mark Lewis (The Real Ned Kelly, C4/NGC; The Anatomists, C4; Secrets of the Dead, C4) reconstructions, interviews and archive footage detail the incredible minds and machines behind the greatest amphibious invasion in history.\n\nD-Day: Men and Machines was shot in France, USA and the UK. Actual locations were used including Omaha Beach, the airborne training school at Fort Benning and the swamps of the Mississippi. Other locations used for drama sequences included Shepperton Studios and the beaches of Norfolk.\n\nThe reconstructions were filmed with a production team of over twenty technical and production staff, using five cameras, thirty actors, a full pyrotechnic team, two specially reconstructed landing craft and two 30-ton Sherman tanks - augmented by CGI.\n\nJeff Baines, DOP, created hyper-real drama sequences by mixing DigiBeta footage with 16mm film footage in order to achieve an authentic feel. By using meticulous reconstruction and hand-cranked cameras ? Bell and Howell and Bolex ? the drama of the daring D-Day invasion has been recreated. Colour-graded in post-production, D-Day: Men and Machines captures the gritty feel of WWII footage but in colour.\n\nNotable scenes include: a ?DD? floating tank which is the first to be re-built and tested since 1944; a US coastguard coxswain re-united for first time in 60 years with a landing craft; filming back on the real ?Pegasus Bridge?; Veterans from the bloodiest massacre meet on the same beach they fought on and confront their feelings ? an American infantry men, an English Royal Navy landing craft commander and a German centurion who was gunning from the top of the hill.\n","torrent":{"xt":"urn:btih:1863ffd46e49198a7fc166bb5471aae0db8f6ff7","amp;dn":"National+Geographic+-+D-Day_Men+and+Machines+%5BDVDRIP%5D%5BSpa-Eng%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1863ffd46e49198a7fc166bb5471aae0db8f6ff7","infoHashBuffer":{"type":"Buffer","data":[24,99,255,212,110,73,25,138,127,193,102,187,84,113,170,224,219,143,111,247]},"announce":[],"urlList":[]}}