{"title":"Amara Flash Suite 2.0 inc Serials","uid":4261057,"size":14345452,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:188ab5d7acf24c5b6f7dfb3a4557dc9f9392fd0c&amp;dn=Amara+Flash+Suite+2.0+inc+Serials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Emma241984","files":13,"time":1214440554,"description":"**************************************************************\nAmara Flash Suite 2.0[TCRG]\n**************************************************************\n\n\n\n\nThis suite contain all 5 animation applications: News Ticker, Menu Builder, Intro-Banner Builder, Slideshow Builder, and Photo Animation Software.\n\nAmara Software provides affordable animation software solutions to create a wide variety of Flash Player compatible text and photo effects and web animations. Its saves your creations in the popular SWF file format, which can be used in any website and viewed in the Adobe Flash Player. No knowledge of Flash is needed to create animations with Amara Softwares.\n\n\nNews Ticker creates horizontal and vertical Flash Player compatible news tickers instantly. It only takes a few quick steps to create a complete news ticker or scroller. No knowledge of Flash required to use our software.\n\nIntro and Banner Builder is the ultimate Flash Player compatible text effect tool to help web designers create and design animated intros, ads, banners, and any other textual animation. No knowledge of Flash required.\n\nMenu and Button Maker creates horizontal and vertical Flash Player compatible menus for your website fast and easily. Create navigation bars, scrolling menus with sub menus in minutes. No knowledge of Flash required.\n\nSlideshow Builder is a low-cost no-nonsense Flash Player compatible slideshow builder to help web designers create and design animated slideshows. No knowledge of Flash is required to build slide shows or photo albums.\n\nPhoto Animation Software lets you create professional Flash Player compatible virtual tours through your still photos via keypoints you insert, to guide your website visitors along an animated path in each photo.\n\n**************************************************************\nBrought To You By TCRG of\n**************************************************************","torrent":{"xt":"urn:btih:188ab5d7acf24c5b6f7dfb3a4557dc9f9392fd0c","amp;dn":"Amara+Flash+Suite+2.0+inc+Serials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"188ab5d7acf24c5b6f7dfb3a4557dc9f9392fd0c","infoHashBuffer":{"type":"Buffer","data":[24,138,181,215,172,242,76,91,111,125,251,58,69,87,220,159,147,146,253,12]},"announce":[],"urlList":[]}}