{"title":"Smoking Popes - Destination Failure [1997]","uid":9634009,"size":364155802,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:191f2e0ee48e17d05a2c72bae59a6aef54f67c5e&amp;dn=Smoking+Popes+-+Destination+Failure+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GenXRock","files":-1,"time":1392824003,"description":"Review by Jack Rabid  [-]\nTo call Smoking Popes merely pop-punk would be a grotesque disservice -- they've been excelling at it for years. The problem is the image such a description (or genre name) conjures: a mediocre group who plays a fifth as well as the bands who founded punk in the '70s, with lyrics that are dim-witted, simplistic, dull, or immature, and tunes that are stiff, forced, and/or plain. We hold these truths to be self-evident, especially since Descendents re-formed to disrobe all the new, shabby pretenders, and to remind us of the melodious glory the genre used to radiate. As for this actually &quot;smoking&quot; Chicago quartet, they not only avoid such pitfalls, they humbly offer a singular style that is actually power pop in the early-'70s and early-'80s tradition -- from the young Todd Rundgren to the Fabulous Poodles. And with earlier efforts, such as 1994's Born to Quit on the little Johan's Face label (here's a rare band that has greatly improved on a major), these likable pontiffs have an earnestness and wound-licking vulnerability to match Descendents' Auckerman, without Milo's more bawdy edges. With a singer in Josh Caterer who can make the most melancholic, fretting passage seem like a whistling, carefree, Willie Wonka-kissed day (and who still sounds like a cross between XTC's Andy Partridge and Gilbert O'Sullivan) and a band who is gleeful, but not in a churlish-youthful way, Smoking Popes are one of the most deceptively pleasant-sounding bands going. So much so that their bite has to sneak up on you. And with such undeniably delicious and catchy fare as &quot;No More Smiles,&quot; it's as easy to root for these folks in the difficulties their words pose as it is to continuously play their records. (3/5)","torrent":{"xt":"urn:btih:191f2e0ee48e17d05a2c72bae59a6aef54f67c5e","amp;dn":"Smoking+Popes+-+Destination+Failure+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"191f2e0ee48e17d05a2c72bae59a6aef54f67c5e","infoHashBuffer":{"type":"Buffer","data":[25,31,46,14,228,142,23,208,90,44,114,186,229,154,106,239,84,246,124,94]},"announce":[],"urlList":[]}}