{"title":"Heaven on Earth - The Rise and Fall of Socialism","uid":4507060,"size":1625152788,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1a2d424d33e829c67e8e12fadbe924b2adb93831&amp;dn=Heaven+on+Earth+-+The+Rise+and+Fall+of+Socialism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"apache69","files":3,"time":1226630762,"description":"HEAVEN ON EARTH: The Rise and Fall of Socialism\nA Think Tank Special\n\nA 3 hour documentary series produced by New River Media and BJW, Inc.\n\n&quot;Most of the people in the world today call the name of their dream Socialism.&quot; - Michael Harrington, 1968\n\nMuch of the history of the past 200 years revolved around a single idea. It was the vision that life could be lived in peace and brotherhood if only property were shared by all and distributed equally, eliminating the source of greed, envy, poverty and strife. This idea was called &quot;socialism&quot; and it was man&amp;#039;s most ambitious attempt to supplant religion with a doctrine grounded on science rather than revelation.\n\nIt became the most popular political idea in history. Its provenance was European, but it spread to China and Africa, India and Latin America and even to that most tradition-bound of regions, the Middle East. While it never fully took root in America, its influence shaped the nation&amp;#039;s political debate. At its crest in the 1970s, roughly 60 percent of the earth&amp;#039;s population lived under governments that espoused socialism in one form or another. Then, suddenly, it all collapsed.\n\nBecause its goal proved so elusive, the socialist movement split and split again into diverse, sometimes murderously contradictory forms. There was Social Democracy, which insisted that only peaceful and democratic means could produce a harmonious commonwealth. There was Communism, which extolled the resolute use of force and dictatorship to propel mankind to a new way of life. There was Arab Socialism, African Socialism, and other Third World variants that sought to amalgamate western Social Democracy and eastern Communism. There was even fascism, which turned the socialist idea on its head by substituting the brotherhood of nation and race for the brotherhood of class. And there were those - from early American settlers, to the &quot;flower children&quot; of the 1960s, to Israeli Zionist kibbutzniks - who built their own socialist communities, hoping to transform the world by the force of example.\n\nAs an idea that changed the way people thought, socialism&amp;#039;s success was spectacular. As a critique of capitalism that helped spawn modern social safety nets and welfare states, its success was appreciable. As a model for the development of post-colonial states, the socialist model proved disappointing, fostering economic stagnation among millions of the world&amp;#039;s poorest people. And in its most violent forms, socialism was calamitous, claiming scores of millions of lives and helping to make the twentieth century the bloodiest ever.\n\nThrough profiles of the individuals that brought socialism to life, HEAVEN ON EARTH tells the story of how an idea arose, evolved, changed the world, and eventually fell.\n\n...............................\n\nPART I: THE RISE\n\nROBERT OWEN AND UTOPIAN SOCIALISM\nIn 1825 a progressive British industrialist travels to America to create a utopian community. Owen believes that abolishing private property will liberate mankind.\n\nMARX AND ENGELS: BIRTH OF A MANIFESTO\nTwo young Germans forge a friendship that gives birth to the Communist Manifesto. Their analysis of history as a struggle between classes and their prophecy of the inevitable overthrow of capitalism define the movement.\n\nEDUARD BERNSTEIN AND A CRISIS OF FAITH\nAt the end of the 19th century, the intellectual heir of Marxism tries to reconcile the prediction of labor&amp;#039;s revolt with the reality of improved working conditions. The movement splits, Communism and Social Democracy part ways.\n\nLENIN AND THE BOLSHEVIK REVOLUTION\nVladimir Lenin responds to Bernstein&amp;#039;s critique by igniting a violent revolution and creating the Union of Soviet Socialist Republics.\n\nSAMUEL GOMPERS AND AMERICAN LABOR\nWhile Europe faces revolution, American workers are organized by a former cigar-maker. Gompers rejects socialism and helps give birth to the American Federation of Labor.\n\nCANADIAN SOCIALISM\nAmerican farmers&amp;#039; organizations head north, leading to the creation of the Cooperative Commonwealth Federation, the C.C.F.\n\n...............................\n\nPART II: REVOLUTIONS\n\nMUSSOLINI AND FASCISM\nInspired by Lenin&amp;#039;s Russian revolution, Italy&amp;#039;s Benito Mussolini embraces socialism and joins forces with Adolf Hitler to create National Socialism, or fascism.\n\nCHINA AND THE SPREAD OF COMMUNISM\nFollowing World War II, Mao Zedong reforms China through nationalized industry, collectivized agriculture and complete state control over every aspect of daily life.\n\nCLEMENT ATTLEE AND SOCIAL DEMOCRACY\nIn Britain, a different kind of socialism takes hold after the Second World War, democratic socialism. Attlee&amp;#039;s Labour Party creates a comprehensive social welfare system and nationalizes major British industries.\n\nTHE KIBBUTZ\nThe Zionist movement in Israel creates collective socialist villages called kibbutzim. Residents of Kibbutz Ginosar describe the early years of this communal experiment.\n\nJULIUS NYERERE AND THIRD WORLD SOCIALISM\nWith the end of British colonial rule, Julius &quot;Mwalimu&quot; Nyerere turns to socialism to reshape Tanzania. He blends the teachings of Marx with African traditions to create what is heralded as the developing world&amp;#039;s alternative to Soviet-style communism.\n\nGREAT BRITAIN IN THE 1970s\nEconomic stagnation challenges the Labour Party&amp;#039;s hold on British politics and opens the door for Margaret Thatcher&amp;#039;s conservative government.\n\nTHE KIBBUTZ PART II\nAs the second generation comes of age on the kibbutz, these socialist communities gradually move away from collectivism.\n\nTANZANIA&amp;#039;S UJAMAA VILLAGES\nImpatient with the lack of socialist progress, Nyerere begins to force Tanzanian&amp;#039;s to adopt his vision of the ideal collective society.\n\n...............................\n\nPART III: THE COLLAPSE\n\nGORBACHEV AND REFORM\nMikhail Gorbachev confronts the violent past of Stalinism, but his efforts to bring a new openness to Soviet life have unintended consequences.\n\nDENG XIAOPING AND MODERNIZATION\nIn the 1980s, Deng de-collectivizes the communes that formed the soul of the Chinese Communist revolution. His reforms look suspiciously like capitalism.\n\nGORBACHEV AND REVOLUTION\nGorbachev&amp;#039;s efforts to reform socialism in the Soviet Union unleash forces that unravel the State&amp;#039;s control and lead to a complete transformation of the Communist world.\n\nTONY BLAIR AND NEW LABOUR\nBlair transforms Attlee&amp;#039;s socialist Labour Party into &quot;the party of business.&quot;\n\nTHE FUTURE OF SOCIALISM\nSocialists and capitalists debate the impact of the collapse of communism and the political reversals of Social Democratic parties across Europe. Some ask whether the very definition of socialism is changing.\n\nTHE KIBBUTZ PART III\nResidents of Kibbutz Ginosar observe how market forces are transforming their community.","torrent":{"xt":"urn:btih:1a2d424d33e829c67e8e12fadbe924b2adb93831","amp;dn":"Heaven+on+Earth+-+The+Rise+and+Fall+of+Socialism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a2d424d33e829c67e8e12fadbe924b2adb93831","infoHashBuffer":{"type":"Buffer","data":[26,45,66,77,51,232,41,198,126,142,18,250,219,233,36,178,173,185,56,49]},"announce":[],"urlList":[]}}