{"title":"Privateer 2 The Darkening (GOG)","uid":9240851,"size":1577064462,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1aafba14129a564fab26c72aecfa985507cd2e6f&amp;dn=Privateer+2+The+Darkening+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Sarah116","files":7,"time":1385273429,"description":"Hey guys, here privateer 2. Srry it took so long. Hope you guys enjoy and please help me seed. Game info below.\n\n &lt;a href=&quot;\nhttp://www.gog.com/game/privateer_2_the_darkening&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/game/privateer_2_the_darkening&lt;/a&gt;\n\n\nClive Owen, John Hurt, Christopher Walken, and David Warner are your guides through the seamy underworld of Privateer 2.\nExplore and exploit the universe as you see fit - either as a peaceful trader or a battle-hardened mercenary.\nShady deals, deep space battles, and fast bucks are the standards you must live by if you're going to amass enough firepower and information to stand any chance of success.\n\n\nYou regain consciousness and the unfamiliar faces surrounding you inform you that you've lost your ship in an unfortunate accident. The cutthroat world of the Tri-System privateers greets you with a clenched fist and a knife pointed at your back. Your only order of business is survival. You've got just enough credits to afford something resembling a new ship. It takes more than just a bucket of bolts to make it in this world; you'll need upgrades, and most important of all: money. The sector is brimming with &quot;business&quot; opportunities, but who can you trust? Legal or not, it's time to trade, travel, and battle your way through a place where high risk equals high reward and only those with the brass reap the rewards.\n\nPrivateer 2: The Darkening is the premier open universe space trading and combat sim. Blaze your own path through the Tri-System by either hook or crook. Take any mission you see fit, without rules or restrictions. Corner the market as you work out trade routes with the most reward. The universe is waiting for you, Privateer.","torrent":{"xt":"urn:btih:1aafba14129a564fab26c72aecfa985507cd2e6f","amp;dn":"Privateer+2+The+Darkening+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1aafba14129a564fab26c72aecfa985507cd2e6f","infoHashBuffer":{"type":"Buffer","data":[26,175,186,20,18,154,86,79,171,38,199,42,236,250,152,85,7,205,46,111]},"announce":[],"urlList":[]}}