{"title":"The Man of Numbers: Fibonacci's Arithmetic Revolution","uid":8238841,"size":287178,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ac3997741268ffcd526bee2097e472b6fa8dc9b&amp;dn=The+Man+of+Numbers%3A+Fibonacci%27s+Arithmetic+Revolution&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1362874969,"description":"Keith J. Devlin, &quot;The Man of Numbers: Fibonacci's Arithmetic Revolution&quot;\nISBN: 1408815761 | 2011 | EPUB\n\nIn 1202, a 32-year old Italian finished one of the most influential books of all time, which introduced modern arithmetic to Western Europe. Devised in India in the 7th and 8th centuries and brought to North Africa by Muslim traders, the Hindu-Arabic system helped transform the West into the dominant force in science, technology, and commerce, leaving behind Muslim cultures which had long known it but had failed to see its potential.\nThe young Italian, Leonardo of Pisa (better known today as Fibonacci), had learned the Hindu number system when he traveled to North Africa with his father, a customs agent. The book he created was Liber abbaci, the &quot;Book of Calculation,&quot; and the revolution that followed its publication was enormous. Arithmetic made it possible for ordinary people to buy and sell goods, convert currencies, and keep accurate records of possessions more readily than ever before. Liber abbaci's publication led directly to large-scale international commerce and the scientific revolution of the Renaissance.\nYet despite the ubiquity of his discoveries, Leonardo of Pisa remains an enigma. His name is best known today in association with an exercise in Liber abbaci whose solution gives rise to a sequence of numbers--the Fibonacci sequence--used by some to predict the rise and fall of financial markets, and evident in myriad biological structures.","torrent":{"xt":"urn:btih:1ac3997741268ffcd526bee2097e472b6fa8dc9b","amp;dn":"The+Man+of+Numbers%3A+Fibonacci%27s+Arithmetic+Revolution","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ac3997741268ffcd526bee2097e472b6fa8dc9b","infoHashBuffer":{"type":"Buffer","data":[26,195,153,119,65,38,143,252,213,38,190,226,9,126,71,43,111,168,220,155]},"announce":[],"urlList":[]}}