{"title":"Tropic of Chaos: Climate Change and the New Geography of Violenc","uid":9017098,"size":669270,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1af4410d154c4e72494270d504a02db0d8a5dabe&amp;dn=Tropic+of+Chaos%3A+Climate+Change+and+the+New+Geography+of+Violenc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Djofullinn","files":-1,"time":1381210206,"description":"Christian Parenti, &quot;Tropic of Chaos: Climate Change and the New Geography of Violence&quot;\nEnglish | 2012-09-04 | ISBN: 1568587295 | 312 pages | EPUB | 653 kb\n\nFrom Africa to Asia and Latin America, the era of climate wars has begun. Extreme weather is breeding banditry, humanitarian crisis, and state failure.\n\nIn Tropic of Chaos, investigative journalist Christian Parenti travels along the front lines of this gathering catastrophe--the belt of economically and politically battered postcolonial nations and war zones girding the planet's midlatitudes. Here he finds failed states amid climatic disasters. But he also reveals the unsettling presence of Western military forces and explains how they see an opportunity in the crisis to prepare for open-ended global counterinsurgency.\n\nParenti argues that this incipient &quot;climate fascism&quot;--a political hardening of wealthy states-- is bound to fail. The struggling states of the developing world cannot be allowed to collapse, as they will take other nations down as well. Instead, we must work to meet the challenge of climate-driven violence with a very different set of sustainable economic and development policies.","torrent":{"xt":"urn:btih:1af4410d154c4e72494270d504a02db0d8a5dabe","amp;dn":"Tropic+of+Chaos%3A+Climate+Change+and+the+New+Geography+of+Violenc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1af4410d154c4e72494270d504a02db0d8a5dabe","infoHashBuffer":{"type":"Buffer","data":[26,244,65,13,21,76,78,114,73,66,112,213,4,160,45,176,216,165,218,190]},"announce":[],"urlList":[]}}