{"title":"Police Academy 1-7 (1984-1994) DVDRip Xvid DutchReleaseTeam [Act","uid":6073099,"size":5229065577,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1b333c83cad2c6778b6a6b3f24cf92ab69dab287&amp;dn=Police+Academy+1-7+%281984-1994%29+DVDRip+Xvid+DutchReleaseTeam+%5BAct&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Koedje","files":11,"time":1293709041,"description":"Deel 1:\n &lt;a href=&quot;\nhttp://img823.imageshack.us/img823/9479/policeacademy1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img823.imageshack.us/img823/9479/policeacademy1.jpg&lt;/a&gt;\n\n\nVerenigde Staten\nKomedie\n95 minuten\n\ngeregisseerd door Hugh Wilson\nmet Steve Guttenberg, Kim Cattrall en G.W. Bailey\n\nIn verband met een tekort aan agenten wordt besloten tot een versoepeling van de eisen bij toetreding tot de politiemacht. Hierdoor kunnen mensen die eigenlijk niet geschikt zijn toch agent worden, tot ergernis van de instructeurs.\n\n\n\n\n\n\n\n\nDeel 2:\n &lt;a href=&quot;\nhttp://img405.imageshack.us/img405/716/policeacademy2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img405.imageshack.us/img405/716/policeacademy2.jpg&lt;/a&gt;\n\n\nVerenigde Staten\nKomedie\n97 minuten\n\ngeregisseerd door Jerry Paris\nmet Steve Guttenberg, Bubba Smith en David Graf\n\nDe agenten uit Police Academy I hebben hun opleiding afgerond, en kunnen aan hun eerste opdracht beginnen: het optreden tegen een graffiti-verspreidende bende.\n\n\n\n\n\n\n\n\nDeel 3:\n &lt;a href=&quot;\nhttp://img143.imageshack.us/img143/5715/policeacademy3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img143.imageshack.us/img143/5715/policeacademy3.jpg&lt;/a&gt;\n\nVerenigde Staten\nKomedie\n83 minuten\n\ngeregisseerd door Jerry Paris\nmet Steve Guttenberg, Bubba Smith en David Graf\n\nGouverneur Neilson heeft aangekondigt dat hij vanwege budgetaire redenen een van de twee politiescholen zal sluiten. Welke moet verdwijnen hangt af van het rapport van de evaluatiecommissie. De kans is zeer groot dat het de politieschool van commandant Lassard is die opgedoekt wordt. De recruten zijn ook nu weer ontzettend lomp, naiÃƒÂ«f, onbeholpen en ongedisciplineerd. In allerijl worden de afgestudeerden van de politieschool opgetrommeld. Mahoney, Tackleberry, Hightower, Hooks, Jones en Callahan moeten de nieuwe lichting zo opleiden dat ze de recruten van commandant Mauser kunnen verslaan.\n\n\n\n\n\n\n\nDeel 4:\n &lt;a href=&quot;\nhttp://img251.imageshack.us/img251/9106/policeacademy4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img251.imageshack.us/img251/9106/policeacademy4.jpg&lt;/a&gt;\n\nVerenigde Staten\nKomedie\n88 minuten\n\ngeregisseerd door Jim Drake\nmet Steve Guttenberg, Bubba Smith en Michael Winslow\n\nCommandant Lassard vindt het frustrerend dat het publiek agenten als vijanden ziet. Hierdoor worden talrijke misdaden nooit opgelost. Hij wil hier verandering in brengen door een burgerwacht op te richten. De burgemeester heeft zijn zegen al gegeven en ook de gouverneur steunt het initiatief. Hij dringt er zelfs op aan dat Lassard het project voorstelt op een internationaal congres. Dit houdt natuurlijk in dat Lassard het project niet persoonlijk kan opstarten. Hij laat de rekrutering en de opleiding van de kandidaten dan maar over aan zijn trouwe instructeurs. Zij gaan op pad in hun oude buurt om burgers te vinden die aan de cursus willen deelnemen. Natuurlijk komen die terug met een stel overenthousiaste, maar oerdomme kandidaten.\n\n\n\n\n\n\n\n\nDeel 5:\n &lt;a href=&quot;\nhttp://img545.imageshack.us/img545/1489/policeacademy5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img545.imageshack.us/img545/1489/policeacademy5.jpg&lt;/a&gt;\n\n\nVerenigde Staten\nKomedie\n90 minuten\n\ngeregisseerd door Alan Myerson\nmet Bubba Smith, David Graf en Michael Winslow\n\nTijdens de diploma-uitreiking van de politieschool kondigt commissaris Hurst aan dat Lassard met pensioen gaat. Het nieuws slaat in als een bom, niet alleen voor de commandant zelf maar ook voor zijn trouwe leerlingen. Er bestaat geen twijfel over dat Harris hier iets mee te maken heeft. Hij aast immers al een hele tijd op de baan van de commandant. Hurst meldt ook dat Lassard benoemd zal worden tot agent van het decennium tijdens de nationale conventie in Miami Beach. Lassard wil dat zijn leerlingen aanwezig zijn op de huldiging en betaalt hun tickets. In het vliegtuig zitten ook drie gangsters, die net een geslaagde diamantroof gepleegd hebben. Bij hun aankomst in Miami neemt Lassard per ongeluk hun tas mee. Ondertussen zijn ook Harris en zijn assistent Proctor aangekomen.\n\n\n\n\n\n\n\n\nDeel 6:\n &lt;a href=&quot;\nhttp://img228.imageshack.us/img228/7162/policeacademy6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img228.imageshack.us/img228/7162/policeacademy6.jpg&lt;/a&gt;\n\n\nVerenigde Staten\nKomedie\n84 minuten\n\ngeregisseerd door Peter Bonerz\nmet Bubba Smith, David Graf en Michael Winslow\n\nDe wijk Wilson Height wordt geteisterd door een bende dieven. Dit is ontzettend gÃƒÂªnant voor Harris, die verantwoordelijk is voor die regio. Aangezien hij en zijn hulpje Proctor de situatie niet de baas kunnen, roept de burgemeester versterking in. Hij vraagt commandant Lassard en zijn team om orde op zaken te stellen. Wanneer de bende zelfs hen te snel af is, wordt vermoed dat er een lek is in het politieapparaat. Dit wordt al snel bevestigd. In het kantoor van Lassard is immers een deel van de gestolen diamanten gevonden.\n\n\n\n\n\n\n\n\nDeel 7:\n &lt;a href=&quot;\nhttp://img254.imageshack.us/img254/1452/policeacademy7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img254.imageshack.us/img254/1452/policeacademy7.jpg&lt;/a&gt;\n\n\nVerenigde Staten\nKomedie\n83 minuten\n\ngeregisseerd door Alan Metter\nmet George Gaynes, Michael Winslow en David Graf\n\nMoskou is helemaal in de ban van de peetvader van de Russische maffia. Door middel van een nieuw videospelletje wil de snoodaard in alle informaticabronnen ter wereld infiltreren. Zo hoopt hij de machtigste man op aarde te worden. Gelukkig zijn er nog de onvermeende klungelaars van de Police Academy. Ze worden naar Moskou gezonden voor een speciale missie om een einde te maken aan de alleenheerschappij van de maffioso.\n\n\n\n\n\nMeer zien? Kijk dan op - http://hetmultimediacafe.nl/index.php\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:1b333c83cad2c6778b6a6b3f24cf92ab69dab287","amp;dn":"Police+Academy+1-7+%281984-1994%29+DVDRip+Xvid+DutchReleaseTeam+%5BAct","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b333c83cad2c6778b6a6b3f24cf92ab69dab287","infoHashBuffer":{"type":"Buffer","data":[27,51,60,131,202,210,198,119,139,106,107,63,36,207,146,171,105,218,178,135]},"announce":[],"urlList":[]}}