{"title":"The Dawkins Delusion? - Alister and Joanna McGrath","uid":11773422,"size":1157765,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ba8142c243ea1ff063502d154440401ba7deed8&amp;dn=The+Dawkins+Delusion%3F+-+Alister+and+Joanna+McGrath&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":1,"time":1427167375,"description":"\n\nThe Dawkins Delusion?: Atheist Fundamentalism and the Denial of the Divine\n2008 Christian Bookseller's Covention Book of the Year Award winner!\n\nWorld-renowned scientist Richard Dawkins writes in The God Delusion: &quot;If this book works as I intend, religious readers who open it will be atheists when they put it down.&quot; The volume has received wide coverage, fueled much passionate debate and caused not a little confusion. Alister McGrath, along with his wife, Joanna, are ideal to evaluate Dawkins's ideas. Once an atheist himself, he gained a doctorate in molecular biophysics before going on to become a leading Christian theologian. He wonders how two people, who have reflected at length on substantially the same world, could possibly have come to such different conclusions about God. McGrath subjects Dawkins's critique of faith to rigorous scrutiny. His exhilarating, meticulously argued response deals with questions such as\n-Is faith intellectual nonsense?\n-Are science and religion locked in a battle to the death?\n-Can the roots of Christianity be explained away scientifically?\n-Is Christianity simply a force for evil?\n\nThis book will be warmly received by those looking for a reliable assessment of The God Delusion and the many questions it raises--including, above all, the relevance of faith and the quest for meaning.\n\n\nAbout the author:\nAlister Edgar McGrath (born 23 January 1953) is a Northern Irish theologian, priest, intellectual historian, scientist, and Christian apologist. He currently holds the Andreas Idreos Professorship in Science and Religion in the Faculty of Theology and Religion at the University of Oxford. He was previously Professor of Theology, Ministry, and Education at King's College London and Head of the Centre for Theology, Religion and Culture., Professor of Historical Theology at the University of Oxford, and was principal of Wycliffe Hall, Oxford, until 2005. He is an Anglican priest and is ordained within the Church of England.\n\nAside from being a faculty member at Oxford, McGrath has also taught at Cambridge University and is a Teaching Fellow at Regent College. McGrath holds three doctorates from the University of Oxford, a DPhil in Molecular Biophysics, a Doctor of Divinity in Theology and a Doctor of Letters in Intellectual History.\n\nMcGrath is noted for his work in historical theology, systematic theology, and the relationship between science and religion, as well as his writings on apologetics. He is also known for his opposition to New Atheism and antireligionism and his advocacy of theological critical realism. Among his best-known books are The Twilight of Atheism, The Dawkins Delusion, Dawkins' God: Genes, Memes, and the Meaning of Life, and A Scientific Theology. He is also the author of a number of popular textbooks on theology","torrent":{"xt":"urn:btih:1ba8142c243ea1ff063502d154440401ba7deed8","amp;dn":"The+Dawkins+Delusion%3F+-+Alister+and+Joanna+McGrath","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ba8142c243ea1ff063502d154440401ba7deed8","infoHashBuffer":{"type":"Buffer","data":[27,168,20,44,36,62,161,255,6,53,2,209,84,68,4,1,186,125,238,216]},"announce":[],"urlList":[]}}