{"title":"You Don't Want To Know - Lisa Jackson.epub","uid":9345990,"size":1016621,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1cb764fdcb1c0dfc4f70b1eb47e0b757575022e5&amp;dn=You+Don%27t+Want+To+Know+-+Lisa+Jackson.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387040788,"description":"Bestselling author Jackson deftly takes readers to the edge of sanity--and back--in a gripping novel where a mother's worst fear is only the beginning of a terrifying nightmare, and the truth is more dangerous than she can imagine.\n\nNothing\n\nLife as Ava Garrison knew it ended the day her toddler son Noah went missing. In the two years since, she's been in and out of Seattle mental institutions, existing in a fog of grief. Noah's body was never found, and everyone assumed he drowned after falling off a dock. Until recently, Ava thought so too. . .\n\nIs More Dangerous\n\nSince she moved back home, Ava has experienced unsettling visions. She hears Noah crying in the nursery, glimpses him walking near the water. Her family, her psychologist, and her estranged husband are concerned for her well-being. Or are they worried about what she might discover?\n\nThan The Truth\n\nDid Noah really die, or is Ava losing her sanity? The deeper into her memories she goes, the more fearful she becomes. Ava thought her son's disappearance was the worst thing that could happen to her. But before this nightmare ends, she'll discover how terrifying the truth can be. . .","torrent":{"xt":"urn:btih:1cb764fdcb1c0dfc4f70b1eb47e0b757575022e5","amp;dn":"You+Don%27t+Want+To+Know+-+Lisa+Jackson.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cb764fdcb1c0dfc4f70b1eb47e0b757575022e5","infoHashBuffer":{"type":"Buffer","data":[28,183,100,253,203,28,13,252,79,112,177,235,71,224,183,87,87,80,34,229]},"announce":[],"urlList":[]}}