{"title":"The Burglary: The Discovery...(2014) Betty Medsger (multi)","uid":9506062,"size":19504998,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d2a45a9293fe3e87ac31f267d6a02d441b4a82f&amp;dn=The+Burglary%3A+The+Discovery...%282014%29+Betty+Medsger+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"7","files":-1,"time":1390319794,"description":"The Burglary: The Discovery of J Edgar Hoover's Secret FBI (2014) Betty Medsger (multi)\nThe Discovery of J. Edgar Hoover's Secret FBI by Betty Medsger\n\n\nFormat: mobi/epub/azw3\nLength: 608 pages\nGenre: History\nDate: 7 January 2014\n\nThe never-before-told full story of the 1971 history-changing break-in of the FBI offices in Media, Pennsylvania, by a group of unlikely activists--quiet, ordinary, hardworking Americans--that made clear the shocking truth and confirmed what some had long suspected, that J. Edgar Hoover had created and was operating his own shadow Bureau of Investigation.\n\nThe book shows how the break-in, and subsequent release of the contents of the FBI's files to newspapers across the country, upended the public's perception of the up-till-then inviolate head of the Bureau, paving the way for the FBI's overhaul for the first time since its inception forty-seven years before, in 1924, and setting the stage for the sensational release three months later by Daniel Ellsberg of the top-secret seven-thousand-page Pentagon study of U.S. decision making regarding the Vietnam War that became known as the Pentagon Papers.\n\nAuthor:\n\nBetty Medsger was born in Johnstown, Pennsylvania. She began covering the FBI break-in as a reporter for The Washington Post. Medsger, after many years, found the burglars and persuaded each to break his silence. Medsger is a former chair of the Department of Journalism at San Francisco State University and is the founder of its Center for Integration and Improvement of Journalism. ","torrent":{"xt":"urn:btih:1d2a45a9293fe3e87ac31f267d6a02d441b4a82f","amp;dn":"The+Burglary%3A+The+Discovery...%282014%29+Betty+Medsger+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d2a45a9293fe3e87ac31f267d6a02d441b4a82f","infoHashBuffer":{"type":"Buffer","data":[29,42,69,169,41,63,227,232,122,195,31,38,125,106,2,212,65,180,168,47]},"announce":[],"urlList":[]}}