{"title":"Sherlock Holmes - The Man Who Never Lived and Will Never Die (gn","uid":13576407,"size":26708428,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d478e73d55aaa07c82bd75bd2b12a354052aed5&amp;dn=Sherlock+Holmes+-+The+Man+Who+Never+Lived+and+Will+Never+Die+%28gn&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gnv65","files":5,"time":1455713993,"description":"Sherlock Holmes - The Man Who Never Lived and Will Never Die\r\nby Alex Werner\r\nEbury Digital | October 2014 | ISBN-10: 0091958725 | ePUB | 25.2 mb\r\n\r\nEver since his creation, Sherlock Holmes has enthralled readers. Our perception of him and his faithful companion, Dr Watson, has been shaped by a long line of film, TV and theatre adaptations. This richly illustrated book, compiled by Alex Werner, Head of History Collections at the Museum of London, is an essential guide to the great fictional detective and his world. Using the museum's unrivalled collections of photographs, paintings and original artefacts, it illuminates the capital city that inspired the Sherlock Holmes stories, in particular its fogs, Hansom cabs, criminal underworld, famous landmarks and streets.\r\nAccompanying the landmark exhibition at the Museum of London, the first since 1951, this book explores how Arthur Conan Doyle's creation of Sherlock Holmes has transcended literature and continues to attract audiences to this day. Authoritatively written by leading experts, headed by Sir David Cannadine, this thought-provoking companion sheds new light on the famous sleuth and reveals the truth behind the fiction, over 125 years after the first Sherlock Holmes story was written.\r\n\r\nAbout the Author\r\nTHE MUSEUM OF LONDON opened in 1976. It tells the ever-changing story of the greatest city in the world - and the people who live there. Its galleries chart a journey through London from earliest times to the present. Its ever-changing programme of exhibitions and events and its collections give you a sense of the vibrancy that makes London such an exciting and special place it is today. ALEX WERNER, Head of History Collections at the Museum of London, has curated a number of major displays including Dickens and London (2011-12), the Expanding City gallery (2010) and London Bodies (1998). His publications include Dickens's Victorian London (2011), Jack the Ripper and The East End (2008), Journeys Through Victorian London (2001) and Dockland Life (2000).\r\n\r\nCONTENTS\r\nCover\r\nAbout the Book\r\nAbout the Authors\r\nTitle Page\r\nPreface\r\n‘A Case of [Mistaken?] Identity’ by David Cannadine\r\nThe ‘Bohemian Habits’ of Sherlock Holmes by John Stokes\r\nSherlock Holmes, Sidney Paget and the Strand Magazine by Alex Werner\r\nThe Art of Sherlock Holmes by Pat Hardy\r\nThrowaway Holmes by Clare Pettitt\r\nSilent Sherlocks: Holmes and Early Cinema by Nathalie Morris\r\nPicture Section\r\n- Holmes’s Central London in Photographs and Postcards\r\n- A Day with Dr. Conan Doyle\r\n- Alvin Langdon Coburn’s London\r\n- Maps of Sherlock Holmes’s London\r\n- Holmes at the Cinema and on TV\r\nNotes\r\nBiographies\r\nIndex\r\nAcknowledgements\r\nPhotographer credits\r\nCopyright\r\n \nhttp://s8.postimg.org/kw5zgwjg5/Sherlock_Holmes_The_Man_Who_Never_Lived_and_Wi.jpg","torrent":{"xt":"urn:btih:1d478e73d55aaa07c82bd75bd2b12a354052aed5","amp;dn":"Sherlock+Holmes+-+The+Man+Who+Never+Lived+and+Will+Never+Die+%28gn","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d478e73d55aaa07c82bd75bd2b12a354052aed5","infoHashBuffer":{"type":"Buffer","data":[29,71,142,115,213,90,170,7,200,43,215,91,210,177,42,53,64,82,174,213]},"announce":[],"urlList":[]}}