{"title":"Becoming Jimi Hendrix (epub)[rogercc].","uid":6248721,"size":2741846,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d6236cb43cbcf02d89709109228722c9a76fc5e&amp;dn=Becoming+Jimi+Hendrix+%28epub%29%5Brogercc%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rogercc1","files":1,"time":1300324316,"description":"Becoming Jimi Hendrix: From Southern Crossroads to Psychedelic London,\nThe Untold Story of a Musical Genius \nAuthors: Steven Roby, Brad Schreiber\nPublisher: Da Capo Press\nYear: 2010\nPages:304 \nISBN: 0306819104\nFormat: epub\n\nTo view this you need:\nAdobe Digital Edition (or similar?)\n\nThis can be found &amp; installed from here:http://www.adobe.com/products/digitaleditions/\n\n\nThis is a revealing look at the formative and yet often overlooked five-year period in which the legendary guitarist developed into his own playing style on the 'chitlin' circuit before moving to Greenwich Village. Before he was famous, by 1966, Jimi Hendrix had performed with Little Richard, Ike and Tina Turner, Sam and Dave, Wilson Puckett, and the Isley Brothers. He'd won the Apollo Theater's famous Amateur Night competition. Blue legends B.B King and Albert King had tutored him. Becoming Jimi Hendrix is about a man who was consumed by his passion for music, practicing day and night, but who endured harsh criticism and frequent rejection by band leaders intolerant of guitar feedback from a shy yet cocky kid trying to steal their spotlight. From 1962 to 1966, hendrix learned to please a crowd, dress like a star, and survive some of showbiz's shadier characters. This is the formative journey of one of the world's greatest guitar players - before fame, before London. \n\n\nSteve Roby is the author of Black Gold: The Lost Archives of Jimi Hendrix and he worked for the Hendrix family as editor and publisher of the international Hendrix fanzine, Experience Hendrix. He lives in San Francisco.\n\nBrad Schreiber is a journalist, author, and screenplay writer who has won numerous awards and fellowships from such organizations as the Edward Albee Foundation and the National Press Foundation. He lives near Los Angeles.\n.\n\n\n","torrent":{"xt":"urn:btih:1d6236cb43cbcf02d89709109228722c9a76fc5e","amp;dn":"Becoming+Jimi+Hendrix+%28epub%29%5Brogercc%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d6236cb43cbcf02d89709109228722c9a76fc5e","infoHashBuffer":{"type":"Buffer","data":[29,98,54,203,67,203,207,2,216,151,9,16,146,40,114,44,154,118,252,94]},"announce":[],"urlList":[]}}