{"title":"Bryan Talbot - The Adventures Of Luther Arkwright","uid":7569363,"size":131379021,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1d79ae6abd51325f073b8a0a8e611955c009e789&amp;dn=Bryan+Talbot+-+The+Adventures+Of+Luther+Arkwright&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1345946008,"description":"Issues 1-9 (plus TPB extras) of 'The Adventures of Luther Arkwright'\nDark Horse Comics, 1987-1989\nWritten and Drawn by Bryan Talbot\n\nThe Adventures of Luther Arkwright was a limited series comic book written and drawn by Bryan Talbot.\n\nLuther Arkwright made his first appearance in the mid 1970s in &quot;The Papist Affair&quot;, a short strip for Brainstorm Comix where Arkwright teamed up with a group of cigar-chewing biker nuns to recover the sacred relics of St. Adolf of Nuremberg from &quot;a buncha male chauvinist priests&quot;.\n\nThe first parts of The Adventures of Luther Arkwright followed as a serial in the British underground comic Near Myths in 1978, were later continued in pssst! magazine, then interrupted in 1982, less than half complete. Between 1987 and 1989 Bryan Talbot completed the story, which was published as a series of nine standard comic books by Valkyrie Press, followed, at readers' request, by a tenth issue containing articles about the history and production of the comic and some extended back story and character information. It was subsequently published in the United States by Dark Horse Comics.\n\nThe story is adult in tone, with many mythological, historical and political references, and a little explicit sex. Its genesis owes something to the influence of Michael Moorcock's Jerry Cornelius stories, though Moorcock and Talbot agree that the similarities between the characters are limited. Warren Ellis calls Arkwright &quot;probably the single most influential graphic novel to have come out of Britain to date... probably Anglophone comics' single most important experimental work.&quot;\n\nLuther Arkwright is a work of apocalyptic science fiction set in parallel universes. The eponymous hero has the unique talent of being able to move between parallels purely by force of will, and is aided by Rose Wylde, a telepath whose many incarnations across the parallels are able to communicate with one another. Luther and Rose are agents of a parallel known as &quot;zero-zero&quot;, whose stable position in the multiverse has allowed the development of a world at peace with itself and sufficiently high technology to monitor the parallels for signs of the malign influence of the &quot;Disruptors&quot;.\n\nMost of the action in the story is set in a parallel world where the English Civil War has been indefinitely prolonged by the actions of the Disruptors, who are also responsible for unleashing &quot;Firefrost&quot;, a legendary artifact which is destabilising the multiverse. Arkwright intervenes on the Royalist side in order to draw out the Disruptors and locate and destroy Firefrost. Along the way he is captured, dies in custody and returns to life with his powers enhanced.\n\nThe storytelling of the early episodes is complex, with flashbacks to Arkwright's upbringing by the Disruptors, escape to the parallel of his birth and early missions for zero-zero intermingling with the course of his mission in neo-Cromwellian England, with story-telling techniques and art styles shifting to match. The scenes of Arkwright's death and rebirth are particularly abstract and full of religious and mythological symbolism: the comic is unusual in being one of the few adventure stories where the readers and the protagonist both know from the beginning that he's going to die; the only questions are 'when?', 'where?', 'how?'... and 'what then?'\n\nThe later parts of the story have a more straightforward, linear form. At the end Arkwright, having completed his mission, renounces violence.","torrent":{"xt":"urn:btih:1d79ae6abd51325f073b8a0a8e611955c009e789","amp;dn":"Bryan+Talbot+-+The+Adventures+Of+Luther+Arkwright","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d79ae6abd51325f073b8a0a8e611955c009e789","infoHashBuffer":{"type":"Buffer","data":[29,121,174,106,189,81,50,95,7,59,138,10,142,97,25,85,192,9,231,137]},"announce":[],"urlList":[]}}