{"title":"Tidy Up pre[K]racked v. 3.0.6","uid":8339429,"size":49104016,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:1dadf64bb869364582f38fe32612ddcc919fdeb6&amp;dn=Tidy+Up+pre%5BK%5Dracked+v.+3.0.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"polisdavid","files":-1,"time":1365055300,"description":"Official Web Site: &lt;a href=&quot; http://www.hyperbolicsoftware.com/TidyUp.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.hyperbolicsoftware.com/TidyUp.html&lt;/a&gt;\n\nPre-cracked courtesy of TOBW\n\nTidy Up is a complete duplicate finder and disk tidiness utility.\n\nHere are a few Tidy Up! features:\n\n* With Tidy Up! you can search for duplicate files and packages; by the \n  owner application, content, type, creator, extension, time modified, time\n  created, name, label, visibility and date/age. You can also search by the \n  tag, duration and bit installments of MP3 and AAC sound files and \n  EXIF metadata, search the contents of the iPhoto, Aperture, iTunes, \n  iPod databases and Mail mailboxes, and synchronize deletions with \n  iPhoto, Mail and iTunes.\n\n* Tidy Up! allows you to search for duplicate folders; by name, date \n  modified, date created, label visibility, empty folders, their contents and \n  more.\n\n* Tidy Up! is fast, it doesn't index the scanned volumes, so you don't \n  waste additional precious space. With its multitasking capability, you can \n  do more searches at a time and take advantage of the latest Mac \n  computers and operating systems.\n\n* Tidy Up! comes with a search mode called Basic Mode*, which \n  includes more than 90 pre-defined searches. For a customized strategy, \n  you can opt for Strategy Wizard, which based on your choices creates \n  the appropriate criteria with which to search for duplicates and a new \n  &quot;Smart Basket&quot; that will contain the items to be removed, or the manual\n   method, the most customized method offered.\n\n* Tidy Up! has a security system that assures you will keep at least one \n  file of the duplicate group on your disk, the ability to undo copied and\n  moved items and the ability to restore trashed items as long as the trash \n  is not emptied, even after a restart of the computer.\n\n* Tidy Up! offers a full-size preview of the most commonly used files \n  such as: audio, media, text, pdf, graphics, fonts and more... and Quick \n  Look like in the Finder (only from OS X 10.5). One of the most \n  interesting features of Tidy Up! is the capability to separate, for quick\n  and easy organization, found items using custom criteria via &quot;Smart\n  Baskets.&quot; It also includes the possibility to choose, from the items \n  belonging to the supported applications, a specific album , playlist or\n   mailbox.\n\n* Tidy Up! allows you to trash, move, replace the moved and trashed \n  items with aliases or symbolic links, burn, assign colored Finder labels\n  and export into html and text files all found items.\n\n* Tidy Up! is fully customizable and allows you to create your preferred\n   workspace.\n\nWhat's New:\n\n* Includes bug fixes that sometimes crashed the application.\n\n* Other minor bug fixes and enhancements.\n\nSystem Requirements:\n\nIntel Mac, OS X.6.6 or later\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:1dadf64bb869364582f38fe32612ddcc919fdeb6","amp;dn":"Tidy+Up+pre%5BK%5Dracked+v.+3.0.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dadf64bb869364582f38fe32612ddcc919fdeb6","infoHashBuffer":{"type":"Buffer","data":[29,173,246,75,184,105,54,69,130,243,143,227,38,18,221,204,145,159,222,182]},"announce":[],"urlList":[]}}