{"title":"[2012] Epigenetics in Human Disease.pdf","uid":9522639,"size":15077233,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1db9e21a78943304a66fc25943791e0faf06c194&amp;dn=%5B2012%5D+Epigenetics+in+Human+Disease.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"seering","files":1,"time":1390670160,"description":"Epigenetics is one of the fastest growing fields of sciences, illuminating studies of human diseases by looking beyond genetic make-up and acknowledging that outside factors play a role in gene expression. The goal of this volume is to highlight those diseases or conditions for which we have advanced knowledge of epigenetic factors such as cancer, autoimmune disorders and aging as well as those that are yielding exciting breakthroughs in epigenetics such as diabetes, neurobiological disorders and cardiovascular disease. Where applicable, attempts are made to not only detail the role of epigenetics in the etiology, progression, diagnosis and prognosis of these diseases, but also novel epigenetic approaches to the treatment of these diseases. Chapters are also presented on human imprinting disorders, respiratory diseases, infectious diseases and gynecological and reproductive diseases. Since epigenetics plays a major role in the aging process, advances in the epigenetics of aging are highly relevant to many age-related human diseases. Therefore, this volume closes with chapters on aging epigenetics and breakthroughs that have been made to delay the aging process through epigenetic approaches. With its translational focus, this book will serve as valuable reference for both basic scientists and clinicians alike.","torrent":{"xt":"urn:btih:1db9e21a78943304a66fc25943791e0faf06c194","amp;dn":"%5B2012%5D+Epigenetics+in+Human+Disease.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1db9e21a78943304a66fc25943791e0faf06c194","infoHashBuffer":{"type":"Buffer","data":[29,185,226,26,120,148,51,4,166,111,194,89,67,121,30,15,175,6,193,148]},"announce":[],"urlList":[]}}