{"title":"The 90-Day Novel: Unlock the story within - Alan Watt","uid":8951017,"size":295654,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1db92399ed0200a6c445fa1a6702328bfff84076&amp;dn=The+90-Day+Novel%3A+Unlock+the+story+within+-+Alan+Watt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1379885608,"description":"The 90-Day Novel: Unlock the story within\nby Alan Watt\n\n\nAlan Watt wrote the first draft of his novel Diamond Dogs in just under 90 days, and later sold the North American rights for $500,000 to Little, Brown in a bidding war. The book became a national bestseller, won a slew of awards and is soon to be a major motion picture. \n\nGet the first draft down quickly! The 90-Day Novel is a day-by-day guide through the process of getting the first draft of your novel onto the page. The 90-Day Novel was workshopped at LA Writers' Lab over three years and has helped hundreds of writers complete their work. Some of Watt's students have gone on to become bestselling authors and win major literary awards.\n\nThe 90-Day Novel is structured into three parts. Part One describes the process of getting your story from the imagination to the page and prepares you, through a few simple, powerful writing exercises to access the story within. Part Two is a series of 90 daily letters that will guide you through the hero's journey. Writers often tend to get stuck halfway through, mired somewhere in their &quot;idea&quot; of the story. The 90-Day Novel will show you how and why you got stuck, and how to get to the end of your first draft. Part Three is a compendium of stream-of-consciousness writing exercises designed to help you access the primal forces in your story, as well as the Structure Questions that will invite up images at key stages in your hero's journey. \n\nThe 90-Day Novel teaches you how to distill your plot to its nature, and clarifies the mysterious process of assembling vague disparate images into a coherent narrative. Working in this way, story structure (which is often taught as an intellectual construct or &quot;formula&quot;) becomes a springboard, setting you free to explore the far reaches of your imagination. &quot;There are no rules,&quot; Watt tells us. &quot;Stay out of your left brain, and let your unconscious do the heavy lifting.&quot; The 90-Day Novel clearly articulates the process of marrying the rigor of story structure to the wildness of the imagination and in the process reminds us of something we so often forget...that writing is actually fun. For more information on books, visit the90daynovel.com. For info on workshops, visit lawriterslab.com. ","torrent":{"xt":"urn:btih:1db92399ed0200a6c445fa1a6702328bfff84076","amp;dn":"The+90-Day+Novel%3A+Unlock+the+story+within+-+Alan+Watt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1db92399ed0200a6c445fa1a6702328bfff84076","infoHashBuffer":{"type":"Buffer","data":[29,185,35,153,237,2,0,166,196,69,250,26,103,2,50,139,255,248,64,118]},"announce":[],"urlList":[]}}