{"title":"Python Projects For Kids - Jessica Ingrasselino","uid":14415865,"size":6969680,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e508de12cc6cc0e3746e3737b71d0b2bf144812&amp;dn=Python+Projects+For+Kids+-+Jessica+Ingrasselino&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1461493446,"description":"Key Features\r\nLearn to start using Python for some simple programming tasks such as doing easy mathematical calculations.\r\nUse logic and control loops to build a nice interesting game.\r\nGet to grips with working with data and, once you're comfortable with that, you'll be introduced to Pygame, which will help you wrap up the book with a cool game.\r\nBook Description\r\nKids are always the most fast-paced and enthusiastic learners, and are naturally willing to build stuff that looks like magic at the end (when it works!). Programming can be one such magic. Being able to write a program that works helps them feel they've really achieved something. Kids today are very tech-savvy and cannot wait to enter the fast-paced digital world.\r\n\r\nBecause Python is one of the most popular languages and has a syntax that is quite simple to understand, even kids are eager to use it as a stepping stone to learning programming languages.\r\n\r\nThis book will cover projects that are simple and fun, and teach kids how to write Python code that works.\r\n\r\nThe book will teach the basics of Python programming, installation, and so on and then will move on to projects. A total of three projects, with each and every step explained carefully, without any assumption of previous experience.\r\n\r\nWhat you will learn\r\nStart fiddling with Python's variables, build functions and interact with users\r\nBuild your own calculator using the Math Library\r\nTrain Python to make logical decisions\r\nWork with moving 2D objects on-screen\r\nUnderstand the Pygame Library and build your very own game!\r\nWrite a cool program to manage inventories in your backpack","torrent":{"xt":"urn:btih:1e508de12cc6cc0e3746e3737b71d0b2bf144812","amp;dn":"Python+Projects+For+Kids+-+Jessica+Ingrasselino","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e508de12cc6cc0e3746e3737b71d0b2bf144812","infoHashBuffer":{"type":"Buffer","data":[30,80,141,225,44,198,204,14,55,70,227,115,123,113,208,178,191,20,72,18]},"announce":[],"urlList":[]}}