{"title":"Daryl.Hall.Live.from.Daryl's.House.E22.Smokey.Robinson","uid":5056215,"size":455531417,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1e6f64ea0d0c070777099abb0c4b974861313672&amp;dn=Daryl.Hall.Live.from.Daryl%5C%27s.House.E22.Smokey.Robinson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"PhillySoul","files":9,"time":1250434992,"description":"Legendary Motown singer/songwriter Smokey Robinson featured on Live From Daryl's House - August 15\n\n22nd edition of acclaimed web show finds Daryl and Smokey joining together on nine-song set\n\nNEW YORK, August 7, 2009-It's a historic, one-time-only collaboration between two of the pre-eminent singer/songwriters of their time, joining forces on such classics as &quot;Sara Smile,&quot; &quot;Tears of a Clown&quot; and &quot;Ooh, Baby Baby.&quot;\n\nDaryl Hall's youth was spent as being an integral part of the Sound of Philadelphia, but he had a special feeling for the music of Motown's Rock and Roll Hall of Fame singer/songwriter Smokey Robinson. Now, the two will join forces in an intimate session that can be shared by everybody on the new, 22nd edition of Live From Daryl's House on Aug. 15 at www.livefromdarylshouse.com.\n\n&quot;This truly is a highlight of my career,&quot; said Daryl about the pairing. &quot;Smokey Robinson is one of my heroes as a singer and songwriter, a major influence on my own music from the very start. To be able to join forces on Live from Daryl's House is a real treat.&quot;\n\nThe two collaborate on a nine-song set which highlights the Smokey Robinson songbook as well as including a pair of Daryl Hall penned hits in &quot;I Can't Go for That&quot; and &quot;Sara Smile.&quot; Among the songs Daryl and Smokey tackle are Miracles classics &quot;Tears of a Clown,&quot; &quot;Going to a Go-Go&quot; and &quot;Ooh, Baby Baby,&quot; as well as Norah Jones' &quot;Don't Know Why,&quot; the first single from Robinson's new album, Time Flies When You're Having Fun, coming out Aug. 25 on ROBSO Records/ADA Distribution, featuring special guests Joss Stone, Carlos Santana and India.Arie. Smokey's version of &quot;Don't Know Why&quot; was recently the #1 Most Added song at Urban AC radio.\n\nSmokey was impressed with the experience: &quot;It was absolutely fantastic working with Daryl, T-Bone, Shawn, Zev, Eliot and Everett, knowing before I even got there what top-notch musicians they were. They all proved to be better than their amazing reputations and it was a complete joy for me to work with them.&quot;\n\nPast episodes of Live from Daryl's House have featured a mix of well-known performers like The Doors' Robby Krieger and Ray Manzarek, Nick Lowe, K.T. Tunstall, Gym Class Heroes' Travis McCoy, Finger Eleven's James Black and Rick Jackett and the Bacon Brothers, along with newcomers such as Philly soul singer Mutlu, Canadian techno-rockers Chromeo, MySpace pop-rock phenom Eric Hutchinson, Cash Money rocker Kevin Rudolf, Wind-up Records' Chicago rockers Company of Thieves, Bay Area singer/songwriter Matt Nathanson, Charlottesville, VA's rising Parachute and Chicago rock band Plain White T's.\n\nLive from Daryl's House started with Daryl's &quot;light-bulb moment&quot; idea of &quot;playing music with my friends and putting it up on the Internet,&quot; and the show has subsequently been praised by such varied media outlets as Rolling Stone, Spin, Daily Variety, CNN, BBC, Yahoo and the influential Lefsetz Letter.","torrent":{"xt":"urn:btih:1e6f64ea0d0c070777099abb0c4b974861313672","amp;dn":"Daryl.Hall.Live.from.Daryl%5C%27s.House.E22.Smokey.Robinson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e6f64ea0d0c070777099abb0c4b974861313672","infoHashBuffer":{"type":"Buffer","data":[30,111,100,234,13,12,7,7,119,9,154,187,12,75,151,72,97,49,54,114]},"announce":[],"urlList":[]}}