{"title":"The Matchmaker (1997 - Janeane Garofalo)","uid":4934090,"size":890269696,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1f000739021331d7882dc68ffe222c96604e0c5f&amp;dn=The+Matchmaker+%281997+-+Janeane+Garofalo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"RichardHighHopes","files":-1,"time":1244167878,"description":"This is my first torrent, I get everything from here, so I don't have originals to upload, but no one is seeding these ridiculous 4GB-sized torrents, so a reasonably-sized version of this movie was needed.  Here it is.  I don't have subs for it, sorry, maybe someone wants to add comments below with links to subs?\n\nA sadly underrated gem of a film.  If you like car chases or Rambo movies, this one's definitely not for you.  See below for brief synopsis.\n\n\n\nAuthor: Niro from Farmington Hills, MI, USA\n\n... an utterly charming film, involving a US Senator (Jay O. Sanders) from Boston with Kennedian aspirations ~ although he's trailing badly in the polls for re-election. So he and acerbic campaign manager Denis Leary send their jaded top aide (JG) to Ireland to find the Senator's geneology ~ his &quot;roots&quot; as it were ~ for campaign purposes.\n\nUnfortunately for her, the tiny town in which she's to do her research is just beginning its annual &quot;Matchmaking Festival,&quot; wherein this really takes hold of Erin-firma.\n\nCity~gal JG, who's used to [and yearns for] faxes, cell-phones and email is suddenly the top candidate for the gentry. And her quest for the Senator's geneology proves slowly to fall below her expectations.\n\nBut Milo O'Shea, as the town's premiere matchmaker, wagers with a matchmaking rival that he can get JG together with one of the town's seeming ne'er-do-wells (David O'Hara) and the latter is just as eager to ... ummm.. &quot;fax&quot; her as well.\n\nTo say more would spoil the fun. And it *is* fun. And poignant. And sweet. And occasionally acid-witted. Only one solid &quot;rewind and watch it again&quot; belly laugh, but a lot of great plotting and a fun love story.\n\nSure it's candy, but it's infinitely edible.  ...\n\n\n\n\nPLEASE SEED AS LEAST AS MUCH AS YOU HAVE DOWNLOADED...\n\nIf everyone seeds just 1:1, gives at least what they take, these torrents will never die.  If you wanted to see it and someone was decent enough to seed it for you, the least you can do is return the favour for others.  That's the only way this whole system works.\n\n\n\n\nThe.Matchmaker.1997\nMovie Playtime.......: 137min\nGenre................: Romance/Comedy\nSubtitles: None\nAudio Streams: English\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0119632/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0119632/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0119632/usercomments&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0119632/usercomments&lt;/a&gt;\n\n\n\nI could only find French and Spanish subtitles, but the Spanish ones don't seem to work.  The French subs are working fine, if you want 'em, just msg me here (vous pouvez demander en Francais).  \n\nI didn't want to edit the torrent to include the subs for fear that it might muck up the torrent for people who are dloading this one now.\n\nIf Piratebay trusted sources tell me I can edit the torrent to include the subs and it won't mess up anyone's dload, then I'll add 'em to this torrent.","torrent":{"xt":"urn:btih:1f000739021331d7882dc68ffe222c96604e0c5f","amp;dn":"The+Matchmaker+%281997+-+Janeane+Garofalo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f000739021331d7882dc68ffe222c96604e0c5f","infoHashBuffer":{"type":"Buffer","data":[31,0,7,57,2,19,49,215,136,45,198,143,254,34,44,150,96,78,12,95]},"announce":[],"urlList":[]}}