{"title":"He Who Must Die (1957) (Celui Qui Doit Mourir) Jules Dassin Fr,E","uid":6324186,"size":1784236197,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1f398813ca35f5e33a4652c2da858bad0685922e&amp;dn=He+Who+Must+Die+%281957%29+%28Celui+Qui+Doit+Mourir%29+Jules+Dassin+Fr%2CE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"johnefp","files":-1,"time":1303052622,"description":"Filmed on the island of Crete and set in the early 1920's, when Greece was occupied by the Turks, Jules Dassin's Celu Qui Doit Mourir (He Who Must Die) tells the story of a small village's efforts to stage their Passion Play, an event that occurs once every seven years. The leading citizens, including the wealthy Patriarcheos (Gert Frobe) and the priest Grigoris (Fernand Ledoux), have managed to keep the local Turkish military ruler (Carl Mohner) satisfied with their quiet subservience, each protecting his status and authority within the community in the process. But when Grigoris makes his selections for the roles in the Passion Play, there are unintended consequences, particularly for Manolios (Pierre Vaneck), a tongue-tied, stammering young shepherd who is chosen to play Jesus. On the eve of the celebration and the play, a large group of refugees, survivors of a town burned by the Turks, led by the priest Photis (Jean Servais), arrives seeking help. Grigoris and the other town leaders turn them away, at first spreading the lie that the refugees carry cholera to make the townspeople fearful of them. But Manolios and two others are troubled by the seeming contradiction between the priest's behavior and the teachings of Jesus -- which Manolios is starting to take very seriously. Confronted by the starvation deaths of children and old men among the refugees, Manolios soon finds himself facing an array of unpleasant truths about the failings of the men he has always respected. The village is soon divided, friend against friend and father against son, as Manolios appeals to the better nature of his neighbors -- his closest allies include Patriarcheos's son and Katerina (Melina Mercouri), the village prostitute. These events further enflame Grigoris's anger over what he perceives a open rebellion and the threat of disorder, which the Church will not condone -- and he soon must appeal to the Turkish occupiers, to stop Manolios and all that he represents. \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0050237/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0050237/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Celui_qui_doit_mourir&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Celui_qui_doit_mourir&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Nikos_Kazantzakis&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Nikos_Kazantzakis&lt;/a&gt;\n\n[Movie]\nValid : Yes [AVI]\nDuration : 02:07:36\nMovie complete : Yes\n\n[Video]\nResolution : 704x336 2.10:1\nCodec : DivX (4 / 5 / 6)\nFPS : 23,98\nBitRate : 1736 Kbps\nQuality Factor : 0,31 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 128 Kbps\n","torrent":{"xt":"urn:btih:1f398813ca35f5e33a4652c2da858bad0685922e","amp;dn":"He+Who+Must+Die+%281957%29+%28Celui+Qui+Doit+Mourir%29+Jules+Dassin+Fr%2CE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f398813ca35f5e33a4652c2da858bad0685922e","infoHashBuffer":{"type":"Buffer","data":[31,57,136,19,202,53,245,227,58,70,82,194,218,133,139,173,6,133,146,46]},"announce":[],"urlList":[]}}