{"title":"Comprehensive Molecular Insect Science - Kostas Iatrou et al.","uid":15561938,"size":91759895,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f53c49617750f17bc60b83f572dc7c76f524392&amp;dn=Comprehensive+Molecular+Insect+Science+-+Kostas+Iatrou+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1471144926,"description":"Comprehensive Molecular Insect Science - Kostas Iatrou et al. (Elsevier, 2005).pdf\r\n\r\nThe important developments and achievements in modern insect science since the first edition have led to this new revised, expanded and retitled reference work. New chapters in this edition include the ecdysone receptor, lipocalins, bacterial toxins, etc. Each article may also be read independently, as a review of that particular subject.\r\n\r\nComprehensive Molecular Insect Science also covers new technologies that have been developed since 1985. The Index Volume will help researchers to track specific subjects and particular species of insects cited in several volumes.\r\n\r\nAlso available online via ScienceDirect – featuring extensive browsing, searching, and internal cross-referencing between articles in the work, plus dynamic linking to journal articles and abstract databases, making navigation flexible and easy. For more information, pricing options and availability visit www.info.sciencedirect.com. \r\n\r\nKey Features:\r\n* Revised edition of critically acclaimed Comprehensive Insect Physiology, Biochemistry and Pharmacology (1985, Pergamon Press, 13 Volume Set)\r\n* Written by a distinguished international group of contributors \r\n* Well-organized format provides for concise, readable entries, easy searches, and thorough cross-references \r\n* Complete up-to-date coverage of many important topics - essential information for scientists, students, and professionals alike","torrent":{"xt":"urn:btih:1f53c49617750f17bc60b83f572dc7c76f524392","amp;dn":"Comprehensive+Molecular+Insect+Science+-+Kostas+Iatrou+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f53c49617750f17bc60b83f572dc7c76f524392","infoHashBuffer":{"type":"Buffer","data":[31,83,196,150,23,117,15,23,188,96,184,63,87,45,199,199,111,82,67,146]},"announce":[],"urlList":[]}}