{"title":"Preachers Of LA Season 2","uid":11286261,"size":2599379167,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1f6bbd4a793c920241476e7bae9cee389c76fb7d&amp;dn=Preachers+Of+LA+Season+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"RKSTR","files":10,"time":1414287088,"description":"Preachers.of.LA.S02E01.x264-NoGRP\nA community event is planned by the preachers in the Season 2 premiere. Included: Jay confronts Deitrick over wedding issues, and Bishop Ron clashes with Bishop Noel.\n\nPreachers Of LA S02E02 HDTV x264-NoGRP\nTensions boil over as a showdown erupts over the status of Bishop Noel and Loretta's relationship; Christy defends Jay's decision to confront Deitrick; Jay attempts to save a young drug addict's life.\n\nPreachers.Of.LA.S02E03.HDTV.x264-NoGRP\nSparks fly as Jay confronts Deitrick about the wedding; Loretta faces off with First Lady LaVette at Dominique's Sip N See\n\nPreachers.Of.LA.S02E04.HDTV.x264-NoGRP\nRon and LaVette Gibson, Wayne and Myesha Chaney and psychologist Thema Bryant-Davis are the guests on the show.\n\nPreachers.Of.L.A.S02E05.Prodigal.Son.WS.DSR.x264-[NY2]\nPastor Jay has a difficult decision to make after his troubled son returns home. Pastor Wayne makes a big decision whilst Deitrick puts some unwanted pressure on Dominique. \n\nPreachers Of L.A. S02E06 Sins Of The Father WS DSR x264-NY2\nDeitrick makes his way to Detroit to find some difficult information about his biological father. Bishop McClendon looks back on his childhood.\n\nPreachers Of L.A. S02E07 Restoration WS DSR x264-NY2\nAfter being dramatically restored by his old congregation in Detroit, Dietrick decides to reconcile with Jay; Bishop Gibson attempts to reunite his family; Pastor Wayne struggles with a very personal decision.\n\nPreachers Of L.A. S02E08 My Brothers Keeper WS DSR x264-NY2\nThings get heated when Pastor Chaney tries to mend severed family ties; Bishop Jones throws Loretta a birthday party, and his gift leaves her speechless; Ron Gibson helps an ex-con begin a new life.\n\nPreachers.Of.L.A.S02E09.Meet.The.Godparents.WS.DSR.x264-[NY2\nBishop Gibson and Pastor Haizlip organize a gang summit. Pastor Chaney adds a new pastor to his conference. \n\nPreachers Of L.A. S02E10 Bouncing Back WS DSR x264-NY2\nDeitrick reaches out to fellow gospel artist Kevin Terry; Myesha deals with the serious issue of sex trafficking at her Hiding Behind the Lipstick conference; Christy Haizlip does some soul-searching.\n\nthanks to capper and poster","torrent":{"xt":"urn:btih:1f6bbd4a793c920241476e7bae9cee389c76fb7d","amp;dn":"Preachers+Of+LA+Season+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f6bbd4a793c920241476e7bae9cee389c76fb7d","infoHashBuffer":{"type":"Buffer","data":[31,107,189,74,121,60,146,2,65,71,110,123,174,156,238,56,156,118,251,125]},"announce":[],"urlList":[]}}