{"title":"SANS 610 - Reverse Engineering Malware (2010)","uid":10211571,"size":1098935553,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f765d4b086db64e0d4c22ad3b555ea93f90b99f&amp;dn=SANS+610+-+Reverse+Engineering+Malware+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"amilamx","files":6,"time":1400919557,"description":"\n\n\nSANS 610 - Reverse Engineering Malware (2010)\n\n\n\nDescription:\n\n\nThis popular malware analysis course has helped forensic investigators, incident responders, security engineers and IT administrators acquire practical skills for examining malicious programs that target and infect Windows systems. Knowing how to understand capabilities of malware is critical to the organization's ability to derive threat intelligence, so they can respond to information security incidents and fortify defenses. The course builds a strong foundation for analyzing malicious software using a variety of system and network monitoring utilities, a disassembler, a debugger and other tools useful for turning malware inside-out.\n\nThe course begins by covering fundamental aspects of malware analysis. You will learn how to set up an inexpensive and flexible laboratory for understanding the inner-workings of malicious software and will understand how to use the lab for uncovering characteristics of real-world malware samples. Then you will learn to examine the specimens behavioral patterns and code. The course continues by discussing essential x86 assembly language concepts. You will examine malicious code to understand its key components and execution flow. Additionally, you will learn to identify common malware characteristics by looking at suspicious Windows API patterns employed by bots, rootkits, keyloggers, downloaders and other types of malware.\n\nTURN MALWARE INSIDE-OUT\n\nYou will also learn how to handle self-defending malware, learning to bypass the protection offered by packers and other anti-analysis methods. In addition, given the frequent use of browser malware for targeting systems, you will learn practical approaches to analyzing malicious browser scripts, deobfuscating JavaScript and VBScript to understand the nature of the attack.\n\nYou will also learn how to analyze malicious documents that take the form of Microsoft Office and Adobe PDF files. Such documents act as a common infection vector and may need to be examined when dealing with large-scale infections as well as targeted attacks. The course also explores memory forensics approaches to examining malicious software, especially useful if it exhibits rootkit characteristics.\n\nThe course culminates with a series of capture-the-flag style challenges, designed to reinforce the techniques learned in class and to provide additional opportunities for learning practical, hands-on malware analysis skills in a fun setting.\n\nHands-on workshop exercises are a critical aspect of this course and allow you to apply malware analysis techniques by examining malware in a lab that you control. When performing the exercises, you will study the supplied specimens' behavioral patterns and examine key portions of their code. To support these activities, you will receive pre-built Windows and Linux virtual machines that include tools for examining and interacting with malware.\n\n\n\nContents:\n\n\n1. Five PDFs\n\n2. Tools/Labs\n\n\n","torrent":{"xt":"urn:btih:1f765d4b086db64e0d4c22ad3b555ea93f90b99f","amp;dn":"SANS+610+-+Reverse+Engineering+Malware+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f765d4b086db64e0d4c22ad3b555ea93f90b99f","infoHashBuffer":{"type":"Buffer","data":[31,118,93,75,8,109,182,78,13,76,34,173,59,85,94,169,63,144,185,159]},"announce":[],"urlList":[]}}