{"title":"Linda Ronstadt Greatest Hits [FLAC+MP3]","uid":9512929,"size":318910937,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1f7daa0c10551c64e91ca3dc2d2054e4e2bf6ee0&amp;dn=Linda+Ronstadt+Greatest+Hits+%5BFLAC%2BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1390450363,"description":"\n\nSource: CD\n\n\nBy Lonnie E. Holder VINE VOICE\n\nLinda Ronstadt is one of those singers who can manage to put a country flavor to just about anything she sings. However, she has sung songs in a wide variety of styles, so it is difficult to rate her as a singer of a particular type of music. Her ability to put a country twang into a song does make me wonder how she would handle a song like Led Zeppelin's &quot;Stairway to Heaven.&quot;\n\nLinda has a great talent and has had hits well beyond those on this collection. While this collection was fine in the days of vinyl, with the advent of CDs there is little need for this CD. There are bigger and better collections of music. The music included here is good, but the CD should be re-titled &quot;Early Greatest Hits&quot; or &quot;Here's Our Way of Milking Fans for More Money Because You Still Need a More Comprehensive Collection.&quot;\n\nMoving past my gripes about the CD, there is some really fun music on this CD. &quot;Silver Threads&quot; was a minor hit for the Springfields in the early 60s, after being sung by Wanda Jackson in the 50s. Linda's version is more rockabilly than the Springfield's version; a good cover of this song. &quot;Desperado&quot; is a cover of the Eagles song. Her clear voice brings a stronger country flavor to this song, but I prefer the Eagles version, which I believe has stronger feeling and power. Linda shows her flexibility in &quot;You're No Good&quot; as she manages a bit of soul.\n\nLinda Ronstadt manages to sound as though she came right out of the hills on &quot;Love Is a Rose.&quot; This heavily bluegrass flavored song still retains a rock influence, particularly with the percussion and a bass guitar. In the following song, &quot;That'll Be the Day&quot; she again manages yet another country-flavored song with a rock beat. Her voice is well matched to the requirements of this song and is an indication of how well she could have been a country music star had she remained in one genre.\n\n&quot;Long, Long Time&quot; is one of those incredible songs that any singer with a good voice should have in their repertoire. Linda has both the range and ability to sing this song with the kind of emotion required to pull a listener into the words and music. This sumptuous ballad is one of the few songs on this CD that require substantial vocal talent to execute and Linda does it very well indeed.\n\n&quot;Different Drum&quot; is yet another musical style, this time 60s pop. While the song has a standard pop beat and catchy lyrics, Linda's voice managed to flavor the song with a character that changes this song into a classic. One anachronistic touch is the use of a harpsichord. Many 60s songs used a variety of unusual instruments to achieve a different sound. This song was penned by Michael Nesmith of The Monkees. I like this song, but the fade at the end and my recollection makes me think that the end of the song may have been clipped. If the song was not clipped the fade was handled poorly.\n\nSwitching back to a country flavor is &quot;When Will I Be Loved,&quot; a short, AM-friendly song. While the song is relatively simple Linda Ronstadt manages to take charge of the song with outstanding vocals. Another country styled song, &quot;Love Has No Pride.&quot; While the style is familiar, the clear, powerful vocal is the focus of this soulful ballad. With the exception of the song discussed just below, the last two songs are also country style songs, a genre that Linda Ronstadt seems to favor.\n\nThis collection changes pace as she belts out a rocking versus of &quot;Heat Wave.&quot; No fuzz on this song, this song is solid pop-rock.\n\nTo be a fan of Linda Ronstadt is to be a fan of power vocals. Her style is eclectic; her skill sublime.\n\nThis collection has some good music. However, as noted at the start of this review, this collection is woefully inadequate. Linda's career has spanned Spanish language recordings, numerous later hits including the phenomenal &quot;Somewhere Out There&quot; with James Ingram, and albums of classic standards with Nelson Riddle. Against the breadth of her ability is this relatively paltry album. If you are looking for just her earliest hits, you may stop here. But if you are out to appreciate Linda Ronstadt's career, pass this one by in favor of the bigger collection, or a future box set with much more scope.","torrent":{"xt":"urn:btih:1f7daa0c10551c64e91ca3dc2d2054e4e2bf6ee0","amp;dn":"Linda+Ronstadt+Greatest+Hits+%5BFLAC%2BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f7daa0c10551c64e91ca3dc2d2054e4e2bf6ee0","infoHashBuffer":{"type":"Buffer","data":[31,125,170,12,16,85,28,100,233,28,163,220,45,32,84,228,226,191,110,224]},"announce":[],"urlList":[]}}