{"title":"Introduction to Cyber-Warfare (2013)","uid":8885227,"size":12906218,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f7ec18af9c382be77bebc3deda772ec63d251f5&amp;dn=Introduction+to+Cyber-Warfare+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1378439418,"description":"Introduction to Cyber-Warfare\n\nBook Details:\n\nPages: 336 \nPublisher: Syngress (June 2013)\nLanguage: English\nISBN-10: 0124078141\nISBN-13: 978-0124078147\nFormat: PDF, EPUB\n\nBook Description:\n\nCyber Warfare has become a global problem threatening governments, corporations and individuals. This new domain of warfare is not only inhabited by governments such as China, Russia, Iran, and the United States, but a variety of other actors including insurgent groups like Hezbollah and Hamas as well as hacking groups such as Anonymous, LulzSec, and others. According to a recent analysis the global market for Cyber Warfare consulting, product development and protective services will reach a value of $15.9 billion in 2012. This in-depth text on cyber warfare, written by experts on the front lines, explores the cutting edge world of cyber-warfare including the following:\n\nProvides a multi-disciplinary approach to Cyber Warfare analyzing the information technology, military, policy, social, and scientific issues that are in play.\nPresents detailed case studies of cyber-attack including inter-state cyber-conflict (Russia-Estonia), cyber-attack as an element of an information operations strategy (Israel-Hezbollah,) and cyber-attack as a tool against dissidents within a state (Russia, Iran)\nExplores cyber-attack conducted by large, powerful, non-state hacking organizations such as Anonymous and LulzSec\nCovers cyber-attacks directed against infrastructure such including but not limited to water treatment plants, power-grid and a detailed account on Stuxent\n\nTable of Contents:\n\nChapter 1. Cyber Warfare: Here and Now\n\nPart I: Cyber Attack\nChapter 2. Political Cyber Attack Comes of Age in 2007\nChapter 3. How Cyber Attacks Augmented Russian Military Operations\nChapter 4. When Who Tells the Best Story Wins\nChapter 5. Limiting Free Speech on the Internet\nChapter 6. Cyber Attacks by Nonstate Hacking Groups\n\nPart II: Cyber Espionage and Exploitation\nChapter 7. Enter the Dragon\nChapter 8. Duqu, Flame, Gauss, the Next Generation of Cyber Exploitation\nChapter 9. Losing Trust in Your Friends\nChapter 10. How Iraqi Insurgents Watched U.S. Predator Video Information Theft on the Tactical Battlefield\n\nPart III: Cyber Operations for Infrastructure Attack\nChapter 11. Cyber Warfare Against Industry\nChapter 12. Can Cyber Warfare Leave a Nation in the Dark? Cyber Attacks Against Electrical Infrastructure\nChapter 13. Attacking Iranian Nuclear Facilities: Stuxnet\n\nAppendix I. Chapter 6: LulzSec Hacktivities\nAppendix II. Chapter 6: Anonymous Timeline\n","torrent":{"xt":"urn:btih:1f7ec18af9c382be77bebc3deda772ec63d251f5","amp;dn":"Introduction+to+Cyber-Warfare+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f7ec18af9c382be77bebc3deda772ec63d251f5","infoHashBuffer":{"type":"Buffer","data":[31,126,193,138,249,195,130,190,119,190,188,61,237,167,114,236,99,210,81,245]},"announce":[],"urlList":[]}}