{"title":"Counterknowledge -epub","uid":6384131,"size":217669,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f8ff9cdde08b0ac259b800cb4d6e48e9e9ce4a4&amp;dn=Counterknowledge+-epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bookzilla","files":1,"time":1305137167,"description":"-epub\n\nCounterknowledge: How We Surrendered to Conspiracy Theories, Quack Medicine, Bogus Science and Fake History\n\nAn important and compelling book on the viral dissemination of misinformation in today's world. We are being swamped with dangerous nonsense. From 9/11 conspiracy theories to Holocaust denial to alternative medicine, we are all experiencing an epidemic of demonstrably untrue descriptions of the world. For Damian Thompson, the misinformation industry is wreaking havoc on the once-lauded virtues of science and reason. Unproven theories and spurious claims are forms of &quot;counterknowledge,&quot; and, helped by the Internet, they are creating a global generation of misguided adherents who repeat these untruths and lend them credence. Thompson explores our readiness to accept falsehoods and the viral role of technology in spreading quack remedies, pseudo-history, and creationist fanaticism. Following in the footsteps of Richard Dawkins's The God Delusion, Sam Harris's The End of Faith, and Christopher Hitchens's God Is Not Great, Counterknowledge is a brilliant defense of scientific proof in an age of fabrication\n\n176 pages \nPublisher: W. W. Norton &amp; Company; 1st American Ed edition (September 17, 2008) \nLanguage: English ","torrent":{"xt":"urn:btih:1f8ff9cdde08b0ac259b800cb4d6e48e9e9ce4a4","amp;dn":"Counterknowledge+-epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f8ff9cdde08b0ac259b800cb4d6e48e9e9ce4a4","infoHashBuffer":{"type":"Buffer","data":[31,143,249,205,222,8,176,172,37,155,128,12,180,214,228,142,158,156,228,164]},"announce":[],"urlList":[]}}