{"title":"Napoleon Hill -Think and Grow Rich: The Original 1937 Utd Edt","uid":11815386,"size":2348596243,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1f95019609ee2632e7bfcf50a4b5cf0a494f093a&amp;dn=Napoleon+Hill+-Think+and+Grow+Rich%3A+The+Original+1937+Utd+Edt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"dannesorgard","files":6,"time":1429061460,"description":"Napoleon Hill -Think and Grow Rich: The Original 1937 Utd Edt 9cd\n\n\nThe Napoleon Hill Foundation received many requests from people wanting the original, unedited, 1937 copy of Think and Grow Rich. To satisfy those customers, the Foundation reproduced Napoleon Hill's personal copy of the first edition, printed in March of 1937. The book has the notation, &quot;not to be loaned&quot;, and signed: Annie Lou Hill (the wife of Dr. Hill). This personal copy of Dr. Hill's was given to me by Dr. Charles W. Johnson, Chairman of the Napoleon Hill Foundation and a nephew of Napoleon Hill. It was Napoleon Hill who sent Dr. Johnson to medical school, and today he is a practicing cardiologist. Charlie refers to Napoleon Hill as &quot;Uncle Nap&quot; and will often make the statement, &quot;Uncle Nap would be proud of the Foundation today.&quot; The original 1937 manuscript was written and edited with the assistance of Napoleon's wife. In later years, the existing document was again edited by Dr. Hill. For example, the Foundation owns a 1958 edition that Hill edited personally. This did not lessen the book's value in Hill's judgment. Hill made the editing remarks in his own handwriting and the resulting 1960 edited edition has sold over 100 million copies making it the most read self-help book of all time.\nThink and Grow Rich sells more copies today than before Dr. Hill died in 1970. Now, a new and authoritative recording of this original, unedited, one-of-a-kind work, authorized by the Napoleon Hill Foundation is available. By purchasing this audio edition, you will be supporting the nonprofit Napoleon Hill Foundation. The entire philosophy of Napoleon Hill is based on the Golden Rule. The Foundation deeply appreciates the support of those of you who only purchase Napoleon Hill authorized books. You can identify these materials by the Foundation Logo and by looking inside for Napoleon Hill copyright.\n$11.95","torrent":{"xt":"urn:btih:1f95019609ee2632e7bfcf50a4b5cf0a494f093a","amp;dn":"Napoleon+Hill+-Think+and+Grow+Rich%3A+The+Original+1937+Utd+Edt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f95019609ee2632e7bfcf50a4b5cf0a494f093a","infoHashBuffer":{"type":"Buffer","data":[31,149,1,150,9,238,38,50,231,191,207,80,164,181,207,10,73,79,9,58]},"announce":[],"urlList":[]}}