{"title":"Valone-Electrogravitics 2(future propulsion systems)(2005)","uid":4533253,"size":7837621,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f9f338d9a0b8054ca1f4f972846d07439738ae3&amp;dn=Valone-Electrogravitics+2%28future+propulsion+systems%29%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227638473,"description":"This is Thomas Valone&amp;#039;s amazing book Electrogravitics 2 - Validating Reports on a New Propulsion Methodology (2nd Edition, 2005) which presents even more scientific evidence that electrogravitics is the propulsion technology of the future. The much awaited sequel of the first Electrogravitics Systems, it gives you the necessary background of what you need to understand to start off researching the coupling of gravity and electricity, by which you can ultimately control gravitation using electric machinery alone. This book delivers the scientific validation from three different authorities, the compelling public history of gravity research conducted by the aviation industry before it became &amp;#039;unacknowledged&amp;#039; and testimonials which eye-witnesses have provided. In total, this anthology attests to the validity of the Biefeld-Brown high voltage force effect. The book&amp;#039;s Science Section includes a well-known &quot;electrokinetic force&quot; and how it works; the proposed ion mobility explanation; and how electricity and gravity may couple. The Historical Section contains seven articles about T.T. Brown, gravity research, etc. Also included are a Testimonial Section and Patent Section. Interesting and scientific explanation of the electrokinetic force which also predicts why and how most electrogravitic devices will and do move with breathtaking speeds if only we could make the shift in our thinking from old mechanical, oil-pumping machines to the much more elegant electric ones. 160 pages, many pictures. A must read from everyone.\n","torrent":{"xt":"urn:btih:1f9f338d9a0b8054ca1f4f972846d07439738ae3","amp;dn":"Valone-Electrogravitics+2%28future+propulsion+systems%29%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f9f338d9a0b8054ca1f4f972846d07439738ae3","infoHashBuffer":{"type":"Buffer","data":[31,159,51,141,154,11,128,84,202,31,79,151,40,70,208,116,57,115,138,227]},"announce":[],"urlList":[]}}