{"title":"Masaan-DVD.Rip-HEVC-1CD-DDR","uid":12661441,"size":730044172,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2019fdabdea4bede4bfc3f803194b25c618d9f70&amp;dn=Masaan-DVD.Rip-HEVC-1CD-DDR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"SaM","files":1,"time":1446301177,"description":"DDR Presents\r\n\r\n\r\nMasaan-Fly Away Solo(2015)\r\n(A film by Neeraj Ghaywan)\r\n\r\nHindi - DVD rip - 720x386p (16:9)- 698 MB - x.265.AAC (5.1 Ch) - 1 Hrs:44 Min\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n \nhttp://extraimago.com/image/03A \nhttp://extraimago.com/image/03v \nhttp://extraimago.com/image/03t \nhttp://extraimago.com/image/03o \nhttp://extraimago.com/image/03k \nhttp://extraimago.com/image/03H \nhttp://extraimago.com/image/03F \nhttp://extraimago.com/image/03D \nhttp://extraimago.com/image/035 \nhttp://extraimago.com/image/03g \nhttp://extraimago.com/image/03X \nhttp://extraimago.com/image/03P \nhttp://extraimago.com/image/03r \nhttp://extraimago.com/image/03p\r\n\r\n Tech Specifications:\r\n \nhttp://extraimago.com/image/03G\r\n\r\nSynopsis:\r\nSet on the banks of the river Ganga in Benares, Masaan is a story of two interwoven tales of young people who buck the trend in a highly constraining tradition bound society. The first story is of Devi Pathak (Richa Chaddha), the daughter of a former Sanskrit teacher, Vidyadhar Pathak (Sanjay Mishra), who now sells trinkets at the burning ghat. Devi, in a fit of curiosity, goes to a hotel room with her friend Piyush. The police burst in and accuse them of immoral activities. Humiliated and unable to face society, Piyush commits society, leaving Devi alone to face the music. Things are compounded when a police inspector who has filmed Devi in the hotel room threatens to make the films public and has to be paid off with a hefty bribe, which Devi and her father, impoverished as they are, cannot afford. Devi has to switch jobs and finally rejected by society, find a way to stand on her own two feet by taking up a job with the railways and moving to Allahabad..\r\n\r\nThe second story is of a fairy tale romance between Dipak (Sanjay Mishra), an enginerring student, and Shalu Gupta (Shweta Tripathi). As their romance blossom, a major hurdle appears, for Dipak is a Dom by caste. The lowliest caste, who burns dead bodies on the banks of the Ganga and Shalu is a Bania, a way higher caste. Shalu stands firm by her lover, but tragedy strikes when she loses her life ina an accident. He body is brought to the cremation grounds, where Dipak has to cremate it. Dipak loses sense of time and purpose, and finally takes up a job, ironically again with the railways and also in Allahabad.\r\n\r\nThese two tales of blighted lives get intertwined, as the two meet on the banks of the river in Allahabad.\r\n\r\nComments:\r\nUnderneath the separate tales of Dipak &amp; Shalu and Devi, is a story of young people who break traditional shackles and with a quiet confidence, builds a new life for themselves. Appropriately, the setting is the Ghats of Varanasi, the bastion of tradition. Where Devi breaks the taboo of sexual exclusion, Dipak and Shaalu break the stranglehold of caste. This is no tale of heroic struggle against society. These are tales of quiet determination, of a strength of conviction and the urge that young people have to find their own solutions despite the disapproval of society.\r\n\r\nNowhere does the story cross limits and become a potboiler. It could be the story of any young couple caught in the webs of society and its mores. It is an impressive debut by a young Director, for Neeraj Ghaywan directs the film with a sure hand. Like his characters, he is understated, letting the events tell the tale, not through moralistic outbursts, but through quiet steps. I also liked his attention to detail, for example, his use of the local dialect of Varanasi, the creation of the ambiance of the Ghats etc.\r\n\r\nRicha Chaddha as Devi puts in a fine understated but exquisitely nuanced performance as does Vicky Kaushal as Dipak. Matching them Scene by scene is Sanjay Mishra as Devi's father, who is appalled by Devi's fall from 'standard' and yet is ready to compromise his own morals in exploiting the child Jhonta (Nikhil Sahni) who works for him. Shweta Tripathy is good too, although she had an easier role to assay.\r\n\r\nThese superb performances are backed by some scintillating cinematography of Varanasi, the banks of the Ganges and its people by Avinash Arun and some very innovative use of poetry throughout the film. Music is otherwise appropriate.\r\n\r\nOverall, one of the most moving films that I have seen in recent times. As the two tales come together at the end, where Devi and Dipak meet and share a boat to the Sangam at Allahabad, there is a sense of upliftment too, for the young pair have been able to overcome their travails in their own ways and a future lies ahead.\r\n\r\n\r\nUploader's Notes:\r\nThis rip is from a badly authored DVD which had variable cropping and poor production qualities. I am not sure why this splendidly photographed film was allowed to me mounted in such a poorly authored DVD, for the fil has seen commercial success too. We have corrected the cropping, the frame size, adjusted the colours to bring them out and etch the images out by sharpening selectively. The screenshots have been deliberately spaced out over the entire movie rather than give you the best parts. They give you a more accurate idea about the quality of this rip. The sample too, is of a scene at night and you can get a better idea about quality by watching it.\r\n\r\nPlease note that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt4635372/","torrent":{"xt":"urn:btih:2019fdabdea4bede4bfc3f803194b25c618d9f70","amp;dn":"Masaan-DVD.Rip-HEVC-1CD-DDR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2019fdabdea4bede4bfc3f803194b25c618d9f70","infoHashBuffer":{"type":"Buffer","data":[32,25,253,171,222,164,190,222,75,252,63,128,49,148,178,92,97,141,159,112]},"announce":[],"urlList":[]}}