{"title":"Indie Classic!: Swervedriver - MezcalHead [1993]","uid":3535294,"size":73621606,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2027af9a4d1ae090744522962ad62b4859869dc0&amp;dn=Indie+Classic%21%3A+Swervedriver+-+MezcalHead+%5B1993%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"tigerduck","files":11,"time":1160240262,"description":"&quot;There are cruising records, and then there are speeding records; Mezcal Head is definitely one of the latter. Solid, dense as marble, and frighteningly well executed, Swervedriver&amp;#039;s second album is a non-abrasive rock &amp; roll record of the highest order. Polishing the sound of Raise and improving the songcraft to match the band&amp;#039;s previous sense of texture, it contains all the ingredients of a favorite record to exceed the speed limit by. Adam Franklin&amp;#039;s cool voice is no longer buried in the mix, a smart move since his range has expanded to allow for melodic hooks and deep emotion, unlike the detached quality he held on Raise and the singles that preceded it.\n\nClocking in at an hour, the 11 songs provide enough depth and variety to defray any sense of boredom. &quot;For Seeking Heat&quot; begins innocently until revving into steaming ferocity. &quot;Duel,&quot; a minor hit on alternative radio, is probably the band&amp;#039;s most well-known song. Fittingly enough, it takes its name from Spielberg&amp;#039;s road velocity-based movie of the same name. &quot;Blowin&amp;#039; Cool&quot; shows the band&amp;#039;s first strain of the pop influence that would bleed through Ejector Seat Reservation. &quot;Last Train to Satansville,&quot; likely Franklin&amp;#039;s finest moment as a songwriter, puts him in the shoes of a delusional lover. Breaking free from the steaming charge of the album&amp;#039;s first side, the eight-minute &quot;Duress&quot; snakes drowsily through the first four minutes until breaking into a trancey mid-tempo dirge.\n\nLike a film with many well-developed characters that makes one lose both track of time and a sense of self, Mezcal Head delivers. And, just to hammer home that this isn&amp;#039;t an album that loses its effect outside of the automobile -- after the tenth play you&amp;#039;ll surely learn your lesson to quit running over to the stereo and increasing the volume with each successive song. Just leave it pegged&quot;.-AMG&amp;#039;\n\n\nENjoy!\nThe DUck","torrent":{"xt":"urn:btih:2027af9a4d1ae090744522962ad62b4859869dc0","amp;dn":"Indie+Classic%21%3A+Swervedriver+-+MezcalHead+%5B1993%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2027af9a4d1ae090744522962ad62b4859869dc0","infoHashBuffer":{"type":"Buffer","data":[32,39,175,154,77,26,224,144,116,69,34,150,42,214,43,72,89,134,157,192]},"announce":[],"urlList":[]}}