{"title":"The Amazing - Wait for a Light to Come [2010][EAC,log,cue. FLAC]","uid":8798475,"size":207610442,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:203bc844b371c201ca0471ccfd9c175cf2a5da43&amp;dn=The+Amazing+-+Wait+for+a+Light+to+Come+%5B2010%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"dickspic","files":13,"time":1376135929,"description":"Artist: The Amazing\nRelease: Wait for a Light to Come\nReleased: 2010\nLabel: Subliminal Sounds\nCatalog#: SUB-70-CD\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: SWEDEN\nStyle: alternative, psychedelic, rock, progressive, dream.pop, folk.rock, neo.psychedelia\n\n\n1. Evil (3:23)\n2. And It Looks Like Today (3:10)\n3. Islands (6:10)\n4. Head Beaches (4:33)\n5. Defect (6:36)\n6. Wait for a Light to Come (2:38)\n\nThis is the second album from Sweden's The Amazing on Subliminal Sounds. Wait For A Light To Come features brand-new recordings of Swedish folk-rock-psych-pop perfection. Their 2009 debut album received unanimous critical acclaim worldwide. This follow-up is an all-encompassing sonic soundscape of groovy electric folk-rock, psychedelic pop and heavy jams. The core musicians in The Amazing are Christoffer Gunrup, Reine Fiske (who doubles as the lead guitar wizard in Dungen and who solos so furiously, it's as if something's trapped inside him that must be turned into melody or he'll burst into flames), Johan Holmegard (who doubles as the drummer in Dungen, too) and Fredrik Swahn. The intimacy permeating through this group intensifies itself steadily in the music they produce; swimming idly through the twisted melodies, yet luminously anchored by Reine's astral guitar. Elsewhere they forgo the interstellar for a more bucolic revelry, built upon acoustic laments and a male and female vocal ripple that could only have spread itself outwards from Sweden's forlorn beauty. With special guests including some of Sweden's finest musicians; Gustav Ejstes (Dungen) and Moussa Fadera (Life On Earth!) amongst others, nothing on Wait For A Light To Come is introverted or overworked -- everything is balanced, kept together by natural melodies and soulful vocals. The Amazing is a feeling, an organic consequence of something that effortlessly came together.","torrent":{"xt":"urn:btih:203bc844b371c201ca0471ccfd9c175cf2a5da43","amp;dn":"The+Amazing+-+Wait+for+a+Light+to+Come+%5B2010%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"203bc844b371c201ca0471ccfd9c175cf2a5da43","infoHashBuffer":{"type":"Buffer","data":[32,59,200,68,179,113,194,1,202,4,113,204,253,156,23,92,242,165,218,67]},"announce":[],"urlList":[]}}