{"title":"Silver Bells - Fern Michaels, JoAnn Ross, Mary Burton &amp; Judy","uid":9332181,"size":421707,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:20a0cadd067157b6f317f8fbe4dbb6098223369e&amp;dn=Silver+Bells+-+Fern+Michaels%2C+JoAnn+Ross%2C+Mary+Burton+%26amp%3B+Judy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1386788933,"description":"In the air, there's a feeling of Christmas. . .so settle into your coziest armchair and enjoy four captivating tales that will make your holidays merry and bright. . .\n\n&quot;Silver Bells&quot; by Fern Michaels\n\nFor years, movie star Amy Lee wondered what it would be like to leave her shallow Hollywood life and go back home to Apple Valley, Pennsylvania. This Christmas, she plans to find out. And Hank Anders, her high-school boyfriend, is now ready to give her a welcome she'll never forget. . .\n\n&quot;Dear Santa. . .&quot; by JoAnn Ross\n\nMystery author Holly Berry's SUV has broken down in the little hamlet of Santa's Village, Washington. Holly hates the holidays--that is until lodge owner Gabriel O'Halloran and his five-year-old daughter rekindle her belief in passion, magic, and Christmas wishes. . .\n\n&quot;Christmas Past&quot; by Mary Burton\n\nPhotographer Nicole Piper just received a very unwelcome Christmas gift--a letter that holds clues to an elusive killer's identity. Uncovering the truth means enlisting homicide detective David Ayden's help, and embarking on a road trip that will take them both into the heart of danger and desire. . .\n\n&quot;A Mulberry Park Christmas&quot; by Judy Duarte\n\nEvery Christmas, the folks living on Sugar Plum Lane pull out all the stops when decorating. After a bitter breakup, Alyssa Ridgeway's heart just isn't in it this year. But running into her first love, James &quot;Mac&quot; MacGregor, fills her with memories of the tender Christmas kiss they once shared. . .","torrent":{"xt":"urn:btih:20a0cadd067157b6f317f8fbe4dbb6098223369e","amp;dn":"Silver+Bells+-+Fern+Michaels%2C+JoAnn+Ross%2C+Mary+Burton+%26amp%3B+Judy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20a0cadd067157b6f317f8fbe4dbb6098223369e","infoHashBuffer":{"type":"Buffer","data":[32,160,202,221,6,113,87,182,243,23,248,251,228,219,182,9,130,35,54,158]},"announce":[],"urlList":[]}}