{"title":"Hush..Hush, Sweet Charlotte [Bette Davis 1964] DVDrip - cOOt","uid":5484027,"size":1467994159,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:20a6745360ba1609421229fc49fc706e7dca9174&amp;dn=Hush..Hush%2C+Sweet+Charlotte+%5BBette+Davis+1964%5D+DVDrip+-+cOOt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"jerry7_57","files":-1,"time":1270597275,"description":"I Know there are other copies out there but I have d/l all of them and they all had sync issues. This far too good of a movie not to have a good copy out there. I assure you there is no sync issues with this copy!!\n\n\n\nSynopsis: Bette Davis plays Charlotte Hollis, a hermetic spinster haunted by memories of her murdered fiancÃƒÂ©. Charlotte, whose only social contact is with her maid, Velma (Agnes Moorehead), is crushed to... Bette Davis plays Charlotte Hollis, a hermetic spinster haunted by memories of her murdered fiancÃƒÂ©. Charlotte, whose only social contact is with her maid, Velma (Agnes Moorehead), is crushed to learn that the state wants to tear down her mansion and put up a highway in its place. She calls on her cousin Miriam (Olivia de Havilland) for help, but Miriam fails to offer any assistance other than bringing in the family physician (Joseph Cotten) to have her troubled relative committed. As the nightmares of her fiancÃƒÂ© continue to haunt her, Charlotte ends up fighting not only for the Hollis estate but for her sanity as well. Director Robert Aldrich resumes the electric collaboration\nwith Davis begun in the terrifying smash hit WHAT EVER HAPPENED TO BABY JANE? Davis heads up the stellar cast (which includes Bruce Dern and George Kennedy in small, early roles and Mary Astor in her last film appearance) with a performance that radiates desperation, entrapment, and inevitable collapse. HUSH...HUSH, SWEET CHARLOTTE provides a chilling investigation of a heartbreakingly demented mind.","torrent":{"xt":"urn:btih:20a6745360ba1609421229fc49fc706e7dca9174","amp;dn":"Hush..Hush%2C+Sweet+Charlotte+%5BBette+Davis+1964%5D+DVDrip+-+cOOt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20a6745360ba1609421229fc49fc706e7dca9174","infoHashBuffer":{"type":"Buffer","data":[32,166,116,83,96,186,22,9,66,18,41,252,73,252,112,110,125,202,145,116]},"announce":[],"urlList":[]}}