{"title":"Lego Marvels Avengers PS3","uid":13296357,"size":6800017332,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:20bc9c98ded9d099e4f492ad2902f672f373e726&amp;dn=Lego+Marvels+Avengers+PS3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"punk_oll","files":141,"time":1453640444,"description":"Game overview\r\n\r\nAvengers Assemble! The best-selling LEGO Marvel videogame franchise returns with a new action-packed, Super Hero adventure. Join the LEGO Marvel’s Avengers team and experience the first console videogame featuring characters and storylines from the critically-acclaimed film Marvel’s The Avengers, the blockbuster sequel Marvel’s Avengers: Age of Ultron, and more. Play as the most powerful Super Heroes in their quest to save the world. \r\n\r\nGame Features\r\n\r\n    Diverse roster of Marvel’s Avengers characters –Play and unlock more than 100 new and returning characters with an array of exciting capabilities, including fan favorites like Hulk, Iron Man, Captain America and Thor, new characters from Marvel’s Avengers: Age of Ultron, and more.\r\n\r\n    New and enhanced powers and abilities – Battle in new ways with enhanced powers and character abilities. Team up with core Avengers to execute incredible combo moves.  \r\n\r\n    Free Roam Gameplay – Enjoy LEGO Marvel’s Avengers’ unique take on open world gameplay as you assume the roles of Earth’s Mightiest Heroes to collect gold bricks, studs, and unlock additional characters.\r\n\r\n    Variety of iconic locations – Visit iconic Marvel Cinematic Universe locations from around the world.\r\n\r\n    Experience the blockbuster action from the Avengers films – Relive key moments from Marvel’s The Avengers, Marvel’s Avengers: Age of Ultron and more, with a splash of classic LEGO humor","torrent":{"xt":"urn:btih:20bc9c98ded9d099e4f492ad2902f672f373e726","amp;dn":"Lego+Marvels+Avengers+PS3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20bc9c98ded9d099e4f492ad2902f672f373e726","infoHashBuffer":{"type":"Buffer","data":[32,188,156,152,222,217,208,153,228,244,146,173,41,2,246,114,243,115,231,38]},"announce":[],"urlList":[]}}