{"title":"Voice Of The Seven Woods - Voice Of The Seven Woods [2007][EAC,l","uid":8208906,"size":240427560,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:21052edc8816da2fc31fe222742b27f291fc5221&amp;dn=Voice+Of+The+Seven+Woods+-+Voice+Of+The+Seven+Woods+%5B2007%5D%5BEAC%2Cl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":13,"time":1362185525,"description":"Artist: Voice Of The Seven Woods\nRelease: Voice Of The Seven Woods\nDiscogs: 1237625\nReleased: 2007-08-06\nLabel: Twisted Nerve\nCatalog#: TN 077\nFormat: LAC / Lossless / Log (100%) / Cue / CD\nCountry: UK\nStyle: Rock, Folk Rock, Acoustic\n\nTracklisting:\n\n01. Sand And Flames (4:17)\n02. Sayat Nova (2:52)\n03. The Fire In My Head (3:29)\n04. Silver Morning Branches (3:58)\n05. Second Transition (3:26)\n06. Valley Of The Rocks (3:21)\n07. Underwater Journey (2:17)\n08. Return From Byzantium (6:35)\n09. The Smoking Furnace (2:50)\n10. Dusk Cloud (1:42)\n\nCredits: Show\n\nGuitarist Rick Tomlinson is one of those rare individuals able to synthesize the influences of a diverse record collection into something far greater than its disparate parts. As his alter ego Voice of the Seven Woods, he's released a stream of 7&quot;s and CD-Rs (the 'R' stands for rare) that have given psychedelic folk fans a reason to live in the present again. Truly, a man of Tomlinson's pedigree deserves wider recognition. It's practically impossible to track down most of his transmissions (a fact that no doubt plays a large role in his current niche appeal) and that's a shame, since Tomlinson is one of the few psych stars with the talent and melodicism to attract a crossover audience.\n\nThat's all about to change. Thanks to the label Twisted Nerve and Manchester UK cartel B-Music, Tomlinson finally has a stage befitting his abilities. His eponymous debut, Voice of the Seven Woods, is no ramshackle rustic recording. These 10 sprawling compositions are intricately arranged and produced with almost glossy precision, like a drab forest brought to life through anHD lens.\n\nThe exquisite guitar work and Middle Eastern sensibilities (extended ragas, bongos and fuzzed-out guitar tones) places Tomlinson clearly in the camp of Jack Rose and Sir Richard Bishop (even the mondo obscure Wilburn Burchette), but he's more akin to Sandy Bull or hyphen-folk pioneers Pentangle. Like Bull, Tomlinson manages to find ways to extend his fretwork into mesmerizing tones atop quiet undercurrents of simple percussion, his pieces evolving slowly into mass hedonism. And unlike most of his contemporaries,Tomlinson works equal parts Krautrock, Turkish psych and British hard-folk into his pieces.\n\nFor instance, &quot;The Fire in My Head&quot; starts with a watery Middle Eastern guitar rhythm that builds over a tambourine/bongo beat, then morphs into a massive groove with enough hard-hitting kit to make John Bonham proud. The lone vocal track, &quot;Silver Morning Branches,&quot; grows from whispers and intricate fret board meanderings to full-blown psychedelia. Considering Tomlinson's exemplary technique, this could have turned into a wanky showcase for another guitar wunderkind who fell in love with '70s folk music. But Tomlinson proves himself much more than just a guitarist. The arrangements are perfectly off-kilter, and songs like &quot;Second Transition&quot; burn in the best tradition of British folk rock.\n\nYou could call it fret-folk freak-beat (not bad, actually), but inordinate labels like that complicate what's in essence a pure - and purifying - listening experience. Simply put, Voice of the Seven Woods is a vibrant, intelligent and engaging record, simultaneously delicate and dangerous, and sure to be one of the best things you'll hear in 2007.","torrent":{"xt":"urn:btih:21052edc8816da2fc31fe222742b27f291fc5221","amp;dn":"Voice+Of+The+Seven+Woods+-+Voice+Of+The+Seven+Woods+%5B2007%5D%5BEAC%2Cl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21052edc8816da2fc31fe222742b27f291fc5221","infoHashBuffer":{"type":"Buffer","data":[33,5,46,220,136,22,218,47,195,31,226,34,116,43,39,242,145,252,82,33]},"announce":[],"urlList":[]}}