{"title":"The Savior Generals: From Ancient Greece to Iraq (2013)","uid":8549313,"size":4132199,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:211023422667d9fbb45b049db4827abc1f6de759&amp;dn=The+Savior+Generals%3A+From+Ancient+Greece+to+Iraq+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":2,"time":1370605015,"description":"The Savior Generals: How Five Great Commanders Saved Wars That Were Lost - From Ancient Greece to Iraq\n\n\nLeading military historian Victor Davis Hanson returns to non-fiction in The Savior Generals, a set of brilliantly executed pocket biographies of five generals who single-handedly saved their nations from defeat in war. War is rarely a predictable enterprise--it is a mess of luck, chance, and incalculable variables. Today's sure winner can easily become tomorrow's doomed loser. Sudden, sharp changes in fortune can reverse the course of war.\n These intractable circumstances are sometimes mastered by leaders of genius--asked at the eleventh hour to save a hopeless conflict, created by others, often unpopular with politics and the public. These savior generals often come from outside the established power structure, employ radical strategies, and flame out quickly. Their careers often end in controversy. But their dramatic feats of leadership are vital slices of history--not merely as stirring military narrative, but as lessons on the dynamic nature of consensus, leadership, and destiny.\n\nepub &amp; mobi\n\n2013","torrent":{"xt":"urn:btih:211023422667d9fbb45b049db4827abc1f6de759","amp;dn":"The+Savior+Generals%3A+From+Ancient+Greece+to+Iraq+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"211023422667d9fbb45b049db4827abc1f6de759","infoHashBuffer":{"type":"Buffer","data":[33,16,35,66,38,103,217,251,180,91,4,157,180,130,122,188,31,109,231,89]},"announce":[],"urlList":[]}}