{"title":"Stephen Hawking - My Brief History","uid":11676344,"size":65084632,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2117619e271e17b51062e05531002fd2504d33cf&amp;dn=Stephen+Hawking+-+My+Brief+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cybotage","files":5,"time":1422889558,"description":"Stephen Hawking has dazzled listeners worldwide with a string of best sellers exploring the mysteries of the universe. Now, for the first time, perhaps the most brilliant cosmologist of our age turns his gaze inward for a revealing look at his own life and intellectual evolution.\n\nMy Brief History recounts Stephen HawkingÂ¿s improbable journey, from his postwar London boyhood to his years of international acclaim and celebrity. This concise, witty, and candid account introduces listeners to a Hawking rarely glimpsed in previous books: the inquisitive schoolboy whose classmates nicknamed him Einstein; the jokester who once placed a bet with a colleague over the existence of a particular black hole; and the young husband and father struggling to gain a foothold in the world of physics and cosmology.\n\nWriting with characteristic humility and humor, Hawking opens up about the challenges that confronted him following his diagnosis of ALS at age 21. Tracing his development as a thinker, he explains how the prospect of an early death urged him onward through numerous intellectual breakthroughs, and talks about the genesis of his masterpiece A Brief History of Time - one of the iconic books of the 20th century.\n\nClear-eyed, intimate, and wise, My Brief History opens a window for the rest of us into HawkingÂ¿s personal cosmos.\n\nRead by Matthew Brenher\nFormat: MP3\nBitrate: 64 Kbps\nUnabridged","torrent":{"xt":"urn:btih:2117619e271e17b51062e05531002fd2504d33cf","amp;dn":"Stephen+Hawking+-+My+Brief+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2117619e271e17b51062e05531002fd2504d33cf","infoHashBuffer":{"type":"Buffer","data":[33,23,97,158,39,30,23,181,16,98,224,85,49,0,47,210,80,77,51,207]},"announce":[],"urlList":[]}}