{"title":"Robert Fisk - Beirut to Bosnia - 3 Parts","uid":4708046,"size":1403069928,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:218f78e7ce16024dcefaa2e1e4d724778447ca7c&amp;dn=Robert+Fisk+-+Beirut+to+Bosnia+-+3+Parts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"amgine2007","files":3,"time":1233926612,"description":" From Beirut to Bosnia is a three part documentary by Robert Fisk shown on the Discovery Channel focusing on Lebanon, Palestine, Egypt and Bosnia. It spans different nations and different peoples, but the problems and tragedies, the false hopes and betrayals, these are always the same. Muslims all over the world bear the brunt of Western foreign policy and local dictatorial rule. They pay the price of these policies and adventures with their land, freedom, property and lives. This mixture, of oppression, poverty and abuse has alienated millions of Muslims from their own governments as well as from some in the West. Today we witness a region on fire, plagued with instability. Robert Fisk analyses some of the root causes of the conflicts and tragedies we hear about daily.\n\nAnother in the compelling series Beirut to Bosnia from Films for the Humanities, To the Ends of the Earth compares the plight of Muslims in Egypt and Bosnia. Though separated by geography and the distinct cultures in which they live their lives, this video reveals the feeling of betrayal by the West experienced by these two Muslim communities. Interviews with Islamic freedom fighters and war casualties shed light on the dynamics of the ongoing struggle for the survival of these communities. \n\n\nPart I: The Martyr's Smile::\nThis Films for the Humanities production focuses its capable eye on Lebanon's guerilla war that aims to liberate southern Lebanon from Israeli control. The scope of this tragic conflict is brought into sharp focus in this documentary through the use of extensive interviews with participants from the Hezbollah and Islamic Jihad movements, views of civilian casualties caused by Israeli air attacks, and photographic evidence of the ongoing destruction of life and property in the region. The viewer should be advised that this video contains some disturbing scenes of this conflict.\n\n\nPart II: The Road to Palestine:\nAnother in the Beirut to Bosnia series from Films for the Humanities, The Road to Palestine provides the viewer with a glimpse into the ongoing conflict in the region around Jerusalem and the Gaza Strip. Through interviews with members of the militant Islamic group Hamas, as well as Zionist settlers and Jewish refugees, this documentary succeeds at revealing some of this tragic situation.\n\n\nPart III: To the Ends of the Earth:\nAnother in the compelling series Beirut to Bosnia from Films for the Humanities, To the Ends of the Earth compares the plight of Muslims in Egypt and Bosnia. Though separated by geography and the distinct cultures in which they live their lives, this video reveals the feeling of betrayal by the West experienced by these two Muslim communities. Interviews with Islamic freedom fighters and war casualties shed light on the dynamics of the ongoing struggle for the survival of these communities.","torrent":{"xt":"urn:btih:218f78e7ce16024dcefaa2e1e4d724778447ca7c","amp;dn":"Robert+Fisk+-+Beirut+to+Bosnia+-+3+Parts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"218f78e7ce16024dcefaa2e1e4d724778447ca7c","infoHashBuffer":{"type":"Buffer","data":[33,143,120,231,206,22,2,77,206,250,162,225,228,215,36,119,132,71,202,124]},"announce":[],"urlList":[]}}