{"title":"Five Finger Death Punch - Bad Company (2nafish)","uid":6001631,"size":157982724,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2194223ff1a646f8d053baa47acc42021bdfcf5c&amp;dn=Five+Finger+Death+Punch+-+Bad+Company+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"2nafish","files":-1,"time":1291196832,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Bad Company&quot; is a song from the hard rock band Bad Company. It was released as the third single from their debut album Bad Company in 1974. Co-written by the group's lead singer Paul Rodgers and drummer Simon Kirke, the song's meaning comes from the movie of the same name featuring Jeff Bridges and Barry Brown. The introductory three chords of the song are also in the movie.\n\nIt is one of the few songs where the artist, album and song names are the same. Other examples include Bo Diddley, Black Sabbath, Blue Murder, Bad Religion, Visage, MotÃƒÂ¶rhead, Iron Maiden, Metal Church, Minor Threat, Great Lake Swimmers, Another Black Day, Talk Talk, Bang Camaro, Wilco, Deicide, Pennywise, Dog Police, Living In A Box, Hellyeah, Wavves, Eisbrecher and Titus Andronicus.\n\nFive Finger Death Punch frequently performs a cover of this song live, and professionally recorded the song for their second album War Is the Answer. They released the song as the fifth single from War Is the Answer, and their eighth single overall on May 17, 2010. A music video for the song was recorded while the band was performing for the United States troops in Iraq. The video premiered on June 11, 2010. The song has reached #7 on the Rock Songs chart, #28 on the Alternative Songs chart and #2 on the Billboard Hot Mainstream Rock Tracks, making it their first top-5 hit and their highest charting single to date. The song has a significantly heavier tone to it, along with several lyrical edits (&quot;I was born a shotgun in my hands&quot;, &quot;the death punch sound is our claim to fame&quot;).\n\nWar Is the Answer is the second studio album by American heavy metal band Five Finger Death Punch. It was released on September 22, 2009 through Prospect Park Records and debuted at #7 on the Billboard 200 selling approximately 44,000 copies in its first week. Metal Hammer magazine named it the 16th best album of 2009. The album has sold 342,000 copies according to Nielsen Soundscan.\n\nFive Finger Death Punch is an American heavy metal band from Los Angeles, California. Formed in 2005, the group's named is derived from classic oriental martial arts cinema. The band originally consisted of Motograter and Ghost Machine vocalist Ivan Moody, U.P.O. guitarist Zoltan Bathory, guitarist Caleb Bingham, Anubis Rising and Deadsett bassist Matt Snell, and W.A.S.P. drummer Jeremy Spencer. Bingham was replaced by W.A.S.P. guitarist Darrell Roberts in 2006, who was replaced by Alice Cooper guitarist Jason Hook in 2009.\n\nThey achieved commercial success rapidly: their debut album, The Way of the Fist (2007) has currently sold over 420,000 copies in the United States. Their second album, War Is the Answer (2009), sold more than 44,000 copies in its first week of release, and has gone on to sell more than 340,000 copies. They have released five top ten singles: &quot;The Bleeding&quot;, &quot;Never Enough&quot;, &quot;Hard to See&quot;, &quot;Walk Away&quot; and &quot;Bad Company&quot;.\n\nThey have played many major tours and festivals including playing on the JÃƒÂ¤germeister Stage (second stage) at Mayhem Festival in 2008 and the main stage at Mayhem Festival in 2010. They performed at Download Festival during both 2009 and 2010. They supported Korn on their Family Values and Bitch We Have a Problem tours, Disturbed on their 2008 Indestructible tour and Godsmack on their 2010 The Oracle tour.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:2194223ff1a646f8d053baa47acc42021bdfcf5c","amp;dn":"Five+Finger+Death+Punch+-+Bad+Company+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2194223ff1a646f8d053baa47acc42021bdfcf5c","infoHashBuffer":{"type":"Buffer","data":[33,148,34,63,241,166,70,248,208,83,186,164,122,204,66,2,27,223,207,92]},"announce":[],"urlList":[]}}