{"title":"Malibu Mystery Series 1-4 ~ A B C D is for by Rebecca Cantrell","uid":15575018,"size":2655058,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2265f1645c4947edccbc37987920ca92ecbe288d&amp;dn=Malibu+Mystery+Series+1-4+%7E+A+B+C+D+is+for+by+Rebecca+Cantrell+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"KiwiSue49","files":9,"time":1471312777,"description":"&quot;A&quot; is for Actress (Malibu Mystery Book 1)\r\n\r\nAfter a decade spent in the glare of the Hollywood spotlight as the star of kids’ TV show Half Pint Detective, Sofia Salgado has had enough. Desperate to build a life outside showbiz, she quits acting to do something that everyone around her–including her family—thinks is plain nuts. Get a real job. \r\n\r\nThey think she’s even crazier when she announces that she’s going to become a real detective, instead of playing one on TV. She’s convinced the technical consultant from her TV show, Brendan Maloney, to take her on in his detective agency, but can accident-prone Sofia hack it?\r\n\r\n\r\n\r\n          &quot;B&quot; is for Bad Girls (Malibu Mystery Book 2)\r\n\r\nMaloney Investigation’s newest private detective, Sofia Salgado, is back on the case that turns into her mother’s worst nightmare when she ends up undercover in one of Malibu’s many rehab clinics. \r\n\r\nIf she doesn’t solve the mystery in time, she and all the bad girls she meets inside, including rock star Brandi Basher and reality TV train wreck Monaco Jane, might just end up going to the big rehab center in the sky.\r\n\r\n\r\n\r\n          &quot;C&quot; is for Coochy Coo (Malibu Mystery Book 3)\r\n\r\nFormer child star Sofia Salgado is finding her feet as a trainee investigator at Malibu detective agency, Maloney Investigations, when a new case throws her, and everyone else at the agency, for a loop. \r\n\r\nMaloney Investigations are drafted in to help thirteen-year-old Daniel find his birth father. There’s only one snag. According to Daniel’s mom, former Los Angeles party girl, Candy, there’s more than one candidate. A lot more!\r\n\r\n\r\n\r\n\r\n          &quot;D&quot; is for Drunk (Malibu Mystery Book 4)\r\n\r\nMaloney Investigation’s new client? An eccentric vineyard owner convinced his even more eccentric neighbor is siphoning off his precious water. But of course it’s not as simple as that. Or as dignified. Sofia and Aidan soon find out these Merlot messiahs are turning water into wacky, plowing more than fields, and sowing more than grapes. But there’s no putting the cork back in when the opposing vintner turns up naked and face down in a trough of sour grapes. Can Sofia and Aidan clear their client and unmask the killer? Or will they, too, perish in the Pinot Noir?\r\n\r\n\r\n\r\n\r\nOpened up the mobi file in Kindle for PC [Windows], Kindle for Android, in Kindle Previewer, and Mobipocket Reader app for PC [Windows], with the epub opening up in Calibre for PC [Windows]","torrent":{"xt":"urn:btih:2265f1645c4947edccbc37987920ca92ecbe288d","amp;dn":"Malibu+Mystery+Series+1-4+%7E+A+B+C+D+is+for+by+Rebecca+Cantrell+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2265f1645c4947edccbc37987920ca92ecbe288d","infoHashBuffer":{"type":"Buffer","data":[34,101,241,100,92,73,71,237,204,188,55,152,121,32,202,146,236,190,40,141]},"announce":[],"urlList":[]}}