{"title":"The Hush Sound - So Sudden (2005)","uid":4115145,"size":55022611,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:22772a51ed093a05b82f2b75fc2cd782cdc5d7bd&amp;dn=The+Hush+Sound+-+So+Sudden+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"aluizbsilva","files":16,"time":1207265824,"description":"ARTiST   :  The Hush Sound\nALBUM    :  So Sudden\nLABEL    :  Decaydance / Fueled By Ramen\nGENRE    :  Indie\n\nENCODER  :  Lame 3.90 / APS\nQUALiTY  :  VBRkbps / 44.1kHz / Joint-Stereo\n\nRELEASE  :  Oct-01-2005\nSTREET   :  Oct-11-2005\nSOURCE   :  CDDA\nTYPE     :  Album\nPLAYTIME :  38:20 min\n\n=================\n+ TRACK LiSTiNG +\n=================\n[#] [Track Name]                                      [Time]\n\n01. City Traffic Puzzle                               03:29\n02. Weeping Willow                                    02:17\n03. Crawling Towards The Sun                          02:57\n04. The Artist                                        03:36\n05. Unsafe Safe                                       03:34\n06. Momentum                                          03:32\n07. Hourglass                                         02:38\n08. Echo                                              04:59\n09. My Apologies                                      02:16\n10. The Market                                        01:54\n11. Tides Change                                      01:22\n12. Carry Me Home                                     02:16\n13. Eileen                                            03:30\n\n=======================\n+ RELEASE iNFORMATiON +\n=======================\n\nWith the ever-exploding Chicago music scene, which is rapidly\nbecoming known for producing some of today?s best underground\nbands, comes The Hush Sound ? a much-needed breath of fresh\nair from the monotony of today?s oversaturated music scene.\nThe Hush Sound offers something different. Comprised of four\nmembers (who all sing, by the way), this indie-folk-pop-rock\nband spurts out songs that are full of catchy guitar riffs,\nuplifting piano parts and layered male/female vocals. Their\nstyle is hard to pinpoint as anything but original and\nimaginative.\n\nThe Hush Sound first began as a casual pastime when longtime\nfriends Bob Morris and Greta Salpeter began playing music\ntogether for fun during their free time. Introduced by mutual\nfriends (Bob a sophomore in high school and Greta only in\nseventh grade), they were an unlikely musical combination: he\nhad been in rock bands since age 12 and she was a classically\ntrained pianist since age 3. ?I had horrible stage fright at\nfirst,? Greta admits, but Bob wasn?t about to let her quit.\n?He told me that I have talent and that I needed to pursue my\npassion, music, and we started writing songs together after\nthat.?\n\nIt wasn?t until winter of 2004/05 that the band started\nwriting seriously. Originally an acoustic/piano duo, The Hush\n(later adding the ?Sound? after finding out a rapper shared\nthe name) decided to branch out and try their hand at adding\ndrums and bass. Coincidentally around the same time, Darren\nWilson and Chris Faller, friends from another local Chicago\nband, were looking for a new band to play with. Bob got in\ncontact with Darren and jammed out about 5 or 6 songs that\nwould later be a part of their first album. ?At first, it was\nonly Darren who joined the band,? Bob explains, ?Chris on the\nother hand, was hesitant.?\n\nThe band went on to play their first show as a three-piece in\na friend?s basement. The next day before watching the tape of\nthe performance, Darren invited Chris to come watch it with\nthe band. Chris was impressed with what he saw and ended up\ncoming out to a practice a few days later. There was immediate\nchemistry and by the end of February, Chris had joined The\nHush Sound and left the other two bands he was in at the time.\nThe lineup was complete.\n\nBy the end of March of 2005, The Hush Sound took all the songs\nthey had written into the studio to record their debut full\nlength. Appropriately titled ?So Sudden? (a reflection on how\nquickly things were moving for the band), the record showcases\na diverse collection of songs? most catchy and tuneful, some\nquirky, while others are haunting and beautiful. Colored with\nimagery evoking lyrics reflecting on personal life experience\nand hardship, each song has its own character. Yet, they are\nunified by a certain flair that is The Hush Sound.\n\nSince January of 2005, the band has blossomed around the\nChicago-land area and has played sold out shows with Fall Out\nBoy, The Academy Is? and Motion City Soundtrack. They have\nquickly secured a strong local following, and have sold a\nsurprising large amount of records in such a short period of\ntime (as a DIY release with no label support at the time, they\nsold 300 CDs in two nights). Only five months after the band\nstarted seriously writing and playing shows, they gained the\nattention of Fall Out Boy?s Pete Wentz through their page on\npurevolume.com. Since then, they have found a home on the\nrenowned indie label, Fueled By Ramen / Decaydance Records,\nwho plan to re-release ?So Sudden? fall of 2005. Keep an eye\nout for The Hush Sound, as they will be playing shows around\nthe Midwest during the fall, and have plans to record a follow\nup to ?So Sudden? this winter to be released summer of 2006.\n","torrent":{"xt":"urn:btih:22772a51ed093a05b82f2b75fc2cd782cdc5d7bd","amp;dn":"The+Hush+Sound+-+So+Sudden+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22772a51ed093a05b82f2b75fc2cd782cdc5d7bd","infoHashBuffer":{"type":"Buffer","data":[34,119,42,81,237,9,58,5,184,47,43,117,252,44,215,130,205,197,215,189]},"announce":[],"urlList":[]}}