{"title":"RR Karaoke Collection Vol 084 CDG+MP3 Final","uid":15832578,"size":8482315905,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:229bbcd6248be2bf719627e50c2ed9f8c6123b98&amp;dn=RR+Karaoke+Collection+Vol+084+CDG%2BMP3+Final&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"rigmar_radio","files":6,"time":1473935570,"description":"WELL DONE you have reached the END of this mega Karaoke collection and should now have over 65,000 songs to go out and start your Karaoke host career.  You can keep your collection up to date online at Ace Karaoke or SelectAtrack or any other number of more local to where you live online shops.\r\n\r\nCDG+MP3 Karaoke, over 2000 songs in a single RAR Archive.  Plain text and Excel spreadsheet files of THE WHOLE RIGMAR RADIO KARAOKE COLLECTION are included for the easy printing of your Karaoke idea's book. \r\n\r\nOR you can move with the times and provide a computer or laptop at your venue where the singers can browse the collection without you having to go to the considerable expense of printing out a book which is out of date the day after it returns from the printers.\r\n\r\nWe will now go back to Vol 1 and re seed the collection in batches for 24 hours at a time for the late on parade peers.  I will not support dial up speed slow downloaders, they will be left behind to learn how to torrent properly.  They can start by acting on the advice I give in the plain text file included with most.  They can use google translate to change the language for better understanding as required.\r\n\r\nCU same time next year for the 2017 collection.  Have fun till then.\r\n\r\nRigmar Radio","torrent":{"xt":"urn:btih:229bbcd6248be2bf719627e50c2ed9f8c6123b98","amp;dn":"RR+Karaoke+Collection+Vol+084+CDG%2BMP3+Final","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"229bbcd6248be2bf719627e50c2ed9f8c6123b98","infoHashBuffer":{"type":"Buffer","data":[34,155,188,214,36,139,226,191,113,150,39,229,12,46,217,248,198,18,59,152]},"announce":[],"urlList":[]}}