{"title":"The Beatles - Sgt. Pepper's Lonely Hearts Club Band [MONO] [320k","uid":7696596,"size":95936429,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:22a9742f72f17c928c34b52974bf04bfaf5b7e20&amp;dn=The+Beatles+-+Sgt.+Pepper%27s+Lonely+Hearts+Club+Band+%5BMONO%5D+%5B320k&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"smbdownload","files":-1,"time":1349378019,"description":"Sgt. Pepper's Lonely Hearts Club Band (often referred to simply as Sgt. Pepper) is the eighth studio album by the English rock band The Beatles. Released in June 1967, Rolling Stone called it &quot;the most important rock &amp; roll album ever made ... by the greatest rock &amp; roll group of all time.&quot; The LP included songs such as &quot;With a Little Help from My Friends&quot;, &quot;Lucy in the Sky with Diamonds&quot;, and &quot;A Day in the Life&quot;.\n\nDuring the Sgt. Pepper sessions, the group improved upon the quality of their music's production while exploring experimental recording techniques. Producer George Martin's innovative approach included the use of an orchestra. The songs on the album range from music hall, rock and roll and pop to traditional Indian music. Widely acclaimed and imitated, the album cover's inspiration came from a sketch by Paul McCartney that depicted the band posing in front of a collage of some of their favourite celebrities. It later served as the basis for the design by English pop artists Peter Blake and Jann Haworth.\n\nSgt. Pepper was a worldwide critical and commercial success, spending a total of 27 weeks at the top of the UK Album Chart and 15 weeks at number one on the US Billboard 200. A seminal work in the emerging psychedelic rock style, the album was critically acclaimed upon release and won four Grammy Awards in 1968. In 1994, it was ranked number one in the book All Time Top 1000 Albums. In 2005, the album was placed at number one on Rolling Stone magazine's list of &quot;The 500 Greatest Albums of All Time&quot;. Sgt. Pepper is one of the world's best selling albums, with 11 million RIAA certified copies sold in the US as of 2012.\n\nSgt. Pepper was the first Beatles album to be released with identical track listings in the UK and the US.[67] The American release did not originally contain the side two runout groove and inner groove sound effects that were restored for the worldwide CD issue, released on 1 June 1987.\n\n2009 MONO REMASTER [320k MP3]\n\n01. \t&quot;Sgt. Pepper's Lonely Hearts Club Band&quot;   \tMcCartney \t2:02\n02. \t&quot;With a Little Help from My Friends&quot;   \tStarr \t2:44\n03. \t&quot;Lucy in the Sky with Diamonds&quot;   \tLennon \t3:28\n04. \t&quot;Getting Better&quot;   \tMcCartney \t2:48\n05. \t&quot;Fixing a Hole&quot;   \tMcCartney \t2:36\n06. \t&quot;She's Leaving Home&quot;   \tMcCartney with Lennon \t3:35\n07. \t&quot;Being for the Benefit of Mr. Kite!&quot;   \tLennon \t2:37\n08. \t&quot;Within You Without You&quot; (George Harrison) \tHarrison \t5:04\n09. \t&quot;When I'm Sixty-Four&quot;   \tMcCartney \t2:37\n10. \t&quot;Lovely Rita&quot;   \tMcCartney \t2:42\n11. \t&quot;Good Morning Good Morning&quot;   \tLennon \t2:41\n12. \t&quot;Sgt. Pepper's Lonely Hearts Club Band (Reprise)&quot;  1:19\n13. \t&quot;A Day in the Life&quot;   \tLennon and McCartney \t5:39\t\t","torrent":{"xt":"urn:btih:22a9742f72f17c928c34b52974bf04bfaf5b7e20","amp;dn":"The+Beatles+-+Sgt.+Pepper%27s+Lonely+Hearts+Club+Band+%5BMONO%5D+%5B320k","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22a9742f72f17c928c34b52974bf04bfaf5b7e20","infoHashBuffer":{"type":"Buffer","data":[34,169,116,47,114,241,124,146,140,52,181,41,116,191,4,191,175,91,126,32]},"announce":[],"urlList":[]}}