{"title":"Horace Silver - 1965 - The Cape Verdean Blues (2010) FLAC","uid":8402110,"size":282593020,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:23b70964809f670aeabfbb2dd9c9587a92bb8e09&amp;dn=Horace+Silver+-+1965+-+The+Cape+Verdean+Blues+%282010%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"eika256","files":-1,"time":1366725828,"description":"Horace Silver - 1965 - The Cape Verdean Blues (2010)\n\nAfter the success of Song for My Father and its hit title cut, Horace Silver was moved to pay further tribute to his dad, not to mention connect with some of his roots. Silver's father was born in the island nation of Cape Verde (near West Africa) before emigrating to the United States, and that's the inspiration behind The Cape Verdean Blues. Not all of the tracks are directly influenced by the music of Cape Verde (though some do incorporate Silver's taste for light exoticism); however, there's a spirit of adventure that pervades the entire album, a sense of exploration that wouldn't have been quite the same with Silver's quintet of old. On average, the tracks are longer than usual, and the lineup -- featuring tenor saxophonist Joe Henderson (a holdover from the Song for My Father sessions) and trumpeter Woody Shaw -- is one of the most modernist-leaning Silver ever recorded with. They push Silver into more advanced territory than he was normally accustomed to working, with mild dissonances and (especially in Henderson's case) a rawer edge to the playing. What's more, bop trombone legend J.J. Johnson appears on half of the six tracks, and Silver sounds excited to finally work with a collaborator he'd been pursuing for some time. Johnson ably handles some of the album's most challenging material, like the moody, swelling &quot;Bonita&quot; and the complex, up-tempo rhythms of &quot;Nutville.&quot; Most interesting, though, is the lilting title track, which conjures the flavor of the islands with a blend of Latin-tinged rhythms and calypso melodies that nonetheless don't sound quite Caribbean in origin. Also noteworthy are &quot;The African Queen,&quot; with its blend of emotional power and drifting hints of freedom, and &quot;Pretty Eyes,&quot; Silver's first original waltz. Yet another worthwhile Silver album. (AllMusic)\n\nTrack list:\n01 - The Cape Verdean Blues\n02 - The African Queen\n03 - Pretty Eyes\n04 - Nutville\n05 - Bonita\n06 - Mo' Joe\n\nPersonnel:\nHorace Silver - piano\nWoody Shaw - trumpet\nJoe Henderson - tenor sax\nJ.J. Johnson - trombone on tracks 4 - 6\nBob Cranshaw - bass\nRoger Humphries - drums\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:23b70964809f670aeabfbb2dd9c9587a92bb8e09","amp;dn":"Horace+Silver+-+1965+-+The+Cape+Verdean+Blues+%282010%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23b70964809f670aeabfbb2dd9c9587a92bb8e09","infoHashBuffer":{"type":"Buffer","data":[35,183,9,100,128,159,103,10,234,191,187,45,217,201,88,122,146,187,142,9]},"announce":[],"urlList":[]}}