{"title":"God Bless America (audiobook) by Karen Stollznow 2014","uid":9755899,"size":247607097,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:24640e5558f30f2314d00f704b2732b6167372af&amp;dn=God+Bless+America+%28audiobook%29+by+Karen+Stollznow+2014+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bobpocket","files":22,"time":1394732117,"description":"God Bless America: Strange and Unusual Religious Beliefs and Practices in the United States (Audiobook) By Karen Stollznow, read by the author\nUnabridged edition 2014 | 8 hours and 35 mins | ISBN: n/a | ASIN: B00IT5Y676 | MP3 64 kbps | 236 MB\n\nGod Bless America lifts the veil on strange and unusual religious beliefs and practices in the modern-day United States. Do Satanists really sacrifice babies? Do exorcisms involve swearing and spinning heads? Are the Amish allowed to drive cars and use computers? Offering a close look at snake handling, new age spirituality, Santeria spells, and satanic rituals, this book offers more than mere armchair research. It takes you to an exorcism, a Charismatic church, and a Fundamentalist Mormon polygamist compound.\n\n\nYou will sit among the beards and bonnets in a Mennonite church, hear the sounds of silence at a Quaker meeting, and listen to L. Ron Hubbard's sci-fi stories told as sermons during a Scientology service. From the Amish to Voodoo, the beliefs and practices explored in this book may be unorthodox, and often dangerous, but they are always fascinating. Some of them are dying out, while others are gaining popularity with a modern audience, but all offer insight into the past, present, and future of religion in the United States.","torrent":{"xt":"urn:btih:24640e5558f30f2314d00f704b2732b6167372af","amp;dn":"God+Bless+America+%28audiobook%29+by+Karen+Stollznow+2014+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24640e5558f30f2314d00f704b2732b6167372af","infoHashBuffer":{"type":"Buffer","data":[36,100,14,85,88,243,15,35,20,208,15,112,75,39,50,182,22,115,114,175]},"announce":[],"urlList":[]}}