{"title":"Twitch City - The Complete Series [DVDRip]","uid":6940681,"size":2675951193,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:249f38257a45311f9bf6979b573b9ad89b44ee47&amp;dn=Twitch+City+-+The+Complete+Series+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"TheDarkIsRising","files":14,"time":1326017773,"description":"Twitch City - The Complete Series [DVDRip]\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0135110&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0135110&lt;/a&gt;\n\n---------------------------------------------------------------------------------\nSummary\n---------------------------------------------------------------------------------\n\nTwitch City is a Canadian sitcom produced by CBC Television. The series aired as two short runs in 1998 and 2000. The series also aired in the United States on Bravo, and in Australia.\n\nThe show's surreal humour was popular with critics. One Australian television critic actually called it the best television show ever made. The show was never a mainstream ratings success in Canada, although it had an extremely devoted cult following.\n\nThe show was directed by Bruce McDonald (director, writer: Highway 61, Roadkill, Hardcore Logo, The Rez) and produced by Shadow Shows and Accent Entertainment in association with the CBC. Music composed by Bob Wiseman.\n\n---------------------------------------------------------------------------------\nPlot\n---------------------------------------------------------------------------------\n\nSet in the Toronto, Ontario neighbourhood of Kensington Market, the series is about Curtis (Don McKellar), a television addict who refuses to leave his apartment, and his friends Nathan (Daniel MacIvor), Hope (Molly Parker), and Newbie (Callum Keith Rennie). McKellar was also one of the show's creators.\n\nFeaturing an excellent supporting cast (including hilarious cameos by Kid in the Hall, Bruce McCulloch as television host Rex Reilly).\n\nIn the first episode, Nathan is sent to prison for killing a homeless man with a can of cat food. The homeless man was played by Al Waxman, who had been the star of the 1970s sitcom King of Kensington, although the producers claimed that they did not intend for the homeless man to be seen as the same character.\n\nThroughout the series, Curtis and Hope's ongoing attempts to find a new roommate provide one of the show's major plot threads. In one episode, Curtis rents Nathan's room to a mysterious businessman who uses it to store drugged cookies, while in another, Hope unwittingly rents it to two Neo-Nazis she mistakes for a gay couple. That episode includes a Nazi rally which features all four members of the rock band Sloan among the extras. At the end of the episode, the two Nazi roommates renounce Nazism and promptly kiss each other, vindicating Hope's judgement.\n\nBruce McCulloch and Mark McKinney (both from The Kids in the Hall) also starred in the series as Rex Reilly, the Jerry Springer-like host of Curtis' favourite TV talk show. McCulloch played Reilly in the first season, and McKinney played him in the second. The change in Reilly's appearance is explained in his autobiography, Tyrannosaurus Rex, which refers to his &quot;on-air cranium transplant.&quot;\n\nGuest stars on the series included Jennifer Jason Leigh, Tom McCamus, Valerie Buhagiar, Charmion King, Kenneth Welsh, Hugh Dillon, Kim Mitchell, Stefan Brogren, John L'Ecuyer and Joyce DeWitt. DeWitt plays herself as a guest on The Rex Reilly Show, meeting lookalikes in an episode devoted to the theme &quot;I Look Like Joyce DeWitt&quot;. (Reilly, at one point, asks DeWitt about the enduring popularity of Three's Company, to which she responds, &quot;It's the writing.&quot;)\n\n-----\n\nTwitch City is a unique and often surreal situation comedy, which takes place in the city of Toronto. There are two roomates, Nathan (played by Daniel MacIvor) and Curtis (played by Don McKellar). They comprise a sort of the Odd Couple for the x-generation. Except in this version, Felix goes to prison for murdering a homeless man with cat food...and Oscar starts making time with Felix's girlfriend in the meantime. All of this is established in the first episode. Where it goes from there is strange and often quite funny.\n\nIn season two of Twitch City, Curtis and Hope's relationship develops further while Nathan adapts to live in prison. This season sees a whole new assortment of strange (sometimes episode-long) scenarios, including color-coordinated Klan members, a &quot;planet of the apes&quot; takeoff and the return of Rex Reilly (now played by erstwhile Kid in the Hall, Mark McKinney).\n\n---------------------------------------------------------------------------------\nRip Specs\n---------------------------------------------------------------------------------\n\nFile Name .........................................: S01E01 - I Slept With My Mother.divx\nFile Size (in bytes) ............................: 224,733,920 bytes\nRuntime ............................................: 23:10.303\n\nVideo Codec ...................................: DivX 5.x/6.x\nFrame Size ......................................: 640x480 (AR: 1.333)\nFPS .................................................: 29.970\nVideo Bitrate ...................................: 897 kb/s\nBits per Pixel ...................................: 0.097 bpp\nB-VOP, N-VOP, QPel, GMC.............: [B-VOP], [], [], []\n\nAudio Codec ...................................: 0x2000 (Dolby AC3) AC3\nSample Rate ...................................: 48000 Hz\nAudio Bitrate ...................................: 192 kb/s [2 channel(s)] CBR\nNo. of audio streams .......................: 2\n\n\nExtras: includes commentary for episodes one and three by actor Don McKellar.\n\nThis is the complete series and includes both Season 1 and Season 2.\n\nUploaders note: \n\nThese are, in fact DVD Rips. However, the quality is lesser than the average DVD Rip. This is due to the quality of the DVDs that were released and not with the rips/encoding on my end. (7 episodes on one DVD is a good indication you're going to have less than stellar quality)\n\n*** Thanks to original ripper and uploader [b]kinghorsey[/b] @ Demonoid ***\n\n","torrent":{"xt":"urn:btih:249f38257a45311f9bf6979b573b9ad89b44ee47","amp;dn":"Twitch+City+-+The+Complete+Series+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"249f38257a45311f9bf6979b573b9ad89b44ee47","infoHashBuffer":{"type":"Buffer","data":[36,159,56,37,122,69,49,31,155,246,151,155,87,59,154,216,155,68,238,71]},"announce":[],"urlList":[]}}