{"title":"EBOOK (Official) - The Cult of Lego [pdf]","uid":8408791,"size":19716007,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:252a2fb4ba51b34e23d04e337f73b967df675593&amp;dn=EBOOK+%28Official%29+-+The+Cult+of+Lego+%5Bpdf%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"lokii_187","files":-1,"time":1366866090,"description":"EBOOK - The Cult of Lego [pdf]\n\nNo, this isn't a book about joining some fringe cult. It's a book by LEGOÂ® fans, for LEGO fans, and you and your kids will love it.\n\nIn The Cult of LEGO, Wired's GeekDad blogger John Baichtal and BrickJournal founder Joe Meno take you on a magnificent, illustrated tour of the LEGO community, its people, and their creations.\n\nThe Cult of LEGO introduces us to fans and builders from all walks of life. People like professional LEGO artist Nathan Sawaya; enigmatic Dutch painter Ego Leonard (who maintains that he is, in fact, a LEGO minifig); Angus MacLane, a Pixar animator who builds CubeDudes, instantly recognizable likenesses of fictional characters; Brick Testament creator Brendan Powell Smith, who uses LEGO to illustrate biblical stories; and Henry Lim, whose work includes a series of models recreating M.C. Escher lithographs and a full-scale, functioning LEGO harpsichord.\n\nMarvel at spectacular LEGO creations like:\n\nA life-sized Stegosaurus and an 80,000-brick T. Rex skeleton\nDetailed microscale versions of landmarks like the Acropolis and Yankee Stadium\nA 22-foot long, 350-pound re-creation of the World War II battleship Yamato\nA robotic, giant chess set that can replay historical matches or take on an opponent\nA three-level, remote-controlled Jawa Sandcrawler, complete with moving conveyor belt\nWhether you're a card-carrying LEGO fanatic or just thinking fondly about that dusty box of LEGO in storage, The Cult of LEGO will inspire you to take out your bricks and build something amazing.\n\nGold Medal, Independent Publisher Book Award, &quot;IPPY&quot; for Pop Culture\n\nSilver Medal, 2012 ForeWord Book of the Year Awards for Crafts and Hobbies\n\nGrand Prize, 2012 San Francisco Book Festival\n\nSelected for the Communication Arts 2012 Design Annual\n\n               *******LET US ALL GET SEEDY TO HELP THE NEEDY*******\n\nA Lokii_187 [MaSSaCRiSiS] Production","torrent":{"xt":"urn:btih:252a2fb4ba51b34e23d04e337f73b967df675593","amp;dn":"EBOOK+%28Official%29+-+The+Cult+of+Lego+%5Bpdf%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"252a2fb4ba51b34e23d04e337f73b967df675593","infoHashBuffer":{"type":"Buffer","data":[37,42,47,180,186,81,179,78,35,208,78,51,127,115,185,103,223,103,85,147]},"announce":[],"urlList":[]}}