{"title":"Bioshock 2 [PAL][Spanish][PS3][www.consolasatope.com]","uid":5935117,"size":10033809874,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:25694a540cc3fab274a2f51a47054d28963cde4f&amp;dn=Bioshock+2+%5BPAL%5D%5BSpanish%5D%5BPS3%5D%5Bwww.consolasatope.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"consolasatope","files":598,"time":1288913857,"description":"SumÃƒÂ©rgete de nuevo en el espectacular e inolvidable mundo de Rapture con BioShock 2, el segundo juego de la franquicia que ha ganado mÃƒÂ¡s de 50 premios al Mejor Juego del AÃƒÂ±o. BioShock 2 aporta a los jugadores una mezcla de combate explosivo de first person shooter con una profunda narrativa para crear uno de los tÃƒÂ­tulos mÃƒÂ¡s esperados de 2009.\nVive el poder y la fuerza bruta de los habitantes mÃƒÂ¡s temerosos de Rapture mientras que tomas el papel del personaje mÃƒÂ¡s icÃƒÂ³nico y significativo de BioShock: el Big Daddy.\nAdemÃƒÂ¡s de un rico y profundo modo campaÃƒÂ±a, tambiÃƒÂ©n se le suma el modo multijugador de BioShock 2, que aportarÃƒÂ¡ una gran experiencia de juego y que expande la historia de los orÃƒÂ­genes de la ficciÃƒÂ³n de BioShock. Situado en el declive de Rapture, los jugadores tomarÃƒÂ¡n el papel de un personaje escogido para probar los nuevos plÃƒÂ¡smidos de Sinclair Solutions, un importante proveedor de plÃƒÂ¡smidos y tÃƒÂ³nicas para la sumergida ciudad de Rapture.\n\nCaracterÃƒÂ­sticas un jugador:\nÃ‚Â· EvoluciÃƒÂ³n del juego de acciÃƒÂ³n genÃƒÂ©ticamente mejorado: los innovadores avances aportan una dimensiÃƒÂ³n y profundidad diferente a cada encuentro. Los elementos novedosos como la capacidad de empuÃƒÂ±ar armas a dos manos y plÃƒÂ¡smidos permiten al jugador crear increÃƒÂ­bles combinaciones de castigo.\nÃ‚Â· Regreso a Rapture: ambientada 10 aÃƒÂ±os despuÃƒÂ©s de los sucesos del Bioshock original, la historia continÃƒÂºa con un viaje ÃƒÂ©pico mÃƒÂ¡s intenso por uno de los mundos ficticios mÃƒÂ¡s cautivadores y espeluznantes jamÃƒÂ¡s creados.\nÃ‚Â· TÃƒÂº eres el Big Daddy: asume el control del prototipo original de Big Daddy, el sÃƒÂ­mbolo mÃƒÂ¡s caracterÃƒÂ­stico y representativo de Bioshock y experimenta el poder y la fuerza bruta de los moradores mÃƒÂ¡s temidos de Rapture para enfrentarte a nuevos y poderosos enemigos.\nÃ‚Â· ContinuaciÃƒÂ³n de la galardonada historia: nuevos y originales recursos narrativos sirven como vehÃƒÂ­culo para la continuaciÃƒÂ³n de una de las historias mÃƒÂ¡s alabadas del mundo del videojuego\n\nCaracterÃƒÂ­sticas multijugador:\nÃ‚Â· Multijugador genÃƒÂ©ticamente mejorado: consigue puntos de experiencia a lo largo del juego para poder acceder a nuevas armas, plÃƒÂ¡smidos y tÃƒÂ³nicos con los que crear cientos de combinaciones diferentes y desarrollar un personaje que se amolde a tu estilo de juego.\nÃ‚Â· Experimenta la guerra civil de Rapture: Los jugadores se pondrÃƒÂ¡n en la piel de los ciudadanos de Rapture y participarÃƒÂ¡n activamente en la guerra civil que devastÃƒÂ³ la ciudad.\nÃ‚Â· Vive Rapture antes de su caÃƒÂ­da: experimenta la vida en Rapture antes de que se la tragase el ocÃƒÂ©ano y combate en lugares mÃƒÂ­ticos que se han vuelto a diseÃƒÂ±ar para el modo multijugador, como el restaurante Kashmir y Mercury Suites.\n\n","torrent":{"xt":"urn:btih:25694a540cc3fab274a2f51a47054d28963cde4f","amp;dn":"Bioshock+2+%5BPAL%5D%5BSpanish%5D%5BPS3%5D%5Bwww.consolasatope.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25694a540cc3fab274a2f51a47054d28963cde4f","infoHashBuffer":{"type":"Buffer","data":[37,105,74,84,12,195,250,178,116,162,245,26,71,5,77,40,150,60,222,79]},"announce":[],"urlList":[]}}