{"title":"What Chemtrails Are Doing To Your Brain - Neurosurgeon Dr. Russe","uid":10658566,"size":151506210,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:2597c43f8c2d990bf62bb53ffe7a9af03cd6e5de&amp;dn=What+Chemtrails+Are+Doing+To+Your+Brain+-+Neurosurgeon+Dr.+Russe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"H2oDragon","files":1,"time":1406690372,"description":"\n\nPublished on Apr 7, 2013\n\nLinderman Unleashed Radio Show March 28th 2013 Broadcast. Curt Linderman speaks with Dr. Blaylock about the devastating health effects of the chemtrails and geoengineering programs which have been implemented in secret without public consent.\n\nChemtrails, Nanoaluminum and Neurodegenerative and Neurodevelopmental Effects\nBy Russell L. Blaylock, M.D.\n\nThe Internet is littered with stories of &quot;chemtrails&quot; and geoengineering to combat &quot;global warming&quot; and until recently I took these stories with a grain of salt. One of the main reasons for my skepticism was that I rarely saw what they were describing in the skies. But over the past several years I have notice a great number of these trails and I have to admit they are not like the contrails I grew up seeing in the skies. They are extensive, quite broad, are laid in a definite pattern and slowly evolve into artificial clouds. Of particular concern is that there are now so many Â­dozens every day are littering the skies.\n\nMy major concern is that there is evidence that they are spraying tons of nanosized aluminum compounds. It has been demonstrated in the scientific and medical literature that nanosized particles are infinitely more reactive and induce intense inflammation in a number of tissues. Of special concern is the effect of these nanoparticles on the brain and spinal cord, as a growing list of neurodegenerative diseases, including Alzheimer's dementia, Parkinson's disease and Lou Gehrig's disease (ALS) are strongly related to exposure to environmental aluminum.\nNanoparticles of aluminum are not only infinitely more inflammatory, they also easily penetrate the brain by a number of routes, including the blood and olfactory nerves (the smell nerves in the nose). Studies have shown that these particles pass along the olfactory neural tracts, which connect directly to the area of the brain that is not only most effected by Alzheimer's disease, but also the earliest affected in the course of the disease. It also has the highest level of brain aluminum in Alzheimer's cases.\n\nThe intranasal route of exposure makes spraying of massive amounts of nanoaluminum into the skies especially hazardous, as it will be inhaled by people of all ages, including babies and small children for many hours. We know that older people have the greatest reaction to this airborne aluminum. Because of the nanosizing of the aluminum particles being used, home filtering system will not remove the aluminum, thus prolonging exposure, even indoors.\nIn addition to inhaling nanoaluminum, such spraying will saturate the ground, water and vegetation with high levels of aluminum. Normally, aluminum is poorly absorbed from the GI tract, but nanoaluminum is absorbed in much higher amounts. This absorbed aluminum has been shown to be distributed to a number of organs and tissues including the brain and spinal cord. Inhaling this environmentally suspended nanoaluminum will also produce tremendous inflammatory reaction within the lungs, which will pose a significant hazard to children and adults with asthma and pulmonary diseases.\n\nI pray that the pilots who are spraying this dangerous substance fully understand that they are destroying the life and health of their families as well. This is also true of our political officials. Once the soil, plants and water sources are heavily contaminated there will be no way to reverse the damage that has been done.\nSteps need to be taken now to prevent an impending health disaster of enormous proportions if this project is not stopped immediately. Otherwise we will see an explosive increase in neurodegenerative diseases occurring in adults and the elderly in unprecedented rates as well as neurodevelopmental disorders in our children. We are already seeing a dramatic increase in these neurological disorders and it is occurring in younger people than ever before.\n\n    Category\n\n    News &amp; Politics\n    License\n\n    Standard YouTube License\n\n","torrent":{"xt":"urn:btih:2597c43f8c2d990bf62bb53ffe7a9af03cd6e5de","amp;dn":"What+Chemtrails+Are+Doing+To+Your+Brain+-+Neurosurgeon+Dr.+Russe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2597c43f8c2d990bf62bb53ffe7a9af03cd6e5de","infoHashBuffer":{"type":"Buffer","data":[37,151,196,63,140,45,153,11,246,43,181,63,254,122,154,240,60,214,229,222]},"announce":[],"urlList":[]}}