{"title":"S. H. Jucha - Méridien (Silver Ships #3)","uid":14158293,"size":413443132,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:25be2727c8fe61fa8db8679733c726ced306b3c3&amp;dn=S.+H.+Jucha+-+M%26eacute%3Bridien+%28Silver+Ships+%233%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cybotage","files":48,"time":1459689625,"description":"The Méridiens are fleeing to their far colonies—and they have reason to run. Over the course of decades, they have lost hundreds of ships, billions of people, and seven Confederation colonies to an alien enemy: an advancing swarm of silver ships transported in the bowels of a gigantic, spherical vessel.\r\n\r\nAlex Racine, who once enjoyed the solitary life of an explorer-tug Captain, is now an Admiral and responsible for the lives of a quarter million Librans. Further complicating his life, Alex’s Librans have made it clear they don’t want to settle on his home world. They want a new home, and he must secure them one.\r\n\r\nThe silver ships await Alex’s makeshift flotilla at Libre, the last colony they consumed. Thus far, Alex’s people have succeeded in skirmishes against the enemy’s fighters. Now, though, they’re preparing to attack the entire alien fleet and halt the devastation of the colonies.\r\n\r\nTo the surprise and chagrin of his officers and crew alike, Alex concocts a new plan, because he believes humanity faces not one but two alien species, and one may be enslaved to the other. If so, Alex believes slaves should be liberated, not obliterated.\r\n\r\nTo test Alex’s theory, his people must capture a wholly intact silver ship—a feat never before accomplished. The crew remains doubtful, but their Admiral is determined to communicate with the aliens before he’s forced to destroy them, and his wish is their command.\r\n\r\n\r\n\r\n\r\nRead by Grover Gardner\r\nFormat: MP3\r\nBitrate: 64 Kbps","torrent":{"xt":"urn:btih:25be2727c8fe61fa8db8679733c726ced306b3c3","amp;dn":"S.+H.+Jucha+-+M%26eacute%3Bridien+%28Silver+Ships+%233%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25be2727c8fe61fa8db8679733c726ced306b3c3","infoHashBuffer":{"type":"Buffer","data":[37,190,39,39,200,254,97,250,141,184,103,151,51,199,38,206,211,6,179,195]},"announce":[],"urlList":[]}}