{"title":"Wing Commander: Privateer GoG","uid":7904989,"size":168581620,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:25cc9f18814e0ba310e9cb0a46aecacd9c1e056d&amp;dn=Wing+Commander%3A+Privateer+GoG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1355072464,"description":"Publisher: Electronic Arts\nDeveloper: Origin Systems\nYear: 1993\nGenre: shooter / action / sci-fi\nNo of players: single player\n\n\n\nCustomize your ship according to your needs and budget, modifying weapons, armor, and other systems\nChoose the life of a pirate, merchant, or mercenary. As long as you keep a couple of steps ahead of your enemies and a couple of bucks in the black, youï¿½re a free agent\nExplore a vast universe with countless bases and planets spread out across dozens of systems. Adventure, trade, and exploration are limitless, even after youï¿½ve finished the main game\n\n2669, Gemini Sector, Troy System. The Terran frontier between the Kilrathi Empire and the unknown. Privateer takes you to the seamy side of the Wing Commander universe. In the far reaches of space, you live by no manï¿½s rules but your own. The fringes are populated by a volatile mix of pirates, miners, mercs, cutthroats, and Kilrathi, all struggling to make a life for themselves.\n\nIn this open-ended game you can choose from many paths. You start with a rusted scout ship and a handful of credits in your pocket. It isn't much, but the universe is there for you to explore in search for profitable opportunities. Become a patient, law-abiding merchant, a smuggler far away from the normal space lanes, a pirate preying on the weak, or a professional mercenary hunting down criminal scum. Or just do whatever suits you at the time. At the end of the day, itï¿½s all about money and survival. Mostly money.\n\nAre you determined enough to forge your own destiny?\n\nInstall and Play.","torrent":{"xt":"urn:btih:25cc9f18814e0ba310e9cb0a46aecacd9c1e056d","amp;dn":"Wing+Commander%3A+Privateer+GoG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25cc9f18814e0ba310e9cb0a46aecacd9c1e056d","infoHashBuffer":{"type":"Buffer","data":[37,204,159,24,129,78,11,163,16,233,203,10,70,174,202,205,156,30,5,109]},"announce":[],"urlList":[]}}