{"title":"Applied Industrial Energy and Environmental Management","uid":12008159,"size":17414755,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25cd20073b20a535a5b3086261dd4de6fa26ed8c&amp;dn=Applied+Industrial+Energy+and+Environmental+Management&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1434031394,"description":"ISBN 9780470697429\n\nIndustrial energy systems channel fuels and power into a variety of energy types such as steam, direct heat, hot fluids and gases, and shaft power for compressors, fans, pumps, and other machine-driven equipment. All of these processes impact the environment and are impacted by external energy and environmental policies and regulations. Therefore many environmental management issues are closely related to energy use and efficiency.\nApplied Industrial Energy and Environmental Management provides a comprehensive and application oriented approach to the technical and managerial challenges of efficient energy performance in industrial plants. Written by leading practitioners in the field with extensive experience of working with development banks, international aid organizations, and multinational companies, the authors are able to offer real case studies as a basis to their method. The book is divided into three main parts:\n\nPart one describes Energy and Environmental Management Systems (EEMS) in current use and management techniques for energy and environmental performance improvement.\nPart two focuses on the engineering aspects of industrial energy management, describing main industrial energy systems and how to analyse and improve their energy performance.\nPart three is the TOOLBOX on an accompanying website, which contains data, analytical methods and questionnaires as well as software programs, to support the practical application of the methods elaborated on in the first two parts of the book.\nThis book will be a valuable resource to practising energy and environmental management engineers, plant managers and consultants in the energy and manufacturing industries. It will also be of interest to graduate engineering and science students taking courses in industrial energy and environmental management","torrent":{"xt":"urn:btih:25cd20073b20a535a5b3086261dd4de6fa26ed8c","amp;dn":"Applied+Industrial+Energy+and+Environmental+Management","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25cd20073b20a535a5b3086261dd4de6fa26ed8c","infoHashBuffer":{"type":"Buffer","data":[37,205,32,7,59,32,165,53,165,179,8,98,97,221,77,230,250,38,237,140]},"announce":[],"urlList":[]}}