{"title":"Karl Marlantes - What It Is Like To Go To War (mobi + epub)","uid":7899917,"size":812481,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25fe3a51b05c886618124aa522d39edba217534d&amp;dn=Karl+Marlantes+-+What+It+Is+Like+To+Go+To+War+%28mobi+%2B+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"kevinkray","files":-1,"time":1354939472,"description":"In 1968, at the age of 22, Karl Marlantes abandoned his Oxford University scholarship to sign up for active service with the US Marine Corps in Vietnam. Pitched into a war that had no defined military objective other than kill ratios and body counts, what he experienced over the next thirteen months in the jungles of South East Asia shook him to the core. But what happened when he came home covered with medals was almost worse. It took Karl four decades to come to terms with what had really happened, during the course of which he painstakingly constructed a fictionalized version of his war, MATTERHORN, which has subsequently been hailed as the definitive Vietnam novel. WHAT IT IS LIKE TO GO TO WAR takes us back to Vietnam, but this time there is no fictional veil. Here are the hard-won truths that underpin MATTERHORN: the author's real-life experiences behind the book's indelible scenes. But it is much more than this. It is part exorcism of Karl's own experiences of combat, part confession, part philosophical primer for the young man about to enter combat. It It is also a devastatingly frank answer to the questions 'What is it like to be a soldier?' What is it like to face death?' and 'What is it like to kill someone?'","torrent":{"xt":"urn:btih:25fe3a51b05c886618124aa522d39edba217534d","amp;dn":"Karl+Marlantes+-+What+It+Is+Like+To+Go+To+War+%28mobi+%2B+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25fe3a51b05c886618124aa522d39edba217534d","infoHashBuffer":{"type":"Buffer","data":[37,254,58,81,176,92,136,102,24,18,74,165,34,211,158,219,162,23,83,77]},"announce":[],"urlList":[]}}