{"title":"Ancient Philosophy - Kenny, Anthony [Non-Fiction] Mobi/Epub/PDF_","uid":8840453,"size":13595083,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:264e29e4339fa4000d8c4ebdaccceeab5127b9f6&amp;dn=Ancient+Philosophy+-+Kenny%2C+Anthony+%5BNon-Fiction%5D+Mobi%2FEpub%2FPDF_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"K-Slender","files":5,"time":1377229217,"description":"Sir Anthony Kenny here tells the fascinating story of the birth of philosophy and its remarkable flourishing in the ancient Mediterranean world. This is the initial volume of a four-book set in which Kenny will unfold a magisterial new history of Western philosophy, the first major single-author history of philosophy to appear in decades.\nAncient Philosophy spans over a thousand years and brings to life the great minds of the past, from Thales, Pythagoras, and Parmenides, to Socrates, Epictetus, Marcus Aurelius, and Augustine. The book's great virtue is that it is written by one of the world's leading authorities on the subject. Instead of an uncritical, straightforward recitation of known facts--Plato and his cave of shadows, Aristotle's ethics, Augustine's City of God--we see the major philosophers through the eyes of a man who has spent a lifetime contemplating their work. Thus we do not simply get an overview of Aristotle, for example, but a penetrating and insightful critique of his thought. Kenny offers an illuminating account of the various schools of thought, from the Pre-Socratics to the Epicureans. He examines the development of logic and reason, ancient ideas about physics (&quot;how things happen&quot;), metaphysics and ethics, and the earliest thinking about the soul and god.\nVividly written, but serious and deep enough to offer a genuine understanding of the great philosophers, Kenny's lucid and stimulating history will become the definitive work for anyone interested in the people and ideas that shaped the course of Western thought. ","torrent":{"xt":"urn:btih:264e29e4339fa4000d8c4ebdaccceeab5127b9f6","amp;dn":"Ancient+Philosophy+-+Kenny%2C+Anthony+%5BNon-Fiction%5D+Mobi%2FEpub%2FPDF_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"264e29e4339fa4000d8c4ebdaccceeab5127b9f6","infoHashBuffer":{"type":"Buffer","data":[38,78,41,228,51,159,164,0,13,140,78,189,172,204,238,171,81,39,185,246]},"announce":[],"urlList":[]}}