{"title":"Urban Homesteading (gnv64)","uid":7670739,"size":47599403,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:273c94c6d4a8a2be166d8f446c3a9f086ea65788&amp;dn=Urban+Homesteading+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gnv65","files":-1,"time":1348565097,"description":"Urban Homesteading: Heirloom Skills for Sustainable Living\nby Rachel Kaplan and K. Ruby Blume\nSkyhorse Publishing | April 2011 | ISBN-10: 161608054X | ePUB/PDF | 14.4/30.9 mb &lt;a href=&quot;\nhttp://www.amazon.com/Urban-Homesteading-Heirloom-Skills-Sustainable/dp/161608054X&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Urban-Homesteading-Heirloom-Skills-Sustainable/dp/161608054X&lt;/a&gt;\nPDF conversion is mine.\n\nA comprehensive and inspiring guide to self-reliance, sustainability, and green living for city dwellers. Read it and reap.\nThe urban homesteading movement is spreading rapidly across the nation. Urban Homesteading is the perfect &quot;back-to-the-land&quot; guide for urbanites who want to reduce their impact on the environment. Full of practical information, as well as inspiring stories from people already living the urban homesteading life, this colorful guide is an approachable guide to learning to live more ecologically in the city. The book embraces the core concepts of localization (providing our basic needs close to where we live), self-reliance (re-learning that food comes from the ground, not the grocery store; learning to do things ourselves), and sustainability (giving back at least as much as we take). Readers will find concise how-to information that they can immediately set into practice, from making solar cookers to growing tomatoes in a barrel to raising chickens in small spaces to maintaining mental serenity in the fast-paced city environment. Full of beautiful full-color photographs and illustrations, and plenty of step-by-step instructions, this is a must-have handbook for city folk with a passion for the simple life. 100 color illustrations\n\nAbout the Authors\nRachel Kaplan is the lead author of Urban Homesteading: Heirloom Skills for Sustainable Living. She is an eco-somatic therapist, educator, and widely published author. Her work has appeared in local and national papers and magazines, and includes Moving Toward Life: Five Decades of Transformational Dance (with Anna Halprin), The Probable Site of the Garden of Eden, and Diaspora: Stories from the Cities. She and her family live on a small homestead called Tiny Town Farm, in Petaluma, California.\nK. Ruby Blume is the visual wizard of Urban Homesteading: Heirloom Skills for Sustainable Living. She is the founder of The Institute of Urban Homesteading in Oakland, California. With more than twenty years of experience with gardening, beekeeping, canning, and other homesteading skills, she is a respected authority in the self-sufficiency field. She has been featured on CNN, ABC, and the Hallmark Channel, and her articles have appeared in the San Francisco Chronicle, Oakland Magazine, and other publications.","torrent":{"xt":"urn:btih:273c94c6d4a8a2be166d8f446c3a9f086ea65788","amp;dn":"Urban+Homesteading+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"273c94c6d4a8a2be166d8f446c3a9f086ea65788","infoHashBuffer":{"type":"Buffer","data":[39,60,148,198,212,168,162,190,22,109,143,68,108,58,159,8,110,166,87,136]},"announce":[],"urlList":[]}}