{"title":"Anders Osborne - Black Eye Galaxy [2012][EAC,log,cue. FLAC]","uid":8923879,"size":357108732,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2771c78853c1f3acfea4b7b4a1c7d821b56cf0d8&amp;dn=Anders+Osborne+-+Black+Eye+Galaxy+%5B2012%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":15,"time":1379319932,"description":"Artist: Anders Osborne\nRelease: Black Eye Galaxy\nReleased: 2012\nLabel: Alligator Records\nCatalog#: CD 514948\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle:blues,americana\n\n01- Send Me A Friend (4:19)\n02- Mind Of A Junkie (7:29)\n03- Lean On Me/Believe In You (4:09)\n04- When Will I See You Again? (4:54)\n05- Black Tar (4:56)\n06- Black Eye Galaxy (11:15)\n07- Tracking My Roots (4:04)\n08- Louisiana Gold (5:46)\n09- Dancing In The Wind (4:41)\n10- Higher Ground (3:56)\n\nAnders Osborne extended his reach as a guitarist, songwriter, and recording artist on his Alligator debut, American Patchwork, in 2010. It was louder, wilder, and more psychically free than anything he'd issued previously, while retaining his singer/songwriter skills so wonderfully displayed on 2007's Coming Down. Black Eye Galaxy is the culmination of this trilogy, albeit being a startlingly new entity. It seamlessly marries desperate, overloaded, molten hard rock and blues to expertly written songs that grow more tender, accepting, and optimistic by the set's close. Osborne creates something totally his own; genres cease to matter. Co-produced by Osborne, Stanton Moore, and engineer Warren Riker, the meld of sounds is immediate, gripping, sometimes harrowing, and always uncompromising no matter what is being expressed. The primal &quot;Send Me a Friend&quot; is a boatload of riff-and-roar. It's a redefinition of the blues regardless of whether it follows 12 bars. The song is about the complete isolation of addiction; it's a howl of terror and pleading to an unknown God with bludgeoning riffs and a ripping solo. &quot;Mind of a Junkie&quot; begins by crossing Neil Young &amp; Crazy Horse with Wes Montgomery. Its lyrics reveal the cycle of addiction, recovery, relapse, and beginning again, the frustration and dangers and character flaws all expressed honestly and without artifice. Its angular guitar solo moves into a strange, lovely terrain, never leaving the soul of the tune behind. &quot;Black Tar&quot; is a slide guitar screamer; Osborne's vocals, plodding rhythm section, and effects just crackle, break, and crunch, without sacrificing melody in the punishing thud. The title track is a long, haunting, and labyrinthine psychedelic ballad, with gorgeous guitar and rhythm section interplay; it's a wellspring of inspired improvisation. Despite the brief respite of a gorgeous love song in the middle of all this, &quot;Lean on Me/Believe in You,&quot; the first half of the record is pure stress, strain, and primal shriek. The set's final four songs are, by contrast, nearly serene, as the country-ish &quot;Tracking My Roots&quot; gives way to the acoustic traveling song &quot;Louisiana Gold.&quot; The languid 4/4 love song that is &quot;Dancing in the Wind&quot; sets up the stellar closer. &quot;Higher Ground&quot; is like a gospel testament, but it's personal, not evangelical. With Stevie Blacke's sparse but nearly regal strings and backing vocals by Osborne's band, wife, and children, it's an anthem about the transformative power of love itself. Black Eye Galaxy rises from the depths of an individual's hell transformed via its songwriter's vision to the heights of possibility -- personally, poetically, and musically. It's the most consistent, expertly rendered offering in Osborne's catalog, the place where everything and everywhere he's been as a musician come together in a glorious whole.","torrent":{"xt":"urn:btih:2771c78853c1f3acfea4b7b4a1c7d821b56cf0d8","amp;dn":"Anders+Osborne+-+Black+Eye+Galaxy+%5B2012%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2771c78853c1f3acfea4b7b4a1c7d821b56cf0d8","infoHashBuffer":{"type":"Buffer","data":[39,113,199,136,83,193,243,172,254,164,183,180,161,199,216,33,181,108,240,216]},"announce":[],"urlList":[]}}