{"title":"TextPad 8.0.2 (Install + Portable) - x86/x64","uid":13755318,"size":21011758,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:27af7917dac1eaf648a52b33ce30c16f5a72e98c&amp;dn=TextPad+8.0.2+%28Install+%2B+Portable%29+-+x86%2Fx64&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"jovo_bih","files":1,"time":1457190491,"description":"Please note that portable versions are registered !\r\n\r\nWhen just getting the job done is work enough, the last thing you need is to waste time having to learn yet another computer application. Your experience with other tools should be relevant to each new application, making it possible to sit down and use that new application right away.\r\n\r\nThat's why TextPad® is so popular. Whether you simply need a powerful replacement for Notepad, a tool for editing your web pages, or a programming IDE, TextPad does what you want, the way you would expect.\r\n\r\nTextPad® is designed to provide the power and functionality to satisfy the most demanding text editing requirements. It can edit files up to the limits of virtual memory, and it will work with the 32-bit and 64-bit editions of Windows® 10, 8.1, 7, Vista, XP and Server 2003, 2008 and 2012.\r\n\r\nTextPad has been implemented according to the Windows user interface guidelines, so great attention has been paid to making it easy for both beginners and experienced users. In-context help is available for all commands, and in-context menus pop-up with the right mouse button. The Windows multiple document interface allows multiple files to be edited simultaneously, with up to 2 views on each file. Text can be dragged and dropped between files.\r\n\r\nIn addition to the usual cut and paste capabilities, you can correct the most common typing errors with commands to change case, and transpose words, characters and lines. Other commands let you indent blocks of text, split or join lines, and insert whole files. Any change can be undone or redone, right back to the first one made. Visible bookmarks can be put on lines, and edit commands can be applied to lines with bookmarks.\r\n\r\nFrequently used combinations of commands can be saved as keystroke macros, and the spelling checker has dictionaries for 10 languages.\r\n\r\nIt also has a customizable tools menu, and integral file compare and search commands, with hypertext jumps from the matched text to the corresponding line in the source file (ideal for integrating compilers).\r\n\r\nSupported platforms include Windows 10, 8.1, 7, Vista, and Server 2003, 2008 and 2012.\r\n\r\nTextPad 8.0.2 (27-Feb-2016)\r\n\r\nIssues Resolved:\r\n\r\n- Drag and drop to other applications did not work.\r\n- The application for TextPad.dde, in the registry, was TextPad.7 instead of TextPad.8.\r\n- Pasting multiple lines into a Find/Replace edit control didn't work.\r\n- If a line selected by double clicking in the left margin was searched for, its end of line characters should not have been included in the Find dialog box.\r\n- The height of the main window was reduced on restart, if the bottom was close to the taskbar.\r\n- Couldn't compare open files if &quot;Keep files locked while editing them was set&quot;.\r\n- The code page for new documents was not initialised to its document class setting.\r\n- The BOM setting on Save As was overridden by the document class setting.\r\n- URLs were not highlighted in the text document class, unless they were preceded by white space.\r\n- The MS Surface pen could not be used for right clicks.\r\n\r\n- On high definition displays:\r\n\r\n- Item colour listbox text overlapped.\r\n- Font name listbox text overlapped.\r\n- The list of suggestions for spelling mistakes overlapped.\r\n- The font was too small in the Update License dialog box.\r\n- Visible space glyphs were too small.\r\n- Large toolbar icons are now automatically selected.\r\n- The initial size of docking panes for high definition displays was too small.\r\n- Increased the initial size of the help window.\r\n\r\nOther languages http://www.textpad.com/download/index.html#downloads8\r\nHomepage http://www.textpad.com/index.html","torrent":{"xt":"urn:btih:27af7917dac1eaf648a52b33ce30c16f5a72e98c","amp;dn":"TextPad+8.0.2+%28Install+%2B+Portable%29+-+x86%2Fx64","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27af7917dac1eaf648a52b33ce30c16f5a72e98c","infoHashBuffer":{"type":"Buffer","data":[39,175,121,23,218,193,234,246,72,165,43,51,206,48,193,111,90,114,233,140]},"announce":[],"urlList":[]}}