{"title":"Doctor Who Confidential - 2009 - Specials Only","uid":10789052,"size":1637639614,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:27c69f72631142717096460ba2e94c40334c3da9&amp;dn=Doctor+Who+Confidential+-+2009+-+Specials+Only&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"bnaron","files":6,"time":1408239198,"description":"Doctor Who Confidential - 2009 Specials Only\n\n\nSeries Description Courtesy:\n\nWikipedia, the free encyclopedia &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Doctor_Who_Confidential&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Doctor_Who_Confidential&lt;/a&gt;\n\n\n\nDoctor Who Confidential is a documentary series created by the British Broadcasting Corporation (BBC) to complement the revival of the long-running British science fiction television series Doctor Who. Each episode was broadcast on BBC Three on Saturdays, immediately after the broadcast of the weekly television episode on BBC One. The running time of the first two series was 30 minutes, being extended to 45 minutes in the third.[1] BBC Three also broadcast a cut-down edition of the program, lasting 15 minutes, shown after the repeats on Sundays and Fridays and after the weekday evening repeats of earlier seasons.\n\nDescribed as focusing on the human element of the series, Confidential features behind-the-scenes footage on the making of Doctor Who through clips and interviews with the cast, production crew and other people, including those who have participated in the television series over the years of its existence. Each episode deals with a different topic, and in most cases refers to the Doctor Who episode that preceded it.\n\nThe first Confidential edition attached to the 2009 specials, covering &quot;Planet of the Dead&quot;, was narrated by Noel Clarke, although Anthony Head returned to narrate &quot;Is There Life on Mars?&quot;. This special featured improved graphics in its opening and closing credits sequences, as a result of the move to high definition format; this was the first Confidential edition broadcast on BBC HD as well as BBC Three. Head continued to narrate the Christmas and New Year specials.\n\nNOTE: I have organized the videos in this collection by the year in which they were televised, therefore, you will find 'The Eleventh Doctor' in the 2009 Season folder and 'Allons Y' in the 2010 Season folder. This folder (2009) contains all four specials which were actually televised in 2009.\n\n\nEpisode Synopses courtesy of:\n\nThe On-line TV Database\nAn Open Database for Television Fans &lt;a href=&quot;\nhttp://www.thetvdb.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetvdb.com&lt;/a&gt;\n\n\n2009-01-03 - The Eleventh Doctor (Video:H264 624x352, 988kbps, 25fps - Audio:AAC 44.1kHz, 118kbps)\n\nOver 45 years have passed since the TARDIS first landed on our screens on a cold November evening in 1963. Doctor Who Confidential takes a look back at ten incarnations of the wandering Time Lord, reliving some of his most heroic moments and terrifying adventures, and examining the menacing monsters, colorful costumes and faithful companions which defined each Doctor.\n\n\n2009-04-11 - Desert Storm (Video:H264 624x352, 988kbps, 25fps - Audio:AAC 44.1kHz, 113kbps)\n\nThe cast and crew travel to Dubai to film the Easter special and Confidential are there to capture every shot, scene and sandstorm. How do you get a double-decker bus to the desert? How do you shoot a drama in horrendous weather conditions?  And how do you match a vast Arabian landscape with the cold Cardiff winter? The answers are revealed.\n\n\n2009-11-15 - Is There Life On Mars (Video:H264 624x352, 987kbps, 25fps - Audio:AAC 44.1kHz, 104kbps)\n\nDoctor Who Confidential examines the production of the Doctor Who 2009 Special, &quot;The Waters Of Mars&quot;. Narrated by Anthony Head.\n\n\n2009-12-25 - Lords and Masters (Video:H264 624x352, 987kbps, 25fps - Audio:AAC 44.1kHz, 100kbps)\n\nDoctor Who Confidential examines the production of the Doctor Who 2009 Christmas Special, &quot;The End of Time Part One&quot;. Narrated by Anthony Head.\n\n\n","torrent":{"xt":"urn:btih:27c69f72631142717096460ba2e94c40334c3da9","amp;dn":"Doctor+Who+Confidential+-+2009+-+Specials+Only","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27c69f72631142717096460ba2e94c40334c3da9","infoHashBuffer":{"type":"Buffer","data":[39,198,159,114,99,17,66,113,112,150,70,11,162,233,76,64,51,76,61,169]},"announce":[],"urlList":[]}}