{"title":"No one Knows About Persian Cats","uid":5235148,"size":1034291283,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:27d0e68d246f5ffacb4989853c407841a3453590&amp;dn=No+one+Knows+About+Persian+Cats&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"blitz82","files":5,"time":1261500475,"description":"Once in a while comes along a movie which transcends the medium's boundaries and sets new standards. Bahman Ghobadi's remarkable and riveting new film is one of these rare examples. Made in only 17 days and without a permit, &quot;Persian Cats&quot; is guerrilla film making at its best. It is a faux-documentary, in style of Kiarostami's Close-Up &amp; Panahi's Offside, about the underground music scene in Iran. It is really about the universal power of music and the passion of the youth which know no boundaries. We see that Iranian musicians go to any lengths to defy censorship and restrictions to play their music. They do not need concert halls. They play anywhere: from metro stations to cow sheds and for anyone who wants to listen. Music and lyrics for the young Iranians has become a desperate, but at the same time powerful, means of expression and communication with the world at large. The music played in the film is very powerful and its range is quite remarkable. We see bands playing jazz, pop, heavy metal, rap and singing in both Farsi and English. Ghobadi's film manages to convey all the passion, energy, anger and hope that is contained in these music. It is a brave, and undoubtedly controversial film (specially with the the two leads seeking asylum in the west and Kiarostami denouncing the film), made with so much passion that the viewers can not remain unmoved. It is masterfully directed and photographed and brilliantly edited. A masterpiece which is certain to become another milestone in the history of Iranian and world cinema. Absolutely unmissable. \n\n\nUnfortuneatly, this torrent has no subs.\n\nPS. This is now public domain, so it is not illegal to seed it\n","torrent":{"xt":"urn:btih:27d0e68d246f5ffacb4989853c407841a3453590","amp;dn":"No+one+Knows+About+Persian+Cats","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27d0e68d246f5ffacb4989853c407841a3453590","infoHashBuffer":{"type":"Buffer","data":[39,208,230,141,36,111,95,250,203,73,137,133,60,64,120,65,163,69,53,144]},"announce":[],"urlList":[]}}