{"title":"Kriya -Healing Breath Technique-Sri Sri Ravi Shankar","uid":4356862,"size":123498,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:28768f7cf6f5273348f8eb5a0eaa3f9757f8dcef&amp;dn=Kriya+-Healing+Breath+Technique-Sri+Sri+Ravi+Shankar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"welovesrisri","files":1,"time":1219450556,"description":"THE HEALING BREATH TECHNIQUE/Sudarshan Kriya IN THE TREATMENT OF DEPRESSION\nSHORT RESEARCH SUMMARY (Independent Research)\n\n\nSudarshan Kriya and accompanying breathing techniques (SK&amp;P) demonstrated a\n68-73% success rate in treating people suffering from depression, regardless of severity of the depression. Substantial relief was experienced in three weeks. \n\nBy one month,patients were considered to be in remission. At three months, the patients remained asymptomatic and stable.\n\nFurthermore, SK&amp;P produced highly beneficial biological effects on brain and\nhormone function. The P300 ERP EEG brainwave pattern and NREM brainwave pattern,\nwhich measure electrical brainwave activity and are abnormal in many depressed people, returned to the normal range by ninety days. Plasma prolactin, a hormone in the blood which is believed to be a key factor in producing relief from depression, increased after the very first SK&amp;P session. Levels of plasma cortisol (the stress hormone) decreased significantly after three weeks.\n\nIn a comparison study, SK&amp;P was statistically as effective as the conventional\ntreatments for depression studied. Yet, in contrast to the usual treatments for depression, SK&amp;P is natural and free of unwanted side effects. It is self-administered and selfempowering.\n\nIt can greatly reduce doctor and hospital caseloads, thus making SK&amp;P cost\neffective and staff effective as well.\n\nDr. Janakiramaiah, M.D., Ph.D., D.P.H., psychiatrist, medical researcher, and\nDirector of the Yoga Research Group at the National Institute of Mental Health and\nNeurosciences (N.I.M.H.A.N.S.) of India has conducted several of these studies. He\nconcluded that Sudarshan Kriya has ÃƒÂ¢??remarkable therapeutic effectsÃƒÂ¢?? and ÃƒÂ¢??is clinically feasible and effective. It has the potential to become a first-line treatment of dysthymic [chronic, mild depression] patients and possibly in mild and moderate forms of major depressive disorder.&quot;\n\n\nLONG RESEARCH SUMMARY\n\nThese six research studies were conducted by the National Institute of Mental\nHealth and Neurosciences (NIMHANS) of India. NIMHANS has been conducting\nindependent clinical and laboratory studies on the neurophysiological effects, therapeutic benefits, and clinical applicability of SK&amp;P in depressed patients.","torrent":{"xt":"urn:btih:28768f7cf6f5273348f8eb5a0eaa3f9757f8dcef","amp;dn":"Kriya+-Healing+Breath+Technique-Sri+Sri+Ravi+Shankar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28768f7cf6f5273348f8eb5a0eaa3f9757f8dcef","infoHashBuffer":{"type":"Buffer","data":[40,118,143,124,246,245,39,51,72,248,235,90,14,170,63,151,87,248,220,239]},"announce":[],"urlList":[]}}