{"title":"Sega Rally Championship","uid":4071617,"size":7353192,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2909751a176f303a09a91115a4a122951e7ef87c&amp;dn=Sega+Rally+Championship&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Matt-Lane","files":1,"time":1205081056,"description":"Classic game by sega \n\nInformation\n\nSega Rally Championship is a 1995 arcade racing game developed by AM5 on the Sega Model 2 board. It was later ported over to the Sega Saturn  and PC. The unique selling point of Sega Rally was the ability to drive on different surfaces (including asphalt, gravel and mud), with different friction properties, with the car&amp;#039;s handling changing accordingly.\n\nAnother interesting feature is that the player can enter a &quot;World Championship&quot; mode consisting of three stages (Desert, Forest and Mountain) where their finishing position at the end of one course is carried through to the starting position of the next course. In this mode, it is impossible to reach first place position by the end of the first track, thus the player must try to overtake as many opponent cars as possible on each track (while staying within the time limit), and gain the lead over several tracks. If, at the end of the third round, the player is in first place, they are able to play a fourth secret circuit called &quot;Lakeside&quot; (on the Saturn version, this course may then be played in time attack and split-screen multiplayer modes).\n\nTwo cars are featured in the game: the Toyota Celica GT-Four and the Lancia Delta HF Integrale. There is also a hidden car, the Lancia Stratos. The Stratos is only unlocked if the extra Lakeside track is completed in first place; then it may be used in any of the game&amp;#039;s modes (championship, time attack and split-screen multiplayer). For the arcade machine, hold down the brake pedal while inserting credits, select &quot;Championship&quot; then highlight your car (but do not select it), run 1-2-3-4 through the gears, select your car then release the brake pedal. Codemasters have cited Sega Rally as a strong influence on their first Colin McRae Rally game.\n\n\nRuns Perfectly On Vista And I Think Any Other OS\n\nGames orginial source-Classic Gaming Network\n\n\nEnjoy","torrent":{"xt":"urn:btih:2909751a176f303a09a91115a4a122951e7ef87c","amp;dn":"Sega+Rally+Championship","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2909751a176f303a09a91115a4a122951e7ef87c","infoHashBuffer":{"type":"Buffer","data":[41,9,117,26,23,111,48,58,9,169,17,21,164,161,34,149,30,126,248,124]},"announce":[],"urlList":[]}}