{"title":"Machining of Metal Matrix Composites{BBS}","uid":6761444,"size":8477143,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2921271d4777dd5496bfff4c224e9e72566e895b&amp;dn=Machining+of+Metal+Matrix+Composites%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1319221891,"description":"Machining of Metal Matrix Composites provides the fundamentals and recent advances in the study of machining of metal matrix composites (MMCs). Each chapter is written by an international expert in this important field of research. Machining of Metal Matrix Composites gives the reader information on machining of MMCs with a special emphasis on aluminium matrix composites. Chapter 1 provides the mechanics and modelling of chip formation for traditional machining processes. Chapter 2 is dedicated to surface integrity when machining MMCs. Chapter 3 describes the machinability aspects of MMCs. Chapter 4 contains information on traditional machining processes and Chapter 5 is dedicated to the grinding of MMCs. Chapter 6 describes the dry cutting of MMCs with SiC particulate reinforcement. Finally, Chapter 7 is dedicated to computational methods and optimization in the machining of MMCs. Machining of Metal Matrix Composites can serve as a useful reference for academics, manufacturing and materials researchers, manufacturing and mechanical engineers, and professionals involved with MMC applications. It can also be used to teach modern manufacturing engineering or as a textbook for advanced undergraduate and postgraduate engineering courses in machining, manufacturing or materials.\nProduct Details\n\n    * Hardcover: 174 pages\n    * Publisher: Springer; 2011 edition (November 28, 2011)\n    * Language: English\n    * ISBN-10: 0857299379\n    * ISBN-13: 978-0857299376","torrent":{"xt":"urn:btih:2921271d4777dd5496bfff4c224e9e72566e895b","amp;dn":"Machining+of+Metal+Matrix+Composites%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2921271d4777dd5496bfff4c224e9e72566e895b","infoHashBuffer":{"type":"Buffer","data":[41,33,39,29,71,119,221,84,150,191,255,76,34,78,158,114,86,110,137,91]},"announce":[],"urlList":[]}}