{"title":"Call Of Duty: Black Ops (Wii)[NTSC]","uid":6422497,"size":4700085576,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:295d0c240acf0bb451e6652417f463bd11a76a15&amp;dn=Call+Of+Duty%3A+Black+Ops+%28Wii%29%5BNTSC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ThatTallGuy","files":5,"time":1306347164,"description":"Release Title: Call of Duty Black Ops(Wii)[NTSC]\nRelease Date: 11/09/10\nPlatform: Wii\nGenre: Video Games, Nintendo Wii, Action/Shooter Game\nSize: 4.37GB's Extracted\nNumber of files: 5/6\n\n\nGames Description:\n\nCall of Duty tackles a whole new era as Black Ops plunges you into the murky height of the Cold War and history's most secretive battles. The world's most popular first person shooter places you in the most dangerous conflict zones of the late '60s.\n\nFrom the jungles of Vietnam to the snowy wastes of the Ural mountains, you and your team must operate behind enemy lines and using only the limited technology of the time. Luckily this includes air support such as the SR-71 Blackbird stealth plane, as well as deadly attack helicopters and armored personnel carriers.\n\nLike any Call of Duty game the multiplayer will set the standard for all other console games, with enhanced customization tools, playable vehicles and a revamped scoring system.\nKey Features\n\n* Retro Warfare: Call of Duty explodes the myths of the Cold War as you join a team of Black Ops soldiers caught up in the fight against communism in Vietnam and beyond.\n* Ammu-Nation: Use new special ammo including an explosive crossbow, Dragon's Breath flame rounds for your shotgun and a range of other period weapons.\n* Twisted Metal: Take the controls of the iconic SR-71 Blackbird as you direct operations from high above or jump into an attack chopper in Vietnam for some close-up action.\n* Online Perks: Create-a-Class 2.0 customization tool lets you personalize your online battles even more, with new perks and revamped rules for kill streaks.\n\nAbout the Developer: Treyarch\nOne of publisher Activision's biggest internal studios, Treyarch have worked on many of the company's best known titles - including multiple Spider-Man games and the Quantum of Solace tie-in. They're also behind Call of Duty 2: Big Red One, Call of Duty 3 and Call of Duty: World at War.\n\nKey Features\n\n* Retro Warfare: Call of Duty explodes the myths of the Cold War as you join a team of Black Ops soldiers caught up in the fight against communism in Vietnam and beyond.\n* Ammunition-Nation: Use new special ammo including an explosive crossbow, Dragon's Breath flame rounds for your shotgun and a range of other period weapons.\n* Twisted Metal: Take the controls of the iconic SR-71 Blackbird as you direct operations from high above or jump into an attack chopper in Vietnam for some close-up action.\n* Online Perks: Create-a-Class 2.0 customization tool lets you personalize your online battles even more, with new perks and revamped rules for kill streaks.\n* Team Player: Online four-player co-operative mode lets you team up with fellow players as you take on the might of the Soviet military machine together\n\n\nReleaser's Notes:\n\nThis is the full ISO off of the actual Black Ops Wii disc. Not Wiiscrubbed, but Priiloader is there for you if needed. All Maps work in all Gametypes and Game Modes. Campaign works 100% and Zombies is all there for you to enjoy.\n\nExtract to full ISO with WinRar and burn at 2.4x - 6x speed with IMGBurn or Load with proper cIOS'\n\nUSB Loaded and tested on 4.1 Softmodded Wii:\n\nWiiFlow v1 and v2.2 (using IOS222 version and IOS249 version)\nUSB Loader GX 2.0\nCFG Loader\nNeoGamma r9 beta 47\n\nWananinko's rev21 cIOSx\nHermes 5.1 cIOS\n\nIn order to play this game your Wii MUST be Softmodded or Hardmodded!","torrent":{"xt":"urn:btih:295d0c240acf0bb451e6652417f463bd11a76a15","amp;dn":"Call+Of+Duty%3A+Black+Ops+%28Wii%29%5BNTSC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"295d0c240acf0bb451e6652417f463bd11a76a15","infoHashBuffer":{"type":"Buffer","data":[41,93,12,36,10,207,11,180,81,230,101,36,23,244,99,189,17,167,106,21]},"announce":[],"urlList":[]}}