{"title":"Complete Collection of Nicci French","uid":8361746,"size":8234174,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:297140a0ffcf86dbb4322bdda64d307dea7a52c3&amp;dn=Complete+Collection+of+Nicci+French&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"NewSky000","files":15,"time":1365643212,"description":"Title: Complete Collection of Nicci French's Books\n\nAuthor: Nicci French\n\nBook(s): 14\n\nFormat: eBook (.epub)\n\nAdditional Info: Readme File\n\n*Calibre is a great free tool for managing ebooks. Link: http://www.calibre-ebook.com/\n\nGenres: Thriller, Mystery, Crime, Suspense\n\nSummaries:\n\nBLUE MONDAY\nThe stunning first book in a new series of psychological thrillers introducing an unforgettable London psychotherapist\n\nFrieda Klein is a solitary, incisive psychotherapist who spends her sleepless nights walking along the ancient rivers that have been forced underground in modern London. She believes that the world is a messy, uncontrollable place, but what we can control is what is inside our heads. This attitude is reflected in her own life, which is an austere one of refuge, personal integrity, and order.\n\nThe abduction of five-year-old Matthew Farraday provokes a national outcry and a desperate police hunt. And when his face is splashed over the newspapers, Frieda cannot ignore the coincidence: one of her patients has been having dreams in which he has a hunger for a child. A red-haired child he can describe in perfect detail, a child the spitting image of Matthew. She finds herself in the center of the investigation, serving as the reluctant sidekick of the chief inspector.\n\nDrawing readers into a haunting world in which the terrors of the mind have spilled over into real life, Blue Monday introduces a compelling protagonist and a chilling mystery that will appeal to readers of dark crime fiction and fans of In Treatment and The Killing. - Goodreads Summary of Blue Monday (Freida Klein Series #1)\n\n\nKILLING ME SOFTLY\nNow that you've read GONE GIRL...\n\nAlice Loudon has it all: a devoted boyfriend, a marvelous circle of friends, a challenging job as a research scientist. Then one morning, on her way to work, she exchanges a lingering look with a devastatingly attractive man. Adam Tallis is the essence of every female fantasy--a daring mountain climber who has been hailed as a hero. As a lover, he is more passionate than Alice's wildest imaginings. Soon there isn't anything or anyone she wouldn't give up to stay by his side. Soon all she has is Adam, and life with this stranger will take her to new heights of madness...and fear. - Goodreads Summary of Killing Me Softly\n\n\nTHE RED ROOM\nKit Quinn is a young woman who inhabits dangerous worlds: crime scenes, interrogation scenes, hospitals for the criminally insane. Horribly wounded in an attack by a suspect, she must return to the site of her worst fears. She is asked by the police to advise them on a simple murder inquiry. A young runaway has been found killed by a canal and the chief suspect is the man who wounded Kit. But Kit refuses to accept appearances and her obsessive search for the truth draws her into an underworld of the missing and the unloved which puts her at terrible risk. - Goodreads Summary of The Red Room\n\nNote: The genres listed above are a generalization of what all of Nicci French's book are about. Recommendable for an older audience as it deals with mature themes, and for those who enjoy crime scenes, gruesome deaths and an enticing investigation to uncover the bigger truth, or lie.\n\nCompatibility: Most eReaders\n\nCovers: Yes\n\nMetadata: Yes\n\nAny requests? Concerns? Comments? Anything of the sort? Then plz view readme for support link.\n\n\nPlease seed and thanks for downloading!\n\n\n\nBy: MastermindTTA ~ Thanks for the support!","torrent":{"xt":"urn:btih:297140a0ffcf86dbb4322bdda64d307dea7a52c3","amp;dn":"Complete+Collection+of+Nicci+French","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"297140a0ffcf86dbb4322bdda64d307dea7a52c3","infoHashBuffer":{"type":"Buffer","data":[41,113,64,160,255,207,134,219,180,50,43,221,166,77,48,125,234,122,82,195]},"announce":[],"urlList":[]}}