{"title":"The Universal Sense - Seth S. Horowitz.epub","uid":9851406,"size":2315861,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29953bbb98e868e91c7b64dd2285b1c5c82b722c&amp;dn=The+Universal+Sense+-+Seth+S.+Horowitz.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1396154765,"description":"The surprising truth about how the things our ears hear affect what's between them.\n\nEvery day, we are surrounded by millions of sounds - ambient ones like the rumble of the train and the hum of air conditioner, as well as more attention-grabbing sounds, such as human speech, music, and sirens. But how do we process what we hear every day? And how does it affect our brains and our minds?  This book answers such revealing questions as:\n\nHow do bats see in 3D with their ears and how did that lead to the development of medical ultrasound?\nWhat is it about the sound of fingernails on a chalkboard that makes us cringe?\nWhy do city folks have trouble sleeping in the country, and vice versa?\nWhy can't you get that song out of your head?\nStarting with the basics of auditory biology, neuroscientist and musician Seth Horowitz explains how sound affects us, and in turn, how we've learned to manipulate sound: into music, commercial jingles, car horns, and modern inventions like cochlear implants, ultrasound scans, and the mosquito ringtone. Whether you're standing in a crowded subway or a quiet meadow, you'll never hear the same way after reading this book. The Universal Sense gives new insight into what the sounds of our world have to do with the way we think, feel, and interact.","torrent":{"xt":"urn:btih:29953bbb98e868e91c7b64dd2285b1c5c82b722c","amp;dn":"The+Universal+Sense+-+Seth+S.+Horowitz.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29953bbb98e868e91c7b64dd2285b1c5c82b722c","infoHashBuffer":{"type":"Buffer","data":[41,149,59,187,152,232,104,233,28,123,100,221,34,133,177,197,200,43,114,44]},"announce":[],"urlList":[]}}