{"title":"Big Booty White Girls #3 - Anal Interracial Porn XXX","uid":9470680,"size":2709294400,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:299dfc486965c21ba15dc5c53d5e9c6403686f1b&amp;dn=Big+Booty+White+Girls+%233+-+Anal+Interracial+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"KidAtomic","files":-1,"time":1389559442,"description":"Big Booty White Girls #3\n\nBeautiful ivory girls can boast slammin' big booties just as nice as any ebony babe! Starring Naomi, Julia Bond, Katja Kassin, Macy Lane, Charlotte Stokely and more. Directed by Justin Slayer.\n\n    Scene 1. Charlotte Stokely, Justin Slayer\n    Scene 2. Naomi, Nat Turnher\n    Scene 3. Julia Bond, Justin Slayer\n    Scene 4. Katja Kassin, Nat Turnher\n    Scene 5. Macy Lane, Justin Slayer\n\nLength 2 hrs. 19 mins.\nRating XXX\nReleased Jan 24 2006\nProduction Year 2005\nStudio  Justin Slayer International\n\nActresses:\n    Charlotte Stokely [IR]\n    Julia Bond [IR]\n    Katja Kassin [Anal Facial IR]\n    Macy Lane [Anal Facial IR]\n    Naomi [Facial Squirt IR]\n\nActors:\n    Justin Slayer\n    Nat Turnher\n\nScene One: Charlotte Stokely, the chunky white gal in the red &amp; black corset on the front DVD cover's upper right hand side, was up first with her pale white skin contrasting a lot compared to scene partner Justin Slayer. He had her walk around the room in order to show her ass bounce from side to side before she settled down by the couch to blow him. His shaft was too long for her to readily handle so she worked the tip of it with her mouth as her hand held onto the base, occasionally stroking it. While not the best oral of the day, I'm sure it would set off any number of people that don't like lily white gals doing jet black guys just as much. Justin started tapping her pussy really hard with her bent over. I wasn't keen on the fact that she appeared to barely hold on as he did all the work but that might work for some of you more than a gal sexually active enough to return his thrusts as some of the others did later. She did better once she took her place on top of him, even doing PTM (pussy to mouth) as she worked out his eventual load into her mouth. I didn't think they had much chemistry but she livened up enough towards the end to prove she could and they even did a second round of screwing to close out the 30 minute long scene.\n\nScene Two: Naomi, the lean hotty that has been taking the porn world by storm since her friendly appearance at the 2006 AEE Show, was shown on the center of the front DVD cover. As Justin put it, she had a &quot;poke out&quot; ass, and teased the camera with that deep ass (even taking a television remote control to walk around with in her crack). I liked the natural sunlight on her better when she walked outside by the pool but after some solid posing, she got to work with Nat Turnher on the couch. She playfully sucked his meaty shaft as though it tasted like candy, eyeing the camera as she made faces of pleasure and licked him all over (including his balls). She then climbed on top of his lap and rode him like crazy, bouncing up and down like she was on fire as he sat back and tried to hold onto his load. It didn't matter what position they were in after that either; she was aggressively enjoying the action as enthusiastically as she could be. If that didn't make for a great scene, nothing else could have (even Justin, who wasn't screwing her, was out of breath). He blew his load on her and fed her some of it with his fingers, ending a chemistry filled, passionate scene. Whew!\n\nScene Three: Julia Bond, the very cute gal on the lower part of the front DVD cover, wore her patterned shorts and top for the next scene as she spanked herself and otherwise showed how tight her body was. I know some people don't like tease but I do and she has long been one of the gals able to convey a sense of pleasure via her tease footage alone. This was too much for Justin Slayer to pass up and he eventually gave in to give, as well as receive, some very fine head. I like it when the guy participates in the oral since it shows something about how much he wants her to have fun too (rather than come across as a &quot;for pay&quot; performance). The standing 69 was good and led to him flipping her around for some vaginal boning. She was very vocal (and loud) about her enjoyment, never falling into the kind of over-the-top yelling that too many of her peers rely on. They caught their breath when they hit the couch, going for the slow, deep, drilling style that really gets a gal off. The doggy position was even better though as she bounced back on his shaft, followed by other good positions before he popped his large nut all over her. This was another fine scene with great replay value. Yum!\n\nScene Four: Katja Kassin, sporting reddish brown hair and seen dominating the left hand side of the front DVD cover, needs little introduction for fans of booty-related porn. At this writing, she is considered the top anal gal in the business and one of the few who actually seems to enjoy it rather than do it strictly for the extra money it provides. Fans will note that her booty was in fine form (duh!) but she appeared to have lost some weight, making her leaner than ever before (tightening up those curves of hers). She teased by the outdoor pool on a sunny day, bending over on a towel so she could receive some baby oil to glisten on her silky smooth skin (take my word for it too; her skin is incredibly silky to the touch!). Nat Turnher was the lucky son of a gun that got to work with her as she sucked him off outside in plain view of the neighbors. For the record, Justin can move into my neighborhood, preferably next door to me, any time he likes if this will be taking place in the future, and she showed a better than average set of skills inhaling his meat pipe down. Katja is no oral queen but the blowjob did the trick as he got rock hard well before they continued the action inside the house. The look on her face, the noises she made, and even the flushness of her skin all seemed to indicate that she savored the oral experience a lot. They then went to boning vaginally while she sat in a chair, actively thrusting back onto his rod when balanced to do so. Nat looked like was going to pop more than a few times, with the camera angle switching in order to give him a chance to hold on. The vaginal was good enough but the move to anal was even better and helped once again set Katja apart. In effect, it looked almost like she was fucking him instead of the other way around, working her ass on him with some hp grinding and thrusts that would put most gals in porn to shame (done with a level of enthusiasm, passion, and sheer appreciation that earned her a spot by the title in my opinion). It ended with some ATM and the facial as he blew a huge load breathlessly out of his balls, probably causing him to fall asleep for a month afterwards. Wow!\n\nScene Five: Macy Lane, a relative newcomer to porn who has only been seen in this series at this writing, was up last in the show. She was the gal bent over on the middle of the right hand side of the front DVD cover and in the unenviable position of following Katja's incredibly sexy scene. She followed the routine by teasing the camera to the droning thump of the music, spending most of her time outside along the pool as the sun started to set (or perhaps rise; but I got the feeling it was later in the day for some reason). She had some junk in her trunk that would've looked better had she toned up a little bit, though when she was bent over, I had no complaints. The camera work wasn't as steady this time (it never is when Justin is the performing male) but Justin Slayer seemed lost in her oral skills as she slobbed his knob; concentrating on the tip. I'm willing to bet she's had several hundred dicks in her mouth since she started learning her craft but they went inside to do the actual boning. Fans may like the way her fleshy ass rippled as she bounced on his rod and she held onto the kitchen counter but I think she did an even better job on top of him when they went to the bedroom. They screwed nicely for a while before switching to anal where she slowly built up her speed at working on pumping him deeply (even farting once). The scene ended when she took his load and tried to get him to lay on top of her. While not up to Katja's level of skill, she was admittedly a fine performer.\n- See more at: http://www.xcritic.com/review/20579/charlotte-stokely-big-booty-white-girls-3/#sthash.hrkHieTp.dpuf\n\n\n","torrent":{"xt":"urn:btih:299dfc486965c21ba15dc5c53d5e9c6403686f1b","amp;dn":"Big+Booty+White+Girls+%233+-+Anal+Interracial+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"299dfc486965c21ba15dc5c53d5e9c6403686f1b","infoHashBuffer":{"type":"Buffer","data":[41,157,252,72,105,101,194,27,161,93,197,197,61,94,156,100,3,104,111,27]},"announce":[],"urlList":[]}}