{"title":"Evolution's Achilles' Heels - Robert Carter","uid":11773191,"size":3072982,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29b7d0afe53e32d838a0c97b4e62215b3d9499da&amp;dn=Evolution%27s+Achilles%27+Heels+-+Robert+Carter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1427157815,"description":"\nThis powerful book (illustrated in full colour) exposes the fatal flaws of evolutionary thinking. Like no other work that we are aware of, it is authored by nine Ph.D. scientists to produce a coordinated, coherent, powerful argument. All of the authors received their doctorates from similar secular universities as their evolutionary counterparts. Each is a specialist in a field relevant to the subject written about: Natural selection, origin of life, geology, genetics, radiometric dating, the fossil record, cosmology, and ethics.\n\nEvolution s Achilles Heels directly demolishes the very pillars of the belief system that underpins our now-secular culture evolutionary naturalism. It s coupled with the Biblical command to reach the lost with the Bible s Good News. In a nutshell, it s a comprehensive outreach tool like no other.\n\nThe nine Ph.D. scientists are Donald Batten, Robert Carter, David Catchpoole, John Hartnett, Mark Harwood, Jim Mason, Jonathan Sarfati, Emil Silvestru and Tasman Walker. Foreword by Carl Wieland and edited by Robert Carter.\n\n\nAbout the author:\nDr Carter was converted to Christ at an early age, but did not know what to do with the theory of evolution. He always knew what he wanted to believe, but had no way to express what he was thinking and no evidence to support his views. In his freshman year of college, he was exposed to the information for creation for the first time and soon after adopted it as his modus operandi. He says he felt a tremendous joy when he realized his science and his religion were no longer at odds. This joy (and, he says, Creation magazine and the Journal of Creation) enabled him to get through the in-depth evolutionary training of his undergraduate and graduate programs with his faith intact.\n\nHe obtained a BS in Applied Biology from the Georgia Institute of Technology in 1992. He then spent four years teaching high school biology, chemistry, physics and electronics before going to the University of Miami to obtain his PhD in Marine Biology. He successfully completed this program in 2003 with a dissertation on ?Cnidarian Fluorescent Proteins.? While in Miami, he studied the genetics of pigmentation in corals and other invertebrates, designed and built an aquaculture facility for Caribbean corals, performed well over 500 SCUBA dives, many of them at night, and licensed a spin-off product of his research (a patented fluorescent protein) to a biotech company.\n\nSee long bio He is currently a senior scientist and speaker for CMI-USA in Atlanta, Georgia, where he lives with his wife, Leanne, and children and is currently researching human genetics and other issues related to biblical creation","torrent":{"xt":"urn:btih:29b7d0afe53e32d838a0c97b4e62215b3d9499da","amp;dn":"Evolution%27s+Achilles%27+Heels+-+Robert+Carter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29b7d0afe53e32d838a0c97b4e62215b3d9499da","infoHashBuffer":{"type":"Buffer","data":[41,183,208,175,229,62,50,216,56,160,201,123,78,98,33,91,61,148,153,218]},"announce":[],"urlList":[]}}