{"title":"Magic and Mayhem","uid":7505637,"size":658256584,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:29eb4081f4d7e4ea305c90f352409cc3022ca308&amp;dn=Magic+and+Mayhem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"darkpamer","files":1,"time":1344164703,"description":"Magic &amp; Mayhem, also known as Duel: The Mage Wars in North America, is a fantasy/mythology-themed real-time strategy game designed by Julian Gollop[1] and developed by Mythos Games. It was published by Virgin Interactive Entertainment (European release) in late 1998, and by Bethesda (North American release) soon after in 1999.\n\n-----------------------------------------------------------------------------------\n\nInstructions:\n\n1)Extract\n2)Mount (use Daemon Tools)/Burn\n3)Install\n4)Play and Enjoy\n\n\nThis is one of my childhood's favourite games.\n\n-----------------------------------------------------------------------------------\n\nThe player's primary character is their wizard, and who can cast spells, summon creatures and (in the campaign) interact with other characters. The wizard and any summoned creatures are controlled, as in most strategy games, by dragging selection boxes and using the mouse buttons to interact and issue orders. Casting spells and summoning creatures uses mana. Wizards replenish their mana by occupying &quot;Places of Power&quot; with their creatures, or using up one-use &quot;mana sprites&quot; that are picked up around the map. Magic and Mayhem is built into an isometric grid, with creatures occupying (or flying above) squares on the board.\n\n\nThe game includes two game modes; the campaign progression and a &quot;quick battle&quot; option, similar to a deathmatch. The campaign is single player only, but quick battle can be either single or multiplayer over a LAN network.\n\n\nThe Portmanteau\nMagic and Mayhem uses a unique spell system, in which magical ingredients are needed to be able to cast each spell in the game. In the campaign game mode, these ingredients (such as Brimstone, Clover and Zircon) are gradually acquired as the game progresses. Before each level begins, the player can use their Portmanteau spell-box to combine an ingredient with a &quot;talisman&quot; of either Law, Chaos or Neutrality. This results in a spell that the player can use for the duration of the battle, and which can be changed again after the battle has ended.\n\nMain Theme:\n\n","torrent":{"xt":"urn:btih:29eb4081f4d7e4ea305c90f352409cc3022ca308","amp;dn":"Magic+and+Mayhem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29eb4081f4d7e4ea305c90f352409cc3022ca308","infoHashBuffer":{"type":"Buffer","data":[41,235,64,129,244,215,228,234,48,92,144,243,82,64,156,195,2,44,163,8]},"announce":[],"urlList":[]}}