{"title":"X-Men 2 (Spanish) 2003 HD-Rip Xvid-Ac3 5.1","uid":4833532,"size":1922639872,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2a7875e0245d4e5c6b82e856ad1073a4a4496af6&amp;dn=X-Men+2+%28Spanish%29+2003+HD-Rip+Xvid-Ac3+5.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"mdq1","files":-1,"time":1239223489,"description":"FICHA TECNICA \nDirector: Bryan Singer \nProductores: Lauren Shuler Donner, Ralph Winter para The Donners Co./Bad Hat Harry/20th Century Fox/Marvel Enterprises \nProductores Ejecutivos: Avi Arad, Stan Lee, Tom Desanto, Bryan Singer \nGuiÃƒÂ³n: Michael Dougherty, Dan Harris, segÃƒÂºn argumento de Bryan Singer, David Hayter, Zak Penn, basado en los personajes de Stan Lee y Jack Kirby \nFotografÃƒÂ­a: Newton Thomas Sigel \nMÃƒÂºsica/Montaje: John Ottman \nEfectos especiales: Gordon Smith (maquillajes), Michael Fink (supervisor de efectos visuales) \nIntÃƒÂ©rpretes: Patrick Stewart (profesor Charles Xavier), Hugh Jackman (Lobezno/Logan), Ian McKellen (Magneto), Halle Berry, Famke Janssen, James Marsden, Rebecca Romjin-Stamos, Brian Cox, Alan Cumming, Bruce Davison, Anna Paquin, Kelly Hu, Shawn Ashmore, Aaron Stanford, Daniel Cudmore... \nNacionalidad y aÃƒÂ±o: USA 2003 \nDuraciÃƒÂ³n y datos tÃƒÂ©cnicos: 135 min. color 2.35:1. \n\n\nS I P N O S I S \nOficialmente X-Men 2 se basa en el guiÃƒÂ³n de Dan Harris y Michael Dougherty, a partir de un argumento de David Hayter (guionista de la primera entrega), Zak Penn y el propio Bryan Singer. \n\nEl arranque resulta espectacular, presentÃƒÂ¡ndonos a un nuevo personaje de la saga, Rondador Nocturno, quien no precisa ni una sola palabra para mostrarnos sus sorprendentes habilidades. El director amplÃƒÂ­a este particular universo mutante con varios personajes nuevos, pero esta vez opta de forma acertada por presentarlos sobre la marcha, sin detener la acciÃƒÂ³n. La duraciÃƒÂ³n de la pelÃƒÂ­cula es mÃƒÂ¡s larga que su precedente, 135 minutos contra 100 de la anterior, pero no se hace en absoluto pesada. Otros aciertos son tanto la banda sonora de John Ottman como el trepidante montaje en las escenas de acciÃƒÂ³n. Yo particularmente me quedo con la pelea entre Lobezno y Dama Mortal, garras contra garras, aunque el resto de escenas no desmerece. \n\nPor supuesto, en este baile casi ininterrumpido de personajes, unos salen mejor parados que otros. Aunque todos los actores muestran aplomo, para mÃƒÂ­ los mejores son Hugh Jackman, quien se ha metido a Lobezno en el bolsillo, y un fascinante Ian McKellen, muy alejado de su famoso Gandalf, quien nos recrea con su particular versiÃƒÂ³n del Hannibal Lecter en el Silencio de los corderos (la escena de su huida de la prisiÃƒÂ³n es uno de los momentos cumbres del film). El resto de los actores estÃƒÂ¡ a la altura, aunque no todos brillen con igual intensidad. MenciÃƒÂ³n aparte merece Brian Cox en su papel de William Stryker, uno de los villanos mÃƒÂ¡s redondos y profundos que se pasean por las pantallas. Por cierto, Cox fue el primer Hannibal Lecter en el cine (Hunter, de Michael Mann, 1986).\n\n\n www.CentralDivx.com\n\nwww.Central-Torrent.com\n\nwww.Estrenos-Sub.com","torrent":{"xt":"urn:btih:2a7875e0245d4e5c6b82e856ad1073a4a4496af6","amp;dn":"X-Men+2+%28Spanish%29+2003+HD-Rip+Xvid-Ac3+5.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a7875e0245d4e5c6b82e856ad1073a4a4496af6","infoHashBuffer":{"type":"Buffer","data":[42,120,117,224,36,93,78,92,107,130,232,86,173,16,115,164,164,73,106,246]},"announce":[],"urlList":[]}}