{"title":"Keisuke Kinoshita - Eien no hito aka Immortal Love (1961)","uid":4847629,"size":1191057636,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2a96c613ac0bf47a5c0436cbc8258f5b109ef441&amp;dn=Keisuke+Kinoshita+-+Eien+no+hito+aka+Immortal+Love+%281961%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"lord_terabyte","files":-1,"time":1239744487,"description":"Keisuke Kinoshita - Eien no hito aka Immortal Love (1961)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0054845/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0054845/&lt;/a&gt;\n\nJapanese with English, French, Italian subs\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51g1Lx9cWOL._.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51g1Lx9cWOL._.jpg&lt;/a&gt;\n\nI haven't seen any movies of Japanese director Kinoshita Keisuke until Film Forum screened his 1961 film, the brutally ironically titled Immortal Love, in their Tetsuya Nakadai series. Best known in the West mostly as a name, and, if one is lucky, as the director of the first Japanese color film, Carmen Comes Home (1951), and Twenty-Four Eyes (1954), the Kinoshita worked into the 1980s but few of his films have shown up here in theaters or DVD.\n\nWhile no masterpiece, Immortal Love marks the imprint of a strong directorial vision, and I thought I'd share some notes on the film. By way of background, it tells of the story of a landowner (Nakadai), recently returned from, and injured by, war in China in the early 1930s. He falls for and rapes a tenant farmer's daughter (Takamine Hideko), and forces her to marry him despite her undying love for another farmer, also a soldier in China, who fatefully returns home too late. The film then charts the love-less marriage over several decades, stopping during and after the war in the 1940s, and then in the contemporary early 1960s.\n\n***\n\nImmortal Love strikes me as very modern in its stylization, and very modern for 1961, absorbing lessons of camera bravura both from the rise of art-cinema in the 1950s (Fellini, Rossellini), popular cinema turned &quot;art-cinema&quot; from Japan (Mizoguchi, Kurosawa), and latter day Hollywood stylists getting wilder in the 1950s like Welles, Hitchcock, and Minnelli. The Cinemascope camera moves very often; tracking shots are prevalent; and a majority of the exteriors are shot on location in a stunning, forlorn valley (which includes a volcano and incredible waterfalls).\n\nThe overt-stylization produces a distance in the definition of the story, the film world, and its characters. Despite the historical reference points (the Marco-Polo incident presumably framing the early 1930s military action, as WW2 does the 1940s segment), and some general mentioning of farmer-landowner relationships, Kinoshita's story is mythic rather than psychological, social, or behavioral. That doesn't stop it from being melodramatic, but there is a generality to the script that keeps context lean. More important than the way landowner Nakadai used his class privileges to get away with defiling and then winning his tenant's daughter is the stultifying atmosphere of mutual dislike and unhappiness that pervades their household (and thereby, countryside) for several decades, obtaining a kind of ever-lasting ingrained quality with more to do with human relationships through time than anything specific or particular.\n\nTo compensate, Kinoshita keeps things moving fast. The speed of the first chapter is almost of screwball comedy pacing. The amount of information about the scenario is dolled out in an almost shot-for-shot basis, and here Kinoshita is the strongest. As can often by the case in classically driven studio films, the first act provokes an ambiguity and strangeness as the audience has not yet settled into the rhythm of a film that has not made its value-system clear. In other words: we don't know where it's going or what the film places its importance on. So as the plot accelerates and ellipses-especially involving the film's first several shots, of a young couple on a train at dusk, looking at one another with love, followed by a cut to Takamine looking out at the foggy landscape-as well as a startlingly poetic suicide attempt, provoke questions, the film is at its strongest.\n\nBut the time-jumping chapters kill off a lot of that mystery, as Kinoshita settles into an advanced kind of illustrative style: here is the married couple unhappy; here is what they are like with their children; here this, there that-cue next time jump in our lesson of unhappy marriage. This would normally be a disparaging assessment if Kinoshita did not already know this was the narrative tack he was taking and directly compensated with an understanding style.\nSo without richness of storytelling (say, psychological nuance, or expression of what living as a farmer or village headmaster in the provinces is like in terms of power structures), the director gives us a camera which dynamically frames our few actors within the unchanging, epic landscape of Nature (and thereby of the Farm, and the Landowner, and the Farmer's Daughter, and the True Beloved, and so on). Knowing the kind of mythic simplicity of the story he is telling, the director delves fully into the re-telling of a common story by embracing the grandeur of the setting in order to bestow the unchanging nature of the legend onto its characters. It is a strange effect: realizing the weakness of translating myth to melodrama, Kinoshita takes his melodrama and tries to push it back towards myth. While the result is not as whole and compelling as one could wish, the story is, perhaps above all else, an experiment in cinematic storytelling, and, without the reflexivity of some contemporary modern films, it brings direct attention not just to its story but the way it is told.\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/i1.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/i1.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/i2.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/i2.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/i3.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/i3.png&lt;/a&gt;\n\n---my rip-----\n\n~~~~~~ Eien no hito.avi ~~~~~~                                     \n                                                               \nFile Size (in bytes):...........................1,179,166,720                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD ISO MPEG-4              \nDuration (hh:mm:ss):............................1:42:29                \nFrame Count:....................................153707             \nFrame Width (pixels):...........................688                  \nFrame Height (pixels):..........................288                  \nAspect Ratio:...................................2.389                     \nFrames Per Second:..............................25.000          \nVideo Bitrate (kbps):...........................1428                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.288&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x0055 MPEG-1 Layer 3                   \nAudio Sample Rate (Hz):.........................32000             \nAudio Bitrate(kbps):............................96                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................2           \n\n","torrent":{"xt":"urn:btih:2a96c613ac0bf47a5c0436cbc8258f5b109ef441","amp;dn":"Keisuke+Kinoshita+-+Eien+no+hito+aka+Immortal+Love+%281961%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a96c613ac0bf47a5c0436cbc8258f5b109ef441","infoHashBuffer":{"type":"Buffer","data":[42,150,198,19,172,11,244,122,92,4,54,203,200,37,143,91,16,158,244,65]},"announce":[],"urlList":[]}}