{"title":"Corti-Rise of House of Rothschild(biggest war profiteers in hist","uid":4540114,"size":2397866,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b22f07dd8dab4bf5cb6ff5be471ffd675d2eb6c&amp;dn=Corti-Rise+of+House+of+Rothschild%28biggest+war+profiteers+in+hist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227906103,"description":"This is Egon Caesar Corti&amp;#039;s monumental book The Rise of the House of Rothschild (1928) which is an exhaustive financial historical account of the House of Rothschild between 1770-1830 and a historical sketch of a period when this then unknown jewish family established first footholds of an empire which today spans the whole world and is worth hundreds of trillion (1000 billion) dollars. Certain special features of the 19th century have been entirely neglected. An example of this neglect is the ignoring by historians of the role played by the Rothschild family in the history of the 19th century. The object of this work is to appraise the important influence of this family on the politics of the period, not only in Europe, but throughout the world. The influence of the Rothschilds, interestingly enough, is barely mentioned in other more comprehensive works. The aim of this work is to trace the rise of the House of Rothschild from its small beginnings to the great position it obtained, culminating in the year of its great crisis. Corti was enabled to begin an independent historical research into the part played by this House in the nineteenth century, which was known to be far more important than was commonly thought. The general scheme of this work was built upon facts alone, in a practical way such as will help us to form our own judgment on individuals and the part they played in world events. The Rothschilds soon became the leading financiers of many wars which were fought by one royal against another, one state against another. Gaining enormous profits from such warmongering the Rothschilds were able to exert influence on peace terms reached at the end of conflicts and soon reached a point where they were able to control the monarchs of Europe. This rare book describes the day-to-day dealings and behind the stage financial manipulations which eventually gave the family such prominence it was able to decide not only the financial but also the political happenings in Europe. What the reader will wonder however is that how in the world were they able to rise so high alone and if there wasn&amp;#039;t by any chance some hidden helping hand involved in the process. It was also the time of the resurrection of ancient secret orders, masonic or even illuminist in nature, who conspired against then monarchs of Europe, spawning endless revolutions which eventually crushed them and today culminated in the emergence of an unified Europe. Today we know it was those secret societies who gave aid to this incredible and completely unnatural wealth which is today in posession of this one single family and its many offshoots. If you think that people like Bill Gates and others are the richest in the world you may want to think again as their wealth is simply pathetic compared to that of Rothschilds. But some people are so rich they simply don&amp;#039;t want the world to know anything about them so they don&amp;#039;t arouse any suspicion. The Rise of the House of Rothschild tells a tale of such a group who will do anything to hide from the public view and will not allow any inspection on their fabolous wealth. Although the author&amp;#039;s writing style is sometimes dry, the reader is given (too) many hints on the enormous wealth which was acquired even back then and has been greatly increased since then. The Rothschilds seem to act as a punishment for all the warmongers of this world as they will finance them all without exception, then calmly watch as they slaughter millions and at the end take the money back with interests - and if noone can pay back they will simply take the whole country. 440 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:2b22f07dd8dab4bf5cb6ff5be471ffd675d2eb6c","amp;dn":"Corti-Rise+of+House+of+Rothschild%28biggest+war+profiteers+in+hist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b22f07dd8dab4bf5cb6ff5be471ffd675d2eb6c","infoHashBuffer":{"type":"Buffer","data":[43,34,240,125,216,218,180,191,92,182,255,91,228,113,255,214,117,210,235,108]},"announce":[],"urlList":[]}}