{"title":"Sarah Jarosz - Build Me Up From Bones [2013][EAC,log,cue. FLAC]","uid":8971791,"size":261102967,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2bdb1d18efaeb34a4c86eca9a44086e67b6d53fe&amp;dn=Sarah+Jarosz+-+Build+Me+Up+From+Bones+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":15,"time":1380345227,"description":"Artist:Sarah Jarosz\nRelease:Build Me Up From Bones\nReleased: 2013\nLabel: Sugar Hill\nCatalog#: SUG-CD-4093\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: folk\n\n01. Over The Edge (3:21)\n02. Fuel The Fire (3:32)\n03. Mile On The Moon (3:49)\n04. Build Me Up From Bones (3:36)\n05. Dark Road (3:32)\n06. Simple Twist Of Fate (4:53)\n07. 1,000 Things (3:28)\n08. Gone Too Soon (3:35)\n09. Anything Else (4:57)\n10. The Book Of Right-On (5:36)\n11. Rearrange The Art (3:52)\n\nThe third full-length by 22-year-old Sarah Jarosz reflects not only her growth as a songwriter but her willingness to push the boundaries of country, folk, and Americana to discover connections not necessarily considered before. Build Me Up from Bones reflects years of study in contemporary voice improvisation at the New England Conservatory of Music. She wrote nine of the 11 songs here, and chose two covers: Bob Dylan's &quot;Simple Twist of Fate&quot; and Joanna Newsom's &quot;The Book of Right-On.&quot; Her various backing musicians include Viktor Krauss, Chris Thile, Darrell Scott, and Aiofe O'Donovan, to name a few. Jarosz plays guitar, banjo, and mandolins. &quot;Over the Edge,&quot; fueled by Dan Dugmore's lap steel, Jedd Hughes' acoustic guitar, and her own octave mandolin, walks a roots rock line, while the title track is a slipstream modern folk number that finds her voice accompanied by mandolin, two string players, and O'Donovan's harmony vocal. &quot;Dark Road&quot; drifts between electric Americana, newgrass, and contemporary folk, kissed by Jerry Douglas' dobro and Scott's electric guitar. What all of these songs have in common is a new openness in Jarosz's singing. She takes chances with her phrasing, allowing one line to bleed just enough to inform the next; she moves her smoky alto around its range, holding dynamics in check in favor of subtle tension. Her songs are looser, more expressionistic lyrically and instrumentally; sound and texture are more important than genre. Her reading of Dylan's tune is understated, yet reveals empathy for its narrative in its marrow; her vocal is accompanied only by Nathaniel Smith's plucked cello, revealing the intimate connection. The haunted love song &quot;Gone Too Soon&quot; is one of the most bracing tracks here; Jarosz's banjo is complemented by a full band that features Douglas' and Scott complementing her on Weissenborn and acoustic guitars, respectively, with Kate Rusby's chilling harmony vocal offering support. The slippery, jazz-like take on Newsom's song finds Jarosz employing a breezy blues delivery in the lyric, while her syncopated mandolin playing engages in rhythmic interplay with cello and violin. O'Donovan rejoins her on closer &quot;Re-Arrange the Art,&quot; an expansive yet impressionistic song about lost love that walks the line between emotional stress, loneliness, and open acceptance. Jarosz's banjo is the only clearly discernible instrument as pedal steel, strings, and a Wurlizter swirl around the singers. Build Me Up from Bones separates itself from its promising predecessors because it is a songwriter's record. Jarosz lets her considerable instrumental prowess submit itself to serving the needs of her songs instead of merely adorning them with a precocious imagination. She can do this because she possesses not only self confidence in her material, but in her discernment, which is rare for a musician so young.","torrent":{"xt":"urn:btih:2bdb1d18efaeb34a4c86eca9a44086e67b6d53fe","amp;dn":"Sarah+Jarosz+-+Build+Me+Up+From+Bones+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bdb1d18efaeb34a4c86eca9a44086e67b6d53fe","infoHashBuffer":{"type":"Buffer","data":[43,219,29,24,239,174,179,74,76,134,236,169,164,64,134,230,123,109,83,254]},"announce":[],"urlList":[]}}