{"title":"Jelly Roll Morton - Complete Library of Congress Recordings","uid":3833583,"size":1295683204,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2c13c9f928d4d549b16f4dbce24efbd4404d9841&amp;dn=Jelly+Roll+Morton+-+Complete+Library+of+Congress+Recordings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"JanK","files":128,"time":1191792508,"description":"Jelly Roll Morton\n\nFerdinand &quot;Jelly Roll&quot; Morton (September 20, 1885 or October 20, 1890?July 10, 1941) was an American jazz pianist, bandleader and composer who some call the first true composer of jazz music. Morton was a colorful character who liked to generate publicity for himself by bragging. His business card referred to him as the Originator of Jazz, and he was and is valued as a source of rare information about early jazz, despite his penchant for hyperbole.\n\nWashington, D.C.: The Library of Congress interviews\nIn 1935, Morton moved to Washington, DC, to become manager and piano player at a dive called at various times the &quot;Music Box&quot;, &quot;Blue Moon Inn&quot; and &quot;Jungle Inn&quot; in the African American neighborhood of Shaw. (The building that hosted the nightclub still stands, at 1211 U Street NW.) Morton was also the master of ceremonies, bouncer, and bartender of the club. He was only in Washington for a few years; the club was owned by a woman named Cordelia who allowed all her friends free admission and drinks, which prevented Morton from making the business a success. When Morton got stabbed by one of her disgruntled friends in 1938 in which he suffered wounds to the head and chest, his wife Mabel demanded that he depart Washington.[1] There is speculation the attack may have contributed to his early demise.\n\nHowever, it was during his brief residency at the Music Box that folklorist Alan Lomax first heard Morton playing piano in the bar. In May 1938, Lomax invited Morton to record music and interviews for the Library of Congress. The sessions, originally intended as a short interview with musical examples for use by music researchers in the Library of Congress, soon expanded to record more than eight hours of Morton talking and playing piano, in addition to longer interviews during which Lomax took notes but did not record. Despite the low fidelity of these non-commercial recordings, their musical and historical importance attracted jazz fans, and they have helped to assure Morton&amp;#039;s place in jazz history.\n","torrent":{"xt":"urn:btih:2c13c9f928d4d549b16f4dbce24efbd4404d9841","amp;dn":"Jelly+Roll+Morton+-+Complete+Library+of+Congress+Recordings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c13c9f928d4d549b16f4dbce24efbd4404d9841","infoHashBuffer":{"type":"Buffer","data":[44,19,201,249,40,212,213,73,177,111,77,188,226,78,251,212,64,77,152,65]},"announce":[],"urlList":[]}}