{"title":"Ministry Monday #7","uid":10868923,"size":431820931,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2c27c7202027e549120db4b7bfcd1668cf47caa0&amp;dn=Ministry+Monday+%237&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":4,"time":1408951467,"description":"Week #7...Ministry Monday.  If you missed it a few weeks ago, there was some awesome footage of Sgt. Major doing the vocals on this song in the Making of From Beer To Eternity documentary. How Sgt. Major can be so kind and gentle in person yet powerful and commanding on tape was amazing to capture. He read William S. Burroughs, Thanksgiving Prayer. You can find the poem here (http://academic.brooklyn.cuny.edu/modlang/carasi/thanksgivingprayer.htm) and if you have no fucking clue who Burroughs is buy Naked Lunch and start your education. Also, on the webisodes on the making of... you can see footage of Mikey making all the background music for this mix. \n\nIncluded in this weeks extras on the Pirate Bay are more unreleased DeFriBrilatour Webisodes and an outtake of Ministry: The Lost Gospels of Al Jourgensen, it's being released on paperback and you can order it here,\n\nEnjoy, share and make all your posts on our Facebook, Twitter and website (www.alfuckingjourgensen.com). Some of you are just leeching...do you job too. Get the word out on these FREE downloads. We did our job of slaving over these remixxxes, so you help get the word out to your cult. Fair enough?\n\nSo, remember: 1. like my Alien Jourgensen and Ministry fan pages on Facebook AND hit up my Twitter @alfknjourgensen. 2. Send a link back to us from your website, social media or online magazines.\n\nHow easy was that...a new track gets released THIS Monday (along with some extras on the Pirate Bay... yes...THAT Pirate Bay) and will be released in the same order as on the album. If that weren't enough...we're gonna do the same with the Relapse remixxxes after From Beer to Eternity's are all done... so download away..\n\n-Uncle Al\nwww.alfuckingjourgensen.com\n\nIncludes:\n\nThanks But No Thanks (Do Another Hit RemiXXX)\nDeFriBrilatour Webisode 7\nDeFriBrilatour Webisode 8\nDeFriBrilatour Webisode 9\n \n","torrent":{"xt":"urn:btih:2c27c7202027e549120db4b7bfcd1668cf47caa0","amp;dn":"Ministry+Monday+%237","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c27c7202027e549120db4b7bfcd1668cf47caa0","infoHashBuffer":{"type":"Buffer","data":[44,39,199,32,32,39,229,73,18,13,180,183,191,205,22,104,207,71,202,160]},"announce":[],"urlList":[]}}