{"title":"His Bright Light by Danielle Steel (ePUB/Mobi)","uid":7855333,"size":684159,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d4058788e8e30a466b6bc2f5d327b830945897f&amp;dn=His+Bright+Light+by+Danielle+Steel+%28ePUB%2FMobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"azizex666","files":-1,"time":1353739414,"description":"&quot;This is the story of an extraordinary boy with a brilliant mind, a heart of gold, and a tortured soul.&quot;\n\nFrom the day that he was born, Nick Traina was his mother's joy. By nineteen, he was dead. He rocketed through life like a shooting star. He spoke in full sentences at the age of one; he was a brilliant, charming child who never slept. his gift for writing was extraordinary, his musical talent promised a golden future. But by the time he entered junior high school, Danielle Steel saw her beloved son hurtling towards disaster and tried desperately to get Nick the help he needed - the opening salvoes of what would become a ferocious, pitched battle for his life.\n\nEven as he struggled, Nick's charisma and accomplishments remained undimmed. He bared his soul in his journal with uncanny insight, in searing prose, poetry and song. When he was finally diagnosed and treated, it bought time, but too little. In the end, perhaps nothing could have saved him from the insidious disease that had shadowed him from his earliest years.\n\nThis is Danielle Steel's powerful story of the son she lost and the lessons she learned during his courageous battle against darkness. At once a loving legacy and an unsparing depiction of a devastating illness, Danielle Steel's tribute to her lost son is a gift of life, hope, healing and understanding to us all.\n\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n                          Published - 1999\n\n                All my Ebook uploads are separated by Genre Tags \n\n \n            **Support Your Favorite Authors By Buying Their Books**\n\n\n                Check out all my Magazine and ebook uploads here.\n\n                    &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;\t","torrent":{"xt":"urn:btih:2d4058788e8e30a466b6bc2f5d327b830945897f","amp;dn":"His+Bright+Light+by+Danielle+Steel+%28ePUB%2FMobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d4058788e8e30a466b6bc2f5d327b830945897f","infoHashBuffer":{"type":"Buffer","data":[45,64,88,120,142,142,48,164,102,182,188,47,93,50,123,131,9,69,137,127]},"announce":[],"urlList":[]}}