{"title":"Allied General (1995) - WIN-ALL","uid":8798734,"size":148627535,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2d43d3d90f0c942a494f2ae5cf270c1913969968&amp;dn=Allied+General+%281995%29+-+WIN-ALL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"AN0NYMOUS142857","files":1,"time":1376143021,"description":"Allied General is a turn-based strategy video game set in World War II that features the Allied side of operations. Players can progress through four campaigns as an Allied general against Axis forces controlled by the computer. In Germany, Allied General was titled Panzer General II, and Panzer General II was named Panzer General IIID.\nGameplay\n\nThe playable campaigns include:\n\n    a Soviet campaign, which features the Soviet invasion of Finland, known as the Winter War, the defenses of Moscow, and if successful, the counter-attack\n    a British campaign in North Africa against the German and Italian armies, beginning in Sidi Barrani\n    a British campaign, which can be played as the continuation of the first British campaign, which features the final Allied attack in Tunis on Mareth Line and the invasion of Europe\n    an American campaign, similar to the second British campaign, that begins with Operation Torch and continues to the invasion of Europe\n\nIndividual scenarios can be played from either side.\n\nWhereas the first Panzer General targeted DOS, Allied General was made for Windows. Allied General and Panzer General for Windows (an update to the DOS version) utilize a pop-up interface and share an underlying file system that differs from the original Panzer General. Fans created a version of Allied General, based on its own DOS version, that borrows interface features from the original Panzer General. Called Allied Panzer General, it includes all scenarios and campaigns from the original, as well as bugfixes.\n\n1.Extract anywhere.\n2.Press &quot;START THE GAME&quot; batch file.\n3.Play.\n\nCompatible with WIN-ALL","torrent":{"xt":"urn:btih:2d43d3d90f0c942a494f2ae5cf270c1913969968","amp;dn":"Allied+General+%281995%29+-+WIN-ALL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d43d3d90f0c942a494f2ae5cf270c1913969968","infoHashBuffer":{"type":"Buffer","data":[45,67,211,217,15,12,148,42,73,79,42,229,207,39,12,25,19,150,153,104]},"announce":[],"urlList":[]}}