{"title":"Scooby Doo 2: Monsters Unleased(2004)DVDRip.AC3(ENG)-DROCK","uid":6660113,"size":735588405,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2d665bf163687c1942995b607c4fb2dac1fe1d88&amp;dn=Scooby+Doo+2%3A+Monsters+Unleased%282004%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"drock232","files":-1,"time":1315441689,"description":"America's favorite teenage canine-led crime fighters earn a second shot at the big screen in this sequel to the hit comedy Scooby-Doo. The reunited Mystery Inc. team -- Fred (Freddie Prinze Jr.), Daphne (Sarah Michelle Gellar), Velma (Linda Cardellini), Shaggy (Matthew Lillard), and Scooby-Doo (voice of Neil Fanning) -- return to their hometown of Coolsville as heroes when a local criminology museum offers an exhibition of the many ghostly disguises used by villains they've subdued over the years. However, their warm welcome is not long-lived; mean-spirited television reporter Heather Jasper-Howe (Alicia Silverstone) has aired a series of stories calling the team's intelligence and bravery into question, and even worse, a number of the weird creature costumes on display in the museum are coming to life and wrecking havoc on the people of Coolsville. Some of the clues seem to point to Old Man Wickles (Peter Boyle), whose attempts to pose as the Black Knight Ghost were foiled by the Mystery Machinists in the past, but is he looking for revenge or just a red herring? And what is Velma supposed to do about Patrick Wisely (Seth Green), a curator at the museum who's warm for her helmet-haired form? Scooby-Doo 2 also co-stars Tim Blake Nelson and features a cameo appearance from American Idol star Ruben Studdard. \n\nRipped with Handbrake.\n\nLength: 1 Hour 33 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 400\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:2d665bf163687c1942995b607c4fb2dac1fe1d88","amp;dn":"Scooby+Doo+2%3A+Monsters+Unleased%282004%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d665bf163687c1942995b607c4fb2dac1fe1d88","infoHashBuffer":{"type":"Buffer","data":[45,102,91,241,99,104,124,25,66,153,91,96,124,79,178,218,193,254,29,136]},"announce":[],"urlList":[]}}