{"title":"Bella (1980) - Classic Porn XXX","uid":10697957,"size":1425539663,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2d803fe98ac34683834e0f8800466d645ebc9598&amp;dn=Bella+%281980%29+-+Classic+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"KidAtomic","files":-1,"time":1407197924,"description":"Bella (1980)\n\nCOVERS AND SCREENS FOUND HERE:  &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=7&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=7&lt;/a&gt;\n\nSHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! \n\nBella is the story of a very passionate young woman. Her fantasies are wild but reality is wilder. Unable to control her desires, she falls madly in love with her mother`s lover. Bella`s fantasies will become your erotic reality! Don`t miss this sensual XXX import from Italy.\n\n\n    Scene 1. Diane Sloan, Eric Edwards\n    Scene 2. Diane Sloan, Jack Teague\n    Scene 3. Tracy Adams\n    Scene 4. Tracy Adams, Eric Edwards\n    Scene 5. Tracy Adams, Eric Edwards\n    Scene 6. Tracy Adams, Eric Edwards\n    Scene 7. Diane Sloan\n    Scene 8. Arcadia Lake, Tracy Adams, Eric Edwards\n    Scene 9. Diane Sloan, Tracy Adams, Eric Edwards\n\n\nDirector\n    Alexander Kubelka\n\nActresses:\n    Arcadia Lake [BJOnly]\n    Diane Sloan (as Dana Stone) [Facial]\n    Tracy Adams [Facial]\n\nActors:\n    Eric Edwards\n    Jack Teague (as Jake Teague)\n\n\nREVIEW***************\n\n\nBella\n1980\n80 minutes\nDustributed by: Arrow\n\nAvailable from: Excalibur- http://www.excaliburfilms.com\n\nStarring: Tracy Adams (not the late 80's famous ugly one!), Dana Stone,\nArcadia Lake, Eric Edwards,  Jake Teague\n\nThemes: young girls, forced sex, B+D, incest\n\nThis vid is about a girl and her mom in love with the same next door\nneighbor and their fight over who gets him.  Eric Edwards is the man\nsought after. Tracy Adams is &quot;Bella&quot; the daughter, and the mom is Dana\nStone. Arcadia Lake is Bella's friend and Jake Teague is Bella's father\nand Dana's husband.  The music supplied for this film was done by the\nRome Symphony Orchestra. Now that's class for ya! \n\nI got my copy used, from an old video store, with old Arrow boxcover.\nThe one offered by Excalibur most likely is cut somehow.\n\nFirst scene-  Tracy (Bella) who has long hair and petite tits and looks\nso fucking cute, is walking down the street to her home.  Eric is seen\nunfolding a sleeping couch in his home.  Dana, who is not too pretty but\nhas nice full tits,  comes in and says she doesn't want to fuck Eric .\nBella arrives to her empty house.  Dana wants to have sex but feels\nguilty cause she is married.  Eric, with his clothes still on fucks Dana\nmish though with her legs pushed all the way back and her panties are to\nthe side.  Bella goes outside to look for her mother and stumbles upon a\nwindow into Eric's basement where Eric and Dana are getting down and\ndirty.  Eric cums on her cunt and Dana rubs her cunt continuously. The\ntitle sequence and credits play.\n\nSecond scene-  Bella walks away from the window. Now Bella and Dana sit\nat table for breakfast with a timer ticking and they don't talk to each\nother.  Bella walks to Eric's house but Eric comes from behind and asks\nher what she is doing there but she says nothing. Eric-&quot; You know\nsometimes Bella, you really are a beautiful child&quot;. Bella-&quot;I'm not a\nchild!&quot;  She tells him bye and he goes into his house.  \n\nThird scene-  You see a plane arriving at an airport.  Jake meets Dana\nand Bella who pick him up and drive home. Sem dorky music plays.  They\narrive home and eat a meal.  Bella is sleeping naked (Oh so lovely). Cut\nto   Jake and Dana having some sex in their room.  He rubs her cunt and\nsucks her tits.  Bella starts playing with herself and rubs her tits and\npussy in her own room.  Dana gives jake some head.   Bella sits up and\nmasturbates and sticks her middle finger in her cute little snatch as\nshe looks into a handheld mirror.  Bella now sticks a dildo with a base\nto it into her yummy little hole. She stops and hears her ma and pa\nthrough the walls. She is so horny tonight that she goes over to Eric's\nplace. He opens the door and she says to him- &quot;I'm not a child!&quot;. He\nsays ok you're not and lets her in. She keeps insisting she's not a\nchild no matter what he says and wants to prove it.  She has brown\nleather boots on and a berade in her hair. (oh heaven help me!).  She\nasks him if he is drunk and he replies no.  She sits on a chair and\nspreads her legs.  Eric says,&quot;Where are your parents...your are in a\nvery dangerous position now, Bella- &quot;Why&quot;, Eric-&quot;Cause I'm a man and\nyou're just a child&quot;.   Bella-&quot;I know many things the kids don't know, I\nknow all about you and my mother&quot;. Eric-&quot;So&quot;,  Bella-&quot;So nothing&quot;.  He\nkneels down in front of her and says, &quot;Do you know what it's like to\nmake love&quot;.  Bella- &quot;Teach me&quot;.  He kisses her then sucks on her young\nlittle tits.  Cut to Jake balling Dana mish/spoon and sucking those full\nrounded tits.  Cut back to Eric eating Bella's juicy snatch and then\nmore kissing.  Bella gives Eric some head as he holds her head while\nstanding up.  He lies down as she continues to bestow such grace upon\nhim.  She takes her shirt off completely and gets into some cowgirl\naction while he sucks her delicious buds.  All four in back and forth\ncuts show them kissing.  Dana sucks jake more and he cums on her face\nand she rubs it all over herself.  Cut to Eric mishing Bella as she\nmoans. He cums on her belly and cunt.\n\nFourth scene-  Dana and Bella now are escorting Jake back to the airport\nto L.A. .  Dana goes over Eric's house when they get back but eric\ndoesn't answer the door and avoids her.  Bella sneaks behind Dana and as\nshe leaves and eric opens door for Bella.  Bella tells Eric she doesn't\nwant him to see her mother anymore and she says, &quot;I don't want to share\nyou with anyone!, I'm your girl now, we're having a relationship.&quot;  Eric\nsays, &quot;Relationship you're just a baby. Bella tries to get him to admit\nhe loves her but he's not sure. (I do I do!).  He wants her to stop but\nshe says no and jumps onto him as he carries her upstairs like that.\nEric- 'Oh Bella you are such a child&quot;.  He says he wants to show her\nwhat his gradmother has put in a room when she was living in case a\nchild would visit.  There is a stuffed teddy bare and some dolls.  They\nare on a couch in that room and he does her mish.  She fucks furiously\nbut he asks her to slow down.  You now see Dana calling Eric at his work\n(poor dumb mother) but she's surprised that he's not there.  Some RC\naction on Bella as she says, &quot;I love you, I love you&quot;. Dana is calling\nEric at home now but of course he doesn't answer.  Eric pulls his cock\nout of her snatch and rubs on it now.  Now downstairs, Eric tries to\ntell Bella that he likes her mother still and he likes her and that they\ndid have a good time together.  Eric- &quot;You may think you are a woman\nnow&quot; to Bella.  Cut to Bella and Dana sleeping.  Dana wakes up and goes\nto fuck Eric and does this time. Bella sees this but doesn't interfere.  \n\nFifth scene-  In the morning Eric goes in his garage, opens the car door\nonly to find Bella lying on the seat nude. (Oh what a wake up call!).\nShe tells Eric to kiss her and he does.  Dana tries to call Eric but of\ncourse he's with Bella again. (Man I feel sorry for the old hag).  Bella\nsucks him off and licks his balls.  He cums on her face and she rubs his\ncock all over her face.  \n\nSixth scene-  Dana now is with Bella and tells her she is going over to\ntalk to Eric. Bella says she will go to but ma says no! Ma still doesn't\nknow about Bella's trysts with him.  Bella calls Eric and lets him know\nthat Dana is coming over and that she'll kill him if he touches her at\nall.  Bella calls again after Eric ignores her warning and &quot;touches&quot;\nher.  and says, &quot;I'm masturbating here thinking about your cock, Can you\nhear me, listen Ahhhhh&quot; and she hangs angrily. (She is so cute lying\nthere with her pussy open and her beautiful feet).  Eric is undressing\nDana more but Bella calls again.  Bella tells him to get rid of her\ncause she's coming over.  Eric asks Dana to leave cause he faked a fast\nbusiness meeting cause of Bella coming over.  \n\nSeventh scene-  Dana is in her home now lying stomach down on her bed\nand masturbating from underneath.  She then turns over and does the same\nbut sucks on a cock dildo too and sticks it in her.  Bella leans up from\nher bed in her own room and listens thru the walls as her mom finshes\nup. \n\nEighth scene-  Jake comes home again and both him and Dana confront\ntheir daughter about her not going to school.  Dana says she talked to\nArcadia, Bella's friend,  and she actually confirmed that.  Bella hints\nto her father that her ma is always helping Eric out but he doesn't get\nthe hint.  Bella and ma and a mean look towards each other.  Ma tells\nher to apologize but she doesn't.  Jake starts to question Dan about\nthis helping Eric out but dana just says, &quot;Bella is growing up&quot; and he\nisn't there to see it.  (She's very moody implication excuse).  \n\nNinth scene- Bella sees her mother with eric in the woods kissing.  Then\nBella brings home Arcadia to Eric's house.  Arcadia has nice tits.  When\ninside Eric's house Bella pulls a gun on her friend and yells at her for\nletting her mother know she hasn't been at school. She orders Arcadia\nupstairs where Eric is and surprises him.  She tells Eric to shut up.\nShe throws handcuffs to Arcadia and tell sher to lock them on Eric.\nBella tells Eric to sit down on a chair and put his hands behind it as\nshe cuffs them from behind and for Arcadia to &quot;get on her knees and suck\nhis cock&quot;.  The organ music starts playing.  All the while bella is\npointing the gun at them.  Bella takes off her own clothes and lies down\non a couch with her brown leather boots on only and masturbates still\nwith her gun pointing at them.  She tells Arcadia to kiss her and pushes\nher head into her pussy and points the gun right at her head also.  She\nlays Arcadia back on couch and eats her out.  Eric is dying to jerk\nhimself off but he can't cause he's cuffed  and tries some jerking\nmotions with his hips on the chair.  He begs Bella to let him loose but\nshe ignores.  Now the girls do a 69 and finish.  Bella gets up and says\nas she is pointing the gun at Eric, &quot;Stop fucking around with my\nmother!&quot;.  That scene was so fuckin cool!.\n\nTenth scene-  Bella, Arcadia, Jake and Dana are at the dinner table.\nArcadia tells Jake that she lied to Dana cause it was just a joke about\nBella not going to school recently.  Dana apologizes.  Some freaky music\nagain as Jake drives to airport again. Man I am in tears after a third\nlittle drive the airport. It is done so corny like. \n\nEleventh scene-  On the drive home Dana tells Bella she saw all 3 of\nthem at Eric's place and she proposes a deal.  Dana won't tell Jake\nabout what Bella did as long as she doesn't fuck Eric again. (She didn't\ncare about her daughter's lesbianism!).  Dana threatens Bella that if\nshe can't have Eric she will kill him because if she can't have him\nnobody will.\nBella says how about they share Eric 50/50 and that Arcadia will\nunderstand (with a grin on her face).  They start to call each other\nnames.  \n\nLast scene-\nThey are both back home sleeping.  Dana wakes up and goes over to Eric\nfor a fuck fling.  Bella wakes up and then goes over too and walks in on\nthem.  Bella takes off her own clothes and she joins in and kisses Eric\nand her mother!  Eric mishes Dana as Bella rides her mother's face.\nEric sucks Bella's pretty titties then Bella stands up to let Eric lick\nher young clit as Eric is still mishing Dana.  Beautiful shot of Bella's\nass as Eric licks her cunt.  Bella and her mother suck/jerk off Eric and\nthey kiss again too.  He unloads his cum in slow motion, as the music\nreaches its climax, on to their faces.  Bella licks his cum off her\nmother's face and both do the same off his sick more in slow motion.\nThe end.\n\nThis movie was so very hot. Tracy Adams's performance and her looks made\nthis one of my all time favorites. Lots of kink mixed in with good story\nline. I sure wish she did more movies than she did.  The music just like\nin &quot;Little Me and Marla Strangelove&quot;, although here it was just\ninstrumental, shows a extra caring about the final product which I\napplaud.\nThis is highly recommended.\n\nCOVERS AND SCREENS FOUND HERE:  &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=7&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=7&lt;/a&gt;\n\nSHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! \n\n","torrent":{"xt":"urn:btih:2d803fe98ac34683834e0f8800466d645ebc9598","amp;dn":"Bella+%281980%29+-+Classic+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d803fe98ac34683834e0f8800466d645ebc9598","infoHashBuffer":{"type":"Buffer","data":[45,128,63,233,138,195,70,131,131,78,15,136,0,70,109,100,94,188,149,152]},"announce":[],"urlList":[]}}