{"title":"China - Triumph and Turmoil [BBC 4] Niall Ferguson","uid":7747554,"size":1211397886,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2d8be34da4949dbe320b3cd55919e538617aa8c7&amp;dn=China+-+Triumph+and+Turmoil+%5BBBC+4%5D+Niall+Ferguson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"rambam1776","files":-1,"time":1350810580,"description":"From THEBOX - thanks to the OP\n\nEpisode 1\nChannel 4 Mon 12 March 2012 20:00\n\nNiall Ferguson shows how the vast apparatus of the Chinese state has always been called on to subjugate individual freedom to the higher goal of unity. \n\nFerguson also examines how, on the other hand, centralised control produces tensions that threaten to destroy the country.\n\nEpisode 2\nChannel 4 Mon 19 March 2012 20:00\n\nNiall Ferguson asks how China manages to live under a Communist system of government but with a thriving capitalist economy. \n\nThe succession of revolutions orchestrated by Mao Zedong killed more people than Hitler and Stalin combined. And yet this hard-line communist and murderer of businessmen is revered in China today as the founder of a modern-day capitalist superpower. Why? \n\nTo answer this question Niall travels from Beijing to Mao's birthplace at Shaoshan to the new supercity of Chongqing and to the rural backwaters of Anhui to track down survivors of the madness of Chairman Mao, newly minted billionaires and the Mao worshippers who believe tomorrow belongs to them. \n\nHe finds the way China is governed is eerily similar to the way it was under the First Emperor. All the power lies in the hands of nine men with expressionless faces and what looks like the same hair dye - as unelected and as powerful as Emperor Qin. \n\nAutocracy that values unity over choice; secrecy over openness - not democracy. That has always been the Chinese way. It is the price that China is prepared to pay for the spectre that has always haunted its leaders: protest, rebellion and turmoil.\n\nEpisode 3\nChannel 4 Mon 26 March 2012 20:00\n\nNiall Ferguson asks what China's growing global presence and aggressive nationalism mean to all of us. \n\nChina's supercharged economic growth signals a seismic shift in political power from West to East. We are increasingly dependent on China's money to bail out our own fragile economies. \n\nBut at what price? How can we protest when China challenges our most deeply held beliefs about democracy and freedom of speech by locking up its citizens? Should we criticise them or just keep quiet for fear of frightening off much needed investment? \n\nWhen China transforms itself from an assembler of products invented in the West to an innovator in its own right what will be left for us to do? What will it be like to work in a Chinese-dominated world?\n\nPresenter Niall Ferguson","torrent":{"xt":"urn:btih:2d8be34da4949dbe320b3cd55919e538617aa8c7","amp;dn":"China+-+Triumph+and+Turmoil+%5BBBC+4%5D+Niall+Ferguson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d8be34da4949dbe320b3cd55919e538617aa8c7","infoHashBuffer":{"type":"Buffer","data":[45,139,227,77,164,148,157,190,50,11,60,213,89,25,229,56,97,122,168,199]},"announce":[],"urlList":[]}}