{"title":"GFI.EventsManager.v11.0.0.20110407.Incl.Keymaker-AGAiN","uid":6457086,"size":77819572,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2da93c44dd5a2f1ba5b25a9d347cdbd8c42dd36f&amp;dn=GFI.EventsManager.v11.0.0.20110407.Incl.Keymaker-AGAiN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"amin12","files":1,"time":1307616541,"description":"GFI EventsManager 9.0.0 build 20101117 | 68.06 MB\n\nThe huge volume of system events that is generated daily is a valuable source of information for network administrators to help them monitor configuration changes, administrative actions, identify system errors and suspected security breaches. This is, however, an overwhelming task without the proper tools. The larger the network, the greater is your need for a solution that allows you to monitor, manage and archive thousands of events that are generated by devices across heterogeneous networks. GFI EventsManager 8, an award-winning events monitoring, management and archiving solution, supports a wide range of event types such as W3C, Windows events, Sylogs and, in the latest version, SNMP traps generated by devices such as firewalls, routers and sensors.\n\nProviding support for devices from the top 20 manufacturers in the world as well as custom devices, GFI EventsManager allows you to monitor an extended range of hardware products, report on the health and operational status of each one and collect data for analysis. You can also track employee activity on the network such as changes made to their PCs, files accessed during the day, meet legal and regulatory compliance such as SOX, PCI DSS, HIPAA and much more.\n\nTop Features\n? Improved installation and usability\n? Analysis of event logs including SNMP Traps, Windows Event logs, W3C logs and Syslog\n? Real-time alerts, SNMPv2 traps alerting included\n? View reports on key security information happening now\n? Centralized event logging\n\nOther Features\n? Certified for Windows Server 2008; Supports Vista\n? Deeper granular control of events\n? Support for new devices\n? SQL Server Auditing\n? Translates cryptic windows events\n? High performance scanning engine\n? Collect events data distributed over a WAN into one central database\n? Rule-based event log management\n? Advanced event filtering features\n? Event log scanning profiles\n? Helps to comply with PCI DSS and other regulations\n? Remove ?noise? or trivial events that make up a large ratio of all security events\n? Real-time 24 x 7 x 365 day monitoring and alerting\n? Graphically monitor the status of GFI EventsManager and your network through the built-in status monitor\n? Report scheduling and automated distribution via email\n\n\nRead more: http://forum.esoft.in/other-softwares/1177697-gfi-eventsmanager-9-0-0-build-20101117-a.html#ixzz1OlbgdPae","torrent":{"xt":"urn:btih:2da93c44dd5a2f1ba5b25a9d347cdbd8c42dd36f","amp;dn":"GFI.EventsManager.v11.0.0.20110407.Incl.Keymaker-AGAiN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2da93c44dd5a2f1ba5b25a9d347cdbd8c42dd36f","infoHashBuffer":{"type":"Buffer","data":[45,169,60,68,221,90,47,27,165,178,90,157,52,124,219,216,196,45,211,111]},"announce":[],"urlList":[]}}