{"title":"Sierra Infinity 6 Suite","uid":4561681,"size":38013084,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2e095d1206219ac8a33d763587fda6f2ca6557c8&amp;dn=Sierra+Infinity+6+Suite&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"syntax3rr0r792","files":-1,"time":1228700677,"description":"Infinity is an exterior ballistics program for small arms. Infinity Suite includes the Infinity exterior ballistics program, additional Reloading Data programs to calculate all the cartridge and reloading data included in the 5th Edition printed manuals, and the Reference materials from the 5th Edition printed manuals. Infinity is the fifth version of the Sierra Bullets exterior ballistics program. We believe you will find this to be the most complete and user friendly ballistics program available. This software program computes all essential elements of the trajectory, in 1 yard (or meter) increments, of any bullet that has a Ballistic Coefficient referenced to the &quot;G1&quot; drag function, and for any set of firing conditions. These firing conditions include muzzle velocity of the bullet, elevation (or depression) angle of the gun barrel, altitude of the firing point, wind conditions at that location, and weather (meteorological) conditions at the firing time. The trajectory parameters calculated by the program include velocity, energy, momentum, drop relative to the extended bore line of the gun, bullet path height relative to the line of sight of the shooter, wind deflection of the bullet, and time of flight of the bullet. All are computed versus distance from the muzzle as the bullet flies downrange. The program outputs a list of all these parameters and provides graphs, which the user can select, of velocity, energy, drop, bullet path height, and crosswind drift.\n\nThe program does much more than compute bullet trajectories. It contains a feature that computes the effects on the bullet trajectory of variations in firing conditions. For example, you can change altitude of the firing point, and compute the effect on the trajectory. Or you can change a wind condition; or muzzle velocity; or Ballistic Coefficient. In fact, you can change any inputted firing condition or combination of conditions. You can also graph the trajectory variations that result.\n\nAnother key feature of the program is that it will calculate the point blank range of a cartridge for a game animal or silhouette target of any size (up to a vital zone of 30 inches (762cm)), for either of two cases. The first case is when you have already sighted in your gun for a certain zero range and you want to know how far out you can shoot at the animal or silhouette without holding high to compensate for the drop of the bullet. In the second case the program will tell you where to set your zero range in order to maximize the point blank range.\n\nThe program also will tell you what happens when you first zero your gun in at a convenient shooting range, and then shoot at a target that is either uphill or downhill compared to the slope of the shooting range where you sighted in. In such a situation the bullet trajectory will be different compared to the trajectory at the range you used to zero in. The program calculates the differences in all the trajectory parameters for you.\n\nAnother feature of the program will compute where your gun is zeroed if you know that it shoots high by a measured amount at a known range.\n\nStill another feature calculates the maximum range that a bullet can reach along a given slope angle. The slope angle can be chosen as positive (uphill), zero (level fire), or negative (downhill). This feature also calculates the elevation angle of the gun muzzle (referenced to level) for the bullet to reach the maximum range along the chosen slope.\n\nThe program will also compute the maximum altitude a bullet can reach, above a given firing point.\n\nInfinity handles up to five different active bullets at a time. The program stores a full inventory of bullets and cartridges offered by 15 manufacturers, both U. S. and foreign. Each of the five active bullets can be selected from anywhere in the stored inventory list. A key feature of the program allows any one of several trajectory parameters to be compared among the five (or any smaller number) bullets that you select. You can compare remaining velocity, energy, drop, bullet path height, or crosswind drift. Both a list and a graph of these comparisons are provided by the program.\n\nYou can also create custom bullets and save the settings in the custom bullet database. These custom settings function in the program the same way as the manufacturers bullets. You can save a modification of an existing bullet or create a custom bullet from scratch. The custom bullets database is handled separately from the manufacturer's database allowing future updates of the manufacturer's data without affecting your custom settings. For more information see Custom Bullets.\n\nInfinity sets ranges of conditions for many of the data input fields to ensure that you only enter data which will provide accurate and reasonable results. For each field that has conditions set, you can see these required ranges in the status bar in the bottom left of the main form. If you enter a value outside of these ranges, you will receive an error dialog box and you must return to that field and enter a value that is within the defined range.","torrent":{"xt":"urn:btih:2e095d1206219ac8a33d763587fda6f2ca6557c8","amp;dn":"Sierra+Infinity+6+Suite","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e095d1206219ac8a33d763587fda6f2ca6557c8","infoHashBuffer":{"type":"Buffer","data":[46,9,93,18,6,33,154,200,163,61,118,53,135,253,166,242,202,101,87,200]},"announce":[],"urlList":[]}}