{"title":"Welding and Joining of Magnesium Alloys {BBS}","uid":6920468,"size":23133601,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e32b89fd26aae73c68f850400d8fe55fb526494&amp;dn=Welding+and+Joining+of+Magnesium+Alloys+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1325195349,"description":"Due to the wide application of magnesium alloys in metals manufacturing, it is very important to employ a reliable method of joining these reactive metals together and to other alloys. \n\nWelding and Joining of Magnesium Alloys provides a detailed review of both established and new techniques for magnesium alloy welding and their characteristics, limitations and applications. Part one covers general issues in magnesium welding and joining, such as welding materials, metallurgy and the joining of magnesium alloys to other metals such as aluminium and steel. The corrosion and protection of magnesium alloy welds are also discussed. In part two particular welding and joining techniques are reviewed, with chapters covering such topics as inert gas welding, metal inert gas welding and laser welding, as well as soldering, mechanical joining and adhesive bonding. The application of newer techniques to magnesium alloys, such as hybrid laser-arc welding, activating flux tungsten inert gas welding and friction stir, is also discussed. \n\nWith its distinguished editor and expert team of contributors, Welding and Joining of Magnesium Alloys is a comprehensive reference for producers of primary magnesium and those using magnesium alloys in the welding, automotive and other such industries, as well as academic researchers in metallurgy and materials science.\n\n\n# Hardcover: 422 pages\n# Publisher: Woodhead Publishing (October 28, 2010)\n# Language: English\n# ISBN-10: 1845696921\n# ISBN-13: 978-1845696924","torrent":{"xt":"urn:btih:2e32b89fd26aae73c68f850400d8fe55fb526494","amp;dn":"Welding+and+Joining+of+Magnesium+Alloys+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e32b89fd26aae73c68f850400d8fe55fb526494","infoHashBuffer":{"type":"Buffer","data":[46,50,184,159,210,106,174,115,198,143,133,4,0,216,254,85,251,82,100,148]},"announce":[],"urlList":[]}}