{"title":"iZotope Iris+7 Sound Library - OSX - packet - dada","uid":8835066,"size":4017059301,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:2fb76a68eff13259248e8b6384f2ec25d849fa80&amp;dn=iZotope+Iris%2B7+Sound+Library+-+OSX+-+packet+-+dada&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"future-dada","files":1,"time":1377092920,"description":"The Iris Sound Library\nA world of sound design is at your fingertips, with hundreds of patches from world-class sound designers and 4 GB of idea-provoking audio samples, including recordings of insects, animals, machines, musical instruments, and much more.\n\nA sampling of Iris Samples\n\nGo wild: bees, dolphins, cockatoos, and seagulls...\nGo industrial: metal drones, generators, drills, and fans...\nGo acoustic: tubular bells, glass harps, violins, and strings...\nGo electric: zaps, crackles, guitars, and pianos...\nGo vocal: vocoders, chants, choirs, and wails...\nGo natural: rainfall, wind, seascapes, and fountains...\nGo textured: drones, pulses, sweeps, and FX...\nGo crazy: hedge clippers, party horns, fireworks, and dumpsters...\n\nSpecial bonus: Go vintage with recordings from classic and extremely rare synths, including the ARP 2500, the EMS VCS3, the Korg PS3100, the Yamaha CS-80, and the Logan String Melody.\n\nA peek at Iris Patches\nAmbient patches: Cryogenix, Whale Love Songs, Gifted Children, Night Spelunker ...\nBass patches: Turkey Basster, Pulsing Dub Thunder, Deep Funk Plunk, Speaker Worm ...\nExperimental patches: Chalkboard Fingers, Dusty Cartridge, The Glare Snitch Project, Power Suit ...\nKeys patches: Mad Hatter Waltz, Pharaoh's Kurse, Spoon Full of Salt, Victorian-Era Trance ...\nLead patches: Curse of the Dance, Industrial Mozart, Stadium Lazer, Keytar Fantasy ...\nPad patches: Astral Wiggle, Grimm Forest Bots, R3v3rs3, MyOptic ...\nPercussive patches: Brutal Fuzz Hit, Sippie Cup, Maple Town Sprockets, Trash Swallow ...\nRetro patches: Applesass, Snark Mow Effect, Dr. Smoooove, Siberian Squiggle ...\nVocal patches: Astro Fastro Now Say Ahhhh, Yellow Haze, Choir Needs Metronome ...\n\n\nfuture-dada.com","torrent":{"xt":"urn:btih:2fb76a68eff13259248e8b6384f2ec25d849fa80","amp;dn":"iZotope+Iris%2B7+Sound+Library+-+OSX+-+packet+-+dada","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fb76a68eff13259248e8b6384f2ec25d849fa80","infoHashBuffer":{"type":"Buffer","data":[47,183,106,104,239,241,50,89,36,142,139,99,132,242,236,37,216,73,250,128]},"announce":[],"urlList":[]}}