{"title":"Sans Sec 502 - Perimeter Protection In-Depth","uid":10207248,"size":476411033,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3015c16fa0b1a5a1e83fcfda79b0af765e0352b0&amp;dn=Sans+Sec+502+-+Perimeter+Protection+In-Depth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":null,"files":6,"time":1400861589,"description":"\n\n\nSans Sec 502 - Perimeter Protection In-Depth (2010)\n\n\n\nDescription:\n\n\n There is no single fix for securing your network. That's why this course is a comprehensive analysis of a wide breadth of technologies. In fact, this is probably the most diverse course in the SANS catalog, as mastery of multiple security techniques is required to defend your network from remote attacks. You cannot just focus on a single OS or security appliance. A proper security posture must be comprised of multiple layers. This course was developed to give you the knowledge and tools necessary at every layer to ensure your network is secure.\n\nThe course starts by looking at common problems we need to resolve. Is there traffic passing by my firewall I didn't expect? How did my system get compromised when no one can connect to it from the Internet? Is there a better solution than anti-virus for controlling malware? We'll dig into these questions and more and answer them.\n\nWe spend quite a bit of time learning about IP. Sure we all know how to assign an IP address, but to secure your network you really need to understand the idiosyncrasies of the protocol. We'll talk about how IP works and how to spot the abnormal patterns. If you can't hear yourself saying &quot;Hummm, there are no TCP options in that packet. It's probably forged,&quot; then you'll gain some real insight from this portion of the material.\n\nOnce you have an understanding of the complexities of IP, we'll get into how to control it on the wire. Rather than trying to tell you what are good and bad products, we focus on the underlying technology used by all of them. This is extremely practical information because a side-by-side product comparison is only useful for that specific moment in time. By gaining knowledge of what goes on under the cover, you will be empowered to make good product choices for years to come. Just because two firewalls are stateful inspection, do they really work the same on the wire? Is there really any difference between stateful inspection and network-based intrusion prevention, or is it just marketing? These are the types of questions we address in this portion of the course.\n\nFrom there, it's a hands-on tour through how to perform a proper wire-level assessment of a potential product, as well as what options and features are available. We'll even get into how to deploy traffic control while avoiding some of the most common mistakes. Feel like your firewall is generating too many daily entries for you to review the logs effectively? We'll address this problem not by reducing the amount of critical data, but by streamlining and automating the backend process of evaluating it.\n\nBut you can't do it all on the wire. A proper layered defense needs to include each individual host - not just the hosts exposed to access from the Internet, but hosts that have any kind of direct or indirect Internet communication capability as well. We'll start with OS lockdown techniques and move on to third-party tools that can permit you to do anything from sandbox insecure applications to full-blown application policy enforcement.\n\nMost significantly, the course material has been developed using the following guiding principles:\n\n    Learn the process, not one specific product.\n    You learn more by doing, so hands-on problem solving is key.\n    Always peel back the layers and identify the root cause.\n\nWhile technical knowledge is important, what really matters are the skills to properly leverage it. This is why the course is heavily focused on problem solving and root cause analysis. While these are usually considered soft skills, they are vital to being effective in the role of security architect. So along with the technical training, you'll receive risk management capabilities and even a bit of Zen empowerment.\n\n\nContents:\n\n1.Only PDFs\n\n\n","torrent":{"xt":"urn:btih:3015c16fa0b1a5a1e83fcfda79b0af765e0352b0","amp;dn":"Sans+Sec+502+-+Perimeter+Protection+In-Depth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3015c16fa0b1a5a1e83fcfda79b0af765e0352b0","infoHashBuffer":{"type":"Buffer","data":[48,21,193,111,160,177,165,161,232,63,207,218,121,176,175,118,94,3,82,176]},"announce":[],"urlList":[]}}