{"title":"Choose Your Own Star Wars Adventure-Trilogy","uid":11167231,"size":22197799,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3121034339bf4a885ee956dae506b1b082c40929&amp;dn=Choose+Your+Own+Star+Wars+Adventure-Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":null,"files":-1,"time":1412646252,"description":"Here is the Choose Your Own Star Wars Adventure books Trilogy, printed in 1998.  A New Hope, The Empire Strikes Back, and the Return of the Jedi.\n\nThese books were released at about the time that Choose Your Own Adventure books stopped being published for several years... Bantam recently decided to get back in publishing the CYOA books... but they're just a bunch of old re-prints with NEW NUMBERS; The Cave of Time is not #1 any more, The Abominable Snowman is.  Bites Ass, I don't need to collect the new ones for the most part; although I am glad they're now in print, again.\n\nA NEW HOPE:\n\nIs the Force with you?\n\nJoin Luke Skywalker, Princess Leia, and Han Solo to fight against the evil Galactic Empire--only this time you control the twists, turns, and outcomes of the most exciting adventure in the galaxy.\n\nWill you help lead the Rebellion to victory against the Empire?  Or side with Darth Vader and betray your friends?  The fate of the galaxy is in your hands--may the force be with you.\n\nTHE EMPIRE STRIKES BACK:\n\nWhat price would you pay to learn the ways of a Jedi Knight?\n\nThe fight against evil rages on.  You have the power to decide your future--and the fate of the galaxy.  You could go to Dagohah and learn the ways of the Force from Yoda, but Darth Vadar temps you with the power of the dark side.  Will you help your friends in the Rebellion fight the Emperor, or will you betray Luke Skywalker, Princess Leia, and all who love you to seize unimagined power for yourself?\n\nRETURN OF THE JEDI:\n\nThe fate of the galaxy is in your hands...\n\nFrom the bowels of Jabba the Hutt's palace, where Han Solo lies frozen in carbonite, to the interior of a new Death Star, where Darth Vader and the Emperor plot incredible evil, to the ancient forest of Endor, where Ewoks play, you will enter a galaxy far, far away and have the power to alter a deadly struggle between good and evil.  Will you join Luke Skywalker and fight against the evil Empire?  Or side with Darth Vader and learn the ways of the Force's dark side?\n\nThese books, featuring a special 3-D hologram, are a one-time-only Limited Collector's Edition.","torrent":{"xt":"urn:btih:3121034339bf4a885ee956dae506b1b082c40929","amp;dn":"Choose+Your+Own+Star+Wars+Adventure-Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3121034339bf4a885ee956dae506b1b082c40929","infoHashBuffer":{"type":"Buffer","data":[49,33,3,67,57,191,74,136,94,233,86,218,229,6,177,176,130,196,9,41]},"announce":[],"urlList":[]}}