{"title":"Bohemian Paris - Picasso, Modigliani, Matisse... (Art Ebook)","uid":13157100,"size":86299120,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31b4ccdc3f6cef918614e6bbc65afb57c7947115&amp;dn=Bohemian+Paris+-+Picasso%2C+Modigliani%2C+Matisse...+%28Art+Ebook%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":1,"time":1452113461,"description":"Bohemian Paris: Picasso, Modigliani, Matisse, and the Birth of Modern Art\r\nGrove Press | 2001 | ISBN: 0802116973 | English | 472 pages | PDF | 82.3 MB\r\n\r\nThe rich mixture of international cultures, ideas, personalities, and passions in early 20th-century Paris resulted in an explosive blend of creativity. Writers and artists experimented with bold new concepts, such as Cubism and Dadaism, but they also found time to pursue turbulent love affairs, frequent cafes, challenge each other to duels, and more usually on little or no money. Their stories make for good reading, and French screenwriter/novelist Franck (My Russian Love) spins lavish historical, biographical, artistic, and even scandalous details into a narrative that will captivate both serious and casual readers. He illuminates Picasso's complexities as both friend and lover, introduces us to the mannerly poet Max Jacob, and revisits Apollinaire, Jarry, Modigliani, Cocteau, Matisse, Hemingway, and Fitzgerald, among countless others all set against the marvelously depicted backdrop of bohemian Paris. Though this era has been often treated, Franck's presentation is especially good; he is able to show how all these artists interacted while allowing them to remain individuals. This marvelous and informative volume will inspire readers to become better acquainted with the works produced by these individuals. For circulating libraries and arts collections","torrent":{"xt":"urn:btih:31b4ccdc3f6cef918614e6bbc65afb57c7947115","amp;dn":"Bohemian+Paris+-+Picasso%2C+Modigliani%2C+Matisse...+%28Art+Ebook%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31b4ccdc3f6cef918614e6bbc65afb57c7947115","infoHashBuffer":{"type":"Buffer","data":[49,180,204,220,63,108,239,145,134,20,230,187,198,90,251,87,199,148,113,21]},"announce":[],"urlList":[]}}