{"title":"FS2004 - Aerosoft - Piper Super Cub v1.20","uid":3632646,"size":64289529,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:31d4d39e8a0ee41600618d5ca58e1edfa511b3f4&amp;dn=FS2004+-+Aerosoft+-+Piper+Super+Cub+v1.20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"N537JB","files":1,"time":1173103261,"description":"\t\t\t  Aerosoft - Piper Super Cub v1.20\n\t\t\t  ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nThis is the install version (Don&amp;#039;t think it has been out here before) ;-)\nAnd thanks again, Wildmans for supplying the crack :)\n\nhxxp://www.aerosoft.com/cgi-local/re/iboshop.cgi?showd,4497521320,DF01348\n\nSpecial Features\nThis aircraft has some features not seen before in FS2004:\n\n    * Actually uses oil and you HAVE to check the oil level every few hours otherwise you will be in for a very nasty surprise. Checking the oil is easy but highly realistic. Just open the engine cover and pull out the dipstick. The oil level is stored between sessions.\n    * The magnetic compass has serious problems with deviation as any compass mounted in that location would have. You have to use the deviation card to get the accurate reading.\n    * The gyro compass has to be set by the user, it is not automatically correct as it is most FS aircraft. But... remember the mangetic compass needs to be corrected with the deviation!\n    * The RPM gauge will count your hours of operation and store the values between sessions.\n    * When you click on the center of each gauge it will be zoomed to its native 512 resolution, as if you lean forwards to look at an instrument from close up.\n    * The Narco Avionics set (transeiver, transponder and VOR navigation receiver, simple but reliable and 100% accurate.\n    * The complete electrics system works as it should, from the battery switch to the circuit breakers.\n    * Highly optimized so extremely light on frame rates as is needed to fly it into the detailed bush scenery available now.\n    * Small details like the water rudder control cables are actually working. Even the cable used to release the water rudder is animated and can be clicked in VC mode.\n    * - Dual parking brake system.\n\nFeatures:\n\n    * 25 liveries (with an additional set already available);\n    * THIRTEEN main models, ski (2), wheels (2), tundra wheels (2), float (2), amphibian version;\n    * Three different pilots;\n    * Five different highly flyable flight dynamic files so all models fly different;\n    * Three detailed Virtual Cockpits, fully usable, from startup to shutdown;\n    * Fully simulated Narco avionics set, you can actually use the real manuals;\n    * All instruments can be zoomed to full 512 pixel size, even in VC;\n    * Fully immersive sound set done by professional sound studio (very &amp;#039;throaty&amp;#039;);\n    * Extensive manual;\n    * Automated update check from within FS;\n    * Moderate download size.\n\n\nHave a happy landing with this bird ;-)\nRed White n Blue","torrent":{"xt":"urn:btih:31d4d39e8a0ee41600618d5ca58e1edfa511b3f4","amp;dn":"FS2004+-+Aerosoft+-+Piper+Super+Cub+v1.20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31d4d39e8a0ee41600618d5ca58e1edfa511b3f4","infoHashBuffer":{"type":"Buffer","data":[49,212,211,158,138,14,228,22,0,97,141,92,165,142,30,223,165,17,179,244]},"announce":[],"urlList":[]}}