{"title":"The Kooks - 2006 - Inside In / Inside Out - [EAC - FLAC]","uid":5923773,"size":316254062,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:320891d7f3ae638d0f5f07903606aede99497acc&amp;dn=The+Kooks+-+2006+-+Inside+In+%2F+Inside+Out+-+%5BEAC+-+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bludStain","files":20,"time":1288526364,"description":"The Kooks - 2006 - Inside In / Inside Out - [EAC - FLAC]\n\nReview by Tim Sendra\n\nThe Kooks arrived fully formed in 2006, for their debut sounds like the work of a band well into its career: the confidence with which the foursome from Brighton play and the abandon with which Luke Pritchard sings; the witty songcraft and deft arrangements; the drama and fervor they unleash from the very first notes and carry through to the end. They display maturity but also play with the fervor of kids and project a wide-eyed charm that is very endearing. On most of Inside In/Inside Out, the band sounds like a more energetic Thrills or a looser Sam Roberts Band, maybe even a less severe Arctic Monkeys at times. Along with these modern kinships and influences, the band is heavily indebted to classic rock. Traces of Thin Lizzy's romantic lyricism pop up on tracks like &quot;Eddie's Gun,&quot; and so does a bit of post-punk spikiness on &quot;You Don't Love Me,&quot; some Dexys singalong booziness on &quot;She Moves in Her Own Way,&quot; and a hint of jam-band funk on &quot;Match Box.&quot; Quite varied influences, and in the end the band sounds like the Kooks and no one else. A nice and unique sound doesn't mean much without some songs to fill it out, and the Kooks deliver plenty of memorable tunes. &quot;Eddie's Gun,&quot; &quot;See the World,&quot; the unfortunately named &quot;Jackie Big Tits,&quot; and &quot;Ooh La&quot; are very strong and, taken together, equal the output of just about any pop/rock band around in 2006. The only song that falls flat is the over-long reggae-rocker &quot;Time Awaits.&quot; It's the only track that breaks the four-minute mark, and it shows that the Kooks' strength isn't stretching out and jamming; their chops are best suited for short, sharp blasts of invigorating pop/rock. When they stick to that, the Kooks are an exciting, very promising band, and Inside In/Inside Out is an excellent debut.\n\n01  -  Seaside \tCarred, Harris, Paul Garred, Rafferty \t1:39\n02  -  See the World \tCarred, Harris, Paul Garred, Rafferty \t2:38\n03  -  Sofa Song \tCarred, Harris, Paul Garred, Rafferty \t2:13\n04  -  Eddie's Gun \tCarred, Harris, Paul Garred, Rafferty \t2:13\n05  -  Ooh La \tCarred, Harris, Paul Garred, Rafferty \t3:28\n06  -  You Don't Love Me \tCarred, Harris, Paul Garred, Rafferty \t2:35\n07  -  She Moves in Her Own Way \tCarred, Harris, Paul Garred, Rafferty \t2:49\n08  -  Matchbox \tCarred, Harris, Paul Garred, Rafferty \t3:09\n09  -  NaÃƒÂ¯ve \tCarred, Harris, Paul Garred, Rafferty \t3:23\n10  -  I Want You \tCarred, Harris, Paul Garred, Rafferty \t3:26\n11  -  If Only \tCarred, Harris, Paul Garred, Rafferty \t2:01\n12  -  Jackie Big Tits \tCarred, Harris, Paul Garred, Rafferty \t2:32\n13  -  Time Awaits \tCarred, Harris, Paul Garred, Rafferty \t5:08\n14  -  Got No Love \tCarred, Harris, Paul Garred, Rafferty \t3:39\n","torrent":{"xt":"urn:btih:320891d7f3ae638d0f5f07903606aede99497acc","amp;dn":"The+Kooks+-+2006+-+Inside+In+%2F+Inside+Out+-+%5BEAC+-+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"320891d7f3ae638d0f5f07903606aede99497acc","infoHashBuffer":{"type":"Buffer","data":[50,8,145,215,243,174,99,141,15,95,7,144,54,6,174,222,153,73,122,204]},"announce":[],"urlList":[]}}