{"title":"Carmageddon 2 Portable","uid":7984144,"size":55560635,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:322b4e2f28c27d10096525800d25d1a1d25748c8&amp;dn=Carmageddon+2+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"The_Duck1","files":-1,"time":1357248643,"description":"No need to install,\nNo need to put serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes,\nNo boring installation of tool-bars in your browser,\nThis makes a portable version a better version.\n\nCarmageddon II was subject to criticism for the level of violence portrayed in the game. It is rated 15+ by ELSPA. In some countries, the pedestrians (and animals) are zombies, and blood is turned to green slime: In Germany, aliens replaced the pedestrians. Internet-released 'blood patches' restore the original human pedestrians. The blood pack was later released in the United Kingdom in 1999, earning the game an 18 certificate.\nIt features a heavy metal soundtrack with songs from Iron Maiden and instrumental tracks from Sentience.\nCarmageddon II was one of the few racing games at the time to feature deformable models on its cars, making for more realistic dents and crashes. In fact, the player's car can even be bent in half, leaving the player to drive with only the front wheels on the ground. The car can also be sheared in half, causing retirement from the race if the damage is not repaired before the vehicle touches the ground.\nAs with Carmageddon, there are 3 ways to finish most levels:\nComplete the race, passing every checkpoint before the time runs out\nDestroy all the opponents\nKill every zombie/pedestrian in the level\nAs the player progresses through the game, sets of levels are gradually unlocked (10 in total), each consisting of 3 standard &quot;Race, Wreck, or Wreak havoc among the zombie/pedestrian hordes/populace&quot; levels, followed by a mission. Each mission has specific tasks that must be completed before unlocking the next set.\nThe time limit in the game is generous, and the player can kill pedestrians, crash into opponents, or do tricks to gain time as well.","torrent":{"xt":"urn:btih:322b4e2f28c27d10096525800d25d1a1d25748c8","amp;dn":"Carmageddon+2+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"322b4e2f28c27d10096525800d25d1a1d25748c8","infoHashBuffer":{"type":"Buffer","data":[50,43,78,47,40,194,125,16,9,101,37,128,13,37,209,161,210,87,72,200]},"announce":[],"urlList":[]}}