{"title":"Healing Drinks: Juices, Teas, Soups, Smoothies-Mantesh","uid":6086611,"size":61922012,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:325cdf0bedaa5a131bc1de7ff5ee20ab90019675&amp;dn=Healing+Drinks%3A+Juices%2C+Teas%2C+Soups%2C+Smoothies-Mantesh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MANTESH","files":3,"time":1294356348,"description":" &lt;a href=&quot;http://img600.imageshack.us/img600/3008/41pc54j09qlss500.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img600.imageshack.us/img600/3008/41pc54j09qlss500.jpg&lt;/a&gt;\n\n\n\n\n\nHealing Drinks: Juices, Teas, Soups, Smoothies\n\n\n\nPublisher: Gaia Books Ltd \nAngela Dowden\nAnne Mcintyre\nISBN: 1856751805 \n2000 \nPDF \n160 pages \nENGLISH\n59 MB\n\nThis product provides numerous recipes for health drinks, together with research into herbs, vitamins and nutrients. Each drink is described and featured in photography and the author describes why each drink is so healthy, whether as a tonic after flu, to provide pain relief or to help lose weight.\n\nFrom juices and teas to soups and smoothies, this imaginative collection of delicious drinks from around the world has been compiled to help you look and feel great. These luscious and easy-to-prepare recipes will help lift your spirits and soothe your soul, and warm you up and cool you down, as well as recover from a wide range of illnesses and ailments. Features include:\n\n* In-depth profiles of the healing qualities and benefits of twenty-five key ingredients -- from almonds and apples to barley and beetroot, and from garlic and ginger to oats and onions\n* More than 120 recipes from sources around the world -- from China and Russia to North and South America, the Caribbean, and Europe\n* Specifics for vegetarians, vegans, and people suffering from certain food intolerances\n* Traditional wisdom married with discoveries from modern medical science\n* Gorgeous full-color illustrations and detailed step-by-step instructions\n\nBeautiful, informative, and comforting, Drink to Your Health will show you simple ways to make yourself feel a lot better.\nAbout the Author\nAnne McIntyre, Fellow of the National Institute of Medical Herbalists, is a practicing medical herbalist and the author of many books, including Herbs for Common Ailments, Simple Home Remedies for Common Ailments, The Complete Women's Herbal, and The Complete Floral Healer. She has lectured widely in herbal medicine and has been interviewed frequently for magazines, newspapers, radio, and television..........\n\n\n\n[/color][/code][/b]","torrent":{"xt":"urn:btih:325cdf0bedaa5a131bc1de7ff5ee20ab90019675","amp;dn":"Healing+Drinks%3A+Juices%2C+Teas%2C+Soups%2C+Smoothies-Mantesh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"325cdf0bedaa5a131bc1de7ff5ee20ab90019675","infoHashBuffer":{"type":"Buffer","data":[50,92,223,11,237,170,90,19,27,193,222,127,245,238,32,171,144,1,150,117]},"announce":[],"urlList":[]}}