{"title":"Levison's Textbook for Dental Nurses, 11E [PDF]~StormRG~","uid":9619909,"size":26768080,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32c6a002ea27fa260358bfa08a3a56881fd6bd72&amp;dn=Levison%27s+Textbook+for+Dental+Nurses%2C+11E+%5BPDF%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":-1,"time":1392485499,"description":"Pages: 584 \nPublisher: Wiley-Blackwell; 11 edition (August 19, 2013)\nLanguage: English\nISBN-10: 111850044X\nISBN-13: 978-1118500446\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple \nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\nIn this brand-new 11th edition of the original, best-selling book, Levison's Textbook for Dental Nurses gives you the same great comprehensive coverage of everything students preparing for their dental nurse qualification need to know, and also includes for the first time:\n\nA new look and feel, packed with illustrations and diagrams to make visual learning easy\nKey Learning Points in every chapter help you master essential information\nAn accompanying website designed to help you test your knowledge with self-assessment exercises, case-studies and downloadable images\nFully in line with the most recent developments in dental nursing practice and education, Levison's Textbook for Dental Nurses is the only dental nursing book written specifically to cater to the new NEBDN Diploma in Dental Nursing.\n\nWritten by Carole Hollins, the former Chair of the National Examining Board for Dental Nurses, the new edition of Levison's classic textbook is the only companion you need to get you through to qualification as a successful and accomplished dental nurse.","torrent":{"xt":"urn:btih:32c6a002ea27fa260358bfa08a3a56881fd6bd72","amp;dn":"Levison%27s+Textbook+for+Dental+Nurses%2C+11E+%5BPDF%5D%7EStormRG%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32c6a002ea27fa260358bfa08a3a56881fd6bd72","infoHashBuffer":{"type":"Buffer","data":[50,198,160,2,234,39,250,38,3,88,191,160,138,58,86,136,31,214,189,114]},"announce":[],"urlList":[]}}