{"title":"Pimsleur Russian Docs.tar","uid":3391718,"size":33854976,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3314fb7e35f56025580b07f5c434714fc4dd37d8&amp;dn=Pimsleur+Russian+Docs.tar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"JestaGeek","files":1,"time":1128368618,"description":"These are the reading files and other files associated with Pimsleur's Russian courses. Pimsleur programs are famous for not having much in the way of printed materials -- and not needing them much either... but Cyrillic is a bit different, so ...\n\nCaveat: This came from a huge torrent I came across and downloaded a while back \n(don't remember where), which contained a lot of Pimsleur booklets, scanned as \nimages. I haven't verified that these files are a perfect match to the posted\nPimsleur Russian recordings (it may be a different edition--the ones for Italian, \nwhich I AM studying, were NOT the same edition, but were helpful, nonetheless), \nbut perhaps something is better than nothing.\n\nThere are also some .hlp files (Windoze help format) which appear to be related \nto learning Russian grammar. I haven't looked at these either (I don't do \nWindoze).\n\nAlso included are cover art, though I attached that to each of the MP-3 files, \ntoo.\n\nHope you find these a helpful addition to either or any of the Russian lessons \nposted here.\n\nI've archived them as a .tar so you don't end up renaming or deleting files and \nscrew up the hash of the original (hopefully this will help with keeping the \nfiles seeded so it doesn't die out.) I probably won't be checking back often, so \nif the torrent DOES die out, please send me a personal message.\n\nAnd please DO seed!\n","torrent":{"xt":"urn:btih:3314fb7e35f56025580b07f5c434714fc4dd37d8","amp;dn":"Pimsleur+Russian+Docs.tar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3314fb7e35f56025580b07f5c434714fc4dd37d8","infoHashBuffer":{"type":"Buffer","data":[51,20,251,126,53,245,96,37,88,11,7,245,196,52,113,79,196,221,55,216]},"announce":[],"urlList":[]}}