{"title":"Rigging Period Ship Models - A Step-By-Step Guide to the Intrica","uid":11693014,"size":83250536,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34d9e53a5ed6d77fa7d1816823bd900c728e0d9b&amp;dn=Rigging+Period+Ship+Models+-+A+Step-By-Step+Guide+to+the+Intrica&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1423608497,"description":"Publisher: Seaforth (March 1, 2011)\nLanguage: English\nISBN-10: 1848321023\nISBN-13: 978-1848321021\n\nThe rigging of period ship models is the most complex task which any modeller has to take on, for an eighteenth-century man-of-war boasted mile on mile of rigging, more than 1,000 blocks, and acres of canvas. To reduce this in scale, and yet retain an accurate representation, is an awesome undertaking. This now classic work untangles the complex web, and, using some 400 drawings, the author shows clearly how each separate item of rigging is fitted to the masts, yards and sails. Each drawing deals with only one particular item so that it can be seen clearly in isolation. The lead of a particular halliard, the arrangement of a bracing line, these and every other detail is depicted with startling clarity. Based on the author's research of numerous eighteenth-century models, each one with its contemporary rigging still extant, the information is both meticulous and accurate. The remarkable visual immediacy and clarity of this work makes it truly unique and no modeller of period ships can afford to be without it at his side. In addition, the book is a 'must-have' practical reference work for all those involved in the rigging and repair of historic ships","torrent":{"xt":"urn:btih:34d9e53a5ed6d77fa7d1816823bd900c728e0d9b","amp;dn":"Rigging+Period+Ship+Models+-+A+Step-By-Step+Guide+to+the+Intrica","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34d9e53a5ed6d77fa7d1816823bd900c728e0d9b","infoHashBuffer":{"type":"Buffer","data":[52,217,229,58,94,214,215,127,167,209,129,104,35,189,144,12,114,142,13,155]},"announce":[],"urlList":[]}}