{"title":"The Hit by David Baldacci (US ePub Retail)","uid":8403654,"size":633051,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3624e4c96e3fe522f87d7658dc782e6ff0abffa0&amp;dn=The+Hit+by+David+Baldacci+%28US+ePub+Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TxJag","files":3,"time":1366749177,"description":"From David Baldacci--#1 bestselling author and one of the world's most popular, widely read storytellers--comes the most thrilling novel of the year.\n\nTHE HIT\n\nWill Robie is a master of killing.\n\nA highly skilled assassin, Robie is the man the U.S. government calls on to eliminate the worst of the worst-enemies of the state, monsters committed to harming untold numbers of innocent victims.\n\nNo one else can match Robie's talents as a hitman...no one, except Jessica Reel. A fellow assassin, equally professional and dangerous, Reel is every bit as lethal as Robie. And now, she's gone rogue, turning her gun sights on other members of their agency.\n\nTo stop one of their own, the government looks again to Will Robie. His mission: bring in Reel, dead or alive. Only a killer can catch another killer, they tell him.\n\nBut as Robie pursues Reel, he quickly finds that there is more to her betrayal than meets the eye. Her attacks on the agency conceal a larger threat, a threat that could send shockwaves through the U.S. government and around the world.\n\nFull Retail. Calibre and ePub Reader ready. Metadata is up to date. This is the US Version and not the UK version already available.","torrent":{"xt":"urn:btih:3624e4c96e3fe522f87d7658dc782e6ff0abffa0","amp;dn":"The+Hit+by+David+Baldacci+%28US+ePub+Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3624e4c96e3fe522f87d7658dc782e6ff0abffa0","infoHashBuffer":{"type":"Buffer","data":[54,36,228,201,110,63,229,34,248,125,118,88,220,120,46,111,240,171,255,160]},"announce":[],"urlList":[]}}