{"title":"3D Printable Poison Dart Pistol by Peter Alaric DeSimone","uid":12123319,"size":850259,"categoryP":"other","categoryS":"physibles","magnet":"?xt=urn:btih:37f4a2317e87e7c9d75f089026eb589fd7b766ae&amp;dn=3D+Printable+Poison+Dart+Pistol+by+Peter+Alaric+DeSimone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":1,"time":1436882559,"description":"inspired by President Obama's proposed ban on sharing firearm drawings on the internet, this 3D printed poison dart pistol is invisible to metal detectors and can be manufactured by anyone in the comfort of home.\n\nhere's a video of the weapon's creator demonstrating the prototype:\n\n\nlegality: the term &quot;firearm&quot; is defined in 18 U.S.C. Â§ 921(a)(3) and covers ONLY those weapons that &quot;expel a projectile by the action of an explosive&quot;.  airguns are specifically exempt from all firearms regulations under federal law.\n\nnote that actually coating darts in poison would make them dangerous to handle and could be a crime in some jurisdictions.  this is, in essence, a dart gun.  there is nothing inherently poisonous about it.  but tacking on that term definitely got headlines!  :D\n\ntwo separate designs are included in the ZIP archive.  print the Mk 1 if you want a big, scary gun.  print the Mk 2 if you want all the same functionality of the Mk 1 in a much smaller package.\n\nDISCLAIMER: these files are being shared with you free of charge out of the kindness of the author's heart.  downloading and using them signifies your agreement to take full responsibility for anything that might happen as a result of your decision to engage in the inherently hazardous activity that is weapon making.\n\nfind more fun projects at: http://www.PeterAlaric.com","torrent":{"xt":"urn:btih:37f4a2317e87e7c9d75f089026eb589fd7b766ae","amp;dn":"3D+Printable+Poison+Dart+Pistol+by+Peter+Alaric+DeSimone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37f4a2317e87e7c9d75f089026eb589fd7b766ae","infoHashBuffer":{"type":"Buffer","data":[55,244,162,49,126,135,231,201,215,95,8,144,38,235,88,159,215,183,102,174]},"announce":[],"urlList":[]}}