{"title":"The Last Federation v2.008","uid":11670279,"size":378094482,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3815b88c61aa5e67a2af263722b3e520c36cc65d&amp;dn=The+Last+Federation+v2.008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Lamasu","files":-1,"time":1418112223,"description":"From the creators of AI War: Fleet Command comes an all-new grand strategy title with turn-based tactical combat, set in a deep simulation of an entire solar system and its billions of inhabitants. You are the last of a murdered race, determined to unify or destroy the 8 others.\n\nKey features:\n- Turn-based tactical combat, with up to 5 factions competing at once.\n- Extremely deep simulation of an entire solar system and its billions of inhabitants. Even just watching everything unfold in Observer mode is entertaining, as nations rise and fall.\n- New-player-friendly ramp-up of complexity as you play, which you can disable if you're already a veteran.\n- Eight races each have very distinct personalities and attributes. Each one even has its own completely unique political system.\n- Difficulty levels split between the grand strategy and turn-based combat portions of the game, both ranging from quite casual to incredibly hardcore.\n- Save and reload your game with ease any time, or tough it out in ironman mode.\n- Composer Pablo Vega's best soundtrack to date, featuring 54 minutes of music and the vocal finale &quot;Lay Down Your Arms.&quot; \n\nv2.008 (2014-12-02) changelog:\n- Added new settings toggle: NPC Attack Notifications During Dispatch.\n-- Normally while you're on dispatch the game will display notifications of another race attacking a player-held planet/outpost. If this toggle is on, similar notifications will also be displayed for attacks against a non-player planet/outpost.\n-- Thanks to nas1m for inspiring this change. \n- Fixed a bug where the recently added prediction/result text for duel-prime-warlord about the burlusts now being willing to consider joining the federation was not prevented on invasion or betrayal mode.\n-- Thanks to Eternaly_Lost for reporting. \n- The &quot;Federation&quot; political-deal-category button on the politics window is now hidden in Betrayal and Invasion mode.\n-- Thanks to chemical_art for inspiring this change. \n- Sell Raw Resources is no longer prevented in Betrayal mode, but instead yields 200x less credits than normal.\n-- Thanks to Fleet Unity and Eternaly_Lost for inspiring this change. \n- Fixed a longstanding bug where a race having an ongoing event on any of its planets would often effectively force its &quot;race status&quot; to be normal even if other factors would have made it Internal-War, Crowded, Warlike, Truce, etc.\n-- Thanks to Backgroundc for the report and save leading to this discovery. \n- The construction of personnel (troop) transports has been moved from happening every month to happening every sim-frame (just in much smaller chunks, obviously), to avoid situations where it seemed there should be a ground invasion but none was happening because the parent race had no transports to send the troops with.\n-- Thanks to Eternaly_Lost for inspiring this change. \n- New games started in Betrayal or Invasion mode will not consider the Andor Federationists as eligible for the randomly picked andor parties.\n-- This won't impact old saves that already picked the Federationists.\n-- Thanks to nas1m for inspiring this change. \n- The quest that's an alternate way of bringing spacefaring tech to a race now counts towards the Prometheus achievement (give spacefaring to 7 races).\n-- This should impact old saves just fine, but we didn't have one on hand for testing at the time.\n-- Thanks to giftgruen for inspiring this change. \n\nFor the full changelog, view changelog.txt.\n\nIf you like the game, support the developer, buy it! &lt;a href=&quot;\nhttp://arcengames.com/the-last-federation/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://arcengames.com/the-last-federation/&lt;/a&gt; &lt;a href=&quot;\nhttp://store.steampowered.com/app/273070/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/273070/&lt;/a&gt;","torrent":{"xt":"urn:btih:3815b88c61aa5e67a2af263722b3e520c36cc65d","amp;dn":"The+Last+Federation+v2.008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3815b88c61aa5e67a2af263722b3e520c36cc65d","infoHashBuffer":{"type":"Buffer","data":[56,21,184,140,97,170,94,103,162,175,38,55,34,179,229,32,195,108,198,93]},"announce":[],"urlList":[]}}