{"title":"Bus.Simulator.16.Update.v0.0.768.7023-BAT","uid":13819664,"size":259447651,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3839319bce2d6f53d95a413a1ae6e79af47bce74&amp;dn=Bus.Simulator.16.Update.v0.0.768.7023-BAT&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"TheRival","files":1,"time":1457655503,"description":"Required releases:\r\n        Bus.Simulator.16-HI2U\r\n        Bus.Simulator.16.Update.v0.0.754.6956-BAT\r\n        \r\n        1. Unpack release.\r\n        2. Install the Update to where you installed the game.\r\n           Allow applypatch.exe to run after.\r\n        3. Copy the cracked content from /Crack dir \r\n        4. Enjoy! \r\n        \r\n        Required releases:\r\n        Bus.Simulator.16-HI2U\r\n        Bus.Simulator.16.Update.v0.0.754.6956-BAT\r\n\r\nPatch notes:\r\nPerformance optimizations: \r\nImproved runtime performance / FPS \r\n(Effects may vary depending on the users system components) \r\nNew graphics settings which enable users to perform additional performance optimizations: \r\nController for the adjustment of the number of AI pedestrians on the sidewalks (This setting doesn't affect the number of passengers) \r\nController for the adjustment of the number of AI vehicles on the streets \r\nOption to turn off all decorative objects within the city (such as trash cans, benches, etc.)\r\n\r\nBug fixes: \r\nIndicators and taillights of NPC cars can now also be seen in cockpit and first person view (previously only visible in 3rd person perspective) \r\nMinor clipping errors in and on buses resolved \r\nSpeedometer now displays the correct speed \r\nTurn signal levers are now located on the correct side in all buses\r\n\r\nNew features: \r\nVSync graphics option implemented\r\n\r\nImprovements: \r\nAI cars are generally driving a bit faster and braking less abrupt now. \r\nIn the bus shop you can now see all the buses included in the game, even those who aren't available yet. Currently still locked buses are grayed out in the shop. \r\nTexture Modding: Imported textures now behave the same as the original ones (e.g. the anisotropic filtering of road textures is now also enabled for modded textures) \r\nFun mission Bus Race: Timeout increased (15 min.  \r\n        \r\n        Game:\r\n        ~~~~~\r\n        Win the daily battle with the clock - become a bus driver! \r\n\r\n        Six true-to-life city buses, including two Lion's City buses \r\n        licensed by MAN, and a gigantic freely accessible world are \r\n        waiting for you in Bus Simulator 16. Transport your \r\n        passengers to their destinations across five authentic city \r\n        districts safely and on time. Drive a two-door, three-door, \r\n        or a true-to-life articulated bus through commuter traffic \r\n        at rush hour, watch out for emergency vehicles, and take \r\n        detours around construction sites. But watch out, or you \r\n        will get into trouble for accidents and traffic violations! \r\n\r\n        You also have to maintain order inside the bus. Calm upset \r\n        passengers, repair stuck doors, sell tickets correctly, and \r\n        extend the ramp for wheel chair passengers in a timely \r\n        manner. You will have to be efficient if you want to stick \r\n        to your schedule, as it is only by doing this that you will \r\n        build up your reputation in the city, earn the trust of your \r\n        passengers, and most importantly, make money! The better \r\n        your reputation, the larger the contracts you can secure, \r\n        and the more buses will be available to your company in the \r\n        shop. Unlock additional districts of the city and carefully \r\n        plan routes for the employees you will acquire in the \r\n        included job exchange. \r\n\r\n        As you grow more successful, you will also acquire more and \r\n        more advertising banners for your buses, which bring in \r\n        additional money. If your buses are too dull, you can paint \r\n        and decorate them with unlockable decals, ensuring that your \r\n        passengers reach their destinations in the coolest way \r\n        possible. \r\n\r\n        You think bus drivers are lonely? Not in Bus Simulator 16! \r\n        Invite your friends into your game in multiplayer mode and \r\n        let them take over routes for you. The money they earn can \r\n        be used to expand your shared company and thus perfect \r\n        public transportation in your city. \r\n\r\n        You want to drive even more buses and arrange Sunny Springs \r\n        to fit your expectations? Then you can just construct the \r\n        city to suit your own taste. Bus Simulator 16 is \r\n        mod-friendly, and you can use programs like Blender and Gimp \r\n        to adjust the visual appearance of the existing buses to \r\n        your liking, as well as integrate your own custom buses and \r\n        buildings into the game","torrent":{"xt":"urn:btih:3839319bce2d6f53d95a413a1ae6e79af47bce74","amp;dn":"Bus.Simulator.16.Update.v0.0.768.7023-BAT","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3839319bce2d6f53d95a413a1ae6e79af47bce74","infoHashBuffer":{"type":"Buffer","data":[56,57,49,155,206,45,111,83,217,90,65,58,26,230,231,154,244,123,206,116]},"announce":[],"urlList":[]}}