{"title":"The New World Order and the Eugenics Wars - Andrew John Hoffman","uid":11715082,"size":258756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38768b4ad75560723e50959c4043a9de385f99cd&amp;dn=The+New+World+Order+and+the+Eugenics+Wars+-+Andrew+John+Hoffman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1424531172,"description":"\n If you have ever had the feeling that you're not getting the truth about the world on television, this book is for you. Hoffman delves into the key issues that the eugenicists, technocrats, and politicians would rather you didn't know about. Whether it is false flag terrorism, deceptive political paradigms, or the poisons that taint our air, water, and food, Hoffman addresses the issues with precise prose and solid documentation. This book challenges the often cozy relationship between Christianity and political power structures. Whether you are a veteran truth-seeker or ready to awake TV watcher, there is much in this book that will be of interest to you. Hoffman covers the financial and physical aspects of the power structures that pull the strings of those paraded in front of us as leaders by the media. Additionally, Hoffman explores the spiritual aspects of secret societies and the larger one-world government agenda. As readers of this book have testified, reality is far more interesting than the false reality portrayed in the mass media or the fake conspiracies exploited by establishment friendly authors like Dan Brown. While you won't hear about The New World Order and the Eugenics Wars on television, it has been reviewed and recommended by Dr. Future and Tom Bionic of Future Quake as well as the highly respected host of Radio Liberty, Dr. Stan Monteith.\n\nAbout the author:\n&quot;I am an independent writer and researcher who enjoys learning about a wide variety of subjects from both mainstream and &quot;conspiracy&quot; perspectives. My first book covers a wide variety of topics from the perspective of someone who takes the Bible seriously and believes there's more to the story than what's on the evening news. I am currently researching the topic of propaganda for what will eventually be my second book.\n\nMy formal academic achievements include graduating summa cum-laude with B.A. in English Literature and a minor in Philosophy at Grand Canyon University. I also received an M.Ed. in Secondary Education from Grand Canyon University. My informal education has included reading on a wide variety of topics, including String Theory, Theology, Austrian Economics, Public Relations, and many others. I also enjoy listening to podcasts while driving and hiking, with my favorites including Future Quake, The Alex Jones Show, The Corbett Report, PID Radio,and Media Monarchy. &quot;","torrent":{"xt":"urn:btih:38768b4ad75560723e50959c4043a9de385f99cd","amp;dn":"The+New+World+Order+and+the+Eugenics+Wars+-+Andrew+John+Hoffman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38768b4ad75560723e50959c4043a9de385f99cd","infoHashBuffer":{"type":"Buffer","data":[56,118,139,74,215,85,96,114,62,80,149,156,64,67,169,222,56,95,153,205]},"announce":[],"urlList":[]}}