{"title":"Primer DVDRip Spanish 2004","uid":5124281,"size":733647632,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:388d03d78a1e7f77fa539c64cfb596b1246eed05&amp;dn=Primer+DVDRip+Spanish+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mois20","files":2,"time":1255531104,"description":"Cuatro hombres trabajan en un garaje construyendo aparatos altamente complejos. Parte por accidente y parte por diseÃƒÂ±o, descubren un mecanismo con poderes que les permite conseguir prÃƒÂ¡cticamente todo lo que quieran... una revelaciÃƒÂ³n que podrÃƒÂ­a literalmente cambiar el mundo y que pondrÃƒÂ¡ a prueba la relaciÃƒÂ³n y confianza entre sus inventores. Compleja pelÃƒÂ­cula de &quot;puro&quot; cine independiente (su presupuesto fue de 7.000 dÃƒÂ³lares y con Carruth haciendo labores de director, guionista, productor intÃƒÂ©rprete, montador y compositor de la banda sonora y de la fotografÃƒÂ­a) cuya narraciÃƒÂ³n resulta difÃƒÂ­cil de seguir (y que puede recordar a las maquinaciones de &quot;Pi&quot;), tensamente dramÃƒÂ¡tica y con continuos diÃƒÂ¡logos que, intermitentemente, incluso se hacen incomprensibles. Con una persuasiva estÃƒÂ©tica visual, &quot;Primer&quot; fuerza al espectador a reconstruir el puzzle de la historia al mismo tiempo que lo hacen los personajes, creando una pelÃƒÂ­cula que demanda posteriores visiones. Calificado por unos de &quot;original, inteligente, complejo&quot;. Por otros de &quot;confuso, desesperante e irritante&quot;. En definitiva: un film que provoca total divisiÃƒÂ³n de opiniones (lo mÃƒÂ¡s probable es que te encante o lo detestes). En cualquier caso, una experiencia diferente.","torrent":{"xt":"urn:btih:388d03d78a1e7f77fa539c64cfb596b1246eed05","amp;dn":"Primer+DVDRip+Spanish+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"388d03d78a1e7f77fa539c64cfb596b1246eed05","infoHashBuffer":{"type":"Buffer","data":[56,141,3,215,138,30,127,119,250,83,156,100,207,181,150,177,36,110,237,5]},"announce":[],"urlList":[]}}