{"title":"Paolo Bacigalupi","uid":11491316,"size":494845105,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:38eae3f22dd72183646a4cbbed41d0db0c330061&amp;dn=Paolo+Bacigalupi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cybotage","files":2,"time":1416262894,"description":"2008 - Pump Six and Other Stories\nPaolo Bacigalupi's debut collection demonstrates the power and reach of the science fiction short story. Social criticism, political parable, and environmental advocacy lie at the center of Paolo's work. Each of the stories herein is at once a warning, and a celebration of the tragic comedy of the human experience.\nThe eleven stories in Pump Six represent the best Paolo's work, including the Hugo nominee &quot;Yellow Card Man,&quot; the nebula and Hugo nominated story &quot;The People of Sand and Slag,&quot; and the Sturgeon Award-winning story &quot;The Calorie Man.&quot;\n\n=====\n\n\n2009 - The Windup Girl\nAnderson Lake is a company man, AgriGen's Calorie Man in Thailand. Under cover as a factory manager, Anderson combs Bangkok's street markets in search of foodstuffs thought to be extinct, hoping to reap the bounty of history's lost calories. There, he encounters Emiko...\n\nEmiko is the Windup Girl, a strange and beautiful creature. One of the New People, Emiko is not human; instead, she is an engineered being, creche-grown and programmed to satisfy the decadent whims of a Kyoto businessman, but now abandoned to the streets of Bangkok. Regarded as soulless beings by some, devils by others, New People are slaves, soldiers, and toys of the rich in a chilling near future in which calorie companies rule the world, the oil age has passed, and the side effects of bio-engineered plagues run rampant across the globe.\n\nWhat Happens when calories become currency? What happens when bio-terrorism becomes a tool for corporate profits, when said bio-terrorism's genetic drift forces mankind to the cusp of post-human evolution? Award-winning author Paolo Bacigalupi delivers one of the most highly acclaimed science fiction novels of the twenty-first century","torrent":{"xt":"urn:btih:38eae3f22dd72183646a4cbbed41d0db0c330061","amp;dn":"Paolo+Bacigalupi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38eae3f22dd72183646a4cbbed41d0db0c330061","infoHashBuffer":{"type":"Buffer","data":[56,234,227,242,45,215,33,131,100,106,76,187,237,65,208,219,12,51,0,97]},"announce":[],"urlList":[]}}