{"title":"Tengiz Abuladze - Vedreba AKA The plea (1967)","uid":3634437,"size":789912139,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:396fb294699a989dca8256eb8143b8be9a970ab4&amp;dn=Tengiz+Abuladze+-+Vedreba+AKA+The+plea+%281967%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"kegir","files":3,"time":1173311197,"description":"Georgian Title:  Vedreba\nEnglish Title: The Plea \nDirector:  Tengiz Abuladze\nYear: 1967\nLanguage: Georgian\nSubtitles: English, Russian (softsubs)\nSource: DVD \nThere&amp;#039;re two audio tracks on this rip. The first one is the Russian dubbed one; the second track is in the original language.\n\nMini biography\n\nTengiz Abuladze&amp;#039; studied theatrical direction af the Chota Rustaveli Theatre Institute in Tbilisi, Georgia, and film- making at the VGIK Cinematography Institute, graduating in 1953, when he joined Georgia Film Studios as a director. He made documentaries before making his feature debut in 1958. His best-known work in the West is the trilogy The Plea (1967), ,Natvris khe (1977) and Monanieba (1984), the latter being one of the first films to be released in the post-glasnost era, and one of the most controversial, thanks to its allegorical portrait of a small town under Stalinist terror (Stalin, like Abuladze, hailing originally from Georgia). It was a huge success in the Soviet Union, and achieved reasonable distribution abroad, almost unheard of for a Georgian film.\n\nA voice from IMDB\n\nA masterpiece that demands detailed study., 24 August 2006\n\nIt&amp;#039;s like Bergman and Kurosawa went to Georgia and decided to do Shakespeare together in the mountains. I&amp;#039;ve seen this film several times and there&amp;#039;s much I still haven&amp;#039;t grasped. It&amp;#039;s not an intellectual problem, but a cultural one...VEDREBA seems so deeply embedded in Georgian history that it&amp;#039;s nearly impossible for an outsider to find a way in.\n\nThe film is based entirely on the poetry of Vazha Pshavela, and I believe every line of &quot;dialogue&quot; is lifted directly from his poems. From what I can gather, the &quot;story&quot; concerns a soldier who, after feeling guilty about killing an enemy, becomes an outcast from whatever group he belongs to, then has visitations from both God and the devil who give him visions of the future (or perhaps one possible future). A full understanding of the film would seem to require knowledge of all the different groups of people living in the mountains of ancient Georgia, as well as a basic grasp of several various rituals. For instance, I have no idea what the significance of the main character beheading another man&amp;#039;s bull was, nor do I understand why, when said bull-owner calls for the lead to be killed, several other people began extinguishing candles in bowls of sheep&amp;#039;s blood.\n\nBut despite my perpetual lack of complete understanding, the opinion I&amp;#039;m leaning towards is that this is a long-overlooked masterpiece. The performances simply erupt with power, and the poetry, even from what I&amp;#039;m sure is a far-less-than-ideal translation, is amazing. (And if you ever get a hold of it, I recommend turning the subtitles off for at least one viewing -- the sound and rhythm of the words are absolutely mesmerizing, even if you have no idea what they mean.) And Abuladze&amp;#039;s work is so strange -- every shot is terribly interesting, especially when he plays around with focus.\n\nYes, this is indeed a great and powerful film. It continues to perplex me, but after watching it I feel as if I&amp;#039;ve read an epic poem, and I want to study it as such. I think it absolutely deserves that sort of continued attention.\n\nThe film&amp;#039;s title has several translations in English: THE PLEA, THE PRAYER, THE ENTREATY, THE SUPPLICATION...I even read one article where it was referred to as THE ENCOUNTER. I am not sure what the Russian title, MOLBA, really means, but a Georgian friend informs me that the Georgian title, VEDREBA, implies a specific type of prayer in which something is begged of God. &quot;Deep spiritual begging&quot; was the simplest way she described it. In this case, the warrior (and the poet -- they are one and the same in this film) is asking God to give him a sense of purpose again, some sign that there is good in the world worth fighting for. This is at least the message I have gleaned from the film. \n\nFile Name .............: Vedreba (The Plea) (Tengiz Abuladze, 1977).avi\nFile Size (in bytes) ..: 789,815,296 bytes\nRuntime (# of frames) .: 1:12:20 (4189232 frames)\n\nVideo Codec ...........: DivX 5.2.1 (DrDivX106)\nFrame Size ............: 640x352[=1.818]\nFPS ...................: 25.000\nVideo Bitrate .........: 1264 kb/s\nBits per Pixel ........: 0.224 bpp\nB-VOP, N-VOP, QPel, GMC ......: []...[]...[]...[]\n\nAudio Codec ...........: 0x0055 MPEG-1 Layer 3\nSample Rate ...........: 48000 Hz\nAudio bitrate .........: 108 kb/s [2 channel(s)] VBR audio\nInterleave ............: 40 ms\nNo. of audio streams ..: 2\n\nThanks to Igorert for up at KG\n\nNOT MY RIP\n\n********************************* FREAKYFLICKS **********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art\nto the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional\nrole in the history of cinema and its progression in becoming a great art. Films\nthat are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate\nin our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\t\t &lt;a href=&quot;\thttp://www.freakyflicks.tk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.freakyflicks.tk&lt;/a&gt;\n\n\t\t &lt;a href=&quot;\thttp://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://freakyflicks.proboards54.com/&lt;/a&gt;\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;\n","torrent":{"xt":"urn:btih:396fb294699a989dca8256eb8143b8be9a970ab4","amp;dn":"Tengiz+Abuladze+-+Vedreba+AKA+The+plea+%281967%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"396fb294699a989dca8256eb8143b8be9a970ab4","infoHashBuffer":{"type":"Buffer","data":[57,111,178,148,105,154,152,157,202,130,86,235,129,67,184,190,154,151,10,180]},"announce":[],"urlList":[]}}