{"title":"Processing: A Programming Handbook for Visual Designers and Arti","uid":4528840,"size":16709515,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3989303d3f3e027d0b86d47db3176f44da8af4f2&amp;dn=Processing%3A+A+Programming+Handbook+for+Visual+Designers+and+Arti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Crandom","files":-1,"time":1227470753,"description":"More information:  &lt;a href=&quot;\nhttp://processing.org/learning/books&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://processing.org/learning/books&lt;/a&gt;\nhttp://www.amazon.com/Processing-Programming-Handbook-Designers-Artists/dp/0262182629\nhttp://isbn.nu/9780262182621\nhttp://www.booksense.com/product/info.jsp?isbn=0262182629 (US Only)\n\nThis is the only torrent not killed by the death of ebookvortex.com.\nFull book and not demo. Highly Recommended.\n\n\n&quot;Casey Reas and Ben Fry (Foreword by John Maeda).\nPublished 24 August 2007, MIT Press. 736 pages. Hardcover. ISBN: 9780262182621\n\nThis book is an introduction to the ideas of computer programming within the context of the visual arts. It targets an audience of computer-savvy individuals who are interested in creating interactive and visual work through writing software but have little or no prior experience. It is the result of six years of software development and teaching experience. The ideas presented have been continually tested in the classrooms, computer labs, and basements of universities, art and design schools, and arts institutions.\n\nThe majority of the book is divided into tutorial units discussing specific elements of software and how they relate to the arts. These units introduce the syntax and concepts of software such as variables, functions, and object-oriented programming. They cover topics such as photography and drawing in relation to software. These units feature many short, prototypical example programs with related images and explanation. More advanced professional projects from diverse domains including animation, performance, and typography are discussed in interviews with their creators. The extension sections present concise introductions to further domains of exploration including computer vision, sound, and electronics.\n\nEssays by Alexander R. Galloway, Golan Levin, R. Luke DuBois, Simon Greenwold, Francis Li, and Hernando Barragan\n\nInterviews with Jared Tarbell, Martin Wattenberg, James Paterson, Erik van Blockland, Ed Burton, Josh On, Jeurg Lehni, Auriea Harvey and Michael Samyn, Mathew Cullen and Grady Hall, Bob Sabiston, Jennifer Steinkamp, Ruth Jarman and Joseph Gerhardt, Sue Costabile, Chris Csikszentmihalyi, Golan Levin and Zachary Lieberman, and Mark Hansen.&quot;\n\nPLEASE SEED.","torrent":{"xt":"urn:btih:3989303d3f3e027d0b86d47db3176f44da8af4f2","amp;dn":"Processing%3A+A+Programming+Handbook+for+Visual+Designers+and+Arti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3989303d3f3e027d0b86d47db3176f44da8af4f2","infoHashBuffer":{"type":"Buffer","data":[57,137,48,61,63,62,2,125,11,134,212,125,179,23,111,68,218,138,244,242]},"announce":[],"urlList":[]}}