{"title":"(1975) Bioenergetics by Alexander Lowen, M.D.pdf","uid":9394386,"size":64774576,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:39f91a36783763ce4ecd42c97e87eb4d1a27efcd&amp;dn=%281975%29+Bioenergetics+by+Alexander+Lowen%2C+M.D.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":-1,"time":1387952544,"description":"Bioenergetics is the revolutionary new therapy that uses the language of the body to heal the problems of the mind. This exciting body-mind approach to personality has a liberating and positive effect on emotional, physical, and psychic distress. Dr. Alexander Lowen, founder and prime mover of this fast-growing therapy, writes that increased joy and pleasure are possible in every day life through an understanding of how your body functions energetically: how it determines what you feel, think, and do. Dr. Lowen points out that lack of energy is the result of chronic muscular tensions, a condition caused by the suppression of feelings. These tensions can be dissolved through the direct body work in bioenergetic exercise, which restores the potential for living a rich, full life. Dr. Lowen analyzes common physical ailments like headaches and lower back pain and shows how they too can be overcome by releasing the muscular tenstion that create them. Generously illustrated with line drawings of bioenergetic exercises, this book is sure to bring freedom, confidence, and pleasure to thousands of men and women.\n\nPDF format\n350 pages\n61.7 megabytes","torrent":{"xt":"urn:btih:39f91a36783763ce4ecd42c97e87eb4d1a27efcd","amp;dn":"%281975%29+Bioenergetics+by+Alexander+Lowen%2C+M.D.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39f91a36783763ce4ecd42c97e87eb4d1a27efcd","infoHashBuffer":{"type":"Buffer","data":[57,249,26,54,120,55,99,206,78,205,66,201,126,135,235,77,26,39,239,205]},"announce":[],"urlList":[]}}