{"title":"Percy Jackson GN Collection (2010-2013|Digital|BlurPixel-Empire)","uid":10202381,"size":274223523,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3a03b4d4bd85c583cb45ec08d3d08b1e2ffd50ac&amp;dn=Percy+Jackson+GN+Collection+%282010-2013%7CDigital%7CBlurPixel-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1400794336,"description":"This the a collection of three graphic novels adapted from the successful Rick Riordan book series about Percy Jackson and his adventures with the demigods. These are the first three books in comic form - The Lightning Thief, The Sea Of Monsters and The Titan's Curse.\n\nPromotional info for The Lightning Thief: &quot;You've read the book. You've seen the movie. Now submerge yourself in the thrilling, stunning, and action-packed graphic novel.\n\nMythological monsters and the gods of Mount Olympus seem to be walking out of the pages of twelve-year-old Percy Jackson's textbooks and into his life. And worse, he's angered a few of them. Zeus's master lightning bolt has been stolen, and Percy is the prime suspect. Now, he and his friends have just ten days to find and return Zeus's stolen property and bring peace to a warring Mount Olympus. \n\nSeries creator Rick Riordan joins forces with some of the biggest names in the comic book industry to tell the story of a boy who must unravel a treachery more powerful than the gods themselves.&quot;\n\nPromotional info for The Sea Of Monsters: &quot;Seventh grade has been surprisingly quiet for Percy Jackson. Not a single monster has set foot on his New York prep-school campus. But when an innocent game of dodgeball among Percy and his classmates turns into a death match against an ugly gang of cannibal giants, things get...well, ugly. And the unexpected arrival of his friend Annabeth brings more bad news: the magical borders that protect Camp Half-Blood have been poisoned by a mysterious enemy, and unless a cure is found, the only safe haven for demigods will be destroyed. \n\nIn the follow-up to the wildly popular The Lightning Thief, The Graphic Novel, Percy and his friends must journey into the Sea of Monsters to save their camp. But first, Percy will discover a stunning new secret about his family--one that makes him question whether being claimed as Poseidon's son is an honor or simply a cruel joke. \n\nFeaturing a faithful adaptation by Robert Venditti, stunning artwork by Attila Futaki, and sumptuous colors by newcomer Tamas Gaspar, Rick Riordan's blockbuster book comes to life in The Sea of Monsters, The Graphic Novel. &quot;\n\nPromotional info for The Titan's Curse: &quot;A new prophecy leads to a dangerous quest.\n\nWhen Percy receives an urgent distress call from Grover, he immediately prepares for battle. He knows he'll need his powerful demigod allies, Annabeth and Thalia, at his side; his trusty bronze sword, Riptide; and a ride from his mom. \n\nThe demigods race to the rescue, only to find that Grover has made an important discovery: two new powerful half-bloods, whose parentage is unknown. But that's not all that awaits them. The Titan lord, Kronos, has set up his most devious trap yet, and the young heroes have just fallen prey. \n\nNow, Percy and his friends are faced with their most dangerous challenge-the chilling prophecy of the Titan's Curse. They must rescue the goddess Artemis by the Winter Solstice, or all will be lost including Annabeth. \n\nRick Riordan's internationally best-selling The Titan's Curse becomes a graphic novel in the hands of comic-book luminaries Robert Venditti, Attila Futaki, and Gregory Guilhaumond.&quot;\n\nThanks to BlurPixel-Empire for these awesome digital copies; please seed and enjoy! :-)\n\nPlease visit and support my Suprbay release thread here, I would appreciate it: &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;","torrent":{"xt":"urn:btih:3a03b4d4bd85c583cb45ec08d3d08b1e2ffd50ac","amp;dn":"Percy+Jackson+GN+Collection+%282010-2013%7CDigital%7CBlurPixel-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a03b4d4bd85c583cb45ec08d3d08b1e2ffd50ac","infoHashBuffer":{"type":"Buffer","data":[58,3,180,212,189,133,197,131,203,69,236,8,211,208,139,30,47,253,80,172]},"announce":[],"urlList":[]}}