{"title":"ACS Infectious Diseases (2015-2016)","uid":15431142,"size":330134594,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a4bf0b7fab490b418fb1b95227573e1d4d475e1&amp;dn=ACS+Infectious+Diseases+%282015-2016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":136,"time":1469723393,"description":"ISSN: 2373-8227\r\n\r\nACS Infectious Diseases will be the first journal to highlight chemistry and its role in this multidisciplinary and collaborative research area. The journal will cover a diverse array of topics including, but not limited to:\r\n\r\nDiscovery and development of new antimicrobial agents — identified through target- or phenotypic-based approaches as well as compounds that induce synergy with antimicrobials.\r\nCharacterization and validation of drug target or pathways — use of single target and genome-wide knockdown and knockouts, biochemical studies, structural biology, new technologies to facilitate characterization and prioritization of potential drug targets.\r\nMechanism of drug resistance — fundamental research that advances our understanding of resistance; strategies to prevent resistance.\r\nMechanisms of action — use of genetic, metabolomic, and activity- and affinity-based protein profiling to elucidate the mechanism of action of clinical and experimental antimicrobial agents.\r\nHost-pathogen interactions — tools for studying host-pathogen interactions, cellular biochemistry of hosts and pathogens, and molecular interactions of pathogens with host microbiota.\r\nSmall molecule vaccine adjuvants for infectious disease.\r\nViral and bacterial biochemistry and molecular biology","torrent":{"xt":"urn:btih:3a4bf0b7fab490b418fb1b95227573e1d4d475e1","amp;dn":"ACS+Infectious+Diseases+%282015-2016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a4bf0b7fab490b418fb1b95227573e1d4d475e1","infoHashBuffer":{"type":"Buffer","data":[58,75,240,183,250,180,144,180,24,251,27,149,34,117,115,225,212,212,117,225]},"announce":[],"urlList":[]}}