{"title":"The Andy Cohen Diaries: A Deep Look at a Shallow Year Audiobook ","uid":11691013,"size":392693152,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3a9dff71287c90c0b6b76f77f481d9bbc856e611&amp;dn=The+Andy+Cohen+Diaries%3A+A+Deep+Look+at+a+Shallow+Year+Audiobook+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Squiddy82","files":15,"time":1423530663,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Andy Cohen Diaries: A Deep Look at a Shallow Year\n\nWritten by: Andy Cohen\nNarrated by: Andy Cohen\nLength: 13 hrs and 35 mins\nUnabridged Audiobook\nRelease Date:11-11-14\n\nA year in the whirlwind life of the beloved pop icon Andy Cohen, in his own cheeky, candid, and irreverent words.\nAs a TV producer and host of the smash late-night show Watch What Happens Live, Andy Cohen has a front row seat to an exciting world not many get to see. In this dishy, detailed diary of one year in his life, Andy goes out on the town, drops names, hosts a ton of shows, becomes codependent with Real Housewives, makes trouble, calls his mom, drops some more names, and, while searching for love, finds it with a dog.\nWe learn everything from which celebrity peed in her WWHL dressing room to which Housewives are causing trouble and how. Nothing is off limits - including dating. We see Andy at home and with close friends and family (including his beloved and unforgettable mom). Throughout, Andy tells us not only what goes down, but exactly what he thinks about it.\nInspired by the diaries of another celebrity-obsessed Andy (Warhol), this honest, irreverent, and laugh-out-loud funny book is a one-of-a-kind account of the whos and whats of pop culture in the 21st century","torrent":{"xt":"urn:btih:3a9dff71287c90c0b6b76f77f481d9bbc856e611","amp;dn":"The+Andy+Cohen+Diaries%3A+A+Deep+Look+at+a+Shallow+Year+Audiobook+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a9dff71287c90c0b6b76f77f481d9bbc856e611","infoHashBuffer":{"type":"Buffer","data":[58,157,255,113,40,124,144,192,182,183,111,119,244,129,217,187,200,86,230,17]},"announce":[],"urlList":[]}}