{"title":"AGI - Building The AK Semi-Auto Rifle","uid":4827346,"size":658452350,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3b1acfe7a0540eb38d19f36f2ee6ec5dde3ccbc1&amp;dn=AGI+-+Building+The+AK+Semi-Auto+Rifle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"aikijohn","files":-1,"time":1238998230,"description":"Build a Semi-Auto AK from a parts kit! As I write this, our studio is littered with AK receivers, flats, tooling and parts kits. From internet research (most of the information was absolutely, totally, wrong!), experimenting with various construction techniques, to creating tooling and documenting everything with drawings, we took the long way around in order to find the BEST and EASIEST method for building a Semu-Auto AK from a parts kit. You'll be lost without this video! You won't believe how many different ways there are to skin this cat! It seemed as though the variations of how you could build an AK from a kit were ENDLESS. Several gunsmiths and engineers from AGI poured over this process and tried various methods for forming and assembling receivers before we realized that in order to elimate confusion and lower risk of failure, we needed to come up with ONE standardized procedure that would work for experienced perfectionist as well as the first-time, novice builder. BONUS! 29 TOOL BLUEPRINTS: Bending fixture for flats, Flat blueprints with holes and measurements, Barrel removal and installation tools, and Riveting tools. ","torrent":{"xt":"urn:btih:3b1acfe7a0540eb38d19f36f2ee6ec5dde3ccbc1","amp;dn":"AGI+-+Building+The+AK+Semi-Auto+Rifle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b1acfe7a0540eb38d19f36f2ee6ec5dde3ccbc1","infoHashBuffer":{"type":"Buffer","data":[59,26,207,231,160,84,14,179,141,25,243,111,46,230,236,93,222,60,203,193]},"announce":[],"urlList":[]}}