{"title":"George Harrison-Live in Japan-1992-cd 1-2","uid":5798675,"size":91367938,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3bab210a5d3ea248dfe66b566e4575d39f049be5&amp;dn=George+Harrison-Live+in+Japan-1992-cd+1-2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"flitigalisa","files":19,"time":1283169549,"description":"Live in Japan is George Harrison's second official live album release, coming after 1971's Grammy-winning The Concert For Bangla Desh and was released in 1992. Although unbeknown to anyone at the time, Live in Japan would prove to be Harrison's last solo release in his lifetime. It was credited to George Harrison, Eric Clapton &amp; Band.\n\nIn 1991, a year after releasing the final Traveling Wilburys album Traveling Wilburys Vol. 3, Harrison was persuaded by close friend Eric Clapton to come out on tour with him in Japan. Mindful of his unsavory live tour for Dark Horse in 1974, Harrison finally relented and in December 1991 performed extremely well-received shows which not only featured his songs, but Clapton's as well. The experience - his last ever tour - proved to be a joyous one for Harrison, where he could not only treat fans to his Beatles classics but also his treasure trove of solo songs all in one set. It could have been the catalyst for future tours, but with Harrison's imminent and extensive involvement in The Beatles Anthology and the lack of a new album to promote until he began working on Brainwashed in the late 1990s, he would never get the chance.\n\nReleased in July 1992 with the amusing production credit of &quot;Spike and Nelson Wilbury&quot; (Harrison's two personÃƒÂ¦ on the two Traveling Wilburys albums), Live in Japan was a no-charter in the United Kingdom and only managed #126 in the United States, but reached #15 in Japan.\n\nIn 2004, Live in Japan was remastered and reissued both separately and as part of the deluxe box set The Dark Horse Years 1976-1992 on Dark Horse with new distribution by EMI, and with an extra SACD remix alongside the original.\n","torrent":{"xt":"urn:btih:3bab210a5d3ea248dfe66b566e4575d39f049be5","amp;dn":"George+Harrison-Live+in+Japan-1992-cd+1-2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bab210a5d3ea248dfe66b566e4575d39f049be5","infoHashBuffer":{"type":"Buffer","data":[59,171,33,10,93,62,162,72,223,230,107,86,110,69,117,211,159,4,155,229]},"announce":[],"urlList":[]}}