{"title":"Madeleine L'Engle - Time Quartet 1-4 Audio Books FIXED","uid":4966928,"size":2678754566,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3bc3ee671a8d1d72066c56f4dacce522de83fd9a&amp;dn=Madeleine+L%5C%27Engle+-+Time+Quartet+1-4+Audio+Books+FIXED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"keikii","files":95,"time":1245584046,"description":"These are the Audio books to the Time Quartet series by Madeleine L'Engle.  The first three are read by the author herself, and the fourth is read by a Anne-Marie Lee. FIXED.\n\n1. A Wrinkle In Time\n2. A Wind in the Door\n3. A Swiftly Tilting Planet\n4. Many Waters\n\nI had difficulty trying to figure out how to name these - Time Quartet, or Time Quintet.  Since I didn't have An Acceptable Time, I decided to go with Time Quartet, and have An Acceptable Time in the Austin Family Chronicles if I am ever able to get a hold of those audio books.  And then there was the matter of Chronologically speaking how to name them, since Many Waters comes before A Swiftly Tilting Planet, while A Swiftly Tilting Planet was published before Many Waters.\n\nI have split each book up into their chapters. I've grown tired of audio books and them being broken up in random places. In the original files, there was 1 file for the first three books, and for the third there were 131 files, and I split the files to make it so that there was one file per chapter.\n\nAs far as I have been able to tell, there hasn't really been anything wrong with these files from the beginning except there was this one point in the fourth book where I couldn't figure out what was going on and the word made no sense.  If you come across this and know what is wrong, and think it is fixable, tell  me and I'll do my best to fix it. If you find anything else the matter, just comment and I'll try and fix what is wrong.\n\nI've also made each book into an .m4b (audio book format) file. These are actually smaller in size, and they work perfectly on your iPod.\n\nIf you can think of anything else that needs to be fixed, or if there is a problem with any of the files, just comment, and I'll try and fix the problem.\n\nEnjoy.\n\nIf you have any requests, email me at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;315841545f554350565e5f0808714850595e5e1f525e5c&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt; and I'll take it into consideration.\n\nPost Script: I'm asking if anyone has the Austin Family Chronicles and An Acceptable Time by the same author in audio books, please share.  I really love this author and I would love to be able to listen to that series. Thanks!\n\nThe Covers: In every torrent, I include the covers I use in the files.  When I was searching for covers for this series, I found there were soo many to choose from, so I just used them all.  For the .m4b files, if you pay attention, each chapter has a different cover art (well, some repeat because I couldn't find enough of them for some series).  I kept all the .mp3 file cover arts the same though, because if you're anything like me, you keep your music library completely in order, and when you're using itunes, I have the files so they are all in a compilation mode so I don't have 20 of the same cover arts for the same album.  So it wouldn't matter anyway, but you can change this yourself in your own library.\n\nHope you enjoy.","torrent":{"xt":"urn:btih:3bc3ee671a8d1d72066c56f4dacce522de83fd9a","amp;dn":"Madeleine+L%5C%27Engle+-+Time+Quartet+1-4+Audio+Books+FIXED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bc3ee671a8d1d72066c56f4dacce522de83fd9a","infoHashBuffer":{"type":"Buffer","data":[59,195,238,103,26,141,29,114,6,108,86,244,218,204,229,34,222,131,253,154]},"announce":[],"urlList":[]}}