{"title":"299 Days: The change of seasons - Glen tate","uid":10196468,"size":501290,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3bd2860db70e32de71337b5139d561307efa4ecf&amp;dn=299+Days%3A+The+change+of+seasons+-+Glen+tate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"DaRule762","files":-1,"time":1400698267,"description":"The Change of Seasons is the seventh book in the 299 Days series, where summer has ended and reality has set in at Pierce Point. For many people, this means scrambling to survive the long winter with even less food. Some were smart enough to spend the summer preparing for the changing season and the expanding effects of the Collapse; others were not so smart, and their desperation and fear grows stronger by the day.\nGrant Matson reflects with pride on how he has provided for his family while guiding Pierce Point into a community that functions well on its own. Celebrating this accomplishment, Grant and others join to offer the community a Thanksgiving dinner, which is met with gratitude and exhilaration. This mood is short-lived, however, as circumstance quickly begin to unravel, beginning with the disappearance of a beloved community member, followed shortly by a self-defensive killing by another.\nThe situation is just as bleak, or worse, in other parts of Washington State and the country, as innocent people are imprisoned and murdered, women and children become commodities, and what is left of the government looks even less like the once-beloved United States of America.\nAs the threat of a civil war becomes imminent, Grant, the Team, and the 17th Irregulars at Marion Farm bond over their duty to protect the country and are soon a fully-formed combat-ready unity, excited to go into combat but uncertain of what will happen to them. Grant dreads what he knows is coming, but he understands that he has been called to sacrifice - potentially his life and probably his marriage - to stop the Loyalists from hurting more people.","torrent":{"xt":"urn:btih:3bd2860db70e32de71337b5139d561307efa4ecf","amp;dn":"299+Days%3A+The+change+of+seasons+-+Glen+tate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bd2860db70e32de71337b5139d561307efa4ecf","infoHashBuffer":{"type":"Buffer","data":[59,210,134,13,183,14,50,222,113,51,123,81,57,213,97,48,126,250,78,207]},"announce":[],"urlList":[]}}