{"title":"50 Digital Team-Building Games (2012).epub Gooner","uid":13103564,"size":9232187,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c4663ac463179698f1fc6a4ba70199e1a3d6885&amp;dn=50+Digital+Team-Building+Games+%282012%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1451255732,"description":"50 Digital Team-Building Games - Fast, Fun Meeting Openers, Group Activities and Adventures using Social Media, Smart Phones, GPS, Tablets and More (2012).epub Gooner\r\n\r\nPublisher: Wiley; 1 edition (May 1, 2012)\r\nLanguage: English\r\nISBN-10: 1118180933\r\nISBN-13: 978-1118180938\r\n\r\nUse technology to increase loyalty and productivity in your employees\r\n50 Digital Team-Building Games offers fun, energizing meeting openers, team activities, and group adventures for business teams, using Twitter, GPS,smartphones, and other technology. The games can be played in-person or virtually, and range from 5-minute ice-breakers to an epic four-hour GPS-based adventure. Designed to be lead by managers, facilitators, presenters, and speakers, the activities help teams and groups get comfortable with technology, get to know each other better, build trust, improve communication, and more. No need to be a &quot;techie&quot; to lead these games—they're simple and well-scripted.\r\n\r\nAuthor John Chen is the CEO of Geoteaming, a company that uses technology and adventure to teach teams how to collaborate.\r\n\r\nHow to lead a simple, fast, fun team building activity with easy-to-follow instructions\r\nHow to create successful &quot;virtual&quot; team building that requires NO travel and little to no additional expenses\r\nHow to engage standoffish engineers, &quot;hard to reach&quot; technical teams, or Gen X/Y teammates with technology they enjoy using\r\nSuccessful technology-based team building can build buzz for your company, build critically important relationships and communication internally, and keep your team talking about it for weeks afterward!","torrent":{"xt":"urn:btih:3c4663ac463179698f1fc6a4ba70199e1a3d6885","amp;dn":"50+Digital+Team-Building+Games+%282012%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c4663ac463179698f1fc6a4ba70199e1a3d6885","infoHashBuffer":{"type":"Buffer","data":[60,70,99,172,70,49,121,105,143,31,198,164,186,112,25,158,26,61,104,133]},"announce":[],"urlList":[]}}