{"title":"Harlan Coben Shelter","uid":11949525,"size":259581847,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3d3ec162cd10f70a05f1dd8edbe9b6311f2923f1&amp;dn=Harlan+Coben+Shelter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":8,"time":1432135290,"description":"Written by Harlan Coben\nRead by Nick Podehl\nFormat: MP3\n\n\nA young adult debut from internationally bestselling author Harlan Coben\n\nMickey Bolitar's year can't get much worse. After witnessing his father's death and sending his mom to rehab, he's forced to live with his estranged uncle Myron and switch high schools.\n\nA new school comes with new friends and new enemies, and lucky for Mickey, it also comes with a great new girlfriend, Ashley. For a while, it seems like Mickey's train-wreck of a life is finally improving - until Ashley vanishes without a trace. Unwilling to let another person walk out of his life, Mickey follows Ashley's trail into a seedy underworld that reveals that this seemingly sweet, shy girl isn't who she claimed to be. And neither was Mickey's father. Soon, Mickey learns about a conspiracy so shocking that it makes high school drama seem like a luxury - and leaves him questioning everything about the life he thought he knew.\n\nFirst introduced to readers in Harlan Coben's latest adult novel, Live Wire, Mickey Bolitar is as quick-witted and clever as his uncle Myron, and eager to go to any length to save the people he cares about. With this new series, Coben introduces an entirely new generation of fans to the masterful plotting and wry humor that have made him an award-winning, internationally bestselling, and beloved author","torrent":{"xt":"urn:btih:3d3ec162cd10f70a05f1dd8edbe9b6311f2923f1","amp;dn":"Harlan+Coben+Shelter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d3ec162cd10f70a05f1dd8edbe9b6311f2923f1","infoHashBuffer":{"type":"Buffer","data":[61,62,193,98,205,16,247,10,5,241,221,142,219,233,182,49,31,41,35,241]},"announce":[],"urlList":[]}}