{"title":"Iggy Pop - Post Pop Depression (2016) [EAC-FLAC]","uid":14648320,"size":328932165,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3d8a49dba84a2746243cda1997c91e8d8ff0986d&amp;dn=Iggy+Pop+-+Post+Pop+Depression+%282016%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pucholoco","files":24,"time":1463611040,"description":"Iggy Pop - Post Pop Depression (2016) \r\n              EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 266 Mb\r\n                       Full Artwork @ 300 dpi (png) -&gt; 63 Mb\r\n\r\n\r\nFate has a way of putting things into an interesting context. When it was announced that Iggy Pop would be collaborating with Josh Homme of Queens of the Stone Age, the music press buzzed with anticipation about the project. What would the proto-punk icon and the snarky hard rock smart guy come up with? The surprise answer is, in many respects, 2016's Post Pop Depression, an unwitting but loving tribute to Pop's friend and collaborator David Bowie. Post Pop Depression arrived two months after Bowie's death, and was completed before his health problems became common knowledge. More than anything, though, this music evokes the sound and feel of Pop's first two solo albums.\r\n\r\n1977's The Idiot and Lust for Life were cut with Bowie in Germany as Pop struggled to make sense of his life and career after the Stooges collapsed. With the reunited Stooges gone following the deaths of Ron and Scott Asheton, Post Pop Depression finds Pop returning to the work he made in 1977, in ways that count the most. Post Pop Depression is smart and thoughtful, intelligent without being pretentious, and full of bold but introspective thinking. \r\n\r\nWhile Josh Homme is certainly no David Bowie, he's a skilled musician who challenges Pop in a way many of his previous producers have not. The sound of Post Pop Depression occasionally gestures to Bowie's work, with and without Pop, but Homme has given this music a personality of its own. Dark and richly textured, Post Pop Depression puts Pop's craggy but authoritative voice and intelligent tirades front and center. Homme and his rhythm section of Dean Fertita and Matt Helders have created strong, muscular backdrops for Pop's lyrics that add to their power. \r\n\r\nThey counter his thoughtful anger with sounds that are rich, cleanly designed, and a successful compliment for the star's work. Pop has suggested that Post Pop Depression may be his last album, and if that's true, it wraps up his career with a strong and atypical work. It tips its hat to Bowie, but also to the freedom and creative possibilities Pop discovered in their collaborative work. It confirms that Pop has never lost the ability to surprise and upend expectations. In the bitter rant that closes &quot;Paraguay,&quot; Pop declares he wants to run away and live as &quot;your basic clod.&quot; It's an ironic thought, closing an album that once again proves Pop never was and never will be an ordinary guy.\r\n\r\n\r\n---------------------------------------------------------------------------------\r\nTracklist:\r\n---------------------------------------------------------------------------------\r\n\r\n01 - Break Into Your Heart\r\n02 - Gardenia\r\n03 - American Valhalla\r\n04 - In The Lobby\r\n05 - Sunday\r\n06 - Vulture\r\n07 - German Days\r\n08 - Chocolate Drops\r\n09 - Paraguay\r\n\r\n© 2016 IGHO / Caroline Australia / Records Records / Ume | CAROL011CD\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:3d8a49dba84a2746243cda1997c91e8d8ff0986d","amp;dn":"Iggy+Pop+-+Post+Pop+Depression+%282016%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d8a49dba84a2746243cda1997c91e8d8ff0986d","infoHashBuffer":{"type":"Buffer","data":[61,138,73,219,168,74,39,70,36,60,218,25,151,201,30,141,143,240,152,109]},"announce":[],"urlList":[]}}