{"title":"Ron Kenoly","uid":5898000,"size":13795841592,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3db1789daa3d971fcab890f93496f31e4d8aa43f&amp;dn=Ron+Kenoly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"geturscripturehere","files":188,"time":1287567284,"description":"About Ron Kenoly\n&quot;God is the same yesterday, today and forever.  But we're not.  We change with time.&quot; Those are the words of a man who knows a great deal about change, transition and life in the Lord.  From the time Dr. Ron Kenoly was born on December 6, 1944, until now, a great deal has transpired.  Both the man and his ministry have evolved.  At 65, he has gone from being a military man to a Rhythm and Blues artist, then from a Sunday morning congregational hymn leader to the most popular Praise and Worship leader in the country.  &quot;God created the world so we would go through seasons. Each season brings about a change.&quot; Dr. Kenoly's life is one that has gone through many seasons, all designed by God to bring him to a place of serving the Lord and leading millions of people into His presence.\n\nAfter graduating from High School in his birthplace, Coffeyville, Kansas, Kenoly ventured out to Hollywood, California.  When plans to make it in the big city fell through, he joined the Air Force in 1965.  It was in the military that he met and married Tavita, his wife of 42 years.  It was also there that the humble beginnings of his music career were launched.  Kenoly joined the Mellow Fellows, a top 40 cover band that toured military bases. In 1968, he left the Air Force and the Mellows Fellows behind and shipped out to the City of Angels to go after his passion- music.","torrent":{"xt":"urn:btih:3db1789daa3d971fcab890f93496f31e4d8aa43f","amp;dn":"Ron+Kenoly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3db1789daa3d971fcab890f93496f31e4d8aa43f","infoHashBuffer":{"type":"Buffer","data":[61,177,120,157,170,61,151,31,202,184,144,249,52,150,243,30,77,138,164,63]},"announce":[],"urlList":[]}}