{"title":"Son House and Bukka White Masters of The Country Blues(avki)(blu","uid":5470228,"size":367594425,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3ed1a78e45db16b048c9de0d2184cb9eb4754829&amp;dn=Son+House+and+Bukka+White+Masters+of+The+Country+Blues%28avki%29%28blu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rogercc","files":3,"time":1269855048,"description":"SON HOUSE &amp;  BUKKA WHITE MASTERS OF THE COUNTRY BLUES\nReleased: 2001\nLabel: Yazoo\nTime: 51:31\n\nVideo\nFormat : MPEG-4 Visual Matrix : Default (H.263)\nCodec ID  : XVID  Bit rate : 747 Kbps\nWidth   x   Height   : 352 pixels  x  480 pixels                  : \nDisplay aspect ratio  : 4:3  Frame rate : 29.970 fps\nAudio\nFormat  : AC-3  Format/Info : Audio Coding 3\nCodec ID    : 2000    Bit rate : 192 Kbps CBR\nChannel(s) : 2 channels  Sampling rate : 48.0 KHz\n\n\nSon House\n\n[color=deepskyblue]1. Taj Mahal introduction \n2. Death Letter Blues \n3. John the Revelator \n4. Preaching the Blues \n5. I Want to Live So God Can Use M[/color]e \n\nBukka White \n\n6. Taj Mahal introduction \n7. Aberdeen Mississippi Blues \n8. Mama Don't Allow \n9. Piano Boogie \n10. Gibson Hill \n11. Poor Boy \n12. World Boogie \n\n\nFrom the Back Cover\nEddie &quot;Son&quot; House and Booker T. Washington &quot;Bukka&quot; White were giant figures in the annals of American music. Both were passionate purveyors of their native Mississippi Delta music and of slide guitar. Both were seminal figures, not only through their association with legendary blues pioneer Charley Patton, but also in the strong influence Mississippi blues has had on this century's music from Robert Johnson to Muddy Waters, all the way to Eric Clapton.\nIn the early part of this century, Mississippi still retained characteristics of a frontier state, physically, socially and politically. The Delta region, which had only recently been cleared out of the wilderness in the late 19th century, was a rich, fertile area that attracted black labor to sharecrop on the burgeoning cotton plantations. Jim Crow laws, expressly aimed at tying blacks to the lowest level of society and to the plantation system, left them little mobility or redress against the social order. Amidst this backdrop, a new type of secular music was evolving in black culture and taking center stage. Chiefly played on the recently popularized guitar, the blues quickly displaced most earlier styles and became the dominant medium for black musical expression and entertainment. It spread through Mississippi like a high water flood.\n\nSON HOUSE\nSon House was born in Lyons, Mississippi, in 1902 and raised in this blues-rich environment. As a young man he was deeply influenced by the Baptist church and thought about a career as a preacher. But, in his own words, the women and the whiskey would not let him pray. House at first scorned blues, but in 1926 a chance encounter with a bluesman named James McCoy impressed him enough to embark on a career as a blues musician. In 1930 he met Charley Patton, the most famous blues performer in Mississippi, and was invited by Patton to accompany him on his next recording session for Paramount Records. In May, 1930, Son House set out for the company's studios in Grafton, Wisconsin, and immortality.\nSon House has always been reckoned one of the greatest of all Delta bluesmen and the nine selections he recorded in 1930 reveal him at the height of his powers. His deep, dynamic vocals convey a power and expressiveness rarely matched. He uses his bottleneck slide guitar style to both carry the melody line and to play riffs and fills. Robert Johnson was pointedly influenced by House and closely copied his accompaniment of &quot;Walking Blues&quot; as well as incorporating major riffs from &quot;Preaching the Blues&quot; and &quot;My Black Mama.&quot; Muddy Waters, too, has called House one of his greatest influences.\n\nBUKKA WHITE\nBeing entranced by the music he heard around him, Bukka White learned to play guitar and became very attracted to the glamorous lifestyle of blues musicians. Bukka developed his own style using a bottleneck and a percussive pick-strum technique that resembled that of his idol, Charley Patton. Bukka was impressed by the reputation Patton had throughout the Delta, and the admiration and excitement his music generated. As the environment for blues was primarily bars, brothels, and gambling dens, bluesmen were viewed by most, however, as disreputable figures, even as they utilized the musicians' talents for a much needed respite from the hard grind of daily life in rural Mississippi.\nBy 1930 Bukka was already a first-rate musician when he recorded four brilliant selections that stand today as masterpieces of slide guitar playing and early gospel singing. He recorded extensively in 1937 and again in 1940 when he premiered his &quot;sky songs,&quot; a powerful body of self-penned compositions with dark overtones and great expressiveness. In a way, these sessions marked the final flowering of the first generation of Delta bluesmen, as the upcoming war created inexorable cultural and social change.\n\n","torrent":{"xt":"urn:btih:3ed1a78e45db16b048c9de0d2184cb9eb4754829","amp;dn":"Son+House+and+Bukka+White+Masters+of+The+Country+Blues%28avki%29%28blu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ed1a78e45db16b048c9de0d2184cb9eb4754829","infoHashBuffer":{"type":"Buffer","data":[62,209,167,142,69,219,22,176,72,201,222,13,33,132,203,158,180,117,72,41]},"announce":[],"urlList":[]}}