{"title":"Gels Handbook - Yoshihito Osada et al.","uid":15375067,"size":19410696,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ee7d716a08f1c7ab2b419ae01b453ed86f1fba4&amp;dn=Gels+Handbook+-+Yoshihito+Osada+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1469183472,"description":"Gels Handbook - Yoshihito Osada et al. (Elsevier, 2001).pdf\r\n\r\nThis major reference work, covering the important materials science area of gels, is a translation of a Japanese handbook. The three-volume set is organized to cover the following: fundamentals, functions, and environmental issues. Gels Handbook also contains an appendix, complete references, and data on gel compounds.\r\nRecently, polymer gels have attracted many scientific researchers, medical doctors, and pharmaceutical, chemical, and agricultural engineers to the rapidly growing field. Gels are considered to be one of the most promising materials in the 21st Century. They are unique in that they are soft, gentle, and can sense and accommodate environmental changes. Because of these unique characteristics gels have a huge potential in technological and medical applications. They are irreplaceable in the separation of molecules, the release of drugs, artificial skins and organs, sensors, actuators, chemical memories, and many other applications.\r\nThe 21st century is also said to be the century of biotechnology, where two kinds of biopolymers play crucial roles: DNA as a bearer of genetic\r\ninformation and proteins as molecular machines. In spite of the dramatic progress in molecular biology and the Human Genome project, the basic principles behind the function and design of such polymeric machines are in the black box. Science and technologies that will emerge from those of polymer gels will shed light on such principles.\r\nSome researchers have already developed prototypes of artificial glands (pancreas), artificial muscles and actuators, and chemical sensors and molecular recovery systems using polymer gels.\r\nThe Gels Handbook is an invaluable source of information on this rapidly growing field. It covers the entire area from the scientific basics to the applications of the materials. The authors are among the leading researchers, doctors, engineers, and patent officers in Japan. This book can be used as a textbook or an encyclopedia and is a must for those involved in gel research or applications.\r\n\r\nKey Features\r\n* Comprehensive coverage of a popular topic in materials science\r\n* Is the first english-language gels handbook\r\n* Includes numerous figures, tables, and photos","torrent":{"xt":"urn:btih:3ee7d716a08f1c7ab2b419ae01b453ed86f1fba4","amp;dn":"Gels+Handbook+-+Yoshihito+Osada+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ee7d716a08f1c7ab2b419ae01b453ed86f1fba4","infoHashBuffer":{"type":"Buffer","data":[62,231,215,22,160,143,28,122,178,180,25,174,1,180,83,237,134,241,251,164]},"announce":[],"urlList":[]}}