{"title":"Without Rule of Law: Advanced Skills to Help You Survive [blacka","uid":8674752,"size":8945684,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3f14db517854016c6838af59a31f25ab2e6932ec&amp;dn=Without+Rule+of+Law%3A+Advanced+Skills+to+Help+You+Survive+%5Bblacka&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"blackatk","files":-1,"time":1373565403,"description":"Publication Date: January 12, 2012\n\nWARNING: This book contains content that may be offensive to some readers. It is an instruction guide covering tactical actions and capabilities which should only be executed in last-resort survival situations.\n\nThis book was written for non-military readers who believe in self-reliance and wish to develop advanced, just-in-case capabilities for themselves and their families. It will lead the reader through progressively more complex preparations and activities.\n\nWritten by Joe Nobody, author of the bestselling HOLDING YOUR GROUND series of books, this work addresses skills that may be necessary to survive if a breakdown of society or government should occur.\n\nThe work covers topics such as camouflage, breaching, hiding, stalking, looting, scavenging, infiltration and disguise. The book includes numerous examples, special equipment, exercises and instructional text on how to plan, equip and execute these actions in a potentially hostile, post-SHTF environment. It takes the reader through various scenarios and provides guidance should TEOTWAWKI occur and extreme measures are required to survive.\n\nReview\nThis book may tick some people off...how to do things that some might find immoral...interesting stuff, things I hadn't thought of before. How to hide. How to evade. How to infiltrate. How to scavenge... if all of your preps have been expended or destroyed, there are skills you can deploy to increase your chances of living. - SHTFBLOG.com\n\nIf you are serious about survival, this book is a Must Read...Paratus Familia Blog\n\nThis guy knows his stuff. And this book could save your life many times over. Perhaps even make you a post-apoc ninja...James M. Dakin Blog\n\nOh, and yes buy this book if you haven't already. I am very pleased with the information provided...rationalsurvivor.com\n\nSome pretty good stuff here. I got it on the kindle and it is thorough in its approch to SERE for a prepper...onpointtactical.com\nFrom the Author\nI didn't want to write this book. It goes against my grain. I am a positive, optimistic person, and the subject matter of this work is dark and foreboding.\n\nIt speaks of a time when my meticulous preparations fail, and I have to resort to the very behavior that I have campaigned to eradicate. It advocates and teaches skills and actions that I despise in others. Yet, the very creed of self-reliance is preparing---for whatever may happen. Are we so confident that the proverbial S will HTF only one time? Where is it written that society will immediately bounce back, returning civilization quickly to its pre-SHTF state? Is there no such thing as TEOTWAWKI II? What happens when my preparations are not enough?\n\nOur forefathers possessed skills that we respect, in which they lived valuable lives without the advantages of electricity and other modern conveniences. Despite all of their self-reliance, skills, and knowledge, disaster still struck. Drought, Indian raids, war, and even weather that destroyed crops endangered their lives. They often struggled to survive, despite all of their preparations. In a post-SHTF society, there will likely be no resources for an already starving population if disaster strikes - again.\n\n\nWithout Rule of Law assumes that such a time arrives when anarchy is pervasive, and the remnants of humanity are struggling to re-establish civilization. Governmental resources are thin or nonexistent. Do you have a plan for this contingency? What additional skills or means would you need on hand to prepare for this? I hope this work helps in your preparations and generates a thought process allowing you to address this threat.\n\nFile Size: 2388 KB\nPrint Length: 192 pages\nPage Numbers Source ISBN: 061559283X\n\n &lt;a href=&quot;\nhttp://www.amazon.com/dp/B006WV6F78&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/dp/B006WV6F78&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:3f14db517854016c6838af59a31f25ab2e6932ec","amp;dn":"Without+Rule+of+Law%3A+Advanced+Skills+to+Help+You+Survive+%5Bblacka","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f14db517854016c6838af59a31f25ab2e6932ec","infoHashBuffer":{"type":"Buffer","data":[63,20,219,81,120,84,1,108,104,56,175,89,163,31,37,171,46,105,50,236]},"announce":[],"urlList":[]}}