{"title":"Molly Hatchet album","uid":4998646,"size":2705739313,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3f5b22527a78a16169828abb3842a4700b8c8c94&amp;dn=Molly+Hatchet+album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"SecondOpinion","files":-1,"time":1247411933,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\n\nVA-The Motown Story-25 Years Of Great Original Hits-cd 1-6\n\nMolly Hatchet is an American southern rock band formed in Jacksonville, Florida in 1971. They are widely known for their hit song &quot;Flirtin' with Disaster&quot; from the album of the same title. The band, founded by Dave Hlubek and Steve Holland, took its name from a prostitute who allegedly mutilated and decapitated her clients. \nBased in Jacksonville, Fla., Molly Hatchet shared influences and inspiration with the most well-known act in the Southern rock genre, Lynyrd Skynyrd as well as another up-and-coming Southern Rock act, .38 Special whose singer was Donnie Van Zant, the brother of late Lynyrd Skynyrd lead vocalist, Ronnie Van Zant. .38 Special enjoyed influential connections in the music industry, referring Molly Hatchet to manager Pat Armstrong. His interest in Molly Hatchet led to a recording contract with Epic Records, bringing in Tom Werman as a producer. Werman had already worked with acts such as Cheap Trick, Stranger and Ted Nugent. Ronnie Van Zant was slated to produce Molly Hatchet's first album, having helped write arrangments and directing rehearsals prior to his fatal airplane crash. Molly Hatchet cut their first demos in Lynyrd Skynyrd's 8-track recording studio using their equipment.\nPrior to the band's signing with Epic Records, they often toured the Florida roadhouse and bar circuit. Dave Hlubek was the band's vocalist prior to Danny Joe Brown, and wrote and co-produced many of the band's songs. Hlubek has stated that the demise of Lynyrd Skynyrd - who were at the height of their success - opened the door for Molly Hatchet\nThe result of the teaming of Tom Werman, a producer known for working with straight hard-rock acts, with a Southern-influenced band led to a new development in the Southern rock genre. Combining boogie, blues and hard rock, Molly Hatchet's sound was differentiated from more country-influenced acts such as Outlaws. Like the area's other Southern rock acts, their music typically expressed the values, hopes - and excesses - of 1970s-era young adults in a Southern metropolitan area like Jacksonville.\nThe band recorded and released its first album, Molly Hatchet in 1978, followed by Flirtin' with Disaster in 1979. Molly Hatchet proceeded to tour behind the record building a larger fan base. Danny Joe Brown, whose gruff voice and tough yet amicable persona had defined the act to that point, left the band at the end of the 1970s only to return a number of years later\n\n","torrent":{"xt":"urn:btih:3f5b22527a78a16169828abb3842a4700b8c8c94","amp;dn":"Molly+Hatchet+album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f5b22527a78a16169828abb3842a4700b8c8c94","infoHashBuffer":{"type":"Buffer","data":[63,91,34,82,122,120,161,97,105,130,138,187,56,66,164,112,11,140,140,148]},"announce":[],"urlList":[]}}