{"title":"Front Mission 4 US","uid":3430360,"size":922789114,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:3f7867d7517fc358cdc3c54a76883f4c3280d097&amp;dn=Front+Mission+4+US&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Fedas","files":1,"time":1136952914,"description":"It is a familiar refrain ? in the future, men will fight wars from inside heavily armed and armored mechanical machines. The ground will shake as this behemoths rumble through, blasting the landscape with a variety of weapons and creating ruins and wreckage from what was once a city.\n\nFront Mission 4 is a turn-based tactical combat game. Players control the wanzers, but you can also utilize a new feature to the franchise in linking up with fellow squad member for tactical maneuvers. The game also has some features new to the series. There is a voiced dialogue, which does sound a little forced at times, but allows players the option (at times) of not reading the information presented while setting the tone for the missions and game.\n\nFrom the opening cutscene, you just know that Front Mission 4 is going to be something special. The environments, and the mechs, look so real.\n\n \n\nAs you progress, you will level up and earn enhancement points (EP), which can be used to enhance (what else) skills and abilities. Essentially, you use the EP earned to buy new abilities, which are programmed into the wanzer?s computer. There are three types of abilities you can enhance: attribute, weapon proficiency and battle skills. Attribute points (AP) are broken down into AP Charge (the amount of AP a pilot regains during each turn); Link Points (which are used to link other pilots for support in battle); Skill Slots (determines the number of battle skills each pilot can equip for a mission); Speed; Evasion; and Resistance Percentages. There are eight basic weapon types.\n\n \n\nYou can also repair your wanzer during battle, using items from the backpack. \n\n \n\nThe game does feature a tutorial, which will guide players through the player interface and launch them into the campaigns that this game has to offer. But don?t expect rocket science here ? the player interface is very easy to use and you will be embroiled in the conflicts quickly. Detracting, though, from that is the ?personality? side of some of the characters, which is brought into play. Rather than deal with more pertinent information, there is some side stuff, which may be cute, but has little to do with the overall game other than set up some minor story points. This game is really about the action, and because the game can move slowly through the turns, getting into the meat of the game is more important than who is scrubbing toilets with a toothbrush.\n\n","torrent":{"xt":"urn:btih:3f7867d7517fc358cdc3c54a76883f4c3280d097","amp;dn":"Front+Mission+4+US","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f7867d7517fc358cdc3c54a76883f4c3280d097","infoHashBuffer":{"type":"Buffer","data":[63,120,103,215,81,127,195,88,205,195,197,74,118,136,63,76,50,128,208,151]},"announce":[],"urlList":[]}}