{"title":"Steve Winwood - Chronicles - Solo Hits [FLAC+MP3]","uid":9510595,"size":487585891,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3f7cc753b69b77c24a8cf6ed9a2875ed12a3a142&amp;dn=Steve+Winwood+-+Chronicles+-+Solo+Hits+%5BFLAC%2BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1390403984,"description":"Source: CD\n\n\n\nBy Anthony G Pizza VINE VOICE\n\nWhen &quot;Chronicles,&quot; was released in 1987, Steve Winwood was enjoying crossover success much like Carlos Santana enjoys today: Grammys, #1 hits, sexy videos, commercial endorsements, public and critical acclaim. After 20 years' hard work, Britain's most soulful voice and bluesiest organist was finally back in the high life.\n\n&quot;Chronicles&quot; explains and justifies that success, but leaves clues to its eventual, inevitable end. The music is delightful and immaculately crafted, melodically twisting and turning where least expected (most notably &quot;Higher Love,&quot; &quot;Arc of A Diver,&quot; &quot;Valerie,&quot; slightly remixed here). Production was state-of-the-art and featured tasteful, fitting roles by stellar guests (James Taylor, James Ingram, Nile Rodgers, Chaka Khan). Winwood ruled a new strain of AC rock that included many of his contemporaries (Clapton, Stewart, American Billy Joel, etc.).\n\nBut Winwood's sound (jazzy synth lines, big drums) fell from favor as aggressive, guitar oriented rock shouted British R&amp;B rockers (Winwood, Joe Cocker, the younger Paul Young) off the charts). Rod Stewart and Eric Clapton sustained with &quot;Unplugged&quot; sets; Winwood's studio craftsmanship made that impractical. Thus, Steve Winwood has not charted a hit single in 10 years.\n\nHere's hoping a new generation of musicians appreciates Winwood's influence enough to join him in creating a megahit album like Santana's &quot;Supernatural.&quot; That, and an update of this set, would successfully update Steve Winwood's legendary, if dormant, rock career. Nonetheless, a recommended set.","torrent":{"xt":"urn:btih:3f7cc753b69b77c24a8cf6ed9a2875ed12a3a142","amp;dn":"Steve+Winwood+-+Chronicles+-+Solo+Hits+%5BFLAC%2BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f7cc753b69b77c24a8cf6ed9a2875ed12a3a142","infoHashBuffer":{"type":"Buffer","data":[63,124,199,83,182,155,119,194,74,140,246,237,154,40,117,237,18,163,161,66]},"announce":[],"urlList":[]}}