{"title":"Deception Pakistan, the United States, and the Secret Trade in N","uid":8752389,"size":3716261,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3fa8183990a2429989eb4251c9498ad4f5cd6ea2&amp;dn=Deception+Pakistan%2C+the+United+States%2C+and+the+Secret+Trade+in+N&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"blackatk","files":-1,"time":1375062791,"description":"\nThe shocking, three-decade story of A. Q. Khan and Pakistan's nuclear program, and the complicity of the United States in the spread of nuclear weaponry.\n\nOn December 15, 1975, A. Q. Khan-a young Pakistani scientist working in Holland-stole top-secret blueprints for a revolutionary new process to arm a nuclear bomb. His original intention, and that of his government, was purely patriotic-to provide Pakistan a counter to India's recently unveiled nuclear device. However, as Adrian Levy and Catherine Scott-Clark chillingly relate in their masterful investigation of Khan's career over the past thirty years, over time that limited ambition mushroomed into the world's largest clandestine network engaged in selling nuclear secrets-a mercenary and illicit program managed by the Pakistani military and made possible, in large part, by aid money from the United States, Saudi Arabia, and Libya, and by indiscriminate assistance from China.\n\nBased on hundreds of interviews in the United States, Pakistan, India, Israel, Europe, and Southeast Asia, Deception is a masterwork of reportage and dramatic storytelling by two of the world's most resourceful investigative journalists. Urgently important, it should stimulate debate and command a reexamination of our national priorities.\n\n\n\nFile Size: 1298 KB\nPrint Length: 608 pages\nPublisher: Walker Books; 1 edition (August 10, 2010)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B00413PHX2\nfiletype: pdf\n &lt;a href=&quot;\nhttp://www.amazon.com/Deception-Pakistan-Nuclear-Weapons-ebook/dp/B00413PHX2/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Deception-Pakistan-Nuclear-Weapons-ebook/dp/B00413PHX2/&lt;/a&gt;\n\n\nTags: a.q khan, khan, Pakistan, prc, holland, nuclear, weapons, strategic, warhead, nato, dprk, proliferation, Iran, Syria, North Korea, Russia, IAEA, regime, NSG, sanction, embago, counter, terrorism, war, military, politican science, diplomacy, foreign, politics, India, Kashmir, ","torrent":{"xt":"urn:btih:3fa8183990a2429989eb4251c9498ad4f5cd6ea2","amp;dn":"Deception+Pakistan%2C+the+United+States%2C+and+the+Secret+Trade+in+N","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fa8183990a2429989eb4251c9498ad4f5cd6ea2","infoHashBuffer":{"type":"Buffer","data":[63,168,24,57,144,162,66,153,137,235,66,81,201,73,138,212,245,205,110,162]},"announce":[],"urlList":[]}}