{"title":"SOTI Pocket Controller Pro. v6.01 For Windows Mobile","uid":4684811,"size":13050091,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:3fb82a4cab262fdc578588291384bc48c2da0431&amp;dn=SOTI+Pocket+Controller+Pro.+v6.01+For+Windows+Mobile&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"xxThugxx","files":-1,"time":1233194716,"description":" \n                        *******   *    *  *     *   *****\n                           *      *    *  *     *   *\n                           *      ******  *     *   *\n                           *      *    *  *     *   * ****\n                           *      *    *  *     *   *    *\n                           *      *    *  *******   ******\n\n        \n                                  \n                             Pocket Controller Pro V6.01\n\n\n                                                              \n\n\n\nView and control your mobile device using your desktop computer screen, keyboard and mouse with Pocket Controller-Pro.\n\n\n                                   Features:\n\n\n*New Vista User Interface - The User Interface has been completely redone to give it a Vista feel and also to make it more intuitive, with in-depth online help and helpful tips\n\n*New Registry Editor Tool - A new registry editor tool has been integrated into the product, that allows users to browse, change, backup or restore the registry of their mobile device\n\n*New Skin in Window Display Mode - The skin functionality has been greatly improved, users can now view devices in a skin in both windowed and non-windowed modes, new shortcuts have been added to allow quick toggling in and out of skin and windowed modes, additional zoom modes have been added and much more\n\n*New Skin Catalog Tool - A new Skin Catalog tool has been added that allows for rapid download of skins and groups of skins, the Skin Catalog contains hundreds of skins for virtually every device on the market. Device specifications can also be viewed from within the Skin Catalog tool\n\n*Performance - Remote Control performance has once again been enhanced, both during connection establishment, as well as the overall responsiveness of remote control\n\n*Security - New security features allow users to configure a login password, block out certain types of connections, to be notified when a connection to their device is attempted as well as the ability to accept or reject connections\n\n*Enhanced Drawing Tool - The drawing functionality has been enhanced to make it a very useful tool for training and demonstrations. Users can now draw in a variety of colors, as well quickly toggle in and out of drawing mode Screen Capture - Users can now capture screens to a variety of file formats including PNG, JPG, GIF (Compressed), TIFF and BMP\n\n*Video Capture - Support for capturing recording video to MS Video 1, and MS WMV formats has been added\n\n*Vista Support - This version fully supports the new Microsoft Vista Operating System\n\n*Windows Mobile 6 Support - This version fully supports the Microsoft Windows Mobile 6 Operating System\n\n*New Wipe Command - A new wipe command has been added allowing devices to be easily wiped/restored to factory settings. This feature is also useful to remove critical data from the mobile device\n\n*Assorted Fixes - Assorted minor improvements, adjustments and fixes","torrent":{"xt":"urn:btih:3fb82a4cab262fdc578588291384bc48c2da0431","amp;dn":"SOTI+Pocket+Controller+Pro.+v6.01+For+Windows+Mobile","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fb82a4cab262fdc578588291384bc48c2da0431","infoHashBuffer":{"type":"Buffer","data":[63,184,42,76,171,38,47,220,87,133,136,41,19,132,188,72,194,218,4,49]},"announce":[],"urlList":[]}}