{"title":"Reporting Technical Information","uid":7796974,"size":4760042,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3fc2b143d7d9ffdaee1c8f935e5c23f304b53af5&amp;dn=Reporting+Technical+Information&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1352171849,"description":"Reporting Technical Information by the late Kenneth W. Houp\nPublisher: Oxford University Press, USA; 10 edition  | ISBN: 0195146123 | Pages: 720 | PDF \n\nThe leading text in technical writing, Reporting Technical Information introduces students to all aspects of technical communication, including letters, proposals and progress reports, recommendation reports, research reports, instructions, and oral reports. Continuing the esteemed tradition of its predecessors, the tenth edition provides students with a solid foundation in technical communication and adds material on the most recent developments in the field.\n\nThrough accessible language, challenging exercises, and realistic examples, Reporting Technical Information, 10/e, begins with the basic strategies of composing and writing, progresses to techniques of technical communication, and closes by applying those techniques to document creation and design. Documentation instructions include Chicago and APA styles, as well as a guide for citing the Internet as a source. The book also offers detailed coverage of the latest technology in electronic communication, including material on writing collaboratively via e-mail, synchronous discussions, and FTP sites.\n","torrent":{"xt":"urn:btih:3fc2b143d7d9ffdaee1c8f935e5c23f304b53af5","amp;dn":"Reporting+Technical+Information","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fc2b143d7d9ffdaee1c8f935e5c23f304b53af5","infoHashBuffer":{"type":"Buffer","data":[63,194,177,67,215,217,255,218,238,28,143,147,94,92,35,243,4,181,58,245]},"announce":[],"urlList":[]}}