{"title":"Sex - Lawrence Shannon - The Predatory Female.pdf","uid":4377806,"size":1105160,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40e645eb7e23e71adb1d6c44ab1c61caa664cd99&amp;dn=Sex+-+Lawrence+Shannon+-+The+Predatory+Female.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"leraconteur","files":1,"time":1220498552,"description":"The first thing you should know about The Predatory Female is that it's written tongue-in-cheek; but just barely. Written by Lawrence Shannon, The Predatory Female is a crushingly frank and funny look at the way some women go about the process of dating, mating, marrying, and divorcing.\n\nEvery man who has been involved in a romantic or sexual relationship with this kind of woman will wince with painful remembrance as Shannon details the behavior of the typical 'predatory female'. It's likely that you'll experience a strong sense of deja vu as you read through The Predatory Female.\n\nAlthough written in a humorous tone, much of what Shannon writes is indeed the truth these days. Because this book is not politically correct, it is all but guaranteed to enrage feminists, gold-diggers, starry-eyed brides-to-be, and, of course, predatory females.\n\nBrutally straightforward, The Predatory Female would make a wicked gift for any man contemplating marriage. Be warned, however, that giving this book to your friend will make you an instant pariah in the eyes of his girlfriend or wife. (Unless, of course, it was mailed to him anonymously...) It may be worth it though, to save a friend from the impending train-wreck of a bad marriage and the hideous divorce that will follow.\n\nFile Under:\nMGTOW, Men's Rights,mens rights, MRA, FRA, anti-feminism, feminism, mra, fra, Father's Rights, fathers rights, misandry, anti-misandry\n\nThe Essential Men's Rights Library - Torrent #5","torrent":{"xt":"urn:btih:40e645eb7e23e71adb1d6c44ab1c61caa664cd99","amp;dn":"Sex+-+Lawrence+Shannon+-+The+Predatory+Female.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40e645eb7e23e71adb1d6c44ab1c61caa664cd99","infoHashBuffer":{"type":"Buffer","data":[64,230,69,235,126,35,231,26,219,29,108,68,171,28,97,202,166,100,205,153]},"announce":[],"urlList":[]}}