{"title":"Ice Palace (Is-Slottet) - 1987 Tarjei Vesaas","uid":5193492,"size":720841722,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:40f20779e553612c1be2fe18bb5157867b1b8bff&amp;dn=Ice+Palace+%28Is-Slottet%29+-+1987+Tarjei+Vesaas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"ForAnAngel","files":1,"time":1259812977,"description":"In this somber tragedy, a young girl moves to a small town to live with her aunt after her unmarried mother dies. There she makes a new friend. One day, she makes some shy sexual advances to her new friend. This confuses them, and she begins to cry and beg her friend not to tell.\n\nOn the following day, the girl pauses beside an enchantingly beautiful frozen waterfall. To her it is an &quot;ice palace.&quot; She enters the shining castle and begins to wander through it's beautiful crystalline chambers. Unfortunately she becomes hopelessly lost. The ice then begins to melt, and though she makes a valiant effort to make it through the icy water to the entrance, she fails and perishes from cold and exhaustion. Her friend's name is the final word uttered from her freezing lips.\n\nWhen the search for Unn remains fruitless, people wonder if Siss knows more about the disappearance than she lets on. They wonder what had passed between them the night before. Siss on her part is overwhelmed by loss and loneliness, and makes a promise that she will never forget Unn. Therefore, Siss takes upon herself the role Unn had: standing alone in the school yard refusing to play or speak. Thus, she has to find her way out of her own emotional ice castle, before she can continue on the road towards adolescence and adulthood.\n================================================================================\n1 file:\nIs-Slottet.avi 1:14:51\n640x480\n25 fps\n687MB\n1253 kbps\n\nAudio:\nNorwegian\nEnglish subtitles (hardcoded)\nStereo\n160kb/s bitrate\n48000Hz","torrent":{"xt":"urn:btih:40f20779e553612c1be2fe18bb5157867b1b8bff","amp;dn":"Ice+Palace+%28Is-Slottet%29+-+1987+Tarjei+Vesaas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40f20779e553612c1be2fe18bb5157867b1b8bff","infoHashBuffer":{"type":"Buffer","data":[64,242,7,121,229,83,97,44,27,226,254,24,187,81,87,134,123,27,139,255]},"announce":[],"urlList":[]}}