{"title":"Bootsy Collins - Back In The Day (The Best Of Bootsy)@320","uid":4090360,"size":202861669,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:416195297eddc56ba47311844c71498d7f874fa6&amp;dn=Bootsy+Collins+-+Back+In+The+Day+%28The+Best+Of+Bootsy%29%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"alekow1","files":22,"time":1206039079,"description":"Can it get any better? If aliens came down needing to know what funk was all about, in all its talented, embrace-anything-and-everything, screw with your head and get your butt down glory, then this is a prime candidate for what to give them. The man, his voice, his bass, the backing of a prime core band including his guitarist brother Catfish, Fred Wesley, and Maceo Parker leading the brass -- beautiful, hilarious, and just plain great. This one-disc collection could easily be a two-disc or more if one wanted to include every last highlight from Collins\\&amp;#039; up-down-all-around career -- his work with James Brown alone is beyond the bomb -- but when it comes to solo work, this is as perfect a place to start as any. Drawing mostly on the albums done with the active help of George Clinton in the late \\&amp;#039;70s, Back in the Day is a model for what a good compilation should be. Sound is excellent throughout, while full details on who plays what and where, along with where everything came from in the first place, all appear in exhaustive detail. The liner notes, meanwhile, come from longtime funk road manager (Brown, Prince, plenty of others) Alan Leeds, explaining every step of Collins\\&amp;#039; wonderful story. Collins himself gets in a great concluding bit of thanks and message that\\&amp;#039;s a joy to read, and needless to say the photos of him in his sunglassed late-\\&amp;#039;70s star-bass-guitar glory abound. And the music? \\&quot;Bootzilla,\\&quot; \\&quot;Stretchin\\&amp;#039; Out (In a Rubber Band),\\&quot; and \\&quot;Pinocchio Theory\\&quot; are just three jam masterpieces of many. A couple of fine rarities flesh things out; \\&quot;What So Never the Dance,\\&quot; recorded in 1971 when Collins\\&amp;#039; band was still known as the House Guests, is a great slice of greasy, JB-tinged funk. \\&quot;Body Slam!\\&quot; shows him getting to grips with electro nicely, while \\&quot;Scenery,\\&quot; originally a B-side ballad, has him doing his loveman-goes-nuts deal at the end. A fierce 1976-era live take on \\&quot;Psychoticbumpschool,\\&quot; with the Horny Horns in full blow, wraps up this fantastic collection. (AMG)\n\n\n\n01. Ahh... The Name Is Bootsy, Baby                                                                                     \n02. Stretchin\\&amp;#039; Out (In A Rubber Band)                                                                                   \n03. The Pinocchio Theory                                                                                                \n04. Hollywood Squares                                                                                                   \n05. I\\&amp;#039;d Rather Be With You                                                                                              \n06. Bootzilla                                                                                                           \n07. What So Never The Dance                                                                                             \n08. Can\\&amp;#039;t Stay Away                                                                                                     \n09. Jam Fan (Hot)                                                                                                       \n10. Mug Push                                                                                                            \n11. Body Slam                                                                                                           \n12. Scenery                                                                                                             \n13. Vanish In Our Sleep                                                                                                 \n14. Psychoticbumpschool &amp;#039;Live&amp;#039;    \n\n\n\nPersonnel includes: Bootsy Collins (vocals, acoustic &amp; electric guitars, keyboards, bass, drums, percussion); Gary \\&quot;Mudbone\\&quot; Cooper, Rufus Allen (vocals); Robert \\&quot;Peanut\\&quot; Johnson (vocals, percussion); Phelps \\&quot;Catfish\\&quot; Collins, Gary Shider, Michael Hampton (guitar); Maceo Parker, Randy Wallace (saxophone); Rick Gardner, Richard \\&quot;Kush\\&quot; Griffith, Clayton \\&quot;Chicken\\&quot; Gunnells, Ronnie Greenway (trumpet); Fred Wesley (trombone); Kae Williams, Jr. (piano); Joel \\&quot;Razor Sharp\\&quot; Johnson (keyboards, percussion, background vocals); Bernie Worrell (keyboards); Frankie \\&quot;Kash\\&quot; Waddy, Cordell \\&quot;Boogie\\&quot; Mosson (drums); Mallia Franklin, Sheila Hayden, Lynn Mabry, Cynthia Girty, Tony Walker, Carolyn Myles (background vocals).\n\n\nProducers: William Collins, Phelps \\&quot;Catfish\\&quot; Collins, Clayton \\&quot;Chicken\\&quot; Gunnells, Chopper, George Clinton.\nCompilation producer: Alan Leeds.\nRecorded between 1970 and 1980. \nAll songs written or co-written by William Collins or George Clinton.\nLabel: Warner\nOrig Year: 1994\n\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n \n\n\n\nEnjoy,Seed and Share\t\n\n","torrent":{"xt":"urn:btih:416195297eddc56ba47311844c71498d7f874fa6","amp;dn":"Bootsy+Collins+-+Back+In+The+Day+%28The+Best+Of+Bootsy%29%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"416195297eddc56ba47311844c71498d7f874fa6","infoHashBuffer":{"type":"Buffer","data":[65,97,149,41,126,221,197,107,164,115,17,132,76,113,73,141,127,135,79,166]},"announce":[],"urlList":[]}}