{"title":"Whiskey Tango Foxtrot - David Shafer - Audiobook MP3","uid":11196609,"size":438258358,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:41860216fa465fea650bcdb80ebdcc2b6abdb01e&amp;dn=Whiskey+Tango+Foxtrot+-+David+Shafer+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"Squiddy82","files":-1,"time":1413099231,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nWhiskey Tango Foxtrot\n\nWritten by: David Shafer\nNarrated by: Bernard Setaro Clark\nLength: 15 hrs and 11 mins\nUnabridged Audiobook\nRelease Date:08-05-14\n\nThree young adults grapple with the usual thirty-something problems - boredom, authenticity, an omnipotent online oligarchy - in David Shafer's darkly comic debut novel.\n\nThe Committee, an international cabal of industrialists and media barons, is on the verge of privatizing all information. Dear Diary, an idealistic online Underground, stands in the way of that takeover, using radical politics, classic spycraft, and technology that makes Big Data look like dial-up. Into this secret battle stumbles an unlikely trio: Leila Majnoun, a disillusioned non-profit worker; Leo Crane, an unhinged trustafarian; and Mark Deveraux, a phony self-betterment guru who works for the Committee.\n\nLeo and Mark were best friends in college, but early adulthood has set them on diverging paths. Growing increasingly disdainful of Mark's platitudes, Leo publishes a withering takedown of his ideas online. But the Committee is reading - and erasing - Leo's words. On the other side of the world, Leila's discoveries about the Committee's far-reaching ambitions threaten to ruin those who are closest to her.\n\nIn the spirit of William Gibson and Chuck Palahniuk, Whiskey Tango Foxtrot is both a suspenseful global thriller and an emotionally truthful novel about the struggle to change the world in- and outside your head.","torrent":{"xt":"urn:btih:41860216fa465fea650bcdb80ebdcc2b6abdb01e","amp;dn":"Whiskey+Tango+Foxtrot+-+David+Shafer+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41860216fa465fea650bcdb80ebdcc2b6abdb01e","infoHashBuffer":{"type":"Buffer","data":[65,134,2,22,250,70,95,234,101,11,205,184,14,189,204,43,106,189,176,30]},"announce":[],"urlList":[]}}