{"title":"Amazing Discoveries That Unlock the Bible - Douglas Connelly","uid":11773456,"size":11791060,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4193ad66be6471b62778ef4420c7209042d84c7b&amp;dn=Amazing+Discoveries+That+Unlock+the+Bible+-+Douglas+Connelly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1427168658,"description":"\n-What was unearthed in Solomon's great cities?\n-Where did archaeologists learn about the great flood?\n-How do these discoveries reveal secrets about King Herod?\n\nThe events of the Bible may have happened long ago and far away, but they happened to real people living in real places. Modern archaeologists have made stunning finds over the past century or so that validate the historical accuracy of the Bible. These finds allow us to understand scriptures better by helping Bible people and places come alive in our imaginations. Come along on an archaeological journey through the Old and New Testaments. Here are some of the best finds that illustrate Bible history, presented in beautiful full-color images accompanied by clear explanations free of technical jargon. You don?t even have to get your hands dirty!\n\n\nAbout the author:\nDouglas Connelly (M.Div. and M.Th., Grace Theological Seminary) is senior pastor at Parkside Community Church in Sterling Heights, Michigan. A writer and speaker, Connelly has written books and Bible study guides, including Encountering Jesus, Good &amp; Evil, Miracles and Heaven. Other books include The Bible for Blockheads and The Book of Revelation for Blockheads, and Wisdom for Life's Journey and Wisdom for the Easter Journey","torrent":{"xt":"urn:btih:4193ad66be6471b62778ef4420c7209042d84c7b","amp;dn":"Amazing+Discoveries+That+Unlock+the+Bible+-+Douglas+Connelly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4193ad66be6471b62778ef4420c7209042d84c7b","infoHashBuffer":{"type":"Buffer","data":[65,147,173,102,190,100,113,182,39,120,239,68,32,199,32,144,66,216,76,123]},"announce":[],"urlList":[]}}