{"title":"Headpins - The Complete Greatest Hits 2002 [FLAC] - Kitlope","uid":7951539,"size":515879461,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4195b884342c36d477a0580b82379425ae458b1d&amp;dn=Headpins+-+The+Complete+Greatest+Hits+2002+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Kitlope","files":18,"time":1356287321,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Burst Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: 4195B884342C36D477A0580B82379425AE458B1D\nFile Size: 491.98 MB \nYear: 2002\nLabel: Solid Gold Records\nCatalog #: 71012-2\n\n\nPlease help seed these FLACs! \n\n\nFrom Wiki\n\nHeadpins are a Canadian rock group, founded as a side project in the late 1970s by then Chilliwack members Ab Bryant and Brian MacLeod. Macleod was impressed by the vocal talents of Vancouver rock singer Denise McCann, and asked her to join his new venture. Originally, Matt Frenette played drums for The Headpins while Bernie Aubin played drums for fellow Vancouver band Loverboy but, within months, Aubin and Frenette swapped bands where each continues to play to the present. The Headpins began gigging around the Vancouver area throughout 1980, quickly building a fan base. McCann left at the end of that first year, and MacLeod brought in Darby Mills to provide lead vocals.\n\nThey achieved their height of popularity in 1982 and 1983, with songs such as &quot;Don't It Make You Feel&quot; (Sample &quot;Don't It...&quot; here) and &quot;Just One More Time&quot;. Soon after, Darby Mills was replaced by Chrissy Steele. Later, Steele went on to make her own band with MacLeod and signed with Chrysalis Records, although the outfit was soon dropped by the label. She ended up having two hits, &quot;Love You 'Til It Hurts&quot; and the ballad, &quot;Love Don't Last Forever.&quot;\n\nThey continue to perform live with Darby, Ab and Bernie from the 80's lineup.\n\nOriginally formed by Brian MacLeod and Ab Bryant as a sort of 'side project' from Chilliwack in 1980, the group's earliest beginnings included drummer Matt Frennette, ex of Streetheart and Randy Bachman's wife Denise McCann, who had enjoyed a moderately successful disco career a few years earlier on vocals. The Pins and Loverboy swapped drummers, and Frenette was gone and Bernie Aubin was in, who incidentally co-wrote Loverboy's &quot;The Kid Is Hot Tonite&quot;.\n\nBefore the end of the year however, it was decided that McCann wasn't right for the job of translating MacLeod's musical vision and was replaced by Darby Mills, already a seasoned session worker and singer of Streetback, a group closer to what MacLeod had in mind than McCann's disco background.\n\nThey continued playing the Vancouver area and won a local radio station's 'battle of the bands' competition in 1981. CFOX's album later that year featured two of their tracks, a live version of &quot;Breakin' Down&quot; and &quot;When A Man Loves a Woman&quot;, their only recorded cover. Even while still negotiatiating a record deal their impact was immediate. The band's live magnetism was rivalled by few and they soon became one of the hottest commodities on the West Coast, beginning with their first show in hometown Vancouver backing up Pat Travers and Blackmore's Rainbow.\n\n\n\nThe Complete Greatest Hits 2002\n\n\nTracks:\n\n01. Celebration\n02. Staying All Nite\n03. Don't It Make Ya Feel\n04. Winnin'\n05. Just One More Time\n06. Line of Fire\n07. Turn It Loud\n08. Feel It (Feel My Body)\n09. You're Still The One\n10. Breakin' Down\n11. Be With You\n12. People\n13. Keep Walkin' Away\n14.  Mine All Mine\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:4195b884342c36d477a0580b82379425ae458b1d","amp;dn":"Headpins+-+The+Complete+Greatest+Hits+2002+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4195b884342c36d477a0580b82379425ae458b1d","infoHashBuffer":{"type":"Buffer","data":[65,149,184,132,52,44,54,212,119,160,88,11,130,55,148,37,174,69,139,29]},"announce":[],"urlList":[]}}