{"title":"American Dictionary of the English Language (1828) - Noah Webste","uid":11706048,"size":9088363,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:42498f0ce948afe9683ac26376afa7662b48e047&amp;dn=American+Dictionary+of+the+English+Language+%281828%29+-+Noah+Webste&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":1,"time":1424127673,"description":"Includes Noah Webster's 1828 Dictionary and a fully illustrated biography of Noah Webster.\n\nThis edition includes ALL the original over 70,000 entries with over 71,000 links to make navigating and finding words much easier.\n\nWe have painstakingly navigated through all the words and sectioned them into chunks with additional links to each section.\n\nNoah realized that England and the new United States had different forms of government, institutions, customs and laws. Because of this, he believed that they needed different vocabularies. He also knew that science and technology were developing rapidly, and new words were being introduced just as quickly. So, he spent over 25 years researching words and their origins and writing the first American dictionary. This dictionary helped Americans to feel pride in their new country, and enabled everyone across the new nation to have a standard vocabulary.\n\nWebster's greatest achievement was the dictionary. In 1800 he published his intentions of writing a dictionary. He published a shortened, concise but comprehensive, version in 1806. The final version was finished in 1825 and published in 1828. It contained 70,000 words. It is no exaggeration to say that it was immediately accepted as the greatest dictionary of the English language on both sides of the Atlantic. Webster had an absolute genius for defining words.\n\nAbout the Author:\nNoah Webster (1758-1843) was an American lexicographer, textbook author, spelling reformer, political writer, and editor. He has been called the &quot;Father of American Scholarship and Education.&quot; His name means &quot;dictionary&quot; to Americans, as he modernized the American language by ridding it of old forms. He was one of the most prolific authors in history, and for a while was a leading newspaper editor.\n\nWebster's blue-backed spellers were textbooks for children that taught five generations of children in the United States how to spell and read, and made elementary education more secular and less religious. He was increasingly religious himself, and proomoted Bible study. In the U.S. his name became synonymous with &quot;dictionary,&quot; especially the modern Merriam-Webster dictionary that was first published in 1828 as An American Dictionary of the English Language","torrent":{"xt":"urn:btih:42498f0ce948afe9683ac26376afa7662b48e047","amp;dn":"American+Dictionary+of+the+English+Language+%281828%29+-+Noah+Webste","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42498f0ce948afe9683ac26376afa7662b48e047","infoHashBuffer":{"type":"Buffer","data":[66,73,143,12,233,72,175,233,104,58,194,99,118,175,167,102,43,72,224,71]},"announce":[],"urlList":[]}}