{"title":"Writing Greek Law.pdf","uid":11414513,"size":2735728,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:42bd21d209dd66ec1ef05cda67897c78c913c4f5&amp;dn=Writing+Greek+Law.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"interuniversal","files":-1,"time":1415560120,"description":"Writing Greek Law\n\nAuthor: Michael Gagarin\n\nISBN:9780521886611\n\nPublisher: Cambridge University Press\n\nThe use of writing in the development of Greek law was unique. In this comparative study Professor Gagarin shows the reader how Greek law developed and explains why it became so different from the legal systems with which most legal historians are familiar. While other early communities wrote codes of law for academic or propaganda purposes, the Greeks used writing extensively to make their laws available to a relatively large segment of the community. On the other hand, the Greeks made little use of writing in litigation whereas other cultures used it extensively in this area, often putting written documents at the heart of the judicial process. Greek law thereby avoided becoming excessively technical and never saw the development of a specialised legal profession. This book will be of interest to those with an interest in the history of law, as well as ancient historians.\n\nWas the first book to cover the whole of ancient Greek law in English\nAlternative approach to understanding the uniqueness of ancient Greek law\nExplains how law began and developed its unique nature in ancient Greece","torrent":{"xt":"urn:btih:42bd21d209dd66ec1ef05cda67897c78c913c4f5","amp;dn":"Writing+Greek+Law.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42bd21d209dd66ec1ef05cda67897c78c913c4f5","infoHashBuffer":{"type":"Buffer","data":[66,189,33,210,9,221,102,236,30,240,92,218,103,137,124,120,201,19,196,245]},"announce":[],"urlList":[]}}