{"title":"BET The Game Season 5 Ep 1-22","uid":7334578,"size":3613303693,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:433a0ee4736dd0880dd4ead6cd205c378ad7106a&amp;dn=BET+The+Game+Season+5+Ep+1-22&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"352Fella","files":-1,"time":1339029282,"description":"This is the entire season five of BET's The Game, previously airing every Monday night. This appears to be the last season, as both Pooch Hall (Derwin Davis) and Tia Mowry-Hardrict (Melanie Barnett-Davis a.k.a. Med-School) have decided not to renew contracts with BET for a sixth season. \n\n//Season Notes-- Derwin and Melanie continue to struggle with marriage. Jason Pitts finds himself falling in love with someone on the other end of the spectrum, and Tasha Mack learns to love herself. And all the other filler that engulfs this show.\n\n//Video Notes-- EP01 and EP02 are combined. There are no missing episodes. There are some a/v sync issues with EP 07, The Tricks Episode. All other episodes seem to work as they should. I didn't DVR/edit these episodes. I simply downloaded every episode, and catalogued them into one convenient file, for others to enjoy. Don't shoot the messenger!\n\n//Other Notes-- I also uploaded Season 4, for those who are interested. Seeding, of course, is optional. I'm not gonna force a 1:1 ratio, even though that should be standard for those who are familiar with torrents/magnets. If you are able to give back whatever you take, please do that.\n\nEnjoy!","torrent":{"xt":"urn:btih:433a0ee4736dd0880dd4ead6cd205c378ad7106a","amp;dn":"BET+The+Game+Season+5+Ep+1-22","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"433a0ee4736dd0880dd4ead6cd205c378ad7106a","infoHashBuffer":{"type":"Buffer","data":[67,58,14,228,115,109,208,136,13,212,234,214,205,32,92,55,138,215,16,106]},"announce":[],"urlList":[]}}