{"title":"The Be Good Tanyas - (2006) Hello Love [FLAC]","uid":5040343,"size":311788095,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:43801aa2a2b97414284f154f7a155f71e180aa33&amp;dn=The+Be+Good+Tanyas+-+%282006%29+Hello+Love+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"sixcrates","files":-1,"time":1249340570,"description":"Latest (and most likely, last) album by The Be Good Tanyas.\nThis completes lossless Be Good Tanyas collection on TPB - for 2 previous albums click on my username. \nEnjoy :)\n\n\n\nBiography (by Erik Hage, allmusic.com)\n\nThe Be Good Tanyas play an old-timey blend of folk, country, and blues bolstered by sweet harmonies and traditional fingerpicking. The Vancouver trio has garnered comparisons to like-minded predecessors such as Gillian Welch and Iris DeMent. The group came together when Samantha Parton, who had spent her post-high school years traveling with her guitar (drawing strong musical influence from visits to the Southern U.S.), returned to Vancouver. She and Jolie Holland initially formed the group, then added Frazey Ford and Trish Klein, who Parton had met while planting trees in Nelson, British Columbia. (Ford and Winnipeg native Klein had met at Selkirk Music School in Nelson.) The musicians played together for the first time in 1999, busking outside the Lilith Fair venue in Vancouver. They soon moved on to local thrift store and coffee shop gigs. Holland left the group, and the remaining trio was soon touring Canada and released their debut album, Blue Horse, in 2001. Two years later, the ladies returned with the lighthearted sophomore effort Chinatown, while Hello Love, which included covers of Neil Young, Mississippi John Hurt, and even Prince, came out in 2006. \n\n\nRip info\n\nPerfect EAC rip, no AccurateRip info as I was the first one.\nI have no scanner, so cover is downloaded from google :), however I included full set of CD box and booklet photos.\t\n\n\nps. The best way to say thanks is to share earlier Po'Girl albums :) They are kinda like BGT, but a little bit different. I have &quot;Home to you&quot; (downloaded mp3), but the rest are nowhere to be found.. :(","torrent":{"xt":"urn:btih:43801aa2a2b97414284f154f7a155f71e180aa33","amp;dn":"The+Be+Good+Tanyas+-+%282006%29+Hello+Love+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43801aa2a2b97414284f154f7a155f71e180aa33","infoHashBuffer":{"type":"Buffer","data":[67,128,26,162,162,185,116,20,40,79,21,79,122,21,95,113,225,128,170,51]},"announce":[],"urlList":[]}}