{"title":"Roman Legionary AD 69-161","uid":11816962,"size":4832386,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4414b65ba6bf8e2b48ebff26fca43aa60508ef06&amp;dn=Roman+Legionary+AD+69-161&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429131079,"description":"Between AD 69 and 161 the composition of the Roman legions was transformed. Italians were almost entirely replaced by provincial recruits, men for whom Latin was at best a second language, and yet the 'Roman-ness' of these Germans, Pannonians, Spaniards, Africans and Syrians, fostered in isolated fortresses on the frontiers, was incredibly strong. Like the Italian yeomen who had battled Pyrrhus and Hannibal centuries before, the provincial legionaries were imbued with the traditional ethos of the Roman army. They were highly competitive, jealous of their honour, and driven by the need to maintain and enhance their reputations for virtus, that is manly courage and excellence. \nThe warfare of the period, from the huge legion versus legion confrontations in the Civil War of AD 69, through the campaigns of conquest in Germany, Dacia and Britain, to the defence of the frontiers of Africa and Cappadocia and the savage quelling of internal revolts, gave ample opportunity for virtus-enhancing activity. Despite a radical change in the makeup of the legions, the period AD 69-161 was characterised by continuity and revival. The classic battle formation that had baffled Pyrrhus and conquered Hannibal was revived. Heroic centurions continued to lead from the front, and common legionaries vied with them in displays of valour. The legions of the era may have been provincial but they were definitely Roman in organisation and ethos","torrent":{"xt":"urn:btih:4414b65ba6bf8e2b48ebff26fca43aa60508ef06","amp;dn":"Roman+Legionary+AD+69-161","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4414b65ba6bf8e2b48ebff26fca43aa60508ef06","infoHashBuffer":{"type":"Buffer","data":[68,20,182,91,166,191,142,43,72,235,255,38,252,164,58,166,5,8,239,6]},"announce":[],"urlList":[]}}