{"title":"Marion - This World and Body [1996]","uid":9392651,"size":339627852,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:44abecfc691c635b4441d2e2f63c54d8a1a10f76&amp;dn=Marion+-+This+World+and+Body+%5B1996%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GenXRock","files":-1,"time":1387914417,"description":"After a string of slightly inconsistent singles, Marion pulled it all together for This World and Body, a fiery and thrilling blast of rock with some fine hints of delicacy cropping up throughout. The neo-Smiths comparison that the band won for itself -- and just as arguably created for itself -- makes a certain sense, mainly through the guitar work. Grantham and Cunningham combine into a fine team, and if together it's not quite Johnny Marr reborn, the two balance full, blasting riffs, clipped rhythm sections, and abbreviated, crisp soloing, acoustic and electric guitars both regularly used. It's not so original that it's immediately recognizable, but it's really good, inspired playing from both track for track that draws on any number of styles to make a great end result. The rhythm section is agreeably frenetic as well, Mousa's drumming a clear step above timekeeping thrash and bash. Harding is another matter -- while there's no doubting his sheer bravura and desire to throw himself into his singing, sometimes the effect is unpleasant. &quot;Let's All Go Together,&quot; which should be a totally triumphant charge, is almost ruined by his extreme yelping of his lyrics in the verses, a clear case of loving his voice not too wisely but too well (the overwrought words don't help much). Other examples could be cited, but thankfully it's not endemic through This World and Body; often the band, helped by Al Clay's solid, lively production, and Harding combine just right. The re-recorded &quot;Sleep&quot; makes the best case for the album and band, the musicians bursting with energy right from the opening riff to the galloping conclusion, Harding riding the song with vim and controlled passion. Other definite highlights working seeking out include &quot;Your Body Lies,&quot; which shows Harding can tone things down where appropriate, and the moody crawl into louder thrash of &quot;All for Love.&quot; (3/5)","torrent":{"xt":"urn:btih:44abecfc691c635b4441d2e2f63c54d8a1a10f76","amp;dn":"Marion+-+This+World+and+Body+%5B1996%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44abecfc691c635b4441d2e2f63c54d8a1a10f76","infoHashBuffer":{"type":"Buffer","data":[68,171,236,252,105,28,99,91,68,65,210,226,246,60,84,216,161,161,15,118]},"announce":[],"urlList":[]}}