{"title":"Doctor Who - Season 15 - (1977-78) - 26 Episodes","uid":9127661,"size":5280447681,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:44ba9a69e5d3ca212d93a38a33bd45b32597867f&amp;dn=Doctor+Who+-+Season+15+-+%281977-78%29+-+26+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"bnaron","files":26,"time":1383255288,"description":"The fifteenth season of British science fiction television series Doctor Who began on 3 September 1977 with the episode Horror of Fang Rock, and ended with The Invasion of Time.\n\nTom Baker and Louise Jameson continue their roles as the Fourth Doctor and Leela. K-9, played by John Leeson, makes his first appearance during the second serial The Invisible Enemy. Louise Jameson makes her final appearance as Leela in The Invasion of Time.\n\n1.  Horror of Fang Rock - Four Episodes\n\n    Synopsis: Three lighthouse men face their fears when something comes in\n    from the sea, which brings death to all it touches.\n\n2.  The Invisible Enemy - Four Episodes\n\n    Synopsis: A shuttle crew encounters a cloud in space that infects them with\n    an intelligent virus. When the Doctor answers the distress call, he is\n    infected as well.\n\n3.  Image of the Fendahl - Four Episodes\n\n    Synopsis: The Doctor and Leela encounter the Fendahl. In a priory near the\n    village of Fetchborough, four scientists, Adam Colby, Max Stael, Thea\n    Ransome and Dr. Fendelman, are doing tests on a human skull they found in\n    Kenya, apparently twelve million years old. When Dr. Fendelman starts using\n    a sonic time scan, trying to get an image of the owner of the skull, the\n    skull itself seems to react, locking onto Thea and releasing something in\n    the priory grounds that kills a passing hiker, who eventually totally\n    disintegrates.\n\n    The scan catches the attention of the Doctor and Leela when they are pulled\n    down to Earth by it. The Doctor and Leela set off to find it before it\n    creates a continuum implosion and destroys the planet.\n\n4.  The Sun Makers - Four Episodes\n\n    Synopsis: In the far future, the planet Pluto is habitable, heated by\n    several miniature suns. However, the heat is available only to the ruling\n    classes.\n\n5.  Underworld - Four Episodes\n\n    Synopsis: In the history of the Time Lords, their involvement with the\n    Minyans of Minyos is regarded as a disaster. The Minyans looked upon them\n    as gods but, having learned much from their science, later expelled the\n    Time Lords who thereafter adopted a policy of non-intervention. The Minyans\n    resented the Time Lords for their dominion over Minyos. Subsequently, the\n    Minyans engaged in a civil war, using the advanced weapons the Time Lords\n    gave them. In the final conflict, the Minyans destroyed their world. Two\n    ships left Minyos before the final conflict, one carrying the race bank of\n    the Minyans, the other intended to find the race bank and bring the Minyans\n    to a new home world - Minyos II. The Minyan civilization retained some Time\n    Lord gifts, not least cellular rejuvenation and the use of pacifier guns to\n    alter the mental state of the aggressor. The Doctor must help the Minyans\n    find the hidden race banks that will save their dying race.\n\n6.  The Invasion of Time - Six Episodes\n\n    Synopsis: The Doctor returns to Gallifrey, having claimed the Presidency,\n    he orders Leela expelled from the Capitol Citadel. However, the Doctor is\n    doing this to prevent a Sontaran-instigated disaster.\n","torrent":{"xt":"urn:btih:44ba9a69e5d3ca212d93a38a33bd45b32597867f","amp;dn":"Doctor+Who+-+Season+15+-+%281977-78%29+-+26+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44ba9a69e5d3ca212d93a38a33bd45b32597867f","infoHashBuffer":{"type":"Buffer","data":[68,186,154,105,229,211,202,33,45,147,163,138,51,189,69,179,37,151,134,127]},"announce":[],"urlList":[]}}