{"title":"The Googlization of Everything (And Why We Should Worry)","uid":6384140,"size":857302,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:460447d9824a0c7321db5e90d34ab3771f094dcb&amp;dn=The+Googlization+of+Everything+%28And+Why+We+Should+Worry%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bookzilla","files":1,"time":1305137648,"description":"What is the nature of the transaction between Google's computer algorithms and its millions of human users? Are we heading down a path toward a more enlightened age, or are we approaching a dystopia of social control and surveillance? With these and other questions, University of Virginia media studies and law professor Vaidhyanathan thoughtfully examines the insidious influence of Google on our society. In just over a decade, Google has moved so rapidly in its mission to &quot;organize the world's information and make it universally accessible and useful&quot; that cries of &quot;Google it!&quot; resound through high school classrooms, business offices, academic halls, and public libraries. As Vaidhyanathan points out, we must be cautious about embracing Google's mission and not accept uncritically that Google has our best interests in mind. He reminds us that Google is a publicly traded, revenue-driven firm that is dangerous in many subtle ways. By valuing popularity over accuracy and established sites over new ones, Google sets its own agenda regarding what information is most relevant to users, altering their perceptions about value and significance. Vaidhyanathan admirably concludes with a design for an information ecosystem called the Human Knowledge Project, which would be a more democratic means of parsing and organizing knowledge.\n\nMarch 2011\nPublisher: University of California Press\nFormat: Hardcover  280pp \n","torrent":{"xt":"urn:btih:460447d9824a0c7321db5e90d34ab3771f094dcb","amp;dn":"The+Googlization+of+Everything+%28And+Why+We+Should+Worry%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"460447d9824a0c7321db5e90d34ab3771f094dcb","infoHashBuffer":{"type":"Buffer","data":[70,4,71,217,130,74,12,115,33,219,94,144,211,74,179,119,31,9,77,203]},"announce":[],"urlList":[]}}