{"title":"~! Free Your Mind Documentaries !~","uid":5204924,"size":19950019,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4631838fa4b2bdbf38492c7a29830618249f9df7&amp;dn=%7E%21+Free+Your+Mind+Documentaries+%21%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"fymd","files":-1,"time":1260330687,"description":"This is an ULTIMATE torrent of torrents that has an array of the most esoteric information and documentaries you will come across!*~*~*!\n\nIf you appreciate and cherish the work of these film makers, please honor them by purchasing their films or donating through their website... ;~)\nThey have put a tremendous amount of time and energy into producing these films and the only way they can continue to do what they love is by us supporting them.\n\nI hope you really enjoy this documentary archive !~!\nPlease circulate this torrent widely to aid this process of ascension here on planet Earth. *_*\n\nTo download all of these documentaries you will probably need around a Terabyte or more of hard drive space.\nI highly recommend upgrading hard drive space because that's more knowledge in your database and more knowledge for the planet to share.\n\nHowever, if you don't have tons of hard drive space, be sure to pick the torrents you want to download with discretion because it will fill up quick!!\nThank you for downloading and being attracted to this kind of esoteric knowledge (gnosis)...\n\nBeing we have this knowledge, it is now our responsibility to share it with others and awaken the masses.\nPlease help seed this torrent so that it will become more visible by others &amp; seed the torrents within this torrent that you really LOVE...\n\nThank you for being you  ^_^\nMay we all move towards a greater sense of awareness and compassion for our fellow human being*\n\n\npeace, love, truth, light, bliss, honor, and dreams of empathy unto you all...\nultimately, what we do in life.. echoes in eternity~8\nseek the truth and the truth shall set you free~*~*~* &lt;a href=&quot;\nhttp://RedIceCreations.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://RedIceCreations.com/&lt;/a&gt;\n\n*All Is One*\n~ 1LOVE ~\n\nNamaste *_*","torrent":{"xt":"urn:btih:4631838fa4b2bdbf38492c7a29830618249f9df7","amp;dn":"%7E%21+Free+Your+Mind+Documentaries+%21%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4631838fa4b2bdbf38492c7a29830618249f9df7","infoHashBuffer":{"type":"Buffer","data":[70,49,131,143,164,178,189,191,56,73,44,122,41,131,6,24,36,159,157,247]},"announce":[],"urlList":[]}}