{"title":"Beethoven Complete Quartets Guarneri FLAC+CUE","uid":9895879,"size":2593890239,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4694f1dcea136c3c12662037819e257698d3e732&amp;dn=Beethoven+Complete+Quartets+Guarneri+FLAC%2BCUE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"magneez","files":24,"time":1396711301,"description":"This is an EAC rip of the Brilliant label reprint, in lossless FLAC\n\nrandom review:\n\nThe Guarneri Quartet does the best BEETHOVEN April 29, 2004\n\n\nI have always loved the Guarneri Quartets Beethoven recordings of the 1960s.\nBelieve me it is a crowded field out there with a lot of wonderful versions, but I've always thought their interpretations were as good if not better than the Quartetto, Lindsey, Italiano, Vegh, Talich or Medici versions. I have found that the Guarneri Quartet has provided an outstanding escort to these wonderful journeys, the genuine straightforwardness of their playing along with their unrivaled execution, and rich intonation helps to make the Beethoven quartets a extremely poignant experience every time I hear them. In a word, these performances are close to perfection. The Guarneri Quartet really understand what the music is about, they are playing more than just the notes.\nThe recordings are good (thanks to engineer Richard Gardner) and with the fantastic re-mastering job, the recordings now sound superb, with excellent presence and definition. The instruments are closely miked and the sound is nice and dry (it sounds like they are playing in your living room) so that the performances can be fully enjoyed. These recordings are vibrant and exciting! Even the CD layout has been improved so that the great Opus 127 is no longer split over two discs.\nInstead of three sets, totaling nine discs and costing well over one hundred, it has been condensed to one complete slim line box set with eight discs and costing about half the price!","torrent":{"xt":"urn:btih:4694f1dcea136c3c12662037819e257698d3e732","amp;dn":"Beethoven+Complete+Quartets+Guarneri+FLAC%2BCUE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4694f1dcea136c3c12662037819e257698d3e732","infoHashBuffer":{"type":"Buffer","data":[70,148,241,220,234,19,108,60,18,102,32,55,129,158,37,118,152,211,231,50]},"announce":[],"urlList":[]}}