{"title":"The Faint - Doom Abuse (2014) [MP3 320] politux","uid":9919447,"size":95079099,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:46cda018320c4a417493384e152886cf7abb22b0&amp;dn=The+Faint+-+Doom+Abuse+%282014%29+%5BMP3+320%5D+politux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1396988028,"description":"\n  The Faint - Doom Abuse (2014) [MP3 320] politux\n\n  Genre: Pop/Rock\n  Styles: Alternative, Dance-Punk\n  Source: Converted from FLAC\n  Bitrate: 320 CBR\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Help in the Head\n  02 Mental Radio\n  03 Evil Voices\n  04 Salt My Doom\n  05 Animal Needs\n  06 Loss of Head\n  07 Dress Code \n  08 Scape Goat\n  09 Your Stranger\n  10 Lesson from the Darkness\n  11 Unseen Hand\n  12 Damage Control\n\n  Their first collection of new music since 2008's ambitious, electro-rock-studded Fasciinatiion, Doom Abuse finds the venerable Omaha post-punk-dance-metal-pop hybrid speaking a language familiar to anybody who has followed them since their 1995 Conor Oberst-era inception. Helped along by the meaty first single &quot;Help in the Head,&quot; the Faint are as dissatisfied as ever with society, but they don't let the permeable injustices of the world get in the way of having a good time musically, and while the 12 cuts that make up their appropriately titled sixth long-player are still raging against the machine, they do so with the resigned wisdom, or work ethic, of age. Sometimes, all of the sticking it to the man can feel a little too on the nose, as is the case with the relentless yet redundant &quot;Dress Code&quot; and &quot;Loss of Head,&quot; but there are enough dyed-in-the-wool, Faint-astic crowd-pleasers like &quot;Animal Needs,&quot; &quot;Unseen Hand,&quot; and &quot;Your Stranger&quot; to goad a pit into a proper feeding frenzy. The band steps off of the main floor to flex its window dancing abilities on the dense, retro-new wave, faux-leather pants-ripper &quot;Mental Radio,&quot; and the frenetic &quot;Salt My Doom&quot; tears the roof off of the joint while simultaneously peppering it with thick, Gary Numan-inspired blasts of melodic synth, but it's the big, bold, boozy, and surprisingly beautiful closer &quot;Damage Control&quot; that offers up the most concise snapshot of the band in 2014. Equal parts whimsical and despondent, it's Disintegration-era Cure wearing an Imagine Dragons hoodie that's trying to have an LCD Soundsystem, &quot;All My Friends&quot; moment, and while the Faint don't quite pull it off, they're all the better for trying.","torrent":{"xt":"urn:btih:46cda018320c4a417493384e152886cf7abb22b0","amp;dn":"The+Faint+-+Doom+Abuse+%282014%29+%5BMP3+320%5D+politux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46cda018320c4a417493384e152886cf7abb22b0","infoHashBuffer":{"type":"Buffer","data":[70,205,160,24,50,12,74,65,116,147,56,78,21,40,134,207,122,187,34,176]},"announce":[],"urlList":[]}}