{"title":"Anarbor - Burnout (2013) [FLAC] BOCKSCAR","uid":8546039,"size":274747497,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:46f27a6371cfcf6124418c2c3677a2334271cd73&amp;dn=Anarbor+-+Burnout+%282013%29+%5BFLAC%5D+BOCKSCAR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1370530556,"description":"\n  Anarbor - Burnout (2013) [FLAC] BOCKSCAR\n\n  Released: 2013\n  Duration: 34:45\n  Genre: Pop/Rock\n  Style: Emo, Punk-Pop, Alternative\n  Source: Scene CD\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Every High Has A Come Down 3:17\n  02 Damage I've Done 3:52\n  03 18 2:37\n  04 Whiskey In Hell 2:54\n  05 Who Can Save Me Now? 3:14\n  06 I Hate You So Much 3:09\n  07 Take My Pain Away 3:33\n  08 It's A Fact 3:17\n  09 I Don't Love You Anymore 3:14\n  10 Freaks 2:51\n  11 Rock To My Roll 2:47\n\n  Formed when all the members were still in junior high, Phoenix, Arizona's Anarbor signed their record deal and recorded their 2010 debut full-length, The Words You Don't Swallow, before making it out of their teenage years. Making the type of shiny, well-polished pop/rock with emo tendencies that skyrocketed Fall Out Boy and Good Charlotte to fame, the youngsters were quickly touring the world and doing the Warped Tour circuit. On second full-length Burnout (which follows several EPs), the bandmembers seem intent on showing how much they've matured, with lyrical themes tending toward debauchery, self-medication, and the type of destructive, drama-fueled relationships that seem to happen with people in their early twenties. Hard rock guitar grooves make up the backbone of tracks like &quot;Whiskey in Hell&quot; and &quot;Who Can Save Me Now?,&quot; always shifting to big, melodic choruses that temper the snarly instrumentation with calculated hooks. \n\n  Themes of post-teenage life come through loud and clear on tracks like &quot;18,&quot; which spins a tale of a younger lover dating the song's tattooed, chain-smoking protagonist just to piss off her parents, and &quot;Damage I've Done,&quot; with angsty lines like &quot;I don't wanna live a day past 29&quot; spoken with classic detached, hair-flipping affectation. While the lyrics seem fixated with the transition from the teen years to young adulthood, Anarbor have matured musically on Burnout in a more tangible way. Touches of keyboards make their way onto tracks like the '90s-influenced &quot;Freaks,&quot; and album closer &quot;Rock to My Roll&quot; builds on a ukulele chord progression, taking the song to a place smoother and more refined than anything else we've heard from the band thus far.","torrent":{"xt":"urn:btih:46f27a6371cfcf6124418c2c3677a2334271cd73","amp;dn":"Anarbor+-+Burnout+%282013%29+%5BFLAC%5D+BOCKSCAR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46f27a6371cfcf6124418c2c3677a2334271cd73","infoHashBuffer":{"type":"Buffer","data":[70,242,122,99,113,207,207,97,36,65,140,44,54,119,162,51,66,113,205,115]},"announce":[],"urlList":[]}}