{"title":"The Twenty-four Hour Mind","uid":6500021,"size":1778790,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47143842fd632c544498b42c2534a013d0e99516&amp;dn=The+Twenty-four+Hour+Mind&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"_F1_","files":-1,"time":1309214195,"description":"Rosalind Cartwright - The Twenty-four Hour Mind: The Role of Sleep and Dreaming in Our Emotional Lives\nO x f _.rd Un _.ver- _.ty Pr _.ss | ISBN: 0195386833 | 2010-06-24 | PDF | 224 pages | 1.70 Mb\n\nIn The Twenty-four Hour Mind, sleep scientist Rosalind Cartwright brings together decades of research into the bizarre sleep disorders known as parasomnias to propose a new theory of how the human mind works consistently throughout waking and sleeping hours. Thanks to increasingly sophisticated EEG and brain imaging technologies, we now know that our minds do not simply &quot;turn off&quot; during sleep. Rather, they continue to be active, and research has indicated that one of the primary purposes of sleep is to aid in regulating emotions and processing experiences that occur during preceding waking hours. As such, when sleep is neurologically or genetically impaired or just too short, the processes that good sleep facilitates--those that usually have a positive effect on our mood and performance--can short circuit, with negative results that occasionally reach tragic proportions. Examining the interactions between conscious and unconscious forms of thinking as they proceed throughout the cycles of sleeping, dreaming, and waking, Cartwright demystifies the inner workings of the human mind that trigger sleep problems, how researchers are working to control them, and how they can apply what they learn to further our understanding of the brain. Along the way, she provides a lively account of the history of sleep research and the birth of sleep medicine that will initiate readers into this fascinating field of inquiry and the far-reaching implications it will have on the future of neuroscience. The Twenty-four Hour Mind offers a unique look at a relatively new area of study that will be of interest to those with and without sleep problems, as well as anyone captivated by the mysteries of the brain--and what sleep continues to teach us about the waking mind.\n\nContents:\nIn the beginning : the early days of sleep research\nCollecting dreams : watching the sleeping mind\nShort sleep and its consequences : insomnia\nSleep and dreams in depression\nSleepwalking into danger : murders without motives\nMore NREM parasomnias : those who injure themselves, seek food or sex, explore, and protect\nSleepwalking and state of mind in the courtroom\nWarnings from the land of nod : nightmares and REM behavior disorder\nDreaming and the unconscious\nThe role of dreams in the twenty-four hour mind : regulating emotion and updating the self.","torrent":{"xt":"urn:btih:47143842fd632c544498b42c2534a013d0e99516","amp;dn":"The+Twenty-four+Hour+Mind","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47143842fd632c544498b42c2534a013d0e99516","infoHashBuffer":{"type":"Buffer","data":[71,20,56,66,253,99,44,84,68,152,180,44,37,52,160,19,208,233,149,22]},"announce":[],"urlList":[]}}