{"title":"Effective UI - The Art Of Building Great User Experience In Soft","uid":8407503,"size":6293025,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47645a4f047e24511f13370ea7564148c7276e1f&amp;dn=Effective+UI+-+The+Art+Of+Building+Great+User+Experience+In+Soft&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"AwfullyAwesome","files":1,"time":1366834111,"description":"Effective UI - The Art Of Building Great User Experience In Software\n\nBy Jonathan Anderson, John McRee, Robb Wilson, The EffectiveUI Team\nPublisher: O'Reilly Media\nReleased: January 2010\nISBN-10: 059615478X\nISBN-13: 978-0596154783\nPages: 320\n\nDescription :\nPeople expect effortless, engaging interaction with desktop and web applications, but producing software that generates enjoyable user experiences is much harder than many companies anticipate. With Effective UI, you'll learn proven user-experience strategies that will satisfy your clients and customers, drive business value, and increase brand strength.\n\nThis book shows you how to capture the collaborative and cooperative spirit among designers, engineers, and management required for building engaging software. You'll also learn valuable methods for maintaining focus throughout the process -- whether you're a product manager who needs a clear roadmap, a developer or designer looking for guidance and advocacy, or a businessperson who wants to understand and manage user-experience software initiatives.\n\nLearn how to build software that will:\n\nGenerate engaging and interactive experiences between consumers and businesses, or between businesspeople and their information systems\nAccount for how people work with, think about, and consume information\nEstablish a richer means of collaboration and communication\nReduce frustration by streamlining complex tasks and creating processes that are more intuitive\nDistinguish products, services, and brands to create a competitive advantage\nCreate scalable systems that adapt to changing user needs and behaviors","torrent":{"xt":"urn:btih:47645a4f047e24511f13370ea7564148c7276e1f","amp;dn":"Effective+UI+-+The+Art+Of+Building+Great+User+Experience+In+Soft","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47645a4f047e24511f13370ea7564148c7276e1f","infoHashBuffer":{"type":"Buffer","data":[71,100,90,79,4,126,36,81,31,19,55,14,167,86,65,72,199,39,110,31]},"announce":[],"urlList":[]}}