{"title":"Thomas and Friends Season 12 Full","uid":4602858,"size":322002205,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:476ae8fa77675d918ba2467c2896c088d22bf5c8&amp;dn=Thomas+and+Friends+Season+12+Full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"kartoon33","files":1,"time":1230317721,"description":"1. &quot;Thomas and the Billboard&quot; \t\nWhen a photographer comes to photograph the engines for a billboard Diesel accidentally obscures Thomas; Thomas thinks this was on purpose and is so distracted he goes the wrong way and knocks the billboard over. This gives an opportunity for all the engines to be in a new photo, but when Diesel isn't told, he has to do all the others' jobs. Everything is soon rectified and the new photo is put up at Knapford.\n \n2. &quot;Steady Eddie&quot; \t\nEdward is told to take a brass wheel along the express line to the Waterworks, but opts to take the branch line so the people can see him. Although Edward is warned the line ahead is bumpy, he continues onwards as the school is nearby. When the wheel begins to tear the rope, Edward goes up Gordon's Hill, but then the wheel rolls off to the Smelters. Edward saves it just in time and has it chained on so it won't fall off again and successfully delivers the Water Wheel to Great Waterton. \n\n3. &quot;Rosie's Funfair Special&quot;\nRosie and Emily are pulling a train for a fair, but Rosie wants to pull it alone to prove her worth. When Rosie reaches the docks, she only pulled half the train due to a coupling snap. Further carriages snap off during the trip causing accidents affecting Bertie, Stepney and Emily. When caught by the Fat Controller she fetches Rocky to repair Emily's trucks and then they pull the train together, where they reach Maithewaite.\n\n4. &quot;Mountain Marvel&quot;\nMiss Marvel, a famous storyteller is to arrive on the Narrow Gauge Railway, to tell a story about the mythical and mysterious engine, Proteus. While delivering milk churns, Peter Sam finds a statue of Proteus and tries to tell the engines to avoid the track, where he found the statue. Peter Sam then pulls the statue away with his milk churns but crashes into some buffers. With the help of Duncan, Freddie and Mighty Mac, his jobs are soon completed and he and the other engines make it in time to be told the story of Proteus, in front of a croud of people by Miss Marvel.\n\n5. &quot;Henry Gets It Wrong&quot; \t\nA storm has hit the wishing tree, so some woodsmen are to be brought to the island to prop up the tree. But Henry thinks that the woodsmen are chopping the tree down. So he takes Toby, Thomas, Percy and Emily's loads to block the lines, leading to the tree. Harold eventually informs Henry that the woodsmen want to save the tree, so Henry delivers the loads to their destinations, and the woodsmen arrive at the forest to save the tree, with some help from Henry.\n \n6. &quot;Heave Ho Thomas!&quot; \t\nA New American engine named Hank arrives on Sodor and Thomas must show him around, while doing his jobs. Hank must help him, but Thomas constantly refuses his help until he breaks down. Thomas then realizes his mistake and Hank helps him finish his jobs. They make it in time for Hank's welcome party at Knapford Station. \n\n7. &quot;Toby's Special Surprise&quot; \t\nToby wants to make an impression by searching the island for something special. But when Toby is taking workmen to Great Waterton, he spends to much time looking for something special, he eventually runs out of coal. But when he finds a metal piece lying beside the track, Rocky lifts it of the ground and Toby finds the sign of the 'Great Waterton Tram Shed'. \n \n8. &quot;Excellent Emily&quot; \nEmily is the only one who finishes her jobs on time, and thus is called &quot;Excellent&quot; by the Fat Controller. She is then given a job to take Trevor from Farmer McColl's farm, to the Airport to clear some rubble before Jeremy the Jet Plane lands, who is carrying The Fat Controller's Mother. Murdoch, Thomas and Duck inform Emily that some tracks are not safe, Emily ignores them, which lands her into trouble when he track on a muddy dip, sinks. Murdoch helps her out and Emily, who arrives at Farmer McColl's to take Trevor, now asks Murdoch to use which tracks, and delivers Trevor just in time, as Jeremy descends onto the Airport, with The Fat Controller's Mother. \n\n9. &quot;The Party Surprise&quot; \t\nFreddie decides to organize a winter party at the wharf instead of at Mr. Percival's house, so that Colin the Crane can join in, but neglects to tell Mr. Percival and so the equipment is loaded onto a barge. Freddie eventually tells Mr. Percival about the rearranged party, to which Mr. Percival agrees on. Freddie stops the barge just in time and the party is now on the Wharf. Colin thanks Freddie for his help. \n\n10. &quot;Saved You!&quot; \t\nThomas has to take a fireman to Maithwaite for a medal ceremony and decides to try and help the engines on the way - although all his attempts end in failure, when Rocky drops a water tower, Harvey goes down the wrong line and Gordon can't find Toby. Thomas asks Percy to collect the fireman and sorts out the mistakes that he has made. He finds Bertie, broken down on a muddy road and agrees to take children to the medal ceremony. Thomas feels that he is now a real hero. \n\n11. &quot;Duncan and the Hot Air Balloon&quot; \nThe Percival twins are to be getting a ride in a hot air balloon for their birthday, but Duncan, who used to give them their rides, wants to take them himself. So while delivering the balloon (which was delivered by Thomas) to the Percival's house, tries to make the balloon float away. The balloon lands in front of the house, where Mr. Percival tells Duncan that he was supposed to take the twins to and from the balloon. Duncan agrees, and the Percival twins enjoy their ride on the Hot Air Balloon. \n\n12. &quot;James Works It Out&quot; \t\nIt's winter on the Island of Sodor and James, Thomas and Stanley are shunting trucks at the yard. James shows off that he can shunt Hector to the back of his train. He puffs away with his trucks, which he has to take to Great Waterton. On the way he Harold tells James that he has to take the longer route. But James gets cross and takes the snowy track. He takes the wrong route when he sees Edward who tells James to take the longer route. But James doesn't listen and Hector tells James what to do. He doesn't listen again and his trucks gets stuck in the snow. So this time, James does listen to Hector and make his trucks go through the snow. He, Hector and the Trucks, soon make it to Great Waterton. \n\n13. &quot;Tram Trouble&quot; \t\nToby is to lead the first Great Waterton and Thomas is pleased for his friend. But when he arrives at Great Waterton he is surprised to see a new steam tram, Flora. He feels Toby will be upset so tries to keep her away from Toby. She soon runs out of coal and then Toby reveals he was nervous about leading the parade alone, so Thomas then has to put things right. \n\n14. &quot;Don't Go Back&quot; \t\nWhile working at the Quarry, Diesel challenges Thomas to race backwards around the Quarry, but cause bump Mavis, Arry and Bert off the rails. Henry arrives to collect his trucks, which Thomas and Diesel were supposed to have loaded with Quarry stone. They eventually finish the job, then have one more race, forwards, as they arrive together at the finishing point. \n \n15. &quot;Gordon Takes a Shortcut&quot; \t\nGordon boasts to Stanley that he never gets lost. He and Stanley must arrive at Great Waterton, whoever arrived first must take Important people, and whoever arrives second must take workmen. Gordon wants to take the important people, so he takes some shortcut's, but gets lost while refusing to be helped by Duck, Oliver and Toad. After an accident with Ben's trucks of logs, which make their way down onto a line, he then asks Ben for help to take the right tracks, with the addition of Oliver, Toad and Duck. He arrives on the line to stop Stanley from hitting the logs, he succeeds, and Gordon now wants Stanley to take the important people. \n\n16. &quot;The Man in the Hills&quot; \t\nThomas and the narrow gauge engines must collect presents for Mr. Percival's birthday. Sir Handel is to tell Mr. Percival and everyone else his 'Man in the Hills' story. He tells the engines that the man is white and has never been found. Thomas believes that he can find him, but fails when presuming that the 'Man in the Hills' is a Baker, or a Miller. He then takes them back to make Mr. Percival's cake and tells Freddie to find the 'Man in the Hills'. Thomas soon finds that he is carved onto a hill for everyone to see. Everyone arrives for the party, as Sir Handel tells everyone his story about the 'Man in the Hills'. \n \n17. &quot;Thomas Puts the Brakes On&quot; \t\nThomas is worried about his brakes as they make funny noises. While ordered to deliver bricks for the repairing of the Sodor River Bridge, Thomas goes on a bumpy tracks which makes the bricks fall out of his trucks, Thomas doesn't know this, then while trying to brake on Gordon's hill, hits some emergency buffers, as more bricks fall off. Thomas finally makes his way to the bridge, but his brakes stop working all together and finds himself dangling on top of the gap of the bridge. With the help of Stanley, Rocky and Murdoch, they recover the bricks and Thomas has his brakes fixed at the yards. He comes back to the River Bridge to thank Stanley for his help. \n\n18. &quot;Percy and the Bandstand&quot; \nA New Bandstand is being built at Great Waterton. Sir Toppham orders Percy to collect Lady Hatt, but not tell her where she is going. But Lady Hatt asks Percy to take her to her favourite places, and Percy becomes worried that they might be late. \n \n19. &quot;Push Me, Pull You&quot; \t\nSkarloey refuses help from Rheneas to pull the Puppet Show train. So he and Rhenas couple the trucks between them and pull all their might to take the load. Skarloey succeeds, but due to the force of the pulling, goes too fast down the line and causes Duncan and Rusty's loads to be damaged. Skarloey eventually lands in Percival pond where Rheneas comes to rescue him. Skarloey comes to his senses, and wants Rheneas to pull the Puppet Show special. Skarloey later brings new loads for Duncan and Rusty. Later, he meets Rheneas back at the Puppet Show and thanks Rheneas for his help. \n\n20. &quot;Best Friends&quot; \t\nPercy wishes that he can pull the Brass Band to a special concert at Great Waterton, so when Thomas is chosen to pull them, he feels bad and cannot bring himself to tell Percy, and goes about his work with the utmost secrecy, doing all he can to avoid being spotted by Percy. When Thomas arrives at Brendam Docks to pick up the band, Percy soon catches him out, and feels very hurt that Thomas never told him. Thomas feels guilty, and makes a deal with the Fat Controller to let Percy bring the Brass Band home again. The Fat Controller agrees, and Percy is delighted. Thomas is proud to have his best friend back again. \n\nFormat: VLC (.flv)\n\nHope you enjoy!","torrent":{"xt":"urn:btih:476ae8fa77675d918ba2467c2896c088d22bf5c8","amp;dn":"Thomas+and+Friends+Season+12+Full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"476ae8fa77675d918ba2467c2896c088d22bf5c8","infoHashBuffer":{"type":"Buffer","data":[71,106,232,250,119,103,93,145,139,162,70,124,40,150,192,136,210,43,245,200]},"announce":[],"urlList":[]}}