{"title":"The Steampunk Megapack By Lovecraft, Poe, Dickens and others","uid":9159676,"size":4788169,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:486dbd2597cbbee08cc0568b4c2d5741dfa5e57c&amp;dn=The+Steampunk+Megapack+By+Lovecraft%2C+Poe%2C+Dickens+and+others&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"maxdesolate","files":4,"time":1383850557,"description":"The Steampunk Megapack: 26 Modern and Classic Steampunk Stories by Jay Lake G.D. Falksen, H.P. Lovecraft, Arthur Conan Doyle, Jillian Venters, Edgar Allan Poe, Mark Twain, John Leavitt , Vincent Starrett, Edgar Rice Burroughs, Charles Dickens, George Griffith, Peter Wordworth, G.K. Chesterton, William Hope Hodgson, E.M. Forster, Evelyn Kriete, John Betancourt, Arthur O. Friel, Brian Stableford.\n\nThe Steampunk Megapack collects 26 tales of high adventure through Victorian and Edwardian eras--past, present, and future!\n\nMIDNIGHT AT VALDOSTA'S, by Jay Lake\nTHE CASE OF THE PECULIAR SAFECRACKER, by G. D. Falksen\nTHE ACQUISITION OF MANDRAKES AND ASSISTANTS, by Jillian Venters\nTHE WHISPERER IN DARKNESS, by H. P. Lovecraft\nTHE BRASS GOGGLE FACTORY WORKER, by John Leavitt\nTHE PATH OF PROGRESS, by Brian Stableford\nTHE TAILED MEN, by Arthur O. Friel\nTHE IMPOSSIBLE MISTER LAPIN INVESTIGATES: THE AFFAIR OF THE TERRIBLE BOAR, by Peter Wordworth\nTHE WAR EFFORT, by Austin H. Williams\nHERBERT WEST: REANIMATOR, by H. P. Lovecraft\nA CONNECTICUT YANKEE IN KING ARTHUR'S COURT, by Mark Twain\nTHE TRUMPETER, by Arthur O. Friel\nTHE MACHINE STOPS by E. M. Forster\nTHE UNPARALLELED ADVENTURES OF ONE HANS PFAAL, by Edgar Allan Poe\nTHE LOST WORLD, by Sir Arthur Conan Doyle\nTHE GATEWAY OF THE MONSTER, by William Hope Hodgson\nA PRINCESS OF MARS, by Edgar Rice Burroughs\nTHE MID-WATCH TRAGEDY, by Vincent Starrett\nMUSTERED OUT, by H. Bedford-Jones\nPAYABLE TO BEARER, by Talbot Mundy\nTHE DEVIL'S HEIRLOOM by Anthony M. Rud\nDOCTOR OX'S EXPERIMENT, by Jules Verne\nTHE TRIAL FOR MURDER, by Charles Dickens\nANGEL OF THE REVOLUTION, by George Griffith\nTHE MAN WHO WAS THURSDAY, by G. K. Chesterton\nTHE HORROR OF THE HEIGHTS, by Arthur Conan Doyle\n\nepub and mobi. ","torrent":{"xt":"urn:btih:486dbd2597cbbee08cc0568b4c2d5741dfa5e57c","amp;dn":"The+Steampunk+Megapack+By+Lovecraft%2C+Poe%2C+Dickens+and+others","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"486dbd2597cbbee08cc0568b4c2d5741dfa5e57c","infoHashBuffer":{"type":"Buffer","data":[72,109,189,37,151,203,190,224,140,192,86,139,76,45,87,65,223,165,229,124]},"announce":[],"urlList":[]}}