{"title":"RealtimeBondage--Destruction of Darling continues! Bent over bac","uid":9967621,"size":786267917,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:48dc0a844456c0f84d45318954d650df959f4692&amp;dn=RealtimeBondage--Destruction+of+Darling+continues%21+Bent+over+bac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"merzedes","files":-1,"time":1397596850,"description":"Destruction of Darling continues! Bent over backwards while on a sybian, brutal deepthroat on BBC! | Darling\n\nApril 15, 2014\n\n\nMP4 only.\n\n\nThe total destruction of Darling continues. This bendy bitch has already been fucked silly and has long ago lost the capacity for rational thought. The endless amounts of relentless top shelf dick has blasted her brain meat into sexual subspace. Not only does Darling look like a total bimbobot, she has been fucked so hard and deep she has actually become one. She not even form coherent sentences.\n\nIt won't be a Darling shoot without showcasing her superpower. This bendy bitch can basically fold herself in half. Backwards. Her extreme back arch has been showcased in many a shoot before, so how do you make it interesting and different? How about fold her back and then stick a sideways sybian between her bound legs? Darling is arched over a custom made wooden bondage device and shackled down in place. Our trusty sybian is drilled in place. Then we flip the switch.\n\nDarling is already an undone mess of flesh wallowing far and deep into sexual subspace. Take a bimbobot and bolt her into the world's most powerful vibrator while shoving huge amounts of cock down her throat hole and she goes from undone to completely blasted. Her tightly tied breasts look like they are going to burst as they jut up to the ceiling. Her whole body is oiled down and gleaming as it arches over. The cock plows her throat without mercy as her eyes roll into the back of her skull and she mutters vague half words.\n\nIt is the unrelenting multiple orgasms that really do her in. Darling cums easy and hard, and she never stops. It is both a blessing and a curse. Long after her mind wants to give up and throw in the towel, her body keeps cumming. Her screams of overwhelming pleasure echo of the rafters as her brain continues its unrelenting slide to complete meltdown. Darling is the living definition of sexually broken and we are not done yet. Next on the list is a DP with two rock hard massive cocks taking her from both holes. Will this bimbobot survive? Or will she break down? We unshackle her and drop her down to her knees to await her fate. \n \nScreens &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2014/04_15darling6/RealTimeBondage-Darling-Destruction-of-Darling-continues-Bent-over-backwards-while-on-a-sybian-brutal-deepthroat-on-BBC.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2014/04_15darling6/RealTimeBondage-Darling-Destruction-of-Darling-continues-Bent-over-backwards-while-on-a-sybian-brutal-deepthroat-on-BBC.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:48dc0a844456c0f84d45318954d650df959f4692","amp;dn":"RealtimeBondage--Destruction+of+Darling+continues%21+Bent+over+bac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48dc0a844456c0f84d45318954d650df959f4692","infoHashBuffer":{"type":"Buffer","data":[72,220,10,132,68,86,192,248,77,69,49,137,84,214,80,223,149,159,70,146]},"announce":[],"urlList":[]}}