{"title":"Teenage Head - Double Header [2 Albums][1980][1982][320 KBPS]","uid":11630356,"size":239790510,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:48fe4b763d26958433f936c4844ddecd960d0dac&amp;dn=Teenage+Head+-+Double+Header+%5B2+Albums%5D%5B1980%5D%5B1982%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"LameDuck69","files":26,"time":1417670734,"description":"Teenage Head - Double Header [2 Albums][1980][1982]\n\n\n\nFrantic City [1980]\n\n\n01 Wild One\n02 Somethin' On My Mind\n03 Total Love\n04 Let's Shake\n05 Infected\n06 Those Things You Do\n07 Somethin' Else \n08 Take It\n09 Brand New Cadillac\n10 Disgusteen\n\n\nSome Kinda Fun [1982]\n\n\n11 Drivin' Wild [My Invader]\n12 Let's Go To Hawaii\n13 Sheila Scarf\n14 Want You To Know\n15 Teenage Beer Drinkin' Party\n16 Shag Shack\n17 Sick Little Man\n18 Some Kinda Fun\n19 Fist To Face\n20 Don't Toy With Me\n21 Let It Show\n\n\n\n\n320 KBPS [CBR]\nCover Art\n\n\n\n\n\nFrom Wikipedia:\n\n\nTeenage Head is a Canadian rock group from Hamilton, Ontario and was a popular Canadian punk rock band during the early 1980s.\n\nThe group was formed in Hamilton by Frankie Venom (Frank Kerr), Gord Lewis, Steve Mahon and Nick Stipanitz. Stipanitz has since been replaced by Jack Pedler, and Venom died of cancer on October 15, 2008.\n\nTeenage Head was formed in 1975 when the band members were students at Westdale High School in Hamilton. By May 1978, they released their first single &quot;Picture My Face&quot; on Epic Records, and their self-titled debut, Teenage Head, followed a year later.\n\nThe band's performance at the The Last Pogo concert on December 1, 1978 at The Horseshoe Tavern in Toronto, ended in a riot and was shut down by the police. The concert was made into a short film by Colin Brunton, The Last Pogo. In 2006, Brunton began a feature-length documentary film about the concert, including additional interviews and footage of Teenage Head. It was released on DVD in 2008 as a tribute to the late Frankie Venom.\n\n1980's Frantic City was the band's breakthrough album, making them stars across Canada with the hit singles &quot;Let's Shake&quot; and &quot;Somethin' On My Mind&quot;. They toured to support that album, including opening the major Heatwave festival in August. In June 1980 their performance at Toronto's Ontario Place sparked a riot. The incident made headlines across the country, and led Ontario Place to ban rock concerts for several years afterward.\n\nIn September 1980, riding high on the success of Frantic City and the band's unintended notoriety, Attic Records, their Canadian label, set up a series of showcase gigs in New York City, hoping to attract a U.S. record deal. Only a few days before their scheduled departure, Lewis was seriously injured in a car accident and the showcase was cancelled. Lewis was temporarily replaced by David Bendeth, although he was able to return in time to play on the 1982 album Some Kinda Fun, which was another success.\n\nTheir 1983 record Tornado was marked by controversy, with the band's new American label MCA Records demanding that they change their name to Teenage Heads to placate the more conservative American audience. The title track was the band's last big hit in Canada.[citation needed]\n\nDuring this time the band appeared, as themselves, in the film Class of 1984 (starring fellow Canadian Michael J. Fox) and performed &quot;Ain't Got No Sense&quot;.\n\nIn 1986, one year after the release of Trouble in the Jungle Venom left the band to form a new group, Frankie Venom and The Vipers. Nick Stipanitz joined the Vipers as well. Venom was replaced by Dave Desroches, aka Dave Rave, who led the band for three years before departing to form his own band, The Dave Rave Conspiracy. Nick later left The Vipers and did a stint with The Tennesse Rockets for a while. Frank and Nick came back to Teenage Head when the group reformed in 1988, but Stipanitz left Teenage Head shortly after the reformation and went into a professional career in drafting and engineering. He was first replaced by Blair Richard Martin of the Raving Mojos, then Mark Lockerbie, who played on the 1996 album &quot;Head Disorder&quot;. Lockerbie was in turn replaced by Jack Pedler.\n\nIn 2003, the band recorded a host of previously released material with Ramones drummer Marky Ramone at Catherine North Studios in Hamilton and Metalworks Studios in Toronto with Ramones producer, Daniel Rey. The resulting album was released in Canada on April 22, 2008, titled Teenage Head with Marky Ramone.\n\nIn the spring of 2007, Teenage Head played in Alberta and British Columbia for the first time in more than ten years. They returned again in the spring of 2008.\n\nOn October 15, 2008, Gord Lewis announced that Frankie Venom had died following a battle with throat cancer.\n\nThe remaining members of the bands continued to perform after Venom's death playing a tribute show for him, and performing at the 2008 Hamilton Music Awards.\n\nIn 2009, longtime fan and friend of the band, Pete MacAulay joined as the new singer, to &quot;take Frankie's space, not his place&quot;.\n\nIn his hometown of Hamilton, Ontario a memorial statue of Frankie Venom had been planned but has been stalled because of criticism of public funds being spent to commemorate a man who used illegal drugs and was once convicted for domestic assault.\n\n--------------------------------------------------------------------------------\n\nFrantic City is the second studio album by Teenage Head. released in 1980. The album was certified Platinum in Canada in 1983.\n\n\nTeenage Head:\n\nFrankie Venom (Kerr):vocals\nGordon Lewis: guitar\nSteve Mahon: bass\nNick Stipanitz: drums, vocals, backing vocals\n\nAdditional Musicians:\n\nRicky Morrison: saxophone\nGrant Slater: piano\n\n--------------------------------------------------------------------------------\n\nSome Kinda Fun is the third studio album by Teenage Head, released in 1982. It was one of the Top 100 albums in Canada of 1982. The album was certified Gold in Canada on April 28, 2014.\n\n\n\nTeenage Head:\n\n\nFrankie Venom (Kerr): vocals, harmonica\nGordon Lewis: guitar\nSteve Mahon: bass\nNick Stipanitz: drums, vocals, backing vocals","torrent":{"xt":"urn:btih:48fe4b763d26958433f936c4844ddecd960d0dac","amp;dn":"Teenage+Head+-+Double+Header+%5B2+Albums%5D%5B1980%5D%5B1982%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48fe4b763d26958433f936c4844ddecd960d0dac","infoHashBuffer":{"type":"Buffer","data":[72,254,75,118,61,38,149,132,51,249,54,196,132,77,222,205,150,13,13,172]},"announce":[],"urlList":[]}}