{"title":"TTC - 1066 (The Conquest) Prof. J Paxton [2012]","uid":7725506,"size":180590624,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4998451761df4cd00bf73ba6b245e29ecbfae7f0&amp;dn=TTC+-+1066+%28The+Conquest%29+Prof.+J+Paxton+%5B2012%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rambam1776","files":-1,"time":1350205269,"description":"1066 - Professor Jennifer Paxton\nGeorgetown University Ph.D., Harvard University\n\nIf you were to look back at hundreds of years of history in search of the one critical moment after which the history of the English-speaking world would never be the same again, it would undoubtedly be the year 1066. It was during this pivotal time that an event occurred that would have untold ramifications for the European continent: the Norman Conquest of England.\n\nBut why does this moment matter so much, both for the medieval world and for us today in the 21st century? While the true meaning and importance of the Norman Conquest has been sharply debated, medievalist and award-winning Professor Jennifer Paxton of Georgetown University argues that the Norman Conquest, and the entire year of 1066, matters deeply for two key reasons.\n\nIt turned England away from a former Scandinavian orientation toward an orientation with mainland Europe, making the island nation a major player in Europe's political, social, cultural, and religious events.\n\nIt created a rich hybrid between English and French culture that had a profound impact on everything from language and literature to architecture and law.\n\nIn fact, it was only with the tumultuous events of the year 1066 that England was equipped to become a full participant in the unprecedented developments of the Middle Ages and the centuries that followed. And with 1066, Professor Paxton's exciting and historically rich six-lecture course, you can experience for yourself the drama of this dynamic year. Taking you from the shores of Scandinavia and France to the battlefields of the English countryside, 1066 will plunge you into a world of fierce Viking warriors, powerful noble families, politically charged marriages, tense succession crises, epic military invasions, and much more.\n\nLectures\n\n1 - The Norman Conquest through History\n2 - England and Normandy before the Conquest\n3 - The Succession Crisis in England\n4 - The Battle of Hastings\n5 - Completing the Conquest\n6 - The Aftermath of the Conquest","torrent":{"xt":"urn:btih:4998451761df4cd00bf73ba6b245e29ecbfae7f0","amp;dn":"TTC+-+1066+%28The+Conquest%29+Prof.+J+Paxton+%5B2012%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4998451761df4cd00bf73ba6b245e29ecbfae7f0","infoHashBuffer":{"type":"Buffer","data":[73,152,69,23,97,223,76,208,11,247,59,166,178,69,226,158,203,250,231,240]},"announce":[],"urlList":[]}}