{"title":"7 Men Who Rule The World From The Grave - Dave Breese","uid":11772878,"size":1347623,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:49dc9f92ce3de0272301cef76910e0b571f67568&amp;dn=7+Men+Who+Rule+The+World+From+The+Grave+-+Dave+Breese&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":1,"time":1427145716,"description":"Though their bodies lie cold and dormant, the grave cannot contain the influence these seven men have had on today's world. They continue to rule because they have altered the thinking of society. They generated philosophies that have been ardently grasped by masses of people but are erroneous and antiscriptural. Today these ideas pervade our schools, businesses, homes, and even the church.\n\nAs we continue to unknowingly subscribe to their philosophies, we keep the grave open for Charles Darwin, Karl Marx, Julius Wellhausen, John Dewey, Sigmund Freud, John Maynard Keynes, and Soren Kierkegaard. Dave Breese warns us of the dangers of believing unreservedly the ideas of these seven men. He also reminds us of the only man whose life and words we can trust completely--Jesus Christ.\n\n\nAbout the author:\nDAVE BREESE (1926-2002) was a graduate of Judson College and Northern Baptist Seminary and also served as president of Christian Destiny Ministries and World Prophetic Ministry. He was an evangelist, author, lecturer, and university speaker who ministered in more than sixty countries. In addition to a widespread broadcast ministry, Dr. Breese wrote several books, including Seven Men Who Rule the World from the Grave, Satan's Ten Most Believable Lies, Living for Eternity, and His Infernal Majesty","torrent":{"xt":"urn:btih:49dc9f92ce3de0272301cef76910e0b571f67568","amp;dn":"7+Men+Who+Rule+The+World+From+The+Grave+-+Dave+Breese","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49dc9f92ce3de0272301cef76910e0b571f67568","infoHashBuffer":{"type":"Buffer","data":[73,220,159,146,206,61,224,39,35,1,206,247,105,16,224,181,113,246,117,104]},"announce":[],"urlList":[]}}