{"title":"The Murder House - James Patterson, David Ellis","uid":12539377,"size":345152106,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:49fe60a312e17b8f6afab2a85b8bc809db5a872f&amp;dn=The+Murder+House+-+James+Patterson%2C+David+Ellis&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":2,"time":1444374200,"description":"Written by James Patterson, David Ellis\r\nRead by Therese Plummer, Jay Snyder\r\nFormat: MP3\r\n\r\nIt has an oceanfront view, a private beach - and a deadly secret that won't stay buried.\r\nNumber Seven Ocean Drive is a gorgeous, multimillion-dollar beachfront estate in the Hamptons, where money and privilege know no bounds. But its beautiful, gothic exterior hides a horrific past: It was the scene of a series of depraved killings that have never been solved. Neglected, empty, and rumored to be cursed, it's known as the Murder House, and locals keep their distance.\r\nDetective Jenna Murphy used to consider herself a local, but she hasn't been back since she was a girl. Trying to escape her troubled past and rehabilitate a career on the rocks, the former New York City cop hardly expects her lush and wealthy surroundings to be a hotbed of grisly depravity. But when a Hollywood power broker and his mistress are found dead in the abandoned Murder House, the gruesome crime scene rivals anything Jenna experienced in Manhattan. And what, at first, seems like an open and shut case turns out to have as many shocking secrets as the Murder House itself, as Jenna quickly realizes that the mansion's history is much darker than even the town's most salacious gossips could have imagined. As more bodies surface, and the secret that Jenna has tried desperately to escape closes in on her, she must risk her own life to expose the truth - before the Murder House claims another victim","torrent":{"xt":"urn:btih:49fe60a312e17b8f6afab2a85b8bc809db5a872f","amp;dn":"The+Murder+House+-+James+Patterson%2C+David+Ellis","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49fe60a312e17b8f6afab2a85b8bc809db5a872f","infoHashBuffer":{"type":"Buffer","data":[73,254,96,163,18,225,123,143,106,250,178,168,91,139,200,9,219,90,135,47]},"announce":[],"urlList":[]}}