{"title":"Beyond The MBA Hype","uid":11961278,"size":66546451,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a2d62fb6f5b4f4bd7782f68015ea00f2b4c3587&amp;dn=+Beyond+The+MBA+Hype&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"chulbu","files":1,"time":1432562248,"description":"MBA is one of the most sought after courses in India and elsewhere. For those more ambitious and steeling themselves for exposure to the global education system however, the situation is slightly different and Indian applicants are slowly growing more aware of their own handicaps when enrolling elsewhere. The MBA application procedure is an extension of the education process and there are considerable differences between the system in India and abroad. The dynamics and the selection process of top business schools abroad are significantly different from how it is adjudged in India.\n\nBeyond The MBA Hype: A Guide To Understanding And Surviving B-Schools is Kamat's bid to address the gap between the know-how and the realities that are present in the process of applying abroad. The book begins with a treatise exploring the reasons behind choosing MBA as a course. The next few chapters investigates and argues why one should choose a career in management and the opportunities available after completing the course. The author deals with application process where tips to improving the profile of an applicant are laid down along with ways to ace the GMAT and then discusses the skill-gap that is inherent in most students when applying to a prestigious program.\n\nThe added benefits that students accrue on account of extracurricular activities and internships are an important facet of the selection process that Kamat pays close attention to through the book. Deciphering the codes embedded within the MBA hype, the book practically equips students with all the technicalities and finer details that help in finding a place in a good Business School. The book also bears the whole truth about the MBA course where classroom involvement and skills are discussed along with the real benefits that students can hope to accrue on completion of their course.\n\nIn addition to targeting the wide world of MBA aspirants, Kamat also hopes to include students, corporate professionals and executives who wish to find an all-inclusive look into the world of Business, and the stereotypes and fallacies along with the realities that are all demystified by Kamat in this book. Beyond The MBA Hype: A Guide To Understanding And Surviving B-Schools was featured in The Times of India bestsellers list after being published","torrent":{"xt":"urn:btih:4a2d62fb6f5b4f4bd7782f68015ea00f2b4c3587","amp;dn":"+Beyond+The+MBA+Hype","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a2d62fb6f5b4f4bd7782f68015ea00f2b4c3587","infoHashBuffer":{"type":"Buffer","data":[74,45,98,251,111,91,79,75,215,120,47,104,1,94,160,15,43,76,53,135]},"announce":[],"urlList":[]}}