{"title":"Marcus Miller - A Night In Monte-Carlo (2011) [FLAC]","uid":6501650,"size":429372678,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4a94e0fb7d9c903f91ef4a222da58d7ad57773b8&amp;dn=Marcus+Miller+-+A+Night+In+Monte-Carlo+%282011%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"cLoudBase","files":13,"time":1309268407,"description":"Bassist, producer, composer, and all-around musician Marcus Miller has been a student and a leader, a creator and an interpreter, a master and a mentor in the art form of music - from his teen years to the present - with many more miles to go before he sleeps...a profound past paving the way to an as yet unfathomable future. Marcus continues this legacy with A Night in Monte-Carlo, a live audio document of an amazing concert he was commissioned to perform on November 29, 2008 in the &quot;rich man's playground&quot; of Monaco - a performance of music of his choice, much of it from his pen, featuring his arrangements for symphony orchestra. It features Marcus leading both his quartet and the Monte-Carlo Philharmonic Orchestra, with special guests: trumpeter Roy Hargrove as well as singer, songwriter and guitarist Raul MidÃƒÂ³n. &quot;I was invited by Jean-RenÃƒÂ© Palacio, the Artistic Director for the principality of Monaco to present some of my music with the orchestra on the French Riviera,&quot; Marcus recalls. No stranger to the area, as he has performed there many times AND played there on his downtime as a race car buff during the Grand Prix, Marcus relished the opportunity of sharing his music in the breathtaking and intimate 600-seat Monte-Carlo Opera House.\n&quot;The ceiling and every wall beneath is adorned with the most unbelievable murals,&quot; Marcus marvels. &quot;The setting was gorgeous.&quot; More amazing were the fabulous musicians of the symphony. &quot;The Monte-Carlo Orchestra was very hip. They were enthusiastic about my music and understood right away the sound I was trying to get,&quot; Marcus enthuses. &quot;After the first day of rehearsal, they all lined up to shake my hand! That put me totally at ease and made this the most satisfying experience I've ever had with a symphony. My band and the orchestra became good friends over those three days of rehearsal.&quot;\n\nThe repertoire for A Night in Monte-Carlo covers nearly a century of music - from two styles of opera to jazz, including a contemporized, spiritual and a timeless ballad. The program opened with a BANG with &quot;Blast!&quot; the GRAMMY?-nominated Middle Eastern-tinged instrumental of futuristic world fusion funk that has been begging for a symphonic treatment since it was birthed on his ninth album, Marcus (2008). Not knowing what to expect, the audience was taken by surprise when the huge sounds of the orchestra and quartet filled the Opera House with this musical Molotov cocktail.\n\nSince this recording was made in 2008, Marcus has presented A Night In Monte-Carlo with the Monte-Carlo Philharmonic featuring Lalah Hathaway and Raul MidÃƒÂ³n for the 50th Anniversary of Jazz a Juan in the summer of 2010, and more recently at the Tokyo Jazz Festival with the NHK Symphony Orchestra featuring Roberta Flack and young trumpeter, Christian Scott. He has tailored each program to include his special guests and plans to continue to do so with various artists for upcoming shows.\n\n\n1. Blast!\n2. So What\n3. State Of Mind\n4. I Loves You Porgy\n5. Amandla\n6. I'm Glad There Is You \n7. Medley: O Mio Babbino Caro / Mas Que Nada\n8. Your Amazing Grace\n9. Strange Fruit\n\t  ","torrent":{"xt":"urn:btih:4a94e0fb7d9c903f91ef4a222da58d7ad57773b8","amp;dn":"Marcus+Miller+-+A+Night+In+Monte-Carlo+%282011%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a94e0fb7d9c903f91ef4a222da58d7ad57773b8","infoHashBuffer":{"type":"Buffer","data":[74,148,224,251,125,156,144,63,145,239,74,34,45,165,141,122,213,119,115,184]},"announce":[],"urlList":[]}}