{"title":"Bulk Image Downloader v2.22 and crack","uid":5386510,"size":11299981,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4abbb8b1b17edfb1f40d9d1ad5da23d44217cdbd&amp;dn=Bulk+Image+Downloader+v2.22+and+crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"leomahesh","files":1,"time":1266916449,"description":"How to use it\n\nFor a comprehensive guide to using BID please read the BID User's Guide .\n\n \n\nIf the current web page you're viewing contains a thumbnailed image gallery simply right click inside the window and select &quot;Open current page with Bulk Image Downloader&quot;. Alternatively if the page contains links to thumbnailed image galleries right click on one of the links and select &quot;Open link target with Bulk Image Downloader&quot;. Either of these actions will launch BID and cause it to immediately scan the page or link for downloable images. Alternatively start BID manually and copy and paste  the URL of the web page containing the images into the &quot;URL to page containing links&quot; edit box. Click on &quot;Scan URL for images&quot; to bring up a list of images that B.I.D. is capable of downloading.\n\n \n\nOnce BID has presented you with a list of images select the ones you don't want and press the Delete key to remove them from the list. You can select multiple images by holding down the Ctrl key while clicking with the mouse.\n\n \n\nDouble click on an image to display the full sized thumbnail. Double click the thumbnail image to download and display the full sized image.\n\n \n\nSelect a download folder and then click on &quot;Download files&quot; to begin downloading the images.\n\n \n\nClick on &quot;Save Batch&quot; to save the download links to a text file. These &quot;.bidlist&quot; saved files can be loaded into B.I.D. by clicking on the &quot;Load Batch/Scan links from file&quot; button.\n\n \n\nTo create a list from multiple sources check the &quot;Append to existing links&quot; checkbox. Links will now be appended to the list instead of replacing the existing list when a URL is scanned or a file is loaded.\n\n \n\nSome image hosts scramble the image filenames. In such a case you can select the &quot;Generate Filenames&quot; checkbox and type in an image prefix. Images will be saved as &quot;PREFIXnnn.jpg&quot; where nnn is the image's sequence number on the list. \n\n \n\nThe &quot;Thumbnails&quot; checkbox toggles the display of image thumbnails within the list.\n\n \n\nIf &quot;Close when download complete&quot; is selected, B.I.D. will close automatically after the last image in the list has been downloaded.\n\n \n\nClick on &quot;Add to Queue&quot; to have the current batch saved and sent to the Queue Manager.\n\n\n\n\n","torrent":{"xt":"urn:btih:4abbb8b1b17edfb1f40d9d1ad5da23d44217cdbd","amp;dn":"Bulk+Image+Downloader+v2.22+and+crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4abbb8b1b17edfb1f40d9d1ad5da23d44217cdbd","infoHashBuffer":{"type":"Buffer","data":[74,187,184,177,177,126,223,177,244,13,157,26,213,218,35,212,66,23,205,189]},"announce":[],"urlList":[]}}