{"title":"Dennis Wilson - Pacific Ocean Blue [1977] [FLAC]","uid":8081866,"size":729068183,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4b045778251376858b844a9cb2ba62bc07f7c648&amp;dn=Dennis+Wilson+-+Pacific+Ocean+Blue+%5B1977%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"dickspic","files":38,"time":1359516918,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\nArtist: Dennis Wilson\nRelease: Pacific Ocean Blue\nDiscogs: 3385946\nReleased: 1977 / 2008\nLabel: Caribou Records, CBS / Legacy\nCatalog#: PZ 34354 / 88697339322\nFormat: FLAC / Lossless / Log (100%) / CD x2, Remastered, Reissue\nCountry: Europe\nStyle: Rock, Pop Rock, Ballad, Funk\n\n\nWe're certainly lucky that Brian Wilson got it together to complete the legendary Smile sessions, his long-languishing answer to Sgt. Pepper's Lonely Hearts Club Band-- many didn't expect him to reach middle age. With brother Dennis there was also a suspicion he would depart before his time and, sadly in that case, those fears came true. Indeed, all three Wilson brothers suffered the physical and emotional scars left by their abusive father, Murry, and the middle Wilson brother coped by living the fast life of a rebellious drifter. He fell in (albeit briefly) with Charles Manson and ran through many wives and girlfriends. Always overshadowed by brothers Brian and Carl, drummer Dennis fell victim to the common misconception that session player Hal Blaine manned the skins exclusively in the studio at Brian's behest. In actuality, Dennis made sporadic but dramatic contributions during even Brian's creative peak, steering the group towards surfing culture and nurturing rough-hewn musical talents before drowning off the shore of Marina del Ray in 1983 at 39.\nBy the mid-1970s, with Brian a troubled recluse and Mike Love angling for more creative control, Dennis Wilson entered the studio with his friend and songwriter Gregg Jakobson; in 1977, he released Pacific Ocean Blue-- a raw, bluesy masterpiece of ocean-worshipping psychedelia. The record was always tough to find, but unlike SMiLE it's no &quot;lost&quot; classic: released around the same time as the middling Love You, Brian's attempt at a 70s comeback, Pacific Ocean Blue actually sold about the same as its counterpart, about 300,000 copies. Problem is, the record was out of print for almost 20 years. Despiite positive critical notices, Dennis was once again swept under the rug.\nPacific Ocean Blue, however, is a wonderful study in Beach Boys surfer soul imbued with the expressiveness of Dennis' piano style. It's also a meditation on a complex world, one devoid of the nostalgic innocence preached by the Mike Love-fronted Beach Boys of late, and its remastered, 2xCD Legacy Recordings release-- the first CD release of the album since 1991-- is astoundingly refreshing\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:4b045778251376858b844a9cb2ba62bc07f7c648","amp;dn":"Dennis+Wilson+-+Pacific+Ocean+Blue+%5B1977%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b045778251376858b844a9cb2ba62bc07f7c648","infoHashBuffer":{"type":"Buffer","data":[75,4,87,120,37,19,118,133,139,132,74,156,178,186,98,188,7,247,198,72]},"announce":[],"urlList":[]}}