{"title":"P.G. Wodehouse - A Few Quick Ones (Jonathan Cecil)","uid":4169731,"size":223884172,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4b405aae92c72d3859e328934590c7442d539c26&amp;dn=P.G.+Wodehouse+-+A+Few+Quick+Ones+%28Jonathan+Cecil%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"deandominic","files":11,"time":1209792950,"description":"General Information\n===================\n Title............: A Few Quick Ones                               \n Author...........: P.G. Wodehouse                \n Read By..........: Jonathan Cecil               \n Genre............: Humor                 \n Publisher........: Chivers Audio Books; Unabridged edition (2002, 2004)\n\nOriginal Media Information\n==========================\n Media............: 6 CDs  \n Condition........: Excellent\n \nFile Information\n================\n Number of MP3s...: 6\n Total Duration...: 6 hours 5 minutes\n Total MP3 Size...: 209 MB\n Ripped by........: deandominic             \n Ripper...........: Exact Audio Copy                                 \n Encoder..........: LAME 3.98b8          \n Encoder Settings.: ABR 80 kbit/s 44100 Hz Mono          \n ID3 Tags.........: Yes v1.1, v2.3 (includes embedded album art)\n\nBook Description\n================\n &lt;a href=&quot;\nhttp://www.bbcaudiobooksamerica.com/productdetails.cfm?PC=7003&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbcaudiobooksamerica.com/productdetails.cfm?PC=7003&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.amazon.com/Few-Quick-Ones-P-Wodehouse/dp/075409605X/ref=ed_oe_a&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Few-Quick-Ones-P-Wodehouse/dp/075409605X/ref=ed_oe_a&lt;/a&gt;\n\ncover http://img261.imageshack.us/img261/3420/pgwodehouseafewquickonezn5.jpg\n\nIn the Wodehouse novels, the plots are merely superstructure upon which to develop hilarious characters, ridiculous situations, side-splitting slapstick and delicious irony about the &quot;upper&quot; classes. In a short story, a Wodehouse plot plays a bigger role.\n\nP.G. Wodehouse obviously had that point in mind when he designed and wrote the stories for A Few Quick Ones. To make the collection a treat, he has given you a sampler of his best characters. Unless you are a devoted Wodehouse reader, you probably don&amp;#039;t know about some of these characters. I recommend that you become acquainted because you may discover many Wodehouse classics that you would otherwise have not met.\n\nAs a result, the stories will be the most fun for those who already know the stories well. Happy memories from other books and stories will help evoke chuckles where others may only grunt and smile.\n\nBut, that wasn&amp;#039;t enough. What else could he do? Well, he could vary the way he plotted the stories so that it was less predictable what was coming next. In the process, he indulged himself in creating delicious ironies. At the same time, several of the stories contain as detailed a plot as occurs in any of his novels.\n\nThe book&amp;#039;s opening story, The Fat of the Land, is an excellent example. Oofy Prosser, the Drone&amp;#039;s club millionaire, is determined to win the fat uncles contest . . . and no amount of skullduggery and oiliness is too much for him. Will he succeed?\n\nThe Oldest Member stories are a treat for all those who love golf, but many people don&amp;#039;t know the stories. Mr. Wodehouse included Scratch Man and Joy Bells for Walter which eloquently show how the divine game and love can go hand-in-hand . . . but not in the ways you expect. There can be danger, too!\n\nThe Right Approach develops a theme that Mr. Wodehouse repeats in the book; don&amp;#039;t assume that you know what someone else is thinking. Much like Shakespeare&amp;#039;s confused lovers, the addled male, Augustus Mulliner, finds himself faced with a horrible contretemps when he attempts to press his suit.\n\nJeeves Makes an Omelette is the book&amp;#039;s only story involving the inimitable Jeeves, and Jeeves swings into action in an unmistakably effective way. The story is made more delightful by one of Aunt Dahlia&amp;#039;s daffy schemes.\n\nThe inimitable Bingo Little also does his stuff in two stories involving his far from beautiful baby son, Algernon Aubrey Little. In both cases, Bingo&amp;#039;s tendency to wager his last cent on a losing nag is the source of the problem. The first is The Word in Season which shows how timing can be everything. The other is Leave It to Algy where Bingo becomes a baby judge.\n\nBig Business is one of the book&amp;#039;s best stories. The book&amp;#039;s theme relates to whether the male or the female of the species is the stronger and wiser.\n\nA Tithe for Charity is a delicious bit of irony about that famously poor man, Stanley Featherstonehaugh Ukridge, in which he temporarily has some funds.\n\nOofy, Freddie and the Beef Trust is one of the best developed of the stories and has enough twists and turns to keep you guessing what might come next for days . . . even though you will read the story in minutes.\n\nUnless you don&amp;#039;t like to laugh, you should read this book! \n","torrent":{"xt":"urn:btih:4b405aae92c72d3859e328934590c7442d539c26","amp;dn":"P.G.+Wodehouse+-+A+Few+Quick+Ones+%28Jonathan+Cecil%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b405aae92c72d3859e328934590c7442d539c26","infoHashBuffer":{"type":"Buffer","data":[75,64,90,174,146,199,45,56,89,227,40,147,69,144,199,68,45,83,156,38]},"announce":[],"urlList":[]}}