{"title":"Roger Martin du Gard - Nobel Prize in Literature, 1937 (5 books)","uid":14550264,"size":30404449,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b82a9cc984eebaf342dc806b7f3dac925ba1619&amp;dn=Roger+Martin+du+Gard+-+Nobel+Prize+in+Literature%2C+1937+%285+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"workerbee","files":12,"time":1462647047,"description":"\nROGER MARTIN DU GARD (1881-1958) was a French novelist and winner of the 1937 Nobel Prize in Literature &quot;for the artistic power and truth with which he has depicted human conflict as well as some fundamental aspects of contemporary life in his novel-cycle LES THIBAULT.&quot;\r\n\r\nTrained as a paleographer and archivist, he brought to his works a spirit of objectivity and a scrupulous regard for detail, and because of his concern with documentation and the relationship of social reality to individual development, his fiction has been linked with the realist and naturalist traditions of the nineteenth century. \r\n\r\nMartin du Gard first attracted attention with JEAN BAROIS (1913), which was set against the historical context of the Dreyfus Affair, and traces the development of an intellectual torn between the Roman Catholic faith of his childhood and the scientific materialism of his maturity.  CONFIDENCE AFRICAINE (1931) manages to address the difficult theme of incest with quiet mastery and seeming effortlessness.\r\n\r\nHe is best known for LES THIBAULT (1922-1940), a monumental eight-part novel cycle published in two volumes in English as THE THIBAULTS (1939) and SUMMER 1914 (1940).  This record of the prosperous Thibault family's development chronicles the social and moral issues confronting the French bourgeoisie from the beginning of the 20th century to the end of World War I.  Reacting against a bourgeois patriarch, the younger son, Jacques, renounces his Roman Catholic past to embrace revolutionary socialism, and the elder son, Antoine, accepts his middle-class heritage but loses faith in its religious foundation.  The outstanding features of the novels are the wide range of human relationships patiently explored, the graphic realism of the sickbed and death scenes, and the dramatic description of European nations being swept into war.\r\n\r\nLIEUTENANT-COLONEL DE MAUMORT (published posthumously in 1983), written over the final eighteen years of his life and still unfinished at the time of his death, sprang from the writer's unflinching examination of the conundrum of our moral ambivalence: why, knowing what is right, do people do wrong?  The result is a work of extraordinary honesty, combining the sweep of his acknowledged master Tolstoy, the penetrating analysis of Proust, and the speculative profundity of Montaigne.\r\n\r\n\r\nThe following books are in PDF format (&quot;The Thibaults&quot; also available in ePUB):\r\n\r\n* Confidence Africaine (Marlboro, 1983).  Translated by Austryn Wainhouse.\r\n\r\n* Jean Barois (Viking, 1949).  Translated by Stuart Gilbert.\r\n\r\n* Lieutenant-Colonel de Maumort (Knopf, 2000).  Translated by Luc Brébion and Timothy Crouse.\r\n\r\n* Nobel Acceptance Speech (Nobel Prize Library, 1971).\r\n\r\n* Summer, 1914 (John Lane, 1940).  Translated by Stuart Gilbert.\r\n\r\n* The Thibaults (Viking, 1939).  Translated by Stuart Gilbert. -- PDF + ePUB\r\n \r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                             \nhttps://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:4b82a9cc984eebaf342dc806b7f3dac925ba1619","amp;dn":"Roger+Martin+du+Gard+-+Nobel+Prize+in+Literature%2C+1937+%285+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b82a9cc984eebaf342dc806b7f3dac925ba1619","infoHashBuffer":{"type":"Buffer","data":[75,130,169,204,152,78,235,175,52,45,200,6,183,243,218,201,37,186,22,25]},"announce":[],"urlList":[]}}