{"title":"Jacques Audiard - Sur Mes Levres - Read My Lips - Sobre Meus Lab","uid":3983622,"size":1071438711,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4bbe5fa02dfb0278b01816b73c17a42407ce0516&amp;dn=Jacques+Audiard+-+Sur+Mes+Levres+-+Read+My+Lips+-+Sobre+Meus+Lab&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"sonicalchemy","files":4,"time":1200689705,"description":" &lt;a href=&quot; http://www.imdb.com/title/tt0274117/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0274117/&lt;/a&gt;\n\nEn sept ans, Jacques Audiard n&amp;#039;a realise que trois films. Une preuve que loin de la boulimie de realisation dont font souvent preuve certains cineastes, un peu de recul et de reflexion peuvent s&amp;#039;averer utiles. Regarde les hommes tomber en 1994 et Un heros tres discret en 1996 l&amp;#039;avaient design? comme un realisateur a suivre, avec Sur mes levres , il confirme le bien qu&amp;#039;on pensait de sa mise en scene. Lui qui avoue ne pas faire du cinema d&amp;#039;abord pour &quot;se faire plaisir&quot; mais parce qu&amp;#039;il a des choses a dire et ? montrer, signe donc une troisieme oeuvre ecrite intelligente et maetrisee.\n\nLa trentaine bien sonnee, Carla joue toujours les secretaires dans une entreprise d&amp;#039;immobilier. Au bureau elle fait tout : decroche le telephone, classe les fichiers, envoie les faxs et gere les dossiers. Pas evident dans un monde d&amp;#039;hommes, surtout lorsqu&amp;#039;on porte deux protheses auditives et qu&amp;#039;on a pas un physique tout de suite attirant. Tout cela change lorsqu&amp;#039;elle est embauchee pour aider Paul, un ex-taulard aux ongles sales, un morceau d&amp;#039;homme mal degrossi au front aussi bas que ses cheveux sont longs. Elle va lui apprendre le travail et l&amp;#039;efficacite, il lui ouvrira les yeux sur le monde. Ce n&amp;#039;est qu&amp;#039;ensuite qu&amp;#039;ils pourront s&amp;#039;aimer, lorsque leurs trajectoires, au depart confuses vouees a les separer, les amaneront a se trouver.\n\nPar petites touches - le film est constitu? d&amp;#039;une multitudes de courtes s?quences - Jacques Audiard, second? de Tonino Benacquista a l&amp;#039;ecriture, fait vivre son film pour et par ses personnages. Des personnages qui evoluent et font evoluer l&amp;#039;ensemble de belle fa?on. Apres une premiere partie autour du travail de Paul et Carla, le film bascule dans une deuxieme dans une ambiance de polar un peu farcesque. Sous la camera de Jacques Audiard, habile maetre d&amp;#039;oeuvre de cet edifice a l&amp;#039;equilibre aussi reussi qu&amp;#039;il est fragile,\n\nEmmanuelle Devos et Vincent Cassel revelent quelques talents insoupeonnes. Emmanuelle Devos y confirme un talent affet? chez Arnaud Desplechin, sur les planches ou le petit ecran; quant a Vincent Cassel, separe de sa clique d&amp;#039;amis, il compose un personnage profond debarrasse de tout ses habituels tics. Un film qui tient a ses personnages bien ecrits et bien joues mais aussi a la mise en scene tres effacee mais toujours porteuse du regard de Jacques Audiard. Carla et Paul evoluent, c&amp;#039;est cela qui fait la richesse du film, parce ces personnages agissent et reagissent loin des pantins interchangeables qui remplissent ordinairement les films. Les mots ne comptent que peu, ne revelent pas grand-chose, le changement est d&amp;#039;abord a percevoir a travers les corps. Des corps que le realisateur film a juste distance, sans brusquerie mais sans concession non plus.\n\nL&amp;#039;equilibre incertain entre les genres - ni tout a fait une chronique humaine, ni tout a fait un petit polar - et entre les histoires joue aussi pour beaucoup dans la reussite du film. Une production qui confirme non seulement les qualites de Jacques Audiard mais egalement celles de Vincent Cassel et d?Emmanuelle Devos.\n\nJacques Audiard combines disability, insecurity, love, revenge, and intensity to form his modern thriller Sur mes l?vres. The film is set in the unwelcoming offices and dirty underworld of Paris in 2002. It follows a storyline where a lonely woman, burdened by disability and lack of respect, takes comfort in a younger man who enters her life. The man is by no means perfect, but neither is the woman. The two make sacrifices for one another, and together they advance through scandalous operations while falling in love along the way.\n\nThe woman/heroine in this movie, Carla, is introduced immediately with a shot of her putting her earpiece in. The audience automatically feels some sympathy for Carla&amp;#039;s impairment, which makes it more distressing to watch her cope with her job as an overworked and underappreciated secretary for a construction company. It isn&amp;#039;t until she faints from the exhaustion of picking up after her unpleasant coworkers that Carla accepts the boss&amp;#039;s offer of hiring an intern to lighten her load. Carla&amp;#039;s loneliness is expressed by the gender specific criteria she uses to advertise for the position of her new assistant.\n\nPaul is an ex-con who is not nearly qualified to be Carla&amp;#039;s assistant, but Carla is strangely attracted to his looks and decides to hire him. She yearns for intimacy with a man, but she is overly desperate. Seeing the potential in Paul, she decides to take the chance with him; for he may possess the cure to her loneliness.\n\nCarla (Emmanuelle Devos) a secretaria numa imobiliaria. Mulher pouco atraente, ela parece habitar um mundo distante dos demais e a acentuada surdez de que padece sublinha ainda mais esse pormenor. Paul (Vincent Cassel) ? um ex-presidiario que acaba contratado como paquete de Carla. Ele e tudo o que ela nao ? ? ignorante, sedutor e ares de bom malandro ? mas tera certamente aquilo que Carla necessita. Ela que possui um trunfo forte: le discretamente nos labios dos que a rodeiam. Em breve, o mundo de ambos sofrera uma acentuada mutacao.\n\nRealizado por Jaques Audiard, um antigo argumentista, o filme trabalha sobre uma logica de identificacao de fraquezas pessoais entre dois seres que, em ultima analise, leva a uniao de forcas entre os mesmos. Dito de outra forma, o que se trata aqui a de algo tao velho quanto a historia dos homens porque ligado a propria essencia humana: o preenchimento de vazios de vidas trilhadas por alguma insatisfacao existencial, que e idealizado de modo a alcancar-se a compensacao mental (e fisica) de todas as frustracoes ate entao vividas. Um ponto nada lateral e mesmo essencial para o sucesso desse feito reside na paixao que e provocada pela sensualidade dos corpos. Neste caso, dos corpos de Emmanuelle Devos e Vincent Cassel.\n\nNuma gestao apurada (quase perfeita, mesmo) de valores esteticos em ligacao com um elevado rigor tecnico, a tematica do filme e trabalhada de um modo extremamente adequado e de molde a granjear para si uma abordagem plena de apreciavel valor cinematografico. Pela variedade de componentes de que dispoe a narrativa torna-se igualmente algo inadequado afirmar-se que estamos aqui perante um simples ?thriller?, comedia negra ou ate drama psicologico. A eficicia na manipulacao das emocoes que e levada a cabo entre luzes e sombras faz deste, afinal, um filme que capta um pouco de cada um desses generos. E mesmo que alguma acentuacao de frugalidade que se pressente ter existido possa provocar, amiade, um claro sentimento de por ali ter existido um determinado pretensiosismo criativo, isso nao chega a colocar em causa o valor global do filme. Um filme que em caso algum deve deixar de ser visto.\nFuncionaria modelo e extremamente dedicada ao trabalho, Carla e uma secretaria que as voltas com um salario miseravel e uma deficiencia auditiva ve suas chances de crescer profissionalmente reduzidas a quase nada. Sua vida tem uma reviravolta com a contratacao do estagiario Paul, um jovem recem-saido da prisao.\n\nCast (elenco)\n\n\nVincent Cassel (Paul), Emmanuelle Devos (Carla), Olivier Gourmet (Marchand), Olivier Perrier (Masson), Olivia Bonamy (Annie), Bernard Alane (Morel), C?line Samie (Josie) , and Pierre Diot (Keller), Fran?ois Loriquet (Jean-Fran?ois), Serge Boutleroff (Mammouth), David Saracino (Richard Carambo), Christophe Van de Velde (Louis Carambo (as Christophe Vandevelde), B? Gaultier de Kermoal (Le Barman), Lo?c Le Page (Quentin), Nathalie Lacroix (L&amp;#039;Employ?e ANPE)\n\nSoundtrack (trilha sonora):\n\n# &quot;Chartsengrafs&quot;\n(J. Lytle)\nPerformed by Grandaddy\n(c) Deadlineless c/o BMG Music Publishing France\nBy kind permission of BMG Music Vision\n(p) 2000 V2 Records Inc.\nBy kind permission of V2 Music Ltd and V2 Music Publishing France\n\n\n# &quot;Zobi la mouche&quot;\n(William Orbit Remix)\n(N. Rota / J.M. Paulus)\nPerformed by Les N?gresses Vertes\n(c) EMI Virgin Music Publishing France &amp; SNC LNV\nBy kind permission of Editions EMI Virgin Music Publishing &amp; Delabel Editions\n(p) 1991 LNV\nBy kind permission of Virgin France\n\n\n# &quot;Lella&quot;\n(Wezzan/Guez)\n(c) (p) BMG Music Publishing\n\n\n# &quot;Hands Up&quot;\n(Daspit &amp; Lewis)\n(c) (p) EMI Music Publishing\n\n\n# &quot;Never Tell You&quot;\n(Von Oswald / Ernestus / St Hilaire)\nPerformed by Rhythm and Sound / Tikiman\n(c) Editions BCP c/o BMG Ufa Musikverlage\nc/o BMG Music Publishing France\nBy kind permission of BMG Music Vision\n\n\n# &quot;La Mouche&quot;\n(DJ Falcon Remix)\n(Philippe Zdar / Boom Bass)\nPerformed by Cassius\n(c) 1999 Motor Bass / Arr?tez Ecoutez\n(p) 1998 Hubert Blanc-Francard\nBy kind permission of Virgin France\n\n\n# &quot;Make It Funky&quot;\n(Shaw &amp; Rogers)\n(c) (p) Atmosphere/BMG Music Publishing UK\n\n\n# &quot;Positive Education&quot;\n(Slam Remix)\n(Orde Meikle / Stuart McMillan / G. Gibbons / J. Muotune)\nPerformed by Slam\n(c) Soma Music\n(p) 1993 Soma Records Ltd\nWith kind permission of Labels/Virgin France\n\n\n# &quot;Space Trucker&quot;\n(NFMO)\n(c) (p) EMI Music Publishing\n\n\n# &quot;Slam-Dunkin 1&quot;\n(Tom McCarthy)\n(c) (p) EMI Music Publishing\n\n\n# &quot;Marseille Is in the House&quot;\n(Bruizza / Zenn &amp; Baron, for Al-Khemya)\nPerformed by Electrocypher\n(c) 2000 La Cosca\n(p) 2000 Virgin France\nBy kind permission of Virgin France\n\n\n# &quot;Last Dance (and I come over)&quot;\n(Fafa Monteco Vocal Mix Edit)\n(Fabrice Texier / Fafa / Mike 303 / St?phane B.)\nVocals written &amp; performed by Everis Pellius\nPerformed by Superfunk\n(c) Fiat Lux/Delabel Editions\n(p) 2000 Fiat Lux\nWith kind permission of Virgin France\n\n\n# &quot;Ritmo Americano&quot;\n(Marti Vilardeba Miro / Daniel Portavella Dameson / Joan Garriga Martinez)\nPerformed by Dusminguet\n(c) Warner Chappell Music Spain\nWith kind permission of Warner Chappell Music France S.A.\n(p) 2001 Virgin Records Espana\nWith kind permission of Virgin France\n\n\n# &quot;Goa Tribe&quot;\n(Mark Carlos Blackwell)\n(c) (p) EMI Music Publishing\n\n\n# &quot;The Child&quot;\n(Alex Gopher)\nPerformed by Alex Gopher\n(c) Tong/Edward B Marks\n(p) 1999 Disque Solid\nCourtesy of V2 Music and Disques Solid\n&quot;The Child&quot; contains a sample of &quot;God Bless the Child&quot;\nWritten by Billie Holiday and Arthur Herzog Jr.\nPerformed by Billie Holiday\nUsed courtesy of Edward B. Marks Music Inc and MCA Records\nUnder license from Universal Music Special Markets, Inc.\n\n\n# &quot;Make It Happen (Radio Edit)&quot;\n(Trevor Jackshon / K Deconick / Kyra)\nPerformed by Playgroup\n(c) Universal Music Publishing Ltd/Copyright control\nWith kind permission of Universal Music Projets Sp?ciaux\n(p) 2000 Mawlaw 388 Ltd\nWith kind permission of Source/Virgin France\n\n\n# &quot;Till You Drop&quot;\n(Griffiths)\n(c) (p) Atmosphere/BMG Music Publishing UK\n\n\nSize 1021 mb\nSource 720 x 576\nOutput 718 x 552\nAnamorphic 1021 X 552\nFramerate (FPS) same as source 25 fps\nBitrate 1500\nEncoder Xvid\nAudio French (AC3) (5.1 ch)\nDolby Pro Logic II\nSample rate 48 khz\nBitrate 128 kbps\ndual pass deinterlace - Slow\nSubtitles: English, Portuguese Brasil, Portuguese\n\nCooperate and leave the film seeding at least 2 times after download finishes. Thank you for you&amp;#039;re cooperation\n\nCoopere, deixe semeando ao menos duas vezes o tamanho do arquivo que baixar. Obrigado pela sua cooperacao\n\nEnjoy! Apreciez! Apreciem!\n\nsonicalchemy\t","torrent":{"xt":"urn:btih:4bbe5fa02dfb0278b01816b73c17a42407ce0516","amp;dn":"Jacques+Audiard+-+Sur+Mes+Levres+-+Read+My+Lips+-+Sobre+Meus+Lab","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bbe5fa02dfb0278b01816b73c17a42407ce0516","infoHashBuffer":{"type":"Buffer","data":[75,190,95,160,45,251,2,120,176,24,22,183,60,23,164,36,7,206,5,22]},"announce":[],"urlList":[]}}