{"title":"Doc McStuffins Season 2, Episodes 24-26 + shorts","uid":11976422,"size":890697426,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4bc30907572fe67c2fb6d44e90d4cf4f94087885&amp;dn=Doc+McStuffins+Season+2%2C+Episodes+24-26+%2B+shorts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"NantoVision","files":14,"time":1433032849,"description":"Doc McStuffins is an Irish-made (with American voice actors) animated pre-school children's television series produced by Brown Bag Films for The Disney Channel and Disney Junior. It was created and executive produced by Humanitas Prize and Emmy Award-winner Chris Nee and premiered on March 23, 2012. The series chronicles a six-year-old girl named Dottie McStuffins who, one day, wants to become a doctor like her mother. As a kid, she &quot;pretends&quot; to be a doctor by fixing up toys and dolls (because of this, everyone calls her 'Doc'). When she puts on her stethoscope, toys, dolls, and stuffed animals magically come to life and she can communicate with them. With a little help from her stuffed animal friends, Stuffy, Hallie, Lambie and Chilly, Doc helps toys &quot;feel better&quot; by giving them check-ups and checking their illnesses with &quot;The Big Book of Boo Boos&quot;. Each 11-minute episode includes original songs, the &quot;Time for Your Check-Up&quot; song and the &quot;I Feel Better&quot; song.\n\nHere's the rest of season two, along with nine episodes (out of ten) of &quot;The Doc Files&quot; shorts that are shown between programs on The Disney Channel. If I ever find the missing short (The Case of Mr. Chomp's Chompers) I will post that as well.\n\nAfter your download completes, please leave the torrent open for as long as possible so that it will be fully seeded for others to enjoy. I'm still busily getting caught up on encoding shows since TPB came back, if people continue to seed I will start uploading season three episodes soon.\n\nIf you enjoy this upload (or any of my other children's television uploads), feel free to leave me a comment! And check out my video collecting blog: nantovision at blog spot dot com","torrent":{"xt":"urn:btih:4bc30907572fe67c2fb6d44e90d4cf4f94087885","amp;dn":"Doc+McStuffins+Season+2%2C+Episodes+24-26+%2B+shorts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bc30907572fe67c2fb6d44e90d4cf4f94087885","infoHashBuffer":{"type":"Buffer","data":[75,195,9,7,87,47,230,124,47,182,212,78,144,212,207,79,148,8,120,133]},"announce":[],"urlList":[]}}