{"title":"Gynecologic Oncology Handbook [PDF] [StormRG]","uid":10800833,"size":2035446,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4bd0139ef9788b0d4ad54cdddf7a83ef2200e7b7&amp;dn=Gynecologic+Oncology+Handbook+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"0xmovva","files":2,"time":1408346254,"description":"Author: Michelle Benoit MD (Author), M. Yvette Williams-Brown MD (Author), Creighton Edwards MD (Author)\nPaperback: 366 pages\nPublisher: Demos Medical; 1 edition (May 18, 2013)\nLanguage: English\nISBN-10: 1620700050\nISBN-13: 978-1620700051\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nGynecologic Oncology Handbook provides a comprehensive yet concise, practical guide for fellows, residents, specialist trainees, and clinicians in the diagnosis and management of gynecologic cancers. The book addresses the fundamentals of gynecologic oncology, including staging, surgical therapies, comorbidity diagnosis and management, adjuvant therapies including chemotherapy and radiation, and survival and palliative care. With a focus on specific management decision-making, the book provides the basic information needed to guide the clinician on the ward or in the clinic, including clinical study references, medical comorbidity algorithms, and directed gynecologic cancer workups and treatments. In a bullet point format, the book provides the resources you need to meet the demands of clinical management in gynecologic cancer care.\n\nGynecologic Oncology Handbook features:\n\nCovers all fundamentals of gynecologic oncology including, staging, surgical therapies, comorbidity diagnosis and management, adjuvant therapies, and background study data\nExamines survivor care and palliative care practices\nIncludes clinical study references, medical comorbidity algorithms, and directed workups and treatments\nWritten in bullet-point format for quick reference","torrent":{"xt":"urn:btih:4bd0139ef9788b0d4ad54cdddf7a83ef2200e7b7","amp;dn":"Gynecologic+Oncology+Handbook+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bd0139ef9788b0d4ad54cdddf7a83ef2200e7b7","infoHashBuffer":{"type":"Buffer","data":[75,208,19,158,249,120,139,13,74,213,76,221,223,122,131,239,34,0,231,183]},"announce":[],"urlList":[]}}