{"title":"The Lovin' Spoonful - Anthology (1990)","uid":8633098,"size":453992217,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4c14872e92c2d7a3d1c25d700e98569b42325c09&amp;dn=The+Lovin%27+Spoonful+-+Anthology+%281990%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":41,"time":1372684254,"description":"This is the same torrent that was uploaded to Demonoid in October 2008.\n\n\nThe Lovin' Spoonful - Anthology (1990)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/61466VSWXPL._SL500_AA240_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/61466VSWXPL._SL500_AA240_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop. (Includes 8 page folder.)\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio Excerpt from All Music:\n\nRight on the tails of the Beau Brummels and the Byrds, the Lovin' Spoonful were among the first American groups to challenge the domination of the British Invasion bands in the mid-'60s. Between mid-1965 and the end of 1967, the group was astonishingly successful, issuing one classic hit single after another, including &quot;Do You Believe in Magic?,&quot; &quot;You Didn't Have to Be So Nice,&quot; &quot;Daydream,&quot; &quot;Summer in the City,&quot; &quot;Rain on the Roof,&quot; &quot;Nashville Cats,&quot; and &quot;Six O'Clock.&quot;\n\nLike most of the folk-rockers, the Lovin' Spoonful were more pop and rock than folk, which didn't detract from their music at all. Much more than the Byrds, and even more than the Mamas &amp; the Papas, the Spoonful exhibited a brand of unabashedly melodic, cheery, and good-time music, though their best single, &quot;Summer in the City,&quot; was uncharacteristically riff-driven and hard-driving. More influenced by blues and jug bands than other folk-rock acts, their albums were spotty and their covers at times downright weak. As glorious as their singles were, they lacked the depth and innovation of the Byrds, their chief competitors for the crown of best folk-rock band, and their legacy hasn't been canonized with nearly as much reverence as their West Coast counterparts. ...\n\nTo read the entire bio: &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:3ifpxqe5ldfe~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:3ifpxqe5ldfe~T1&lt;/a&gt;\n\nAll Music Album Review:\n\nUnquestionably the finest collection of a major band that did much to launch American folk-rock in the mid-'60s. Anthology jams 26 cuts onto a single CD, including all of their hits and some of their strongest album tracks, drawing mostly from their 1965-1966 prime. As for the more interesting non-smashes, these include the original version of John Sebastian's &quot;Younger Girl,&quot; which was a hit in a more commercial version by the Critters; the minor 1967 hit &quot;She Is Still a Mystery,&quot; a dreamily psychedelic number that holds its own with their other standards, but has somehow been forgotten by oldies radio; and &quot;Good Time Music,&quot; recorded early in 1965 for an obscure Elektra sampler (and a small hit in a cover version by the Beau Brummels). The most overlooked find here is the instrumental &quot;Lonely (Amy's Theme),&quot; from the early Francis Ford Coppola film You're a Big Boy Now, a lushly orchestrated, melancholy tune featuring Sebastian's wistful harmonica. There are also little-known Sebastian originals, with vocals, from You're a Big Boy Now and Woody Allen's early screen venture What's Up, Tiger Lily? The accompanying booklet features comments from Sebastian himself about some of the group's most famous songs.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:w9fexqq5ld6e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:w9fexqq5ld6e&lt;/a&gt;\n\nReviews and for sale here: &lt;a href=&quot; http://www.amazon.com/dp/B0000032RY&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B0000032RY&lt;/a&gt;\n\nTrack List:\n\n01. Good Time Music\n02. Do You Believe In Magic\n03. You Didn't Have To Be So Nice\n04. Did You Ever Have To Make Up Your Mind\n05. You Baby\n06. Younger Girl\n07. Fishin' Blues\n08. Daydream\n09. Jug Band Music\n10. Didn't Want To Have To Do It\n11. Summer In The City\n12. Pow!\n13. Rain On The Roof\n14. Nashville Cats\n15. Full Measure\n16. Lovin' You\n17. Coconut Grove\n18. Darling Be Home Soon\n19. You're A Big Boy Now\n20. Lonely (Amy's Theme)\n21. Six O'clock\n22. She Is Still A Mystery\n23. Money\n24. Younger Generation\n25. Never Going Back\n26. Me About You\n","torrent":{"xt":"urn:btih:4c14872e92c2d7a3d1c25d700e98569b42325c09","amp;dn":"The+Lovin%27+Spoonful+-+Anthology+%281990%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c14872e92c2d7a3d1c25d700e98569b42325c09","infoHashBuffer":{"type":"Buffer","data":[76,20,135,46,146,194,215,163,209,194,93,112,14,152,86,155,66,50,92,9]},"announce":[],"urlList":[]}}