{"title":"Orbital - Orbital (Green Album) (FLAC - EAC)","uid":6513345,"size":508848049,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4c7d34f91fd584891cfb95ff049bd011b6420a25&amp;dn=Orbital+-+Orbital+%28Green+Album%29+%28FLAC+-+EAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":-1,"time":1309721918,"description":"\n\nOrbital: Profile\n\nOne of techno's most celebrated and accomplished partnerships, the brothers Paul and Phil Hartnoll\ntrace their beginnings as Orbital back to the late 1980's, when their first single, &quot;Chime&quot; was released\non Oh-Zone/FFRR and broke into the British Top 20 in the spring of 1990. The single was made in their\ngarage using their father's four-track recorder and mastered directly onto cassette, but became a smash\nhit, giving them the momentum for a handful of other singles and their untitled first CD (the &quot;green album&quot;)\nin 1991.\n\nTheir career took off in 1993-1994, with the release of the EPs &quot;Lush&quot; and &quot;Radiccio&quot; and their second\nuntitled album (the &quot;brown album&quot;), which took the public by storm and made the UK Top 30. They also\ncontinued to hone their famous live act, which featured live projections, live musical arranging and\nsequencing on the fly, making their shows entertaining, improvised and truly &quot;live&quot;. Their appearance at\nthe 1994 Glastonbury Festival in the UK became the stuff of legend and cemented their reputation as\none of the best techno groups of the 1990's. Their subsequent albums saw them taking a more varied,\nintrospective angle to their music, while at the same time captivating audiences worldwide with their\nrelentlessly energetic live shows. In addition to their own productions, they have done remixes for EMF,\nQueen Latifah, Meat Beat Manifesto, Madonna, Kraftwerk and more. More recently, they compiled a\nvolume for the Back To Mine series, released a retrospective compilation called Work, and put out\nThe Blue Album, their last album.\n\nIn mid-2004, Orbital released one final single, &quot;One Perfect Sunrise&quot;, and then seemingly split up for good.\nHowever, after several years of solo production, Paul &amp; Phil reunited in 2009, and a long series of live gigs\nhas followed, as well as a new double A single, &quot;Don't Stop Me&quot; / &quot;The Gun is Good&quot;.\n\n\n\n\nAlbum Reviews (c/o amazon)\n\nA truly special album that defined a generation of club music and bedroom\ntechno. Any album containing the masterpieces Chime, Midnight and Belfast is likely to be a\nclassic, even if the other tracks are bulgarian monastic chanting. But they're not. Steel Cube\nIdolatry and Oolaa are special in their own right and the whole album just works seamlessly.\nAll in an essential LP if you were a club goer in the early 90s or you want a flavour of what it\nwas like when dance music got epic.\n\nThis LP for me epitomises what Orbital are (or were) all about. A lot of people say\nthat the Brown album is the one. Both albums are old in terms of techno music and I wouldnt even\nsay that they were groundbreaking. After all, the first Orbital LP came out what seemed an eternity\nafter the singles contained on it (2 years later which is a vey long time after to release an LP). Its the\nsimplicity that does it for me. The build ups on these tracks are so simple. You get one sound doing\nits thing for 32 beats then another sound is introduced for the same period of time and so on and\nso on. The whole LP is built his way. It is this style which sets itself apart from the brown album which\nis good, BUT, It fixes itself in a period of time that will always sound likes its from 94. When you listen\nto Kraftwerk, you are listening to innovation in techno music that has a real robotic feel to it. You listen\nto Kraftwerk because you are into where it all comes from historically. I cant listen to the Brown album\nin this way whereas its predecessor has that real early techno vibe and is the basis of Orbital's sound.\nEverything following that would never sound like that but would follow or fit in with what was going on\nmusically at the time. It would still sound like Orbital but you have to go to the roots to get the real deal.\n\nThe Green album sounded dated when it first came out! If you dont remember, there was stuff like\nMescalinium United which still sounds like the sound of the future today. It just didnt sound up-to-date\nlike that and most of the people I played it to, had not really been on the scene as long as me and were\nlistening to the Begium and German stuff. The sound of the Green LP has more appeal now and will\ncontinue to have more appeal as time goes on whereas the tracks that were from Germany and may\nhave sounded new and fresh then, you wouldn't dream of playing now. Its a funny thing. If I were asked\nto reccomend an Orbital album, It would be this. It is what made them. Its their sound. It has Chime,\nMidnight and Belfast all on one side. Just for that - this is it. The rest is fantastic too. Just dont expect\nnew synth sounds. It about the composition, the build-up and the breakdowns. Its so simple but so\neffective. Nobody did it like Orbital did.\n\n\n\n\n---------------------------------------------------------------------\nOrbital - Green Album\n---------------------------------------------------------------------\n\n\nArtist...................................: Orbital\nAlbum................................: Green Album\nGenre.................................: Electronic\nSource........................................: CD\nYear........................................: 1991\n\nRipper: Exact Audio Copy V1.0 b1 &amp; HP DVD RW AD-7701H\n\nCodec...........: Free Lossless Audio Codec (FLAC)\nVersion.........: reference libFLAC 1.2.1 20070917\nQuality.......: Lossless, (avg. compression: 60 %)\nChannels..............: Stereo / 44100 HZ / 16 Bit\nTags...............................: VorbisComment\n\nInformation..: Original 1991 European Pressing\n\nRipped by..............: BSW on 7/3/2011\nPosted by..............: BSW on 7/3/2011\nNews Server..........: news.astraweb.com\n\nNews Group(s).: alt.binaries.sounds.mp3.metal.full.albums\n\nIncluded....: NFO, SFV, M3U, LOG, CUE\nCovers................: Front Back CD\n\n\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n\n\n1. The Moebius [07:01]\n2. Speed Freak [07:16]\n3. Oolaa [06:21]\n4. Desert Storm [12:05]\n5. Fahrenheit 303 [08:24]\n6. Steel Cube Idolatry [06:34]\n7. High Rise [08:22]\n8. Chime (Live) [05:56]\n9. Midnight (Live) [06:53]\n10. Belfast [08:06]\n11. (I Think It's Disgusting) [00:51]\n\n\nPlaying Time..............: 01:17:53\nTotal Size...............: 479.87 MB\n\nNFO generated on.....: 7/3/2011 4:38:44 PM\n\n\n\n---------------------------------------------------------------------\n\nOrbital's first album, commonly referred to as the &quot;Green Album&quot;.\n\nContains hidden 11th track entitled &quot;I Think It's Disgusting&quot;,\nwhich was not available elsewhere until the '99 re-release on FFRR.\n\nBarcode (Text): 0 42282 82482 0\nBarcode (String): 042282824820\nMatrix Number: 828 248-2 02\n\n---------------------------------------------------------------------\n\n\n:: Generated by Music NFO Builder v1.21a - www.nfobuilder.com ::","torrent":{"xt":"urn:btih:4c7d34f91fd584891cfb95ff049bd011b6420a25","amp;dn":"Orbital+-+Orbital+%28Green+Album%29+%28FLAC+-+EAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c7d34f91fd584891cfb95ff049bd011b6420a25","infoHashBuffer":{"type":"Buffer","data":[76,125,52,249,31,213,132,137,28,251,149,255,4,155,208,17,182,66,10,37]},"announce":[],"urlList":[]}}