{"title":"Great Ages of Man - Historic India (History Arts Ebook).pdf","uid":11116488,"size":26960229,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ccfdd6f41af33a32cc4a4316c331f72c5710e84&amp;dn=Great+Ages+of+Man+-+Historic+India+%28History+Arts+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1411859172,"description":"Pdf / English / 1969 by Time-Life Books / 192 Pages / 25.7 MB\n\nThis book provides a concise overview of India's pre-colonial history, beginning 2,000 plus years BCE in the northern (now, Pakistan) part of the subcontinent. While not much is known about the early Dravidian and Harappan cultures, India as we know it today emerged during the Vedic Age (1500-500 BCE) and through the influence of the Aryan invaders. Later, the Mauryan Empire dominated the landscape, most prominently under the influence of the (Buddhist) King, Ashoka. After the breakup of that dynasty, the Gupta Empire (320-467 CE) united much of India and this, in time, broke into smaller kingdoms. Moslem invaders came in the 8th, 12th and 16th centuries. The last Moslem wave produced Akbar and his grandson, Shah Jahan, who built the Taj Mahal in memory of his wife. The book ends with the Moslem period and skips British period and India's independence.\n\nGiven its long history and its geographical position relative to the near East, Europe and the far East, India's influence has not perhaps received the recognition it is due. Trading routes and the intermingling of cultural beliefs and intellectual ideas from its many invasions put India at the center of numerous cross-fertilizing currents. Key ideas from the Upanishads are strikingly similar to early Greek thought. The Upanishads were also clearly central to Schopenhauer's philosophy. The Buddhism that began in India (and now is void of its presence) spread to China and to Southeast Asia. By concentrating on a few main themes, &quot;Historic India&quot; does a good job of making a reader appreciate this country's rich and influential history.\n\nBob Nichols","torrent":{"xt":"urn:btih:4ccfdd6f41af33a32cc4a4316c331f72c5710e84","amp;dn":"Great+Ages+of+Man+-+Historic+India+%28History+Arts+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ccfdd6f41af33a32cc4a4316c331f72c5710e84","infoHashBuffer":{"type":"Buffer","data":[76,207,221,111,65,175,51,163,44,196,164,49,108,51,31,114,197,113,14,132]},"announce":[],"urlList":[]}}