{"title":"The Waterboy(1998)DVDRip.AC3(ENG)-DROCK","uid":6875091,"size":734009344,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4cd9b56b8491461fdbff1321b5bf9592e36a419c&amp;dn=The+Waterboy%281998%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"drock232","files":-1,"time":1323386048,"description":"As with his previous films, comedian Adam Sandler and writing partner Tim Herlihy have conceived a simple premise, character, and title, and peppered their creation with visual sight gags. The story concerns Bobby Boucher, a Louisiana-born-and-bred kid living in the swamps with his overbearing, alligator-eating mom (Kathy Bates). Bobby is a water boy for the local college football team, and a damn good one, even good at turning a deaf ear at the ridicule he gets from the players and coach (Jerry Reed). But when Bobby is fired from his job, he is forced to continue his water management skills at the rival college, a losing team with a washed-up coach (Happy Days\\' \\&quot;The Fonz,\\&quot; Henry Winkler). It\\'s here that the coach teaches Bobby to channel his anger, and he makes a surprising discovery. The water boy can tackle like no one he\\'s ever seen. Forced to keep his football talents from his mom, Bobby soon joins the college as a student and learns that there\\'s more to life than alligator stew. He even falls for a perky ex-con (Fairuza Balk) who teaches Bobby about the birds and the bees. As Bobby leads his team toward victory, they get an invitation to play in the annual Bourbon bowl against his old college rivals. Bobby must choose between the love of his ailing mother and the glory of the final game -- or maybe there\\'s a way he can get both. \n\nRipped with Autogk.\n\nLength: 1 Hour 30 Minutes\n\nFile Type: AVI\n\nFrame Width: 560\n\nFrame Height: 304\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 128 kbps","torrent":{"xt":"urn:btih:4cd9b56b8491461fdbff1321b5bf9592e36a419c","amp;dn":"The+Waterboy%281998%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cd9b56b8491461fdbff1321b5bf9592e36a419c","infoHashBuffer":{"type":"Buffer","data":[76,217,181,107,132,145,70,31,219,255,19,33,181,191,149,146,227,106,65,156]},"announce":[],"urlList":[]}}