{"title":"N.T. Wright - Luke for Everyone (pdf)","uid":8209642,"size":3357229,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d2aeba14b4eb6bc670c67c71849330f8b517576&amp;dn=N.T.+Wright+-+Luke+for+Everyone+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1362208457,"description":"N. T. Wright - Luke for Everyone (Westminster John Knox Prress, 2001). 319 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nFourth in the series of &quot;New Testament for Everyone&quot; commentaries by the great Anglican biblical scholar. See my other torrents for other books in the series. If all goes well, the whole series will be posted on tpb soon.\n\nDescription:\n\nN.T. Wright has undertaken a tremendous task: to provide guides to all the books of the New Testament, and to include in them his own translation of the entire text. Each short passage is followed by a highly readable discussion, with background information, useful explanations and suggestions, and thoughts as to how the text can be relevant to our lives today. A glossary is included at the back of the book. The series is suitable for group study, personal study, or daily devotions.\n\nReview\n\nIn this series [Wright] excels as a communicator, making this the most exciting study guide since Barclay's Daily Study Bible. -- Expository Times\n\nIf you wish to meet the Jesus who broke into people's lives while on earth, I heartily recommend these guides. -- The Christian Herald\n\n&quot;A rare event: a commentary that is learned without being stuffy, accessible without being reductionist. Tom Wright joins us in our homes and workplaces, our sanctuaries and classrooms, in genial, prayerful conversation over this text that forms our lives, the New Testament scriptures.&quot; -- Eugene Peterson, Professor Emeritus of Spiritual Theology, Regent College, and author of The Message\t\t","torrent":{"xt":"urn:btih:4d2aeba14b4eb6bc670c67c71849330f8b517576","amp;dn":"N.T.+Wright+-+Luke+for+Everyone+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d2aeba14b4eb6bc670c67c71849330f8b517576","infoHashBuffer":{"type":"Buffer","data":[77,42,235,161,75,78,182,188,103,12,103,199,24,73,51,15,139,81,117,118]},"announce":[],"urlList":[]}}