{"title":"Natural Gas Hydrates, 2nd Edition 2009 - A Guide for Engineers (","uid":5032461,"size":6790862,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d666533fb1e4c686ada106d18fe8c047387cec9&amp;dn=Natural+Gas+Hydrates%2C+2nd+Edition+2009+-+A+Guide+for+Engineers+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"malestrom_HH","files":2,"time":1248971298,"description":" &lt;a href=&quot;http://bayimg.com/nAcbMaAcp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/nAcbMaAcp&lt;/a&gt;\n\nJohn Carroll, &quot;Natural Gas Hydrates, Second Edition: A Guide for Engineers&quot;\nGulf Professional Publishing | 2009 | ISBN: 0750684909 | 248 pages | PDF\n\nThe petroleum industry spends millions of dollars every year to combat the formation of hydrates - the solid, crystalline compounds that form from water and small molecules - that cause problems by plugging transmission lines and damaging equipment. They are a problem in the production, transmission and processing of natural gas and it is even possible for them to form in the reservoir itself if the conditions are favorable.\n\nNatural Gas Hydrates is written for the field engineer working in the natural gas industry, This book explains how, when and where hydrates form, while providing the knowledge necessary to apply remedies in practical applications, . New to the second edition, the use of new inhibitors: Kinetic Inhibitors and Anticoagulants and the topic of kinetics of hydrates. How fast do they form? How fast do they melt? New chapters on Hydrates in Nature, hydrates on the seafloor and a new section has also been added regarding the misconceptions about water dew points. Chapters on Hydrate Types and Formers, Computer Methods, Inhibiting Hydrate Formation with Chemicals, Dehydration of Natural Gas and Phase Diagrams Hydrate Dehydration of Natural Gas and Phase Diagrams have been expanded and updated along with the companion website\n\n\n* Understand what gas hydrates are, how they form and what can be done to combat their formation\n* Avoid the same problems BP experienced with clogged pipelines\n* Presents the four most common approaches to evaluate hydrates: heat, depressurization, inhibitor chemicals, and dehydration.\n\n","torrent":{"xt":"urn:btih:4d666533fb1e4c686ada106d18fe8c047387cec9","amp;dn":"Natural+Gas+Hydrates%2C+2nd+Edition+2009+-+A+Guide+for+Engineers+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d666533fb1e4c686ada106d18fe8c047387cec9","infoHashBuffer":{"type":"Buffer","data":[77,102,101,51,251,30,76,104,106,218,16,109,24,254,140,4,115,135,206,201]},"announce":[],"urlList":[]}}