{"title":"Expert Guide To Oral Sex, Part Two - Fellatio","uid":6086140,"size":1113161136,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4d89533abfe879a1143df83b70d6891376ab045c&amp;dn=Expert+Guide+To+Oral+Sex%2C+Part+Two+-+Fellatio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"c0napelud0","files":1,"time":1294336374,"description":"Women attend a fellatio workshop lead by sex expert Tristan Taormino, where she teaches about male sexual anatomy and offers explicit advice and detailed examples to improve and enhance your oral sex skills. She welcomes her co-hosts Roxy and Christian who then demonstrate various techniques for the crowd as Tristan narrates what they are doing; workshop participants watch and ask questions. After the workshop, we meet Kaiya and Alec, who discuss their thoughts about oral sex and share some of their tips and tricks for maximum pleasure. Kaiya gives Alec an enthusiastic blow job while illustrating the benefits of different positions and stimulation techniques. Next, we meet Lindsey and Marcos and watch as they explore this intimate activity with an incredible display of honesty, vulnerability, and intensity. Through generous, throughful communication, their trust and connection builds before your eyes. As Lindsey experiments with different ways to use her hands and mouth for stimulation, her impressive skills bring Marcos intense pleasure and the heat between them is palpable. Her efforts culminate in an earth shattering orgasm for him.\nStarring: Roxy Deville, Christian, Kaiya Lynn, Alec Knight, Adrianna Nicole, Lindsey Meadows, Marcos Leon","torrent":{"xt":"urn:btih:4d89533abfe879a1143df83b70d6891376ab045c","amp;dn":"Expert+Guide+To+Oral+Sex%2C+Part+Two+-+Fellatio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d89533abfe879a1143df83b70d6891376ab045c","infoHashBuffer":{"type":"Buffer","data":[77,137,83,58,191,232,121,161,20,61,248,59,112,214,137,19,118,171,4,92]},"announce":[],"urlList":[]}}