{"title":"OPERATIVE DICTATIONS IN ORTHOPEDIC SURGERY, SPRINGER [dovah]","uid":8903358,"size":3373840,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d8c4ce214455e99cc8c6217eb473b9922dcc7ba&amp;dn=OPERATIVE+DICTATIONS+IN+ORTHOPEDIC+SURGERY%2C+SPRINGER+%5Bdovah%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dovah12","files":1,"time":1378857363,"description":"\n\nAUTHOR : SAID SAGHIEH, STUART L. WEINSTEIN, JAMAL J. HOBALLAH\n\n\nPUBLISHER : SPRINGER\nLANGUAGE : ENGLISH\nFORMAT : pdf\nRELEASE DATE : 2013/08/22\nISBN : 9781461474791 - STORE DATE : 2013\n\n\n\n\nUnique tool for orthopedics surgical residents and residents in practice\nProvides a preparatory aid for the oral board examination\nWritten by authorities in orthopedic surgery\n\nOperative Dictations in Orthopedic Surgery is a valuable resource for teaching orthopedic surgical trainees and practicing orthopedic surgeons how to document their operative procedures. The book includes the majority of the commonly performed orthopedic procedures. For each procedure, a list of common indications is given, covering 95% of the situations in which particular procedures will be used, as well as a list of essential steps. This is then followed by a list intended to prompt the surgeon for particular details to note and dictate within the template, a list of possible complications that are typically associated with a particular surgical procedure, and templates of operative dictation that allow the surgeon to individualize their dictations. Ample space is also provided to allow each surgeon to add notes.\n\nConcise and easy to use, Operative Dictations in Orthopedic Surgery is a unique tool for orthopedics surgical residents and residents in practice that better prepares them to participate actively and learn as much as possible in the operating room.\n\nContent Level Â» Professional/practitioner\n\nKeywords Â» Acetabular shelf - Anterior tibialis - Cervical laminoplasty - ORIF - Open reduction DDH - Pemberton osteotomy - Salter osteotomy - Vertebroplasty - supracondylar fracture - tibial plateau fracture\n\nRelated subjects Â» Orthopedics - Surgery ","torrent":{"xt":"urn:btih:4d8c4ce214455e99cc8c6217eb473b9922dcc7ba","amp;dn":"OPERATIVE+DICTATIONS+IN+ORTHOPEDIC+SURGERY%2C+SPRINGER+%5Bdovah%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d8c4ce214455e99cc8c6217eb473b9922dcc7ba","infoHashBuffer":{"type":"Buffer","data":[77,140,76,226,20,69,94,153,204,140,98,23,235,71,59,153,34,220,199,186]},"announce":[],"urlList":[]}}