{"title":"Taylor: The Essenes, the Scrolls and the Dead Sea (2012)","uid":8264972,"size":5800064,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e0fa8e1248c81082a5cf53d30e97fa1e90c1d36&amp;dn=Taylor%3A+The+Essenes%2C+the+Scrolls+and+the+Dead+Sea+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"workerbee","files":-1,"time":1363466757,"description":"Joan E. Taylor, The Essenes, the Scrolls, and the Dead Sea. Oxford University Press, 2012.\n\nISBN: 9780199554485 | 418 pages | PDF\n\nEver since the discovery of the Dead Sea Scrolls in caves near the site of Qumran in 1947, this mysterious cache of manuscripts has been associated with the Essenes, a &quot;sect&quot; configured as marginal and isolated. Scholarly consensus has held that an Essene library was hidden ahead of the Roman advance in 68 CE, when Qumran was partly destroyed. With much doubt now expressed about aspects of this view, The Essenes, the Scrolls and the Dead Sea systematically reviews the surviving historical sources, and supports an understanding of the Essenes as an influential legal society, at the centre of Judaean religious life, held in much esteem by many and protected by the Herodian dynasty, thus appearing as &quot;Herodians&quot; in the Gospels.\n\nOpposed to the Hasmoneans, the Essenes combined sophisticated legal expertise and autonomy with an austere regimen of practical work, including a specialisation in medicine and pharmacology. Their presence along the north-western Dead Sea is strongly indicated by two independent sources, Dio Chrysostom and Pliny the Elder, and coheres with the archaeology. The Dead Sea Scrolls represent not an isolated library, quickly hidden, but burials of manuscripts from numerous Essene collections, placed in jars in caves for long-term preservation. The historical context of the Dead Sea area itself, and its extraordinary natural resources, as well as the archaeology of Qumran, confirm the Essenes' patronage by Herod, and indicate that they harnessed the medicinal material the Dead Sea zone provides to this day.\n\nJoan E. Taylor is a historian of early Christianity and Second Temple Judaism. She is also known for her work in other areas of history, literature, archaeology, and biblical studies. A New Zealander, she currently lives in England, and works in the department of Theology and Religious Studies, King's College London.\n","torrent":{"xt":"urn:btih:4e0fa8e1248c81082a5cf53d30e97fa1e90c1d36","amp;dn":"Taylor%3A+The+Essenes%2C+the+Scrolls+and+the+Dead+Sea+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e0fa8e1248c81082a5cf53d30e97fa1e90c1d36","infoHashBuffer":{"type":"Buffer","data":[78,15,168,225,36,140,129,8,42,92,245,61,48,233,127,161,233,12,29,54]},"announce":[],"urlList":[]}}