{"title":"Drive SnapShot v1.42 with Key [TorDigger]","uid":8052220,"size":3654076,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4e33e38c02fa16d2de4bf0f431e3d9e26ec3a8e1&amp;dn=Drive+SnapShot+v1.42+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TorDigger","files":10,"time":1358881147,"description":"Drive SnapShot\n\nSnapShot is disk imaging software that enables the user to back up, restore and view backed up hard disk data, easily and safely. Snapshot Backup is aimed at the backup/disaster recovery market. There is little use for on the fly disk image creation, if you want to deploy hundreds or thousands of workstations. We think however, that the possibility to do on the fly backup is very important for the end user to regularly protect his data. At least, this was our reason to create Snapshot. No need to shut down and boot from floppy, no need to create network disks, and no need to wait half an hour for the backup process - we think that's nice. Snapshot View is a very easy and powerful method to explore disk images. This technique could be easily adapted to disk images created by other disk imaging programs.\n\nFeatures:\n\n&quot;Creating a backup disk image while running Windows\n&quot;The ability to perform other tasks on your PC during image creation\n&quot;Using the latest technology for backup\n&quot;Easily restore or use of individual files or directories\n&quot;Creating a virtual image of the disk\n&quot;The use for the virtual disk in any file manager\n&quot;Full recovery disk in case of loss of data\n&quot;Restoring a system partition requires the use of DOS, the restoration of the remaining sections may under Windows\n&quot;Supporting the work with the file systems FAT16, FAT32, NTFS\n&quot;Compatible with all types of RAID-arrays\n&quot;Easy and comprehensive interface with command line\n&quot;The ability to automate frequently performed tasks\n\nSystem Requirements:\n\nWindows NT 4.0 Service pack 3, 2000, XP, 2003 Server, Vista, 2008, 7, 2008 R2, PE, Windows-X64\n2 MB disk space + space to save the disk images.\n8MB RAM if active, 0 MB if not active.\nYou need administrative rights to execute Drive Snapshot\n\nHomepage: http://www.drivesnapshot.de/en/index.htm\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given information in key.txt file.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.\n","torrent":{"xt":"urn:btih:4e33e38c02fa16d2de4bf0f431e3d9e26ec3a8e1","amp;dn":"Drive+SnapShot+v1.42+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e33e38c02fa16d2de4bf0f431e3d9e26ec3a8e1","infoHashBuffer":{"type":"Buffer","data":[78,51,227,140,2,250,22,210,222,75,240,244,49,227,217,226,110,195,168,225]},"announce":[],"urlList":[]}}