{"title":"Roman Building Materials and Techniques","uid":4841485,"size":45975614,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e91da6f0cd18e6b7bbe44348643821718de07e9&amp;dn=Roman+Building+Materials+and+Techniques&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"philmccrevice","files":1,"time":1239523837,"description":"Roman architecture is extraordinarily rich, both in terms of the techniques and materials used and in the variety of buildings constructed, many of which are still visible today.\nNow in paperback, Roman Buildings places emphasis on the technical aspects of that architecture, following the process of building through each stage, from quarry to standing wall, from tree to roof timbers. The author examines the different techniques involved in building in brick and in stone and wood, and how these materials were obtained or manufactured. He also discusses interior decoration and looks at the practical aspects of water supply, heating and roads. Each type of building required special tools and these are described, using both surviving examples and modern parallels.\nThe Romans constructed many spectacular feats of engineering, producing magnificent monuments such as the Pantheon and Pont du Gard. This book looks at these large-scale public buildings but also at more modest homes and shops. The result is a thorough and systematic examination of Roman building, with over 750 illustrations","torrent":{"xt":"urn:btih:4e91da6f0cd18e6b7bbe44348643821718de07e9","amp;dn":"Roman+Building+Materials+and+Techniques","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e91da6f0cd18e6b7bbe44348643821718de07e9","infoHashBuffer":{"type":"Buffer","data":[78,145,218,111,12,209,142,107,123,190,68,52,134,67,130,23,24,222,7,233]},"announce":[],"urlList":[]}}