{"title":"FSX - A2A F4U Corsair Classic Warbird By ePyrate","uid":6040037,"size":89386363,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4ee6238aeccae172a606cfb83d4a6ff9ea7ca5ce&amp;dn=FSX+-+A2A+F4U+Corsair+Classic+Warbird+By+ePyrate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ePyrate","files":1,"time":1292353524,"description":"***Support WikiLeaks***\n***Support Free Internet***\n\nLets try this again...hopefully you can get the torrent.\n\nShe was affectionately or sometimes not so affectionately known by her pilots as the Bent-Wing Bird, the Ensign Eliminator, Hose Nose, Hog Nose, Sweetheart or Hog. Their choice of handle for this bird usually depended on their latest adventure within the 4 1/2 to 7 ton envelope of this solid but occasionally quirky airframe.\n\nThe F4U was born and bred to be a killer and she excelled at this endeavor, laying claim to an astonishing eleven to one kill ratio by the end of WWII. That doesn't include the unfortunate Ensigns who had so many problems trying to land the long-nosed bird on a carrier that the Navy finally gave up. They assigned the F4U to the Marines who quickly learned to love her for her superior fighting ways. \n\nIn her final form, which was the F4U-4, she was certainly in the running for the &quot;Best Fighter of WWII&quot;. The F4U-4 could out climb the P-51 Mustang by almost 800 feet per minute and had exceptional speed at low and mid altitudes. \n\nThe F4U Corsair launches the Aircraft Factory for those who want to fly their favorite aircraft but their budget is obviously important. This aircraft stays true to stock Microsoft Flight Simulator X SDK standards, which streamlines the development process and delivers a highly compatible product.\n\nThe F4U Corsair is truly a unique aircraft with it's bent wings, long nose, and powerful engine. We have had a lot of fun flying her and believe you will as well.\n\n\nThe Aircraft Factory F4U Corsair FEATURES\n\nThe premier WWII Fighter in the Pacific Theater.\n\nF4U-1A, F4U-1C, and F4U-1D models included\n\nFull feature support with FSX Service Pack 2 or Acceleration\n\nDetailed aircraft with realistic texturing\n\nClassic radial-engine sounds inside and out\n\nAnimated pilot looks around as you fly\n\nA2A / Shockwave 3D lights supported\n\n3D instrumentation for smooth response\n\nDrop wing tanks remove both fuel and weight when released\n\nUnder-wing rockets can be added or removed with a single click\n\n\n","torrent":{"xt":"urn:btih:4ee6238aeccae172a606cfb83d4a6ff9ea7ca5ce","amp;dn":"FSX+-+A2A+F4U+Corsair+Classic+Warbird+By+ePyrate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ee6238aeccae172a606cfb83d4a6ff9ea7ca5ce","infoHashBuffer":{"type":"Buffer","data":[78,230,35,138,236,202,225,114,166,6,207,184,61,74,111,249,234,124,165,206]},"announce":[],"urlList":[]}}