{"title":"The Mark of the Beast - Dr. Peter S. Ruckman","uid":11773660,"size":6225779,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f4b61d0c25d630cf7c68894dec37027b4ea0cc1&amp;dn=The+Mark+of+the+Beast+-+Dr.+Peter+S.+Ruckman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":3,"time":1427179732,"description":"Outside of the Lord Jesus Christ Himself, the Antichrist is the most notable figure in the Bible. This prophetic figure is known as &quot;the Beast&quot; in Revelation, being pictured by eighteen types throughout the word of God. This book is an expose of the religious system Satan uses to bring in the false church, false Christ, and false government of the last days. In this work, Dr. Ruckman makes an extensive study from the scriptures of the name, mark, number, letter, religion, race, and physical characteristics of the Antichrist. The purpose in presenting these facts is to call to the readers' attention the truth that only one Book is able to prove itself by successfully predicting the future events that take place in history.\n\nThe most exhaustive treatment of the Antichrist, showing his name, mark, number, letter, religion, physical characteristics, and music, plus eighteen types of the Antichrist in scripture.\n\n\nAbout the author:\nDr. Peter S. Ruckman received his Bachelor of Arts degree from the University of Alabama and finished his formal education with six years of training at Bob Jones University (four full years and two accelerated summer sessions), completing requirements for the Master of Arts and Doctor of Philosophy degree.\nReading at a rate of seven hundred words per minute, Dr. Ruckman had managed to read about 6,500 books before receiving his doctorate, and he still reads an average of a book each day.\nDr. Ruckman stands for the absolute authority of the Authorized Version and offers no apology to any recognized scholar anywhere for his stand. In addition to preaching the gospel and teaching the Bible, Dr. Ruckman has produced a comprehensive collection of apologetic and polemic literature and resources supporting the authority of the Authorized Version of the Holy scriptures","torrent":{"xt":"urn:btih:4f4b61d0c25d630cf7c68894dec37027b4ea0cc1","amp;dn":"The+Mark+of+the+Beast+-+Dr.+Peter+S.+Ruckman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f4b61d0c25d630cf7c68894dec37027b4ea0cc1","infoHashBuffer":{"type":"Buffer","data":[79,75,97,208,194,93,99,12,247,198,136,148,222,195,112,39,180,234,12,193]},"announce":[],"urlList":[]}}