{"title":"The Struggle for Tennessee (Time-Life Civil War)","uid":11750619,"size":36038296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f8150ecb1bb611868aa9e23770abacbf5a7bf22&amp;dn=The+Struggle+for+Tennessee+%28Time-Life+Civil+War%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"STBGD","files":1,"time":1426193980,"description":"Pdf / English / 1985 Time-Life / 176 pages / 34.3 MB / ISBN10 0809447606\n\n&quot;This book looks at the 1862 (and early 1863) fighting in the West. By now the Union has control of Nashville and has actually made inroads into Alabama and Mississippi. However, poor Federal leadership under Maj. Gen. Don Carlos Buell has resulted in the initiative going over to the Confederates and a poorly-coordinated offensive by two seperate armies under Kirby Smith and Braxton Bragg initially succeed in capturing Kentucky's capital at Frankfort and threatening Louisville and Cincinnati. The Battle of Perryville and a hard march back into Tennessee resulted in depleted Confederate forces but Maj. Gen. William Rosecrans, now in command of the Army of the Cumberland, gives them time to regroup before he ends of fighting Bragg at the Battle of Stones River, southeast of Nashville.\n\nThe book covers the last period in which the Union and Confederate armies were more or less evenly matched. The Confederate hopes that Kentuckians would rise up once their fellow southerners entered the state proved to be illusionary. While the Kentucky regiments already in Confederate service would remain until decimated, Union regiments raised in Kentucky as a result of the invasion would see service in both eastern and western theaters. Meanwhile, in the coming months a far more determined Union offensive would threaten to cut the Confederate rail lines around Chattanooga.\n\nWell illustrated with artwork, photos (including pictures of Civil War relics) and maps. Sidebars include Panic Along the Ohio, Nashville Under Federal Rule, Cannon Makers for the Confederacy, An Artist's Look at the Army of the Cumberland, The Craft of Field Artillery, Carrying the Colors on the Battlefield, Kentucky's Exiled Soldiers and Battlescapes from an Infantryman.&quot;\n\nAmazon","torrent":{"xt":"urn:btih:4f8150ecb1bb611868aa9e23770abacbf5a7bf22","amp;dn":"The+Struggle+for+Tennessee+%28Time-Life+Civil+War%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f8150ecb1bb611868aa9e23770abacbf5a7bf22","infoHashBuffer":{"type":"Buffer","data":[79,129,80,236,177,187,97,24,104,170,158,35,119,10,186,203,245,167,191,34]},"announce":[],"urlList":[]}}