{"title":"UDEMY-Welch Way Creating a Winning Strategy","uid":9345544,"size":421829055,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4fda6b23d95ff478195fd58a1cddcae5d46739bd&amp;dn=UDEMY-Welch+Way+Creating+a+Winning+Strategy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Endroid","files":-1,"time":1387035059,"description":" &lt;a href=&quot;https://www.udemy.com/welch-way-creating-a-winning-strategy/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;https://www.udemy.com/welch-way-creating-a-winning-strategy/&lt;/a&gt;\n\nDoes the thought of having to develop and execute a business strategy terrify you or excite you? Do you even know where to begin or what tools you will need? Are you being asked to present your ideas on how to grow your business, but are unclear what your first step should be?\n\nFor many of us, Strategy Development is shrouded in mystery. It is made up of the secrets shared in the hallowed halls of great business schools and plotted by senior executives behind closed doors and known only be the chosen few.\n\nBut Jack Welch has a different take on it. He teaches that strategy is lifeblood of an organization and that it needn't be complicated nor secretive. During his time as CEO of General Electric, Jack created a strategy development model that was used by all managers to assess their businesses and make decisions about where to go next.\n\nThe model was designed to cut through the clutter, ask the questions that really mattered and &quot;execute like hell&quot; to get it done. That model is presented in this course along with dozens of practical tips directly from Jack on what it takes to win.\n\nIf you had the opportunity to learn strategy from one of the greatest business leaders of all time, would you take him up on the offer?\n\nA Certificate of Completion is presented to all students who complete this course.\n\nAdvance your career. Some employers may provide tuition reimbursement that would cover or assist with the cost of this course - check with your employer.\n","torrent":{"xt":"urn:btih:4fda6b23d95ff478195fd58a1cddcae5d46739bd","amp;dn":"UDEMY-Welch+Way+Creating+a+Winning+Strategy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fda6b23d95ff478195fd58a1cddcae5d46739bd","infoHashBuffer":{"type":"Buffer","data":[79,218,107,35,217,95,244,120,25,95,213,138,28,221,202,229,212,103,57,189]},"announce":[],"urlList":[]}}