{"title":"Ellen Allien - Dust 2010 (flac)","uid":6439363,"size":281763565,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:504ddfc257d45f98eafdb810fea775929272f471&amp;dn=Ellen+Allien+-+Dust+2010+%28flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"barber9","files":-1,"time":1306936958,"description":"Ellen Allien, born Ellen Fraatz (born 1969), is a German electronic musician, music producer and founder of BPitch Control music label. She lives in Berlin, Germany. She sings in both German and English. She has said that one of the main inspirations for her music is the culture of reunified Berlin; her album Stadtkind was dedicated to the city. Her music is best described as a blend of IDM and electro music, which is dance-floor oriented, yet at the same time has noticeable experimental elements.\n\nEllen was born in Berlin in 1969. Her father played guitar and piano. During 1989, she lived in London where she first came into contact with electronic music. When she later returned to Berlin, electronic music had become increasingly popular in Germany. In 1992, she became resident DJ in the Bunker, Tresor and in E-Werk. She started her own show on the Berlin radio station Kiss-FM and created her own record label, calling them both Braincandy. Due to discrepancies with disk sales, she gave Braincandy up in 1997 and instead, organized parties with the name, B Pitch. Allien created the label BPitch Control in 1999. The label's releases from Sascha Funke and Tok Tok were particularly successful. Allien released her first album, Stadtkind (city child), in 2001, and Berlinette in 2003, After releasing Thrills, Allien created a BPitch sub-label for minimal tech and minimal house, called Memo Musik, in 2005. Orchestra of Bubbles, in collaboration with Apparat, featurings songs like Way Out and Jet, was released in 2006.\n\nDuring the same year, Ellen Allien launched her own fashion line, which can be seen as an extension of her philosophy of life. Ellen Allien Fashion combines a smart perspective onto fashion, music, art, and traveling to an overarching existence, which is meant to be shared. Exploring the globe, street life, Ellen Allien develops her own intuition for materials, forms and designs. In her most recent collection, Night Flowers (Ellen Allien Fashion spring-summer 2010), she created a complete look made of a mixture of black floral lace, white and black floral stitched cotton and summer wool. Featuring hazy prints of dancing people on loose cut t-shirts, each detail transports the feeling of Night Flowers. We are the night flowers, and in those special moments, when the music and the crowd become one, we magically blossom at the turn of dusk\n\nDust is Ellen Alliens seventh full-length as a producer. This time around she worked with the similarly busy Tobias Freund, who is also a mainstay in the Berlin electronica world. Dust is being handled by Allien's own BPitch Control label, and Allien describes it as having a warm immediacy compared with her previous efforts.\n\n\n 1  Our Utopie \t\n 2  Flashy Flashy \t\n 3  My Tree (Clarinet - Andreas Ernst)\n 4  Sun The Rain (Guitar, Bass - Tom Krimi)\n 5  Should We Go Home \t\n 6. Ever \t\n 7  You (Percussion, Hihat - Miguel Toro, Guitar, Bass - Tom Krimi)\n 8  Dream \t\t\n 9  Huibuh  (Bongos - Miguel Toro)\n10  Schlumi (Clarinet - Andreas Ernst)\n","torrent":{"xt":"urn:btih:504ddfc257d45f98eafdb810fea775929272f471","amp;dn":"Ellen+Allien+-+Dust+2010+%28flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"504ddfc257d45f98eafdb810fea775929272f471","infoHashBuffer":{"type":"Buffer","data":[80,77,223,194,87,212,95,152,234,253,184,16,254,167,117,146,146,114,244,113]},"announce":[],"urlList":[]}}