{"title":"Johnny Cash - Songs of Our Soil [1959] [EAC/FLAC]","uid":10544390,"size":174877611,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:508d0396998fe02dde7c015292facf60980b8165&amp;dn=+Johnny+Cash+-+Songs+of+Our+Soil+%5B1959%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":-1,"time":1405267006,"description":"FLAC / Lossless / Log /cue\nLabel/Cat#: Legacy / Sony Music Distribution #86792\nCountry:USA\nYear: August 27, 2002\nGenre: country\nFormat: CD, Album,\n\n\n1. Drink To Me\n2. Five Feet High And Rising\n3. The Man On The Hill\n4. Hank And Joe And Me\n5. Clementine\n6. The Great Speckled Bird\n7. I Want To Go Home\n8. The Caretaker\n9. Old Apache Squaw\n10. Don't Step On Mother's Roses\n11. My Grandfather's Clock\n12. It Could Be You (Instead Of Him)\n\n2002 Bonus Tracks:\n13. I Got Stripes\n14. You Dreamer You\n\n\n\n\nOriginally recorded and released in the late fifties, &quot;Songs Of Our Soil&quot; proves that throughout the many years that Johnny Cash has been making music, he has been consistent in quality song-writing and the unique sound that only he could produce. Even though many of the songs lyrics were or are considered to be folk, Johnny's sound is still the same as all of his other country albums.\n\nBe careful of what you wish for, especially when it comes to rain, as illustrated in the upbeat tune, &quot;Five Feet High And Rising.&quot; After the land was dry for quite awhile it started to pour so much that the wheat and oats were all but dead. Even the chickens were sleeping up in the tallest of the trees. Perhaps the funniest line in the song is &quot;Looks like we'll be blessed with a little more rain,&quot; as if that is going to help the situation in the least bit.\n\nIn &quot;The Man On The Hill,&quot; an inquisitive little boy wonders how the family will make it on their own because whenever they need land, shoes, or food the boy always has to pray and be hopeful that someone will take enough pity on them to give them what is needed. Instead of feeling sad, he turns to God to ask for a helping hand.\n\nAfter sailing around and getting drunk all night in &quot;I Want To Go Home,&quot; the man feels as though all of the fun that was to be had has been depleted and wants to get back aboard to forget all of the trouble he got into. Not only did he get drunk, but is shipmate did as well and ended up busting up a car's trunk right before running into a constable.\n\n&quot;Old Apache Squaw&quot; opens with an interesting sounding drum beat before launching into a song about an Indian that, if confronted by a white man, would not be above killing him. Despite the Indian being so wise and having lived so long, the Squaw still, despite the toughness of his exterior, still gets misty eyed when he remembers the past.\n\nWhatever you do, do not step on any of the flowers planted in &quot;Don't Step On Mother's Roses,&quot; because it would make her husband, the widower, cry. As the years passed and the man died too, kids would pass by the home to pick a few of Mother's precious roses as the late couple's son is reminded of his parent's loving faces. The son says picking them is all right as long as the children do not ruin them or hurt them in any way.\n\nBeing compassionate to others is the great message found in &quot;It Could Be You (Instead of Him),&quot; a song in which you also hear that, in all actuality, the very poor soul you might have just passed on the street could have easily been you. As a matter of fact, it could still be in the future. Make friends and spread happiness wherever you go so that you can also make a difference.\n\nOne of the two bonus songs contained in this collection is &quot;I Got Stripes,&quot; a song which sounds patriotic at first - only because of the title - and once you actually hear the lyrics and music you realize that it is not about the stars and stripes, but of the black and white stripes &quot;around the shoulders&quot; on a man's prison garb. In only a short amount of time the man goes on trial and is convicted to spend his life in the slammer. When he starts eating the bread and water he realizes just how low the ball and chains drag him down.\n\nTrying to keep up with folk artists at the time must have sounded like a daunting task to Johnny, but he turned inward and wrote beautiful songs dedicated to people, places, and situations that were important to him as a child growing up in the farmhouse, barn, coop, and 20 acres of land provided free of charge for families trying to get out of the confines of the Great Depression. From an early age he knew that in order to get somewhere, you worked, and looking at his career you can really tell that he has always known that and will never forget that in order to get somewhere, you have to get out and do what you can to make it so. There is no better proof of that than in &quot;Songs Of Our Soil.&quot;","torrent":{"xt":"urn:btih:508d0396998fe02dde7c015292facf60980b8165","amp;dn":"+Johnny+Cash+-+Songs+of+Our+Soil+%5B1959%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"508d0396998fe02dde7c015292facf60980b8165","infoHashBuffer":{"type":"Buffer","data":[80,141,3,150,153,143,224,45,222,124,1,82,146,250,207,96,152,11,129,101]},"announce":[],"urlList":[]}}