{"title":"The Best of Three Dog Night - 20th Century Masters [FLAC+MP3](Bi","uid":9549058,"size":332751828,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:50cc6da0de55ffbe75f239dce27513e15a8cabf6&amp;dn=The+Best+of+Three+Dog+Night+-+20th+Century+Masters+%5BFLAC%2BMP3%5D%28Bi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1391196427,"description":"Source: CD\n\nimage\n\nBy Matthew G. Sherwin VINE VOICE\nFormat:Audio CD\nThree Dog Night enjoyed tremendous success for several years. Between the years 1969 and 1974, they released their own songs as well as cover songs that rose to the top of the pop and adult contemporary charts rather frequently. The music on this CD is incredible; and it holds your interest the entire way through. Their music remains remarkably fresh and strong even to this day.\n\nThe CD starts with the infectiously happy &quot;Joy To The World.&quot; This song wishes happiness and peace not just to humans but to all creatures on our planet. It's the best antidepressant around! SMILES The musical arrangement exemplifies classic rock--YES!!!!\n\nShambala, the nest track on this CD, has another potent rock flavor. The song may have a somewhat more &quot;laid back&quot; feel to it than &quot;Joy To The World;&quot; but it works very well.\n\nOther classic Three Dog Night songs on this CD include &quot;An Old Fashioned Love Song;&quot; a tragic ballad about a love gone awry entitled &quot;The Song Must Go On&quot; and &quot;Easy To Be Hard&quot; from Hair.\n\n&quot;Black &amp; White&quot; reminds us to love our fellow man regardless of the color of his or her skin; I remember this song fondly from my grade school years. We had a 45 rpm record of this song and at recess we played it so much we practically wore the grooves off the record! &quot;An Old Fashioned Love Song&quot; has a great intro with the organ playing; and the band performs this number with great sensitivity. &quot;An Old Fashioned Love Song&quot; is both romantic and hauntingly beautiful. People will remember &quot;An Old Fashioned Love Song&quot; for a long time to come. &quot;I've Never Been To Spain&quot; rocks and stuns you with its sensitivity. Excellent!\n\nOne of Three Dog Night's other hits was &quot;Celebrate.&quot; The musical arrangement showcases the band's incredible sound with their singing and a solid musical arrangement.\n\nUnfortunately, I have one complaint. Other reviewers have written that the CD is just too brief--and they are right. It is shameful that such a talented band does not get its proper due on this CD. I agree with the reviewer who writes that the other CD entitled The Best Of Three Dog Night is a much better buy; you can enjoy much more music from Three Dog Night. Go for it!\n\nThree Dog Night will always be remembered as a band that produced remarkably fine rock hits while they worked together. Their music stuns you with its passion and the melodies are catchy and instantly memorable.\n\nI recommend this CD for Three Dog Night fans or for people who want to become more familiar with the fine artistry of Three Dog Night. Diehard fans will want The Best Of Three Dog Night and other CDs by this unforgettable band. People who enjoy 1970s rock music will enjoy this CD, too. Great job, Three Dog Night!\n\n\n---------------------------------------------------------------------\nThree Dog Night - 20th Century Masters - The Millennium Collection: The Best of Three Dog Night\n---------------------------------------------------------------------\n\nArtist...............: Three Dog Night\nAlbum................: 20th Century Masters - The Millennium Collection: The Best of Three Dog Night\nGenre................: Classic Rock\nSource...............: CD\nYear.................: 2000\n\nFLAC\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 59 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\n\nMP3 V0 (Highest Quality For MP3)\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 260kbps)\nChannels.............: Joint Stereo / 44100 hz\n\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. Three Dog Night - Joy to the World [03:16]\n2. Three Dog Night - Shambala [03:27]\n3. Three Dog Night - One [03:05]\n4. Three Dog Night - Black &amp; White [03:26]\n5. Three Dog Night - Mama Told Me Not To Come [03:20]\n6. Three Dog Night - An Old Fashioned Love Song [03:48]\n7. Three Dog Night - Never Been to Spain [03:45]\n8. Three Dog Night - Liar [03:21]\n9. Three Dog Night - Eli's Coming [02:49]\n10. Three Dog Night - Easy to Be Hard [03:14]\n11. Three Dog Night - Celebrate [03:03]\n12. Three Dog Night - The Show Must Go On [03:45]\n\nPlaying Time.........: 40:25","torrent":{"xt":"urn:btih:50cc6da0de55ffbe75f239dce27513e15a8cabf6","amp;dn":"The+Best+of+Three+Dog+Night+-+20th+Century+Masters+%5BFLAC%2BMP3%5D%28Bi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50cc6da0de55ffbe75f239dce27513e15a8cabf6","infoHashBuffer":{"type":"Buffer","data":[80,204,109,160,222,85,255,190,117,242,57,220,226,117,19,225,90,140,171,246]},"announce":[],"urlList":[]}}