{"title":"The Tornados - The EP Collection (1996)","uid":8398863,"size":372420018,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:51105a3bad0f710798f3a03ce852736890cd10e3&amp;dn=The+Tornados+-+The+EP+Collection+%281996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":36,"time":1366642333,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\nThe Tornados - The EP Collection (1996)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/61PTSdCd--L._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/61PTSdCd--L._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (http://www.poikosoft.com) DVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nBiography from All Music (by Cub Koda):\n\nOne of the saddest stories in rock &amp; roll history surrounds the Tornados, an instrumental group from Britain. Although there were other groups with the same name (see listing for their American surf-band counterparts), this batch of Tornados were the creation of British producer Joe Meek. Meek was England's first independent producer, being equal parts Thomas Edison, Phil Spector, and Ed Wood. An inveterate tinkerer, he designed his own compression units and microphone pre-amps, giving his productions their own distinct sound. Setting up a homemade studio in a three-story flat on Holloway Road in London, Meek pioneered such recording techniques as close miking of instruments, distortion, his aforementioned trademark compression, loud drums fortified by percussion from pocket combs, milk bottles, and stomping the floorboards himself. He put together the original Tornados in late 1961 as a studio session group, its original lineup consisting of Alan Caddy and George Bellamy on guitars, Roger LaVern on organ, Heinz Burt on bass, and Clem Cattini on drums. After one single flopped, Meek had the group do one of his compositions, an instrumental called &quot;Telstar.&quot; Utilizing willful distortion, cheap tape echo, beeping satellite sound effects, a cheesy-sounding Clavioline (a two-octave keyboard powered by a battery), and massive amounts of tube compression, the resulting production sounded like nothing else at the time, or since. It became the first number one record on the American charts by a British rock group and ended up selling five million copies worldwide. It should have made Meek a millionaire and the Tornados a household name. But a French copyright infringement suit kept all royalties tied up for six years, and the Tornados were kept from touring the United States behind their international hit due to a contract employing them as a backup group to U.K. pretty boy Billy Fury. By the time the dust settled, the Tornados had gone hitless for several years, and so had Joe Meek. After numerous personnel changes, the original members scattered to various groups, Heinz Burt starting his own solo career and Cattini becoming a British session mainstay of producer Shel Talmy. The copyright infringement suit was ruled in Meek's favor six years later, a year after he had blown his face off with a hunting rifle after murdering his landlady, ending his life in his beloved but debt-ridden studio.\n\nTaken from: http://www.allmusic.com/artist/the-tornados-p5672/biography\n\nAll Music Album Page: http://www.allmusic.com/album/the-ep-collection-r260928\n\nAmazon.com's page: http://www.amazon.com/dp/B0000011BJ\n\nTrack List:\n\n01. Swinging Beefeater\n02. Love And Fury\n03. The Breeze And I\n04. Telstar\n05. Ridin' The Wind\n06. Globetrotter\n07. Robot\n08. Popeye Twist\n09. Jungle Fever\n10. Locomotion With Me\n11. Life On Venus\n12. All The Stars In The Sky\n13. Hot Pot\n14. Joy Stick\n15. Chattanooga Choo Choo\n16. Earthy\n17. Night Rider\n18. Costa Monger\n19. Alan's Tune\n20. Dreamin' On A Cloud\n21. Red Roses And A Sky Of Blue\n22. Theme From ''A Summer Place''\n23. Chasing Moonbeams\n24. Flycatcher\n25. Ready Teddy\n26. Rip It Up\n27. My Babe\n28. Blue Moon Of Kentucky\n29. Long Tall Sally\n\n","torrent":{"xt":"urn:btih:51105a3bad0f710798f3a03ce852736890cd10e3","amp;dn":"The+Tornados+-+The+EP+Collection+%281996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51105a3bad0f710798f3a03ce852736890cd10e3","infoHashBuffer":{"type":"Buffer","data":[81,16,90,59,173,15,113,7,152,243,160,60,232,82,115,104,144,205,16,227]},"announce":[],"urlList":[]}}