{"title":"The Lexus and the Olive Tree: Understanding Globalization, azw3","uid":12023486,"size":632952,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:514e738eb121ae70bf41ddc5c7ae7a6032283e67&amp;dn=The+Lexus+and+the+Olive+Tree%3A+Understanding+Globalization%2C+azw3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"heliiaruy","files":1,"time":1434488531,"description":"The Lexus and the Olive Tree: Understanding Globalization\n\nby  Thomas L. Friedman\n\n\nazw3 file (put it in kindle)\n\n\nA brilliant investigation of globalization, the most significant socioeconomic trend in the world today, and how it is affecting everything we do-economically, politically, and culturally-abroad and at home.\n\n\nAs foreign affairs columnist for The New York Times, Thomas L. Friedman crisscrosses the globe talking with the world's economic and political leaders, and reporting, as only he can, on what he sees. Now he has used his years of experience as a reporter and columnist to produce a pithy, trenchant, riveting look at the worldwide market forces that are driving today's economies and how they are playing out both internationally and locally.\n\n\nGlobalization is the technologically driven expression of free-market capitalism, and as such is essentially an American creation. It has irrevocably changed the way business is done and has raised living standards throughout the world. But powerful local forces-of religion, race, ethnicity, and cultural identity-are in competition with technology for the hearts and minds of their societies. Finding the proper balance between the Lexus and the olive tree is the great game of globalization-and the ultimate theme of Friedman's challenging, provocative book, essential reading for all who care about how the world really works.\n\n\n\n       helii             aruyyur            a        ii       l          eh","torrent":{"xt":"urn:btih:514e738eb121ae70bf41ddc5c7ae7a6032283e67","amp;dn":"The+Lexus+and+the+Olive+Tree%3A+Understanding+Globalization%2C+azw3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"514e738eb121ae70bf41ddc5c7ae7a6032283e67","infoHashBuffer":{"type":"Buffer","data":[81,78,115,142,177,33,174,112,191,65,221,197,199,174,122,96,50,40,62,103]},"announce":[],"urlList":[]}}