{"title":"BBC Radio Series - The Hitchhiker's Guide to the Galaxy by Dougl","uid":10645694,"size":801215307,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5195fd1a257244ad8fe99e4073be3a0195765bd6&amp;dn=BBC+Radio+Series+-+The+Hitchhiker%27s+Guide+to+the+Galaxy+by+Dougl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"Lydbokami","files":28,"time":1406540872,"description":"Genre: \t\tComic science fiction\nRunning time: \t30 minutes\nCountry: \tUnited Kingdom\nLanguage:\tEnglish\nHome station:\tBBC Radio 4\nSyndicates:\tNPR, CBC Radio\nStarring:\tSimon Jones\n\t\tGeoffrey McGivern\n\t\tMark Wing-Davey\n\t\tSusan Sheridan\n\t\tStephen Moore\nCreator:\tDouglas Adams\nWriter(s): \tDouglas Adams (Series 1-2)\n\t\tJohn Lloyd (Co-writer series 1)\n\t\tDirk Maggs (Series 3-5)\nProducer(s): \tSimon Brett (pilot)\n\t\tGeoffrey Perkins (Series 1-2)\n\t\tDirk Maggs (Co-Producer: final three series)\n\t\tBruce Hyman and Helen Chattwell (Series 3-5)\nNarrated by: \tPeter Jones (first two series)\n\t\tWilliam Franklyn (final three series)\nAir dates: \t8 March 1978 to 21 June 2005\nNo. of episodes:26\nAudio format: \tStereo, surround\nBitrate:\t128 kbps\n\nThe Hitchhiker's Guide to the Galaxy is a science fiction comedy radio series written by Douglas Adams (with some material in the first series provided by John Lloyd).  It was originally broadcast in the United Kingdom by BBC Radio 4 in 1978, and afterwards the BBC World Service, National Public Radio in the U.S. and CBC Radio in Canada. The series was the first radio comedy programme to be produced in stereo, and was innovative in its use of music and sound effects, winning a number of awards. The series follows the adventures of hapless Englishman Arthur Dent and his friend Ford Prefect, an alien who writes for The Hitchhiker's Guide to the Galaxy, a pan-galactic encyclopedia and travel guide. After Earth is destroyed in the first episode, Arthur and Ford find themselves aboard a stolen spaceship piloted by a motley crew including Zaphod Beeblebrox (Ford's semi-cousin and Galactic President), the depressed robot Marvin and Trillian, the only other human survivor of Earth's destruction.\n\nA pilot programme was commissioned in March 1977, and was recorded by the end of the following June. A second series was commissioned in 1979, transmitted in 1980. Episodes of the first series were specially re-recorded for release on LP records and audio cassettes and Adams adapted the first series into a best-selling novel in 1979. After the 1980 transmissions of the second radio series, a second novel was published and the first series was adapted for television. This was followed in turn by three further novels, a computer game, and various other media formats. Adams had considered writing a third radio series to be based on his novel Life, the Universe and Everything in 1993, but the project did not begin for another ten years until after Adams' death in May 2001. Dirk Maggs, with whom Adams had discussed the new series, eventually directed and co-produced radio series adaptations of that novel, as well as So Long, and Thanks for All the Fish and Mostly Harmless. These became the third, fourth and fifth radio series transmitted \nin 2004 and 2005.\n\nSHARE AND ENJOY!","torrent":{"xt":"urn:btih:5195fd1a257244ad8fe99e4073be3a0195765bd6","amp;dn":"BBC+Radio+Series+-+The+Hitchhiker%27s+Guide+to+the+Galaxy+by+Dougl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5195fd1a257244ad8fe99e4073be3a0195765bd6","infoHashBuffer":{"type":"Buffer","data":[81,149,253,26,37,114,68,173,143,233,158,64,115,190,58,1,149,118,91,214]},"announce":[],"urlList":[]}}