{"title":"Nirvana - Roma (Bootleg - Live in Rome) 320 bit mp3","uid":6956046,"size":178521753,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5212867e11e3d37381c12e92eec64ff78d5f0039&amp;dn=Nirvana+-+Roma+%28Bootleg+-+Live+in+Rome%29+320+bit+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Gumball66","files":-1,"time":1326581538,"description":"Nirvana Roma (live in Rome) now available in an mp3 320 bit format.\nUploaded for those who do not wish to download the flac version.\n\nContrary to popular belief, this is not the last Nirvana concert. This is from the concert in Rome on February 22nd, 1994.  The last Nirvana concert took place one week later on March 1st at Terminal One, in Munich, Germany.\n\nTrack Listing\n\n1\tRadio Friendly Unit Shifter\t \t4:00\n2\tDrain You\t \t                3:33\n3\tBreed\t \t                        3:04\n4\tServe the Servents\t \t        3:10\n5\tCome as You Are\t \t                3:34\n6\tSmells Like Teen Spirit\t         \t4:38\n7\tSliver\t \t                        2:13\n8\tDumb\t \t                        3:00\n9\tIn Bloom\t \t                4:13\n10\tAbout a Girl\t \t                2:40\n11\tLithium\t \t                        3:58\n12\tPennyroyal Tea\t \t                3:31\n13\tSchool\t \t                        2:34\n14\tPolly\t \t                        3:13\n15\tVery Ape\t \t                2:19\n16\tLounge Act\t \t                2:36\n17\tRape Me\t \t                        2:38\n18\tTerritorial Pissings\t \t        2:35\n19\tAll Apologies\t \t                3:17\n20\tOn a Plain\t \t                3:21\n21\tScentless Apprentice\t \t        3:39\n22\tHeart Shaped Box\t \t        4:34\n23\tDemolition\t \t                3:12\n\n\nFrom Allmusic.com\n\nReview by Alex Henderson\n\n\nIf, in the 1990s, you went to a CD swap meet that sold a lot of bootlegs, the amount of Nirvana titles could be staggering. The most obsessive collectors wouldnt hesitate to spend $500 or more on Nirvana alone and walk away with at least 20 or 25 Nirvana bootlegs, whereas collectors who were more budget-minded would try to determine which ones had the best sound quality and make their purchases accordingly. One Nirvana bootleg with which you cant go wrong is Roma, recorded live in Rome, Italy on February 22, 1994, the concert occurred less than two months before Kurt Cobains tragic suicide. A digital soundboard recording, Roma boasts excellent sound quality -- not just decent, but excellent -- and the bands set is outstanding. At the time, Cobain was battling his demons and losing the battle; he would unsuccessfully attempt suicide on March 4, but succeed in killing himself on April 5. Despite the emotional hell he was going through, Cobain gives first-rate performances throughout the concert, singing with as much conviction as ever on Rape Me, Smells Like Teen Spirit, Heart Shaped Box, and other angst-ridden grunge gems. Roma was hardly the only bootleg that resulted from Nirvanas European tour of February 1994. There are many others, and the sound quality varies from one to the next, but those who come across the Rolling Disc labels version of Roma can rest assured that they wont be disappointed by either the sound or the performances.\n","torrent":{"xt":"urn:btih:5212867e11e3d37381c12e92eec64ff78d5f0039","amp;dn":"Nirvana+-+Roma+%28Bootleg+-+Live+in+Rome%29+320+bit+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5212867e11e3d37381c12e92eec64ff78d5f0039","infoHashBuffer":{"type":"Buffer","data":[82,18,134,126,17,227,211,115,129,193,46,146,238,198,79,247,141,95,0,57]},"announce":[],"urlList":[]}}