{"title":"The Icicle Works - The Small Price Of A Bicycle","uid":4117444,"size":61529866,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:52222952871fc2f09e6abe5308bbb3f223d24cc4&amp;dn=The+Icicle+Works+-+The+Small+Price+Of+A+Bicycle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"80zforever","files":12,"time":1207385672,"description":"The Icicle Works were one of those U.K. groups of the &amp;#039;80s that scored one fluke hit in the U.S. despite a somewhat lengthy and more successful run in their homeland. They released a number of albums that, while regularly inconsistent, featured scattered moments that helped define the type of big-sounding guitar rock ? prone to chest-beating bombast ? that set them apart from fellow Liverpool-based groups like Echo &amp; the Bunnymen, the Teardrop Explodes, and (somewhat less so) Wah!The group formed in 1980. \n\nThe Small Price of a Bicycle [1985]\n\nThere&amp;#039;s actually nothing small about the Icicle Works&amp;#039; second album. Like early U2, Big Country, and Simple Minds, the Icicle Works paint with a large canvas; on The Small Price of a Bicycle, the Icicle Works don&amp;#039;t stray from their formula of mammoth guitar riffs and epic choruses. While the LP doesn&amp;#039;t have the bewitching wintry feel of the group&amp;#039;s self-titled debut, Ian McNabb&amp;#039;s husky voice compensates for the overall lack of immediate hooks. The galloping bass and sweeping vocals of &quot;Hollow Horse&quot; should&amp;#039;ve been as successful in the U.S. as the band&amp;#039;s only American hit, &quot;Birds Fly (Whisper to a Scream).&quot; &quot;We&amp;#039;ll be as we are/When all the fools who doubt us fade away,&quot; McNabb bellows defiantly on &quot;Hollow Horse,&quot; lyrics that are as catchy as the &quot;We are, we are/We are but your children&quot; singalong of &quot;Birds Fly.&quot; Filled with high drama and a ceaselessly driving beat, &quot;Hollow Horse&quot; nearly stomps the rest of the album into mashed potatoes. &quot;Perambulator&quot; exposes the Icicle Works&amp;#039; more aggressive side, one that McNabb would explore further on his Head Like a Rock LP, while &quot;Seven Horses&quot; is more of the same, McNabb&amp;#039;s throaty voice riding on a wave of colossal guitars and thumping basslines. The Small Price of a Bicycle has its boring moments, such as &quot;All the Daughters (Of Her Father&amp;#039;s House),&quot; but McNabb&amp;#039;s passion breathes life into every lyric. Even when the Icicle Works falter, McNabb goes down with guns blazing. \n\n01 Hollow Horse 4:00 \n02 Perambulator 4:02 \n03 Seven Horses 4:12 \n04 Rapids 4:32 \n05 Windfall 4:13 \n06 Assumed Sundown 5:53 \n07 Saint&amp;#039;s Sojourn 4:33 \n08 All the Daughters (of Her Father&amp;#039;s House) 4:40 \n09 Book of Reason 3:45 \n10 Conscience of Kings 4:48 \n11 Hollow Horse (Long Version)\n\n","torrent":{"xt":"urn:btih:52222952871fc2f09e6abe5308bbb3f223d24cc4","amp;dn":"The+Icicle+Works+-+The+Small+Price+Of+A+Bicycle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52222952871fc2f09e6abe5308bbb3f223d24cc4","infoHashBuffer":{"type":"Buffer","data":[82,34,41,82,135,31,194,240,158,106,190,83,8,187,179,242,35,210,76,196]},"announce":[],"urlList":[]}}