{"title":"Jack L. Chalker - Saga of the Well World -2 - Exiles at the Well","uid":11467010,"size":175481704,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:523e0f4dfeada726e384b5de2f0736a124dfbe0e&amp;dn=Jack+L.+Chalker+-+Saga+of+the+Well+World+-2+-+Exiles+at+the+Well&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cybotage","files":1,"time":1416042574,"description":"Welcome to the Well World: a construct of an ancient defunct race known as the Markovians. The Well World acts both as the controller of and the gateway to 1560 worlds created by the Markovians at the end of their time. *** Gilgam Zinder finally discovers the secret to the Markovian Well World but is then forced by the evil politician and drug dealer, Antor Trelig, to develop a computer that can control the artificial construct. *** Mavra Chang is a freighter pilot hired to rescue Zinder's daughter, who has been kidnapped by Trelig, and to save the worlds populating the construct from Trelig's malicious plans. In the process, Obie, the self-aware computer, accidentally causes a whole world to be automatically transported around the Well World, causing Mavra's ship to crash on a &quot;non-tech&quot; hex-world. *** As inhabitants of surrounding hex-worlds start to realize what is going on, they scramble to collect the pieces of the scattered ship in the hope of escaping the planet, resulting in a chaotic war between various races that might lead to the destruction of the Well World itself. *** Exiles at the Well of Souls is the second book set in the Well World universe","torrent":{"xt":"urn:btih:523e0f4dfeada726e384b5de2f0736a124dfbe0e","amp;dn":"Jack+L.+Chalker+-+Saga+of+the+Well+World+-2+-+Exiles+at+the+Well","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"523e0f4dfeada726e384b5de2f0736a124dfbe0e","infoHashBuffer":{"type":"Buffer","data":[82,62,15,77,254,173,167,38,227,132,181,222,47,7,54,161,36,223,190,14]},"announce":[],"urlList":[]}}