{"title":"A Serial Killer in Nazi Berlin: The Chilling... (2014) Scott Sel","uid":9497871,"size":24235644,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5249f4342ee1d581bce870930d763488677d90fa&amp;dn=A+Serial+Killer+in+Nazi+Berlin%3A+The+Chilling...+%282014%29+Scott+Sel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"7","files":-1,"time":1390155664,"description":"A Serial Killer in Nazi Berlin: The Chilling True Story of the S-Bahn Murderer (2014) Scott Selby (multi)\n\nA Serial Killer in Nazi Berlin: The Chilling True Story of the S-Bahn Murderer by Scott Selby\n\n\nFormat: mobi/epub/azw3\nLength: 320 pages\nGenre: History/True Crime\nDate: 7 January 2014\n\nScott Selby's recreation of the hunt for a wartime serial killer meticulously describes one of the most horrific but fascinating murder investigations of the twentieth century.\n\nFor all appearances, Paul Ogorzow was a model German. An employed family man, party member, and sergeant in the infamous Brownshirts, he had worked his way up in the Berlin railroad from a manual laborer laying track to assistant signalman. But he also had a secret need to harass and frighten women. Then he was given a gift from the Nazi high command.\n\nDue to Allied bombing raids, a total blackout was instituted throughout Berlin, including on the commuter trains - trains often used by women riding home alone from the factories.\n\nUnder cover of darkness and with a helpless flock of victims to choose from, Ogorzow's depredations grew more and more horrific. He escalated from simply frightening women to physically attacking them, eventually raping and murdering them. Beginning in September 1940, he started casually tossing their bodies off the moving train. Though the Nazi party tried to censor news of the attacks, the women of Berlin soon lived in a state of constant fear.\n\nIt was up to Wilhelm Ludtke, head of the Berlin police's serious crimes division, to hunt down the madman in their midst. For the first time, the gripping full story of Ogorzow's killing spree and Ludtke's relentless pursuit is told in dramatic detail.\n\nAuthor:\n\nScott Selby is the author of The Axmann Conspiracy: The Nazi Plan for a Fourth Reich and How the U.S. Army Defeated It, and a coauthor of Flawless: Inside the Largest Diamond Heist in History. He has a law degree from Harvard Law School and a master's degree in Human Rights and Intellectual Property from the Raoul Wallenberg Institute at Sweden's Lund University, as well as a BA in Interdisciplinary Studies/Theories of American Culture from UC Berkeley.","torrent":{"xt":"urn:btih:5249f4342ee1d581bce870930d763488677d90fa","amp;dn":"A+Serial+Killer+in+Nazi+Berlin%3A+The+Chilling...+%282014%29+Scott+Sel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5249f4342ee1d581bce870930d763488677d90fa","infoHashBuffer":{"type":"Buffer","data":[82,73,244,52,46,225,213,129,188,232,112,147,13,118,52,136,103,125,144,250]},"announce":[],"urlList":[]}}