{"title":"Bernstein - West Side Story","uid":5121980,"size":302538765,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5276f918a19ff83d89b409758163c8bc123f49d6&amp;dn=Bernstein+-+West+Side+Story&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"dougietrotter","files":-1,"time":1255395813,"description":"Leonard Bernstein's musical update of Romeo and Juliet, with a young Stephen Sondheim's brilliant lyrics, had already galvanized Broadway with its vivid reinvention as a parable of racial intolerance and generational conflict. But director Robert Wise's lavish widescreen presentation broke fresh ground by taking the story to its most impressionable audience, the teenagers who could identify directly with Tony and Maria, and opened up Jerome Robbins's kinetic choreography through bravura camera work. \n\nThe original soundtrack album was not merely a huge seller but a unique touchstone for an otherwise rock-oriented audience, and its release on CD benefits from an expanded program untenable in its initial LP release, as well as a 20-bit digital transfer. With Richard Beymer, Marni Nixon (Hollywood's vocal doppelgÃƒÂ¤nger of choice, here standing in for Natalie Wood), and Rita Moreno dominating, the show's bounty of terrific songs and exciting instrumental pieces remains an ear-filling treat, mixing operatic passions, tart social commentary, and high comedy. From &quot;Tonight&quot; to &quot;One Hand, One Heart,&quot; &quot;America&quot; to &quot;Jet Song,&quot; this is a landmark in American musical theatre and film beautifully realized on disc.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:5276f918a19ff83d89b409758163c8bc123f49d6","amp;dn":"Bernstein+-+West+Side+Story","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5276f918a19ff83d89b409758163c8bc123f49d6","infoHashBuffer":{"type":"Buffer","data":[82,118,249,24,161,159,248,61,137,180,9,117,129,99,200,188,18,63,73,214]},"announce":[],"urlList":[]}}