{"title":"Unmanned Aerial Vehicles: Robotic Air Warfare 1917-2007","uid":11697932,"size":2789875,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53b0cd81a17fb7b35f7b38249bb45253d3061a30&amp;dn=Unmanned+Aerial+Vehicles%3A+Robotic+Air+Warfare+1917-2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1423800880,"description":"Unmanned aerial vehicles (UAVs) are the most dynamic field of aerospace technology, and potentially the harbingers of new aviation technology and tactics. They have only emerged from the shadows in recent years, but in fact have been in use for decades. After some limited use in World War II, UAVs began to emerge as a substitute for manned reconnaissance aircraft in the 1950s for missions deemed too dangerous to risk an aircrew. Used in significant numbers in the Vietnam War as well as less-heralded missions such as spy flights over China in the 1950s and 1960s, the contemporary UAV began to emerge in the 1980s.\n\nThis book examines the development of this unique and mysterious technology, revealing how it has changed combat through the years and speculating on its potential to transform the nature of warfare in the future. Steven J Zaloga examines the pioneering use of UAVs conducted by the Israeli air and the use of UAVs during Operation Desert Storm. Packed with rare, recently declassified photographs and detailed full-color cutaways, this title goes on to investigate the wide deployment of UAVs over Iraq and Afghanistan today, and considers the possible future of the UAV as an actual military weapon","torrent":{"xt":"urn:btih:53b0cd81a17fb7b35f7b38249bb45253d3061a30","amp;dn":"Unmanned+Aerial+Vehicles%3A+Robotic+Air+Warfare+1917-2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53b0cd81a17fb7b35f7b38249bb45253d3061a30","infoHashBuffer":{"type":"Buffer","data":[83,176,205,129,161,127,183,179,95,123,56,36,155,180,82,83,211,6,26,48]},"announce":[],"urlList":[]}}