{"title":"John Martyn - Piece By Piece  [1986]  [Robbie60] [FLAC] [EAC]","uid":6174911,"size":353502389,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5511d853c7ede68328852e4d7e396c7b86939ec3&amp;dn=John+Martyn+-+Piece+By+Piece++%5B1986%5D++%5BRobbie60%5D+%5BFLAC%5D+%5BEAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Robbie6ty","files":-1,"time":1297735721,"description":"John Martyn\nPiece By Piece\n\n\n\nLabel: Island\nReleased: 1986\nSource: Original CD \nSize Torrent: 337 MB\nFormat: FLAC\n\n\n\n\n\nPiece By Piece was released in February 1986.\n\nThe early cd's of Piece By Piece included four extra tracks: Tight Connection to my Heart, Solid Air, One World and May You Never. This 13-track cd has now been replaced by a standard 9-track version and is hard to find.\n\nTo celebrate John's 20th Anniversary as a performer and in the hope of securing elusive radio air play time, Island released Classic John Martyn at the same time. This was the first commercially available CD single and featured the tracks Angeline, May You Never, Solid Air, Glistening Glyndebourne and a cover of Dylan's Tight Connection To My Heart.\n\nA 12 inch single of Classic John Martyn was also released but with different tracks Angeline, Tight Connection To My Heart, May You Never, Certain Surprise and One Day Without You.\n\nIsland also released Angeline/Tight Connection To My Heart as a single.\n\nThe album itself featured the powerful John Wayne, complete with typically ambiguous lyrics and what John describes as his 'strangled duck' vocal. To achieve the effect John indulged large quantities of liquid refreshment and did the vocal track in a single take. The track pushed his vocal style to new limits and is a song that he likes to perform live. John has said that the track was written for an ex-manager who he was rather unhappy with at the time!\n\nThe album was mainly the product of a liaison with Foster Patterson who wrote the title track. This was another stab at gaining the commercial success and popular recognition, which had so far escaped John's grasp. Other musicians included Alan Thomson (bass), Danny Cummings (percussion) and Colin Tully (saxophone).\n\n&quot;Martyn endows the music with all the benefits of a crystalline production technique and Piece By Piece showcases Martyn's ability to blend his personality and voice with the rigours of jazz instrumentation.&quot; - New Hifi Sounds\n\nIn March 1986 Island released Lonely Love, described by John as &quot;the album's little pop song&quot;, as a single in 7 inch with Sweet Little Mystery (live) on the b-side. The 12 inch version featured a live recording of Fisherman's Dream and Sweet Little Mystery on the b side.\n\nIsland produced a Piece By Piece promotional boxed set which included 2 interview discs, a copy of the 12 inch Classic John Martyn single and a promotional booklet. John is in conversation with Trevor Dann and talks about his life, his views and the background to many of his songs. This is a rare item and was only produced in a very small number. In many years as a fan I've only ever seen one copy and that one now resides in my collection!\n\nJohn on Piece By Piece, &quot;..it's a bit more mature and sophisticated, what do you expect from a 37 year old man? It's not going to be raucous and punkish, hardly going to have the U2 feel about it.&quot;\n\n&quot;What I've tried to do is sing more than play, and have fun with some new sounds, like the strangled duck (on John Wayne). I've been trying to sing better for the last few years and push myself in a certain direction. I always find the vocals more difficult to get right in the studio, they're better live, generally. To get the effect I wanted on the track John Wayne I had to go out and get totally rat-arsed, and then I did it on one take. Great effect.&quot; John toured extensively with a demanding tour schedule.\n\nJohn provided the soundtrack to Tyne Tees Televisions major series on the environment, Turning the Tide. Broadcast in Autumn 1986 the moving title song was loosely based on I Don't Want to Know About Evil but with a new musical arrangement and adapted lyrics. The series ran over budget and plans to release a soundtrack were scrapped though there are some tapes in existence.\n\n\n\n\nPersonnel\n\nJohn Martyn - guitars, vocals, guitar synthesisers\nFoster Patterson - keyboards, backing vocals\nAlan Thomson - fretless bass\nDanny Cummings - percussion\nColin Tully - saxophone\n\n\n\n\n\nTrack Listing\n\n1.&quot;Nightline&quot; 5:04\n2.&quot;Lonely Love&quot; 3:22\n3.&quot;Angeline&quot; 4:45\n4.&quot;One Step Too Far&quot; 3:18\n5.&quot;Piece By Piece&quot; 3:56\n6.&quot;Serendipity&quot; 4:08\n7.&quot;Who Believes In Angels&quot; 4:36\n8.&quot;Love Of Mine&quot; 4:47\n9.&quot;Tight Connection To My Heart&quot; 3:46\n10.&quot;John Wayne&quot; 6:55\n11.&quot;Solid Air&quot; 5:43\n12.&quot;One World&quot; 4:01\n13.&quot;May You Never&quot; 3:40\n","torrent":{"xt":"urn:btih:5511d853c7ede68328852e4d7e396c7b86939ec3","amp;dn":"John+Martyn+-+Piece+By+Piece++%5B1986%5D++%5BRobbie60%5D+%5BFLAC%5D+%5BEAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5511d853c7ede68328852e4d7e396c7b86939ec3","infoHashBuffer":{"type":"Buffer","data":[85,17,216,83,199,237,230,131,40,133,46,77,126,57,108,123,134,147,158,195]},"announce":[],"urlList":[]}}