{"title":"Mail Designer 1.2 with patcher","uid":6819012,"size":124908618,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:559ce77488bc8133793e6cbca2d695db56dbebbf&amp;dn=Mail+Designer+1.2+with+patcher&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"polisdavid","files":-1,"time":1321333445,"description":"Official Web Site: &lt;a href=&quot; http://www.equinux.com/us/products/maildesigner/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.equinux.com/us/products/maildesigner/index.html&lt;/a&gt;\n\nWith Mail Designer, you can create the messages you have always wanted: send irresistible invitations to friends, vital updates to business colleagues and attractive newsletters to any and everyone. Mail Designer is pure inspiration.\n\nMake your own design \n\nMail Designer offers intuitive features that allow you to layout imaginative emails - find the perfect template, adjust the text and image placeholders and fill in your content. \n\nStanding out from the crowd \n\nCreate the emails you have always wanted. With Mail Designer you can create and incorporate your own corporate design - countless features will help you along the way. \n\nKeep your message fresh with placeholders\n \nDo you send regular newsletters? Mail Designer offers place holders for your images and text - just drop in an updated image, add the current text and you are good to go. \n\nStyled templates for your email \nMail Designer includes flexible templates that you can further customize. We have left no stone unturned: whether for a sports team, agent or family - inspiration is just a double click away. \n\nClick and go: Apple Mail integration \nYour mails will be well received with Mail Designer because Mail Designer works together with Apple Mail. Graphic elements are automatically rendered and you can access and add anyone in your Mac OS X Address Book. \n\nMailChimp matches with Mail Designer \nSending mass newsletters is easy. Mail Designer makes this possible by using an export interface: Create and finalize your newsletters with Mail Designer and pass them on to MailChimp. \n\nGive your newsletters a personal touch \nPersonalize your newsletters by adding placeholders for names, addresses, and email. Just organize the placeholders the way you want them in Mail Designer and MailChimp will take care of the contents.\n\nRequirements: Mac OS X 10.6.6 or later\n\nWhats New In Version 1.2 \n\nWeve improved Mail Designer! Now you have even more ways to use and distribute your newsletters and mail designs. Here are the details:\n\n* NEW: HTML Export - you can now export messages as an HTML\n  document\n\n* NEW: OS X Lion users can now use Mail Designer in full-screen mode\n\n* NEW: Mail Designer now supports OS X Lions resume feature\n\n* NEW: Weve added 3 new layout blocks with bullet lists\n\n* NEW: Layout Blocks can now be duplicated with a menu bar command\n\n* IMPROVED: The width of all layout blocks has been adjusted\n\n* IMPROVED: Layout block resizing is now more reliable\n\n* IMPROVED: Compatibility of backgrounds in Outlook, Thunderbird\n  and Gmail\n\n* IMPROVED: Added support for all types of links (e.g. tel, ftp, https,\n  etc.)\n\n* IMPROVED: Image placeholders can now overlap\n\n\nSystem Requirements:\n\nIntel Mac OS X.6.8 and above\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:559ce77488bc8133793e6cbca2d695db56dbebbf","amp;dn":"Mail+Designer+1.2+with+patcher","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"559ce77488bc8133793e6cbca2d695db56dbebbf","infoHashBuffer":{"type":"Buffer","data":[85,156,231,116,136,188,129,51,121,62,108,188,162,214,149,219,86,219,235,191]},"announce":[],"urlList":[]}}