{"title":"Graham Oppy &amp; N. N. Trakakis - Medieval Philosophy of Religi","uid":11472076,"size":1774262,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55e8a9dda08368f0d7548fe162898e9ce7401889&amp;dn=Graham+Oppy+%26amp%3B+N.+N.+Trakakis+-+Medieval+Philosophy+of+Religi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"philosophi","files":-1,"time":1416102762,"description":"Graham Oppy &amp; N. N. Trakakis - Medieval Philosophy of Religion: The History of Western Philosophy of Religion (Volume 2)\n\nThe Medieval period was one of the richest eras for the philosophical study of religion. Covering the period from the 6th to the 16th century, reaching into the Renaissance, &quot;The History of Western Philosophy of Religion 2&quot; shows how Christian, Islamic and Jewish thinkers explicated and defended their religious faith in light of the philosophical traditions they inherited from the ancient Greeks and Romans. The enterprise of 'faith seeking understanding', as it was dubbed by the medievals themselves, emerges as a vibrant encounter between - and a complex synthesis of - the Platonic, Aristotelian and Hellenistic traditions of antiquity on the one hand, and the scholastic and monastic religious schools of the medieval West, on the other. &quot;Medieval Philosophy of Religion&quot; will be of interest to scholars and students of Philosophy, Medieval Studies, the History of Ideas, and Religion, while remaining accessible to any interested in the rich cultural heritage of medieval religious thought","torrent":{"xt":"urn:btih:55e8a9dda08368f0d7548fe162898e9ce7401889","amp;dn":"Graham+Oppy+%26amp%3B+N.+N.+Trakakis+-+Medieval+Philosophy+of+Religi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55e8a9dda08368f0d7548fe162898e9ce7401889","infoHashBuffer":{"type":"Buffer","data":[85,232,169,221,160,131,104,240,215,84,143,225,98,137,142,156,231,64,24,137]},"announce":[],"urlList":[]}}