{"title":"RFID Tracking Everything Everywhere","uid":6299608,"size":770052418,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:56e5b5ba8c0047151667ffed0d77a908c3210616&amp;dn=RFID+Tracking+Everything+Everywhere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"OleDoc","files":2,"time":1302112232,"description":"Supermarket cards and retail surveillance devices are merely the opening volley of the marketers' war against consumers. If consumers fail to oppose these practices now, our long-term prospects may look like something from a dystopian science fiction novel.\n\nA new consumer goods tracking system called Radio Frequency Identification (RFID) is poised to enter all of our lives, with profound implications for consumer privacy. RFID couples radio frequency (RF) identification technology with highly miniaturized computers that enable products to be identified and tracked at any point along the supply chain. [2]\n\nThe system could be applied to almost any physical item, from ballpoint pens to toothpaste, which would carry their own unique information in the form of an embedded chip. [3] The chip sends out an identification signal allowing it to communicate with reader devices and other products embedded with similar chips. [4]\n\nAnalysts envision a time when the system will be used to identify and track every item produced on the planet. [5]\n\n\nA number for every item on the planet\n\nRFID employs a numbering scheme called EPC (for &quot;electronic product code&quot;) which can provide a unique ID for any physical object in the world. [6] The EPC is intended to replace the UPC bar code used on products today. [7]\n\nUnlike the bar code, however, the EPC goes beyond identifying product categories--it actually assigns a unique number to every single item that rolls off a manufacturing line. [8] For example, each pack of cigarettes, individual can of soda, light bulb or package of razor blades produced would be uniquely identifiable through its own EPC number. [9]\n\nOnce assigned, this number is transmitted by a radio frequency ID tag (RFID) in or on the product. [10] These tiny tags, predicted by some to cost less than 1 cent each by 2004 [11] [Note: the one cent tag has proved unattainable as of late 2004. The cost of a passive RFID tag is currently between $0.20 and $0.80. -K.A. 9/04] are &quot;somewhere between the size of a grain of sand and a speck of dust.&quot; [12] They are to be built directly into food, clothes, drugs, or auto-parts during the manufacturing process. [13]\n\nReceiver or reader devices are used to pick up the signal transmitted by the RFID tag. Proponents envision a pervasive global network of millions of receivers along the entire supply chain -- in airports, seaports, highways, distribution centers, warehouses, retail stores, and in the home. [14] This would allow for seamless, continuous identification and tracking of physical items as they move from one place to another, [15] enabling companies to determine the whereabouts of all their products at all times. [16]\n\nSteven Van Fleet, an executive at International Paper, looks forward to the prospect. &quot;We'll put a radio frequency ID tag on everything that moves in the North American supply chain,&quot; he enthused recently. [17]\n\nThe ultimate goal is for RFID to create a &quot;physically linked world&quot; [18] in which every item on the planet is numbered, identified, catalogued, and tracked. And the technology exists to make this a reality. Described as &quot;a political rather than a technological problem,&quot; creating a global system &quot;would . . . involve negotiation between, and consensus among, different countries.&quot; [19] Supporters are aiming for worldwide acceptance of the technologies needed to build the infrastructure within the next few years. [20] ","torrent":{"xt":"urn:btih:56e5b5ba8c0047151667ffed0d77a908c3210616","amp;dn":"RFID+Tracking+Everything+Everywhere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56e5b5ba8c0047151667ffed0d77a908c3210616","infoHashBuffer":{"type":"Buffer","data":[86,229,181,186,140,0,71,21,22,103,255,237,13,119,169,8,195,33,6,22]},"announce":[],"urlList":[]}}