{"title":"Glasvegas - Later...When the TV Turns to Static [FLAC]","uid":8888068,"size":289758101,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5721655bae265b89390f01fa46b9bf6e16f2a8f1&amp;dn=Glasvegas+-+Later...When+the+TV+Turns+to+Static+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"politux","files":-1,"time":1378513936,"description":"\n  Glasvegas - Later...When the TV Turns to Static (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Later... When the TV Turns To Static \n  02 Youngblood\n  03 Choices \n  04 All I Want Is My Baby \n  05 Secret Truth \n  06 I'd Rather Be Dead (Than Be With You) \n  07 Magazine \n  08 If \n  09 Neon Bedroom \n  10 Finished Sympathy \n \n  Glasvegas' third studio effort, 2013's Later...When the TV Turns to Static, is an epic stadium-filler that retains all of the grand conceptual ambitions of 2011's Euphoric Heartbreak without losing the emotional core that made the band's 2008 self-titled debut such an engaging listen. In some ways, not much has changed for Glasvegas over the years, with lead singer/songwriter James Allan's thick Scottish brogue and tortured soul taking center stage against a backdrop of the band's Phil Spector-meets-the Jesus and Mary Chain Wall of Sound. If anything, Allan has stuck to his pitch-black guns and continued to stand firm as the torchbearer for a specific brand of anthemic '80s post-punk born out of Echo &amp; the Bunnymen's bluesy, alliterative groove, Nick Cave's apocalyptic croon, and Morrissey's doomed '50s glamour. \n\n  Later...When the TV Turns to Static is an album of intimate feelings and personal details, such as on the title track, where Allan sings &quot;It's quiet on the edge of my bed, up in the attic/How I got home tonight seemed so automatic, systematic/Now, the outside world looks so cinematic,&quot; seemingly aware of the widescreen filmic emotion the song's epic mood conjures. These clever lyrical choices seem to transmogrify Allan's personal demons into viscerally physical imagery, making them apt symbols for the human condition. This phenomenon is best expressed in the galloping and romantic &quot;If.&quot; Inspired by a phone conversation between Allan and mentor Alan McGee (co-founder of Creation Records), who was in the midst of turmoil, the song is a triumphant declaration of hope in a time of despair, as Allan sings &quot;If not for fear, a hope is nowhere near/If not for the rain, the sun would never split the sky again.&quot; Ultimately, while it's the hum of Allan's inner demons that drives most of the album, there's no white noise on Later...When the TV Turns to Static.","torrent":{"xt":"urn:btih:5721655bae265b89390f01fa46b9bf6e16f2a8f1","amp;dn":"Glasvegas+-+Later...When+the+TV+Turns+to+Static+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5721655bae265b89390f01fa46b9bf6e16f2a8f1","infoHashBuffer":{"type":"Buffer","data":[87,33,101,91,174,38,91,137,57,15,1,250,70,185,191,110,22,242,168,241]},"announce":[],"urlList":[]}}