{"title":"Controlling People: How to Recognize, Understand, and Deal with","uid":9510098,"size":291018626,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5736ed033573c720de2159df1eab5cd703e2f9a4&amp;dn=Controlling+People%3A+How+to+Recognize%2C+Understand%2C+and+Deal+with&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HAVUKS","files":-1,"time":1390389349,"description":"Patricia Evans, read by Sands Xe\nUnabridged edition 2012 | 6 hours and 38 mins | ISBN: 1452658544 | MP3 98 kbps | 277 MB\n\n\nDoes this sound like someone you know?\n\n- Always needs to be right. Tells you who you are and what you think.\n- Implies that you're wrong or inadequate when you don't agree.\n- Is threatened by people who are &quot;different&quot;.\n- Feels attacked when questioned.\n- Doesn't seem to really hear or see you.\n\nIf any of the above traits sounds familiar, help is on the way! In Controlling People, best-selling author Patricia Evans tackles the &quot;controlling personality&quot; and reveals how and why these people try to run other people's lives. She also explains the compulsion that makes them continue this behavior - even as they alienate others and often lose those they love.\n\nControlling People helps you unravel the senseless behavior that plagues both the controller and the victim. Can the pattern, or spell, be broken? Yes! says the author. By understanding the compelling force involved, you can be a catalyst for change and actually become a spell-breaker. Once the spell is broken and the controller sees others as they really are, a genuine connection can be forged and healing can occur.\n\nShould you ever find yourself in the thrall of someone close to you, Controlling People is here to give you the wisdom, power, and comfort you need to be a stronger, happier, and more independent person.","torrent":{"xt":"urn:btih:5736ed033573c720de2159df1eab5cd703e2f9a4","amp;dn":"Controlling+People%3A+How+to+Recognize%2C+Understand%2C+and+Deal+with","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5736ed033573c720de2159df1eab5cd703e2f9a4","infoHashBuffer":{"type":"Buffer","data":[87,54,237,3,53,115,199,32,222,33,89,223,30,171,92,215,3,226,249,164]},"announce":[],"urlList":[]}}