{"title":"Wishbone Ash...No Smoke Without Fire(1978)cd re-issue(2006)[FLAC","uid":5580562,"size":533125615,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:576b27e0ff223d813697cab1650f278060a4d9e7&amp;dn=Wishbone+Ash...No+Smoke+Without+Fire%281978%29cd+re-issue%282006%29%5BFLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"dickspic","files":16,"time":1274524286,"description":"Original cd Release Date: September 25, 2006 \nNumber of Discs: 1 \nFormat: Extra tracks, Import \nLabel: Mca UK \nASIN: B000024YFQ \n\n\n1. You See Red  \n2. Baby the Angels Are Here  \n3. Ships in the Day  \n4. Stand &amp; Deliver  \n5. Anger in Harmony  \n6. Like a Child  \n7. Way of the World, Pt. 1  \n8. Way of the World, Pt. 2  \n9. Firesign  \n10. Time &amp; Space  \n11. Lorelei  \n12. Come in from the Rain  \n13. Bad Weather Blues  \n\nNo Smoke Without Fire, released on 6th October 1978, was Wishbone Ash's 9th studio album, and the fifth recorded by the &quot;Mark II&quot; line-up of Laurie Wisefield, Andy Powell, Martin Turner and Steve Upton. Recorded during the months of June, July, and August in 1978 at De Lane Lea Studios in Wembley, North London, it marked a return to a more &quot;British sound&quot; for the band. Since 1975, the band had been based in the state of Connecticut, in the North East of the USA. Their last four albums had all been recorded in America, and reflected that country's musical influences. The band were now back living in England, and under the guidance of manager John Sherry, chose Derek Lawrence to produce this album. The last time the band had worked with Lawrence was on the acclaimed Argus album in 1972 - some of the thinking behind choosing him again was doubtless an attempt to recapture the inspiration that made Argus such a peak in the band's career.\n\nAndy Powell: &quot;We had kept in touch with Derek, and I believe it was John Sherry who suggested that we ask him to produce us once more. It helped that Derek was very familiar with the De Lane Lea studio set-up. We also had the services of a very young engineer called Rafe McKenna, who has since gone onto great things.&quot; Martin Turner: &quot;Going back to Wembley, where Argus had been recorded, was a bit strange - it had basically stayed the same, although the whole music business had moved on in leaps and bounds. Studio 11 was a very dead, old fashioned sounding, room and it was quite hard to record there in 1978.&quot;\n\nAn important event that had occurred in the UK since the band last worked with Derek Lawrence was the punk rock explosion, which by 1978 had segued into New Wave. The &quot;traditional&quot; rock bands that were big in the early seventies were now no longer fashionable or relevant in the eyes of the music press. Doubtless this influenced the fact that No Smoke received little press coverage on its release, as well as the fact that it had a low showing in the UK album charts, peaking at number 43. In spite of this, the 22-date UK tour to promote the album was a huge success, with every venue sold out, proving that Wishbone Ash live were still a major draw. Some of the shows were recorded for a future live album - Live Dates II.\n\nThe album's opening track, &quot;You See Red&quot;, written by Laurie Wisefield, was released as a single in September 1978, prior to the release of the album. With its driving guitar sound and three part vocal harmonies, it set the mood for the whole album. The song was inspired by a difficult relationship that Wisefield was in at the time, as well as the pressures of moving back to England from America. Laurie recalls the time: &quot;It was a big change for her, as she was very much rooted in America. Although we were engaged at the time, as soon as we came back to England it was very difficult to keep the whole thing going.&quot;\n\nThe next track, &quot;Baby, The Angels Are Here&quot;, was also influenced by a relationship that had gone wrong - this time it was Martin Turner's turn. Martin: &quot;I had been madly in love with a girl in the 60's, but her dad had been very much against us, and the whole thing fizzled out. Then I met her again several years later, and realized that I was still very much in love with her. The only problem was that we were now both married, yet I ended up having an affair with her. It got very messy, and in the end I told her to go back to her husband. I got very depressed about the whole thing, and I was staying at a friend's house in America. He had a case full of shotguns, and I did think about blowing my brains out, but his wife had some books and one of them was the Bible, which I began reading. It was highly appropriate, and that was what got me through, hence the line &quot;brought me a Bible and a gun&quot;. It's a very emotive song for me.&quot;\n\n&quot;Ships In The Sky&quot; is a laid-back affair, and according to composer Laurie Wisefield, was a mixture of all sorts of subconscious things. Laurie: &quot;I'd been to see the film &quot;Close Encounters Of The Third Kind&quot;, which was about the earth being visited by aliens in their space ships. This all came out in the lyrics.&quot;\n\nLaurie wrote the music and lyrics for the album's most aggressive track, the rocker &quot;Stand And Deliver&quot;, which closes the album's first side. Laurie: &quot;What I was trying to do was write in a more rocky English style that had the flavour of the older Wishbone stuff, but with a modern edge to it.&quot; The dueling guitars here make this a musical highlight of the album.\n\nSide two of the album opens with &quot;Anger In Harmony&quot;, which was co-written by Martin Turner, Laurie Wisefield and Andy Powell. Martin: &quot;I think it lacks a certain grittiness that it was intended to have. It sounds a bit limp, as it should have had the live energy that the band created on stage, but that was somehow missing in the studio.&quot;\n\n&quot;Like A Child&quot;, which follows on, was again linked to the ill-fated relationship that Martin had been involved in. Martin: &quot;It was the first time in my life that I had become aware of children. As she had two little children, and I didn't have any of my own, I began to notice their characteristics. I found myself liking children with their energy, their honesty, their view at the world, their naivete, their spontaneity. It kind of reawakened something in me. This song is an attempt to deal with that.&quot;\n\nThe album closes with &quot;The Way Of The World&quot;, which Laurie had written as a type of &quot;epic&quot; song in two parts which could he expanded and improvised further when played live. Laurie: &quot;We'd been playing &quot;Phoenix&quot; for God knows how long, and I decided to write something else that was a bit of an epic. It was like &quot;Phoenix Mark II&quot;!&quot;\n\nVarious other tracks were recorded at the No Smoke sessions, but were dropped for various reasons. These included &quot;Firesign&quot;, and &quot;Time And Space&quot;, which are included on the 1998 CD reissue as bonus tracks. &quot;Firesign&quot; was originally written by Martin Turner back in the mid-sixties, but was always vetoed by the rest of band as a Wishbone Ash track. Although another version of &quot;Firesign&quot; was included on Martin's solo album, Walking The Reeperbahn, the original version was released for the first time on this CD. Martin: &quot;It's a song about reincarnation, and the idea of being reincarnated as an animal. Steve Upton thought the lyrics were ridiculous, and this was probably why it was not included on the album!&quot;\n\n&quot;Time And Space&quot;, another Martin Turner composition, is also included, in a remixed form different from that found on the Distillation box set. Martin: &quot;Time And Space&quot; was a mini-epic. It was a number I'd written, and the whole band had put in a lot of time on. But it was shoved. Listening to it from today's perspective, it's a really good song and certainly deserved to go on the album.&quot;\n\nWhen &quot;No Smoke Without Fire&quot; was first released in the UK, a single was given out free with early copies of the album. The two tracks were &quot;Come In from The Rain&quot;, which had been recorded live at Sheffield City Hall on 18th October 1977, and &quot;Lorelei&quot;, which was recorded live at the Glasgow Apollo l9th November l976. These two tracks are included on the CD reissue, as with the original album. Also included on the CD is the Andy Powell-penned song, &quot;Bad Weather Blues&quot;, which was originally recorded for the Locked In album hack in 1975. It never made that album, but went an to become a live favorite used as an encore number. The version included was recorded live at Sheffield City Hall on 18th October 1977 and was originally the B side of the &quot;You See Red&quot; single.\n\ncd ripped by dBpoweramp\n\nplease seed\n\n","torrent":{"xt":"urn:btih:576b27e0ff223d813697cab1650f278060a4d9e7","amp;dn":"Wishbone+Ash...No+Smoke+Without+Fire%281978%29cd+re-issue%282006%29%5BFLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"576b27e0ff223d813697cab1650f278060a4d9e7","infoHashBuffer":{"type":"Buffer","data":[87,107,39,224,255,34,61,129,54,151,202,177,101,15,39,128,96,164,217,231]},"announce":[],"urlList":[]}}