{"title":"The Chroniclers (Time-Life, The Old West Series).pdf","uid":11794448,"size":34080890,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:57ab904641bb0a0817c6e4dd38338b03c3c2c2c0&amp;dn=The+Chroniclers+%28Time-Life%2C+The+Old+West+Series%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":1,"time":1428074802,"description":"Pdf / English / 1976 / 240 pages / 32.5 MB\n\nThis is a fascinating addition to the Time-Life &quot;Old West&quot; series. Here, we see the role of media, specifically journalists, reporters, photographers, who served to chronicle the Old West. Some of the reporting was hyperbole, some was completely off the mark, and some was compelling. This book serves a useful purpose by addressing these. As the book notes (Page 18): &quot;Joining hands with such distinguished journalists were historians, anthropologists, artists, illustrators and photographers, adventurous and inquiring Europeans, and illustrious men of letters.\n\nThe opening chapter begins with the story of two journalists--Albert Richardson and Horace Greeley--heading west to see for themselves what the region was about (in 1859). We read of Henry Stanley's reporting in the West (the man who was to find Dr. David Livingstone). The multitude of Western reporters and newspaper (coming and going with great rapidity) are covered, too, not just the famous icons of the day.\n\nOne plus for this volume is the illustrations and photographs. For instance, we read of one photographer's life, Joseph Smith, who took many pictures in the West. We get a nice sampling of his work on pages 82-93, giving us a sense of the land and its people. Just so, the work of William Henry Jackson and Alexander Gardner and others (a sampling of his photos appears on pages 209-233, many of which are absolutely stunning).\n\nThere is a segment on the famous writers of the time who visited the West--including Washington Irving, historian Francis Parkman, Bret Harte, Mark Twain, and the like.\n\nAn interesting entree to the chroniclers of the West","torrent":{"xt":"urn:btih:57ab904641bb0a0817c6e4dd38338b03c3c2c2c0","amp;dn":"The+Chroniclers+%28Time-Life%2C+The+Old+West+Series%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57ab904641bb0a0817c6e4dd38338b03c3c2c2c0","infoHashBuffer":{"type":"Buffer","data":[87,171,144,70,65,187,10,8,23,198,228,221,56,51,139,3,195,194,194,192]},"announce":[],"urlList":[]}}