{"title":"Cannonball Adderley - 2006 - Supreme Jazz (SACD 24 88.2) FLAC","uid":9138438,"size":732988937,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:589b4011f44d578bf6b81ff9a9db2fcea8b5a8cc&amp;dn=Cannonball+Adderley+-+2006+-+Supreme+Jazz+%28SACD+24+88.2%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"eika256","files":-1,"time":1383462868,"description":"Cannonball Adderley - 2006 - Supreme Jazz\nSACD 24 bits 88.2 KHz\n\nOne of the great alto saxophonists, Cannonball Adderley had an exuberant and happy sound that communicated immediately to listeners. His intelligent presentation of his music (often explaining what he and his musicians were going to play) helped make him one of the most popular of all jazzmen.\nAdderley already had an established career as a high school band director in Florida when, during a 1955 visit to New York, he was persuaded to sit in with Oscar Pettiford's group at the Cafe Bohemia. His playing created such a sensation that he was soon signed to Savoy and persuaded to play jazz full-time in New York. With his younger brother, cornetist Nat, Cannonball formed a quintet that struggled until its breakup in 1957. Adderley then joined Miles Davis, forming part of his super sextet with John Coltrane and participating on such classic recordings as Milestones and Kind of Blue. Adderley's second attempt to form a quintet with his brother was much more successful for, in 1959, with pianist Bobby Timmons, he had a hit recording of &quot;This Here.&quot; From then on, Cannonball always was able to work steadily with his band.\nDuring its Riverside years (1959-1963), the Adderley Quintet primarily played soulful renditions of hard bop and Cannonball really excelled in the straight-ahead settings. During 1962-1963, Yusef Lateef made the group a sextet and pianist Joe Zawinul was an important new member. The collapse of Riverside resulted in Adderley signing with Capitol and his recordings became gradually more commercial. Charles Lloyd was in Lateef's place for a year (with less success) and then with his departure the group went back to being a quintet. Zawinul's 1966 composition &quot;Mercy, Mercy, Mercy&quot; was a huge hit for the group, Adderley started doubling on soprano, and the quintet's later recordings emphasized long melody statements, funky rhythms, and electronics. However, during his last year, Cannonball Adderley was revisiting the past a bit and on Phenix he recorded new versions of many of his earlier numbers. But before he could evolve his music any further, Cannonball Adderley died suddenly from a stroke. (AllMusic)\n\nTrack list:\n01. A Little Taste\n02. Carribean Cutie\n03. Still Talkin' To Ya\n04. Flamingo\n05. Spontaneous Combustion\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:589b4011f44d578bf6b81ff9a9db2fcea8b5a8cc","amp;dn":"Cannonball+Adderley+-+2006+-+Supreme+Jazz+%28SACD+24+88.2%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"589b4011f44d578bf6b81ff9a9db2fcea8b5a8cc","infoHashBuffer":{"type":"Buffer","data":[88,155,64,17,244,77,87,139,246,184,31,249,169,219,47,206,168,181,168,204]},"announce":[],"urlList":[]}}