{"title":"[FSX] Aerosoft - DHC-6 Twin Otter X: Mission Pack","uid":8069854,"size":82238104,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:589c14e71d3343abd336ef27207a86d8bcfcc493&amp;dn=%5BFSX%5D+Aerosoft+-+DHC-6+Twin+Otter+X%3A+Mission+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"_SnakEye","files":-1,"time":1359248146,"description":"Fly 10 challenging missions with the Aerosoft DHC-6 Twin Otter X. Some missions will not end as you expect them to and it is good being prepared to make an unscheduled stop in the vast Alaskan wilderness. Many hours of flying pleasure guaranteed.\n\nIncluded missions:\n\n    Alaska Transit I: Anchorage: Takeoff from Anchorage, Alaska and fly to Talkeetna carrying passengers and cargo. Complete your flight at Healy.\n    Alaska Transit II: Takeoff from Healy, Alaska and fly to Denali Base Camp at the foot of Mt. McKinley. Drop passengers and supplies then fly on to McGrath.\n    Alaska Transit III: Fly from Anvik to Unalakleet on the coast.\n    Alaska Transit Kodiak: Takeoff from Anchorage, Alaska and fly to Beluga Lake and then on to Kodiak Island. You may choose to stop on the first leg of the journey if you prefer.\n    Homeland Security: Fly a surveillance operation to monitor possible terrorist activity.\n    Northern Medivac: Fly from Skagway to a remote location to pick up an injured prospector. Return him to the hospital at Haines.\n    Rainy Pass Rescue: Fly from McGrath to a remote mountain location to medivac a group of miners. Deliver them safely to Skwentna.\n    Northwest Cargo Kluane: Takeoff from Yakutat, Alaska and fly to Burwash, NWT in Canada across Kluane National Park.\n    Sandspit Transit: Takeoff from Sandspit in the Queen Charlottes and fly to Masset, then Prince Rupert.\n    Taku Glacier Lodge: Takeoff from Juneau and ferry fishermen to Taku Glacier Lodge.\n\n\n\n","torrent":{"xt":"urn:btih:589c14e71d3343abd336ef27207a86d8bcfcc493","amp;dn":"%5BFSX%5D+Aerosoft+-+DHC-6+Twin+Otter+X%3A+Mission+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"589c14e71d3343abd336ef27207a86d8bcfcc493","infoHashBuffer":{"type":"Buffer","data":[88,156,20,231,29,51,67,171,211,54,239,39,32,122,134,216,188,252,196,147]},"announce":[],"urlList":[]}}