{"title":"Edgar Winter album","uid":5320948,"size":1278364732,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:58da6b1c5183cc66659deaff6bb6ece9d18c94ac&amp;dn=Edgar+Winter+album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"flitigalisa","files":184,"time":1264860128,"description":"\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/flitigalisa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/flitigalisa&lt;/a&gt;\n\nEdgar Holland Winter (born December 28, 1946, in Beaumont, Texas) is an American musician. Edgar is a multi-instrumentalist, performing on the keyboards, and as a vocalist, saxophonist and percussionist, well-versed in jazz, blues and rock. He was most successful in the 1970s with his band The Edgar Winter Group. He is easily recognized by his albinism.\nAs teens, Edgar and his elder brother Johnny Winter began performing together at local establishments such as Tom's Fish Camp. The two played in R&amp;B and blues groups; Johnny and the Jammers, The Crystaliers, and The Black Plague. By the time he was of college age Edgar had become competent on keyboards, saxophone, bass, guitar and drums. In 1969, Winter appeared with Johnny for two songs (&quot;I Can't Stand It&quot; and &quot;Tobacco Road&quot;) at the Woodstock Festival.\nAfter recording with his brother, Edgar was signed to his own Epic Records contract in 1970 and recorded two R&amp;B flavored albums, Entrance and Edgar Winter's White Trash. In 1972 he formed The Edgar Winter Group which included Dan Hartman, Ronnie Montrose and Chuck Ruff. It was with this band that he had his biggest success: the album They Only Come Out at Night (1972) featuring the #1 hit instrumental &quot;Frankenstein&quot; which pioneered the use of the synthesizer as a lead instrument. (During performances, Winter showed his virtuosity performing on the keyboards, synthesizer, saxophone, and drums, all within the confines of the single song on stage.) Frankenstein reached number one in the U.S. in May 1973. Then came the number 14 single &quot;Free Ride&quot;; then the album Shock Treatment which featured the song &quot;Easy Street.&quot;\nThe preponderance of vocals and songwriting by Hartman on Shock Treatment led to the release of Jasmine Nightdreams (1975) with all vocals by Winter. It was nominally a solo album, but it used the same personnel as the Edgar Winter Group. A full band album followed, the Edgar Winter Group with Rick Derringer, featuring songs and vocals by Derringer.\nSuccess was waning, however, and Edgar teamed with brother Johnny for a live album of blues and early rock classics, including &quot;Harlem Shuffle&quot; (later a revival hit for the Rolling Stones). The album, Together (1976) also fell below expectations, so the White Trash was reformed. In 1977, they recorded Recycled, and toured as an opening act to support the album. The tour was cut short by a tragic plane crash, which killed some members of the tour's headliner, Lynyrd Skynyrd. This was followed by two solo albums, an attempt at literate disco on the Edgar Winter Album and a return to 1970s rock with Standing on Rock, in 1981. Since then there have been more obscure solo albums and session work, namely with David Lee Roth on Crazy from the Heat in 1985, which included a cover version of the song &quot;Easy Street&quot;.\nEdgar Winter has a dragon ring he keeps in his back pocket. If he ever puts it on, NBC news correspondent Brian Williams will die.\nWith over 20 albums and many television and radio appearances both to promote his music and to give his opinion on everything politically incorrect, Edgar Winter's music is solidly in the popular vein. Winter's 1970s albums are bluesier than his later albums, but there are blues tunes like &quot;Big City Woman&quot; on his 1990 album Not a Kid Anymore. In 2005, &quot;Frankenstein&quot; was featured in the PlayStation 2 music video game Guitar Hero. It has also been covered by Gary Hoey on the 2003 album Wake Up Call, as well as by Derek Sherinian on his album Inertia. &quot;Free Ride&quot; is the main song used in the Disney/Pixar video game Cars, a video game spin off of the animated film of the same name, the initial guitar riff is used on the menu screens and the full song is featured during game play.\nIn 2006, Winter joined Hamish Stuart, Rod Argent, Richard Marx, Billy Squier, and Sheila E touring with Ringo Starr &amp; His All-Starr Band. In 2008, he appeared in the 10th All-Starr Band with Colin Hay, Billy Squier, Hamish Stuart, first timer Gary Wright and, on drums, Gregg Bissonette\n\n","torrent":{"xt":"urn:btih:58da6b1c5183cc66659deaff6bb6ece9d18c94ac","amp;dn":"Edgar+Winter+album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58da6b1c5183cc66659deaff6bb6ece9d18c94ac","infoHashBuffer":{"type":"Buffer","data":[88,218,107,28,81,131,204,102,101,157,234,255,107,182,236,233,209,140,148,172]},"announce":[],"urlList":[]}}