{"title":"Bar Memories","uid":12376576,"size":2273506034,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:590ff2fb5933cbfadcc1197b7aa27c60678f245e&amp;dn=Bar+Memories&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"irealu69","files":1,"time":1441710280,"description":"Bar Memories\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nSynopsis: Andrej Lupin's latest feature for Viv Thomas begins with footage of his three stars - Hanna Sweet, Kiara Lord, and Brandy Smile - enjoying a night on the town, drinking, dancing, flirting, and celebrating in a crowded nightclub. But it's after they've left the bar that this party really gets started! Long-legged brunette Brandy Smile and strawberry blonde Hanna Sweet have stripped down to their sexiest lingerie when they're overcome by mutual desire. The couple proceed to steam up the bathroom with a session of uninhibited and lust-fueled lesbian action that leaves them both glowing with orgasmic pleasure. Smile returns in the next scene, this time teamed with shapely blonde Kiara Lord. Brandy first performs a tantalizing striptease for her lover, then pulls out all the stops for a relentless session of pussy-pleasuring, clit-stroking, and ass-eating. Satisfied and inspired, Lord eagerly follows suit, and it's not long before there's a satisfied smile on Brandy Smile's beautiful face, as well. Kiara Lord and Hanna Sweet share some afternoon delight in the next episode, filling their home with the sights and sounds of unbridled passion as they treat each other to the exquisite pleasure of orgasm using their mouths, lips, tongues, and probing fingers. In the fourth and final scene, Hanna Sweet and Brandy Smile can't be bothered by getting into bed - they make love on a staircase and up on the landing, tonguing and stroking each other to the kind of explosive orgasms that make &quot;Bar Memories&quot; so erotically intoxicating and so intensely memorable.\n\nCast: Kiara Lord, Brandy Smile, Hanna Sweet, Ariel Piper Fawn ProducerAndrej Lupin,Director\n\nScreenshots:\n~~~~~~~~~~~~ &lt;a href=&quot;\nhttp://www.picturescream.com/x/clean/GvCg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturescream.com/x/clean/GvCg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.picturescream.com/x/clean/GvCj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturescream.com/x/clean/GvCj&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.picturescream.com/x/clean/GvCr&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.picturescream.com/x/clean/GvCr&lt;/a&gt;\n\nVideos Info:\n~~~~~~~~~~~~\nSize: 2.117 GB\nDuration: 01:36:40 \t \nResolution: 960x544","torrent":{"xt":"urn:btih:590ff2fb5933cbfadcc1197b7aa27c60678f245e","amp;dn":"Bar+Memories","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"590ff2fb5933cbfadcc1197b7aa27c60678f245e","infoHashBuffer":{"type":"Buffer","data":[89,15,242,251,89,51,203,250,220,193,25,123,122,162,124,96,103,143,36,94]},"announce":[],"urlList":[]}}