{"title":"Enemy.Front-RELOADED","uid":10334459,"size":8554943672,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:591217db707e8e4bfec225d517a10f2171c01548&amp;dn=Enemy.Front-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"Taker009","files":-1,"time":1402451674,"description":"nERv \n\nEnemy Front (c) CI Games \n\n06/2014: RELEASE.DATE .. PROTECTION: Steam\n1: DISC(S) .. GAME.TYPE: Action \n\nENEMY FRONT is the first truly modern WW2 FPS, featuring stunning visuals\nopen-ended levels and a richly interactive combat experience that breaks out\nof the standard model of highly linear scripted FPS experiences, giving the\nplayer full freedom to own their playing style. Intense Combat, Sniping\nStealth and Sabotage all are viable approaches for the player, maximizing\nplayer engagement and replayability. Against the visceral backdrop of\nbreathtaking European locales, the player takes on the role of American\nRobert Hawkins, as he fights hand in hand with Resistance Fighters opposing\nthe Nazi juggernaut in France, Germany, Norway, and during the Warsaw\nUprising \n\n* Choose your own fight: gameplay blends fast-paced FPS action with\nprecision sniping thrilling stealth, and deadly sabotage in the first\nopen-ended WW2 game\n* Deal death from afar: use sniper rifles to decimate enemy ranks and pick\noff officers, enemy snipers and heavy weapons gunners with deadly precision\n* Breathtaking visuals, interactive environments and spectacular action\nacross many iconic Resistance operations of WW2\n* Choose your own weapon: full arsenal of WW2 weaponry across all categories\nof hand-guns, SMGs, assault rifles, sniper rifles, as well as signature\nResistance weapons including the Sten gun, Welrod Silenced Pistol, and\nLightning SMG\n* Own the battlefield: combine reconnaissance, explosives and marksmanship\nto prepare, misdirect and ambush numerically superior Nazi troops\n* Engaging, destructible environments and advanced tactical AI means combat\nis always a rewarding and dynamic experience\n* Highly replayable 10 hour Single-Player Campaign and 12-player Online\nMultiplayer, all powered by CRYENGINE technology \n\n1. Unrar\n2. Burn or mount the image\n3. Install the game\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:591217db707e8e4bfec225d517a10f2171c01548","amp;dn":"Enemy.Front-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"591217db707e8e4bfec225d517a10f2171c01548","infoHashBuffer":{"type":"Buffer","data":[89,18,23,219,112,126,142,75,254,194,37,213,23,161,15,33,113,192,21,72]},"announce":[],"urlList":[]}}