{"title":"CollegeFuckParties - Penny, Sabrina, Eva, Jenny, Rita-Moor...","uid":12992758,"size":807660539,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:59e68a40e7e40c8f9919d3279fffd15c8caf6daf&amp;dn=CollegeFuckParties+-+Penny%2C+Sabrina%2C+Eva%2C+Jenny%2C+Rita-Moor...&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"feeldabyte","files":1,"time":1450137791,"description":"Screens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n \nhttp://imgkiss.com/image/ruAZs \nhttp://imgkiss.com/image/ruEnS \nhttp://imgkiss.com/image/ruWei \nhttp://imgkiss.com/image/ruvXv \nhttp://imgkiss.com/image/ruwV9 \nhttp://imgkiss.com/image/ruL98 \nhttp://imgkiss.com/image/rusEA \nhttp://imgkiss.com/image/ruxTU \nhttp://imgkiss.com/image/ru6pK\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\nSummer is the time to party like hell and to fuck like rabbits! At least this is my friends and me think. Anyway, it was our first outdoor college fuck party of this summer, and it had to be truly epic. We had one brunette, three blondes and two redheads, several bags full of snacks and a car trunk full of booze. We found a very quiet place in the woods where nobody would disturb us and started to unpack. I've always heard that redheads are the most wild and passionate girls ever, but until that party I didn't know it was true. One of the redhead college chicks wanted everyone to check out her boobs, then she made all the pretty party girls get topless and shake their butts to the music. Sweet, huh?\r\n\r\nSoon the girls were horny and drunk enough to boast their blowjob skills. I tell you, there's nothing like a jaw-breaking college blowjob in the fresh air! Things got hotter and hotter, and soon all of us were down on the blankets, licking and fingering and fucking each other. Oh how I love hardcore sex parties! I don't even know where all that energy comes from, you just wanna fuck each and every one of those cute college girls, and you don't wanna stop. Some of the girls even dared to try student anal sex for the first time. One of the blondes turned out to be a big fan of hardcore college sex with double penetration, and all of my friends were happy to help the dirty-minded girl get to cloud nine.\r\n\r\nAs soon as the other sexy college girls saw the blonde being drilled by two guys they also wanted to try it. That was such an unexpected and such a great surprise! Who would say no to a beautiful naked college girl who wants to have her pussy and asshole banged at the same time? You can be sure that all of those babes got what they wanted and that they really loved it! Soon we found out that these inexhaustible college chicks had one more wonderful surprise: they all lay down in a line and got themselves off right in front of our eyes! This was probably the greatest and wildest thing I have ever seen! Go on and check out this impressive party sex scene right now! \r\n\r\n\r\nSail to another one :  https://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:59e68a40e7e40c8f9919d3279fffd15c8caf6daf","amp;dn":"CollegeFuckParties+-+Penny%2C+Sabrina%2C+Eva%2C+Jenny%2C+Rita-Moor...","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59e68a40e7e40c8f9919d3279fffd15c8caf6daf","infoHashBuffer":{"type":"Buffer","data":[89,230,138,64,231,228,12,143,153,25,211,39,159,255,209,92,140,175,109,175]},"announce":[],"urlList":[]}}