{"title":"Pro Evolution Soccer 2014 NTSC/U PAL Xbox 360","uid":10293986,"size":8738846757,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:59e7c6399f8cc6bcedb4263598fa183010ce3196&amp;dn=Pro+Evolution+Soccer+2014+NTSC%2FU+PAL+Xbox+360&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rjp1679","files":2,"time":1401898386,"description":"Pro Evolution Soccer 2014:\n\nRegion      : NTSC/U PAL            Languages: English        \nSize        : 1 DVD                 Genre    : Sports         \nPlatform    : XBOX 360              Date     : 9/2013\n\nAbout:\n\nPro Evolution Soccer 2014 title will mark a new beginning for the popular series, with an all-new engine allowing for the most comprehensive advance for the Pro Evolution Soccer series since its inception. The new engine has been in development for a number of years and uses Kojima Production's renowned FOX Engine at its core, extended and enhanced to match the bespoke and complex demands of a football title. Based on six gameplay tenants, the new system allows every aspect of Pro Evolution Soccer 2014 to be totally reworked. Throwing off previous limitations imposed by dated animation systems and AI elements, the engine has enabled the PES Productions team to produce a game much closer to the excitement and variety of a top-level match. The central theme of fluidity is based on the constant moving of players and switching positions which mirrors the modern approach to football. Producers looked at how the matches ebb and flow, with player individuality key to a team's success, and well-drilled tactics helping underdogs produce giant-killing feats. Working from the ground up, the team has reworked every element of play, creating a fresh and energetic new standard for football titles. In addition to noticeably improved graphics and seamless animation, the thrust of the new engine's power has been used to redefine the way football is played on a gaming console. Gone are the limitations imposed by dated animation systems and AI elements, and instead PES 2014 boasts a central core that perfectly mimics the skill and awareness that elevates the world's greatest players above their peers. ","torrent":{"xt":"urn:btih:59e7c6399f8cc6bcedb4263598fa183010ce3196","amp;dn":"Pro+Evolution+Soccer+2014+NTSC%2FU+PAL+Xbox+360","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59e7c6399f8cc6bcedb4263598fa183010ce3196","infoHashBuffer":{"type":"Buffer","data":[89,231,198,57,159,140,198,188,237,180,38,53,152,250,24,48,16,206,49,150]},"announce":[],"urlList":[]}}