{"title":"Dxtory 2.0.111 Licensed Game record Software [A4]","uid":7135505,"size":2359599,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5a8abc6b345e053c5541826f2b5a7b41fe38142f&amp;dn=Dxtory+2.0.111+Licensed+Game+record+Software+%5BA4%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"AUDI-A4","files":1,"time":1332845195,"description":"The Fastest Movie Capture\n\nDxtory is a movie capture tool only for DirextX/OpenGL application.\nIn order to acquire data from Surface Memory directly, It operates very much at high speed.\nArbitrary cropping and free scaling are supported by hardware.\nNon-deteriorated Capture\n\nThe codec of Dxtory can record original pixel data as it is. A quality can be pursued to a limit with video source without degradation.\nMoreover, since the third party VFW codec is also supported, the user can choose a favorite solution.\nDistribution HDD Writing\n\n\nThe bottleneck of No. 1 of the speed of capture is a write-in speed to HDD.\nIf it is the environment of two or more HDD, this function will accelerate writting speed.\nPreparation is completed only by specifying two or more holders which save data, and performing speed setting, without using a special file system.\nDual Audio Recording\n\nIf there are two or more audio input devices, two sound sources are recordable, like game sound and mic input.\nIt is possible to edit it individually later because it is preserved respectively as an independent stream in AVI file.\nOnly voice changes volume or there is small only game sound, by the conventional mux recording, it becomes possible for it to have been impossible.\nIf CoreAudio is effective environment (Windows Vista/Windows 7), since game sound can also be recorded from an output, only by 1 audio device, two lines are recordable. (* There is also a thing which cannot record sound depending on application.)","torrent":{"xt":"urn:btih:5a8abc6b345e053c5541826f2b5a7b41fe38142f","amp;dn":"Dxtory+2.0.111+Licensed+Game+record+Software+%5BA4%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a8abc6b345e053c5541826f2b5a7b41fe38142f","infoHashBuffer":{"type":"Buffer","data":[90,138,188,107,52,94,5,60,85,65,130,111,43,90,123,65,254,56,20,47]},"announce":[],"urlList":[]}}