{"title":"Civil War Humor (US History).pdf","uid":8636669,"size":7693792,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5aa91c79ce85a2def73a0933b733a24fcbdcdbfa&amp;dn=Civil+War+Humor+%28US+History%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1372770760,"description":"Cameron C. Nickels, &quot;Civil War Humor&quot;\nEnglish | 2010 | ISBN: 1604737476 | PDF | 160 pages | 7.3 MB\n\nA thorough account of the extraordinary breadth of comedic output during America's Civil War.\nIn Civil War Humor, author Cameron C. Nickels examines the various forms of comedic popular artifacts produced in America from 1861 to 1865 and looks at how wartime humor was created, disseminated, and received by both sides of the conflict. \n\nBroadsides, newspaper journalism, sheet music covers, lithographs, political cartoons, light verse, printed envelopes, comic valentines, humor magazines, and penny dreadfuls---from and for the Union and the Confederacy---are analyzed at length.\n\nNickels argues that the war coincided with the rise of inexpensive mass printing in the United States and thus subsequently with the rise of the country's widely distributed popular culture. As such, the war was as much a &quot;paper war&quot;---involving the use of publications to disseminate propaganda and ideas about the Union's and the Confederacy's positions---as one taking place on battlefields. For both sides, humor deflated pretensions, coped with the sobering realities of war, and established political stances and strategies of critiquing them. Civil War Humor explores how the combatants portrayed Jefferson Davis and Abraham Lincoln, life on the home front, battles, and African Americans.\n\nCivil War Humor reproduces over sixty illustrations---including eight in full color---and texts created during the war and provides close readings of these materials. At the same time, it places this corpus of comedy in the context of wartime history, economies, and tactics. This comprehensive overview examines humor's role in shaping and reflecting the cultural imagination of the nation during its most tumultuous period.","torrent":{"xt":"urn:btih:5aa91c79ce85a2def73a0933b733a24fcbdcdbfa","amp;dn":"Civil+War+Humor+%28US+History%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5aa91c79ce85a2def73a0933b733a24fcbdcdbfa","infoHashBuffer":{"type":"Buffer","data":[90,169,28,121,206,133,162,222,247,58,9,51,183,51,162,79,203,220,219,250]},"announce":[],"urlList":[]}}