{"title":"meninpain.com","uid":5098762,"size":14174569185,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:5b123d8f89be959e0640a6563a49a1042d8e3711&amp;dn=meninpain.com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Puzker","files":-1,"time":1253798730,"description":"Production year: 2009\nGenre: Femdom, Bondage, Strapon, Spanking, Facesitting\nStudio: kink.com\nDescription: Rigid theme\nVideo quality: HDRip\nVideo Format: WMV\nVideo codec: Windows Media\nAudio Codec: WMA\nVideo: Windows Media Video 9 1280x720 29.97fps 1500Kbps\nAudio: Windows Media Audio 44100Hz stereo 128Kbps\nThe best collection on this topic! From the Russian studio, well known on the Internet.\n &lt;a href=&quot;\nhttp://russian-femdom.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://russian-femdom.net&lt;/a&gt;\n\nMost requested not to leave the distribution and leave comments-type thanks:)\n\n What is Men In Pain?\n\nMen in Pain BDSM offers the best Femdom. At MeninPain.com, sexy women dominate and humiliate naked men to please any fetish. We feature a large selection of photo, video, and streaming media galleries. Male bondage sex here with women includes cock and ball torment, rope bondage, women spanking men, male urethral play, penis torment, testicle torment, facesitting femdom, beating, slapping, and hard fucking.\n\nGirls bring amazing implements and techniques to torment and humiliate their men at MeninPain.com. One of the girls paddles, slaps, spits on, and fucks her guy. She pins his cock, balls, and nipples with clothespins, reams him with a strapon, and then lets him fuck her hard with his stiff cock. The next sadistic woman gets her ass kissed and fucked after first fucking her man's ass. The next guy gets an electrified catheter put in the urethra of his cock, he gets held up with suspension bondage, and then he gets fucked in the ass by his mistress.\n\nAs you can see, the hardcore porn we offer at Men in Pain is some of the best adult BDSM you'll find. We not only have shibari with men bound and gagged, but we are kinky to the extreme. We have bondage sex with women fucking men, testicle torment, and men tied up. If you like Femdom, stay here and enjoy femdom tgp, femdom facesitting, femdom spanking, femdom galleries, femdom humiliation, strapon femdom, femdom videos, and extreme femdom cfnm. ","torrent":{"xt":"urn:btih:5b123d8f89be959e0640a6563a49a1042d8e3711","amp;dn":"meninpain.com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b123d8f89be959e0640a6563a49a1042d8e3711","infoHashBuffer":{"type":"Buffer","data":[91,18,61,143,137,190,149,158,6,64,166,86,58,73,161,4,45,142,55,17]},"announce":[],"urlList":[]}}