{"title":"The Kingdom of Infinite Space- Raymond Tallis [PDF] [StormRG]","uid":10887938,"size":1522532,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b128fbd3f8a4c2124b148c99c61d12a6ab4bd6e&amp;dn=The+Kingdom+of+Infinite+Space-+Raymond+Tallis+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"krystine","files":-1,"time":1409084265,"description":"The Kingdom of Infinite Space: A Fantastical Journey Around Your Head\nAuthor: Raymond Tallis\nPublished: 2009\nPublisher: Atlantic Books\nISBN: 9781843546702\nFormat: Retail PDF\nReader Required:Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\n\nIn this pathbreaking book, one of Britain's most eloquent and original thinkers writes about the head, what happens in it, and how it is and is not connected to our sense of identity and consciousness. Blending science, philosophy, and humor, Raymond Tallis examines the extraordinarily complex relationship we have with our heads. His aim, as he says, &quot;is to turn readers into astonished tourists of the piece of the world that is closest to them, so they never again take for granted the head that looks at them from the mirror.&quot; Readers will delight that this is precisely what he accomplishes. The voyage begins with a meditation on the self-portrait of a mirror image, followed by a consideration of the head's various secretions. Tallis contemplates the air we exhale; the subtle meanings of nods, winks, and smiles; the mysteries of hearing, taste, and smell. He discusses the metaphysics of the gaze, the meaning of kissing, and the processes by which the head comes to understand the world. Along the way he offers intriguing digressions on such notions as &quot;having&quot; and &quot;using&quot; one's head, and enjoying and suffering it. Tallis concludes with his thoughts on the very thing the reader's head has been doing throughout the book: thinking.\n","torrent":{"xt":"urn:btih:5b128fbd3f8a4c2124b148c99c61d12a6ab4bd6e","amp;dn":"The+Kingdom+of+Infinite+Space-+Raymond+Tallis+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b128fbd3f8a4c2124b148c99c61d12a6ab4bd6e","infoHashBuffer":{"type":"Buffer","data":[91,18,143,189,63,138,76,33,36,177,72,201,156,97,209,42,106,180,189,110]},"announce":[],"urlList":[]}}