{"title":"[SoM]Witness.Il Testimone[DvdRip-Xvid-Ita-Mp3]","uid":4502235,"size":1564616704,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5b24babe34cbda1ae097b4194fa065ad4be325ed&amp;dn=%5BSoM%5DWitness.Il+Testimone%5BDvdRip-Xvid-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mitimex","files":1,"time":1226442242,"description":"Un omicidio ed un testimone. Uno schema, una trama classica per un film d&amp;#039;azione. Con una novitÃƒÂ  perÃƒÂ². Il testimone ÃƒÂ¨ appena un bambino. Senza papÃƒÂ  ed amish alla sua prima uscita al di fuori del suo mondo. Un mondo quello degli amish completamente diverso da tutto quello che noi conosciamo, un mondo antico per noi, pieno di fascino, di magia. Sembra di tornare indietro nei secoli, in un altro mondo, senza elettricitÃƒÂ , televisione, automobili. Senza tutto quello che per noi ÃƒÂ¨ scontato, normale. &quot;Gli amish non vivono nel nostro tempo&quot;, non perchÃƒÂ© costretti, ma per scelta.\nPotete immaginare la sorpresa di un bimbo che per la prima esce da questo mondo, che per la prima volta vede un mondo completamente diverso, e subito una grande cittÃƒÂ , Philadelphia. E subito un omicidio, nei bagni pubblici. E lui Samuel Lap ÃƒÂ¨ l&amp;#039;unico testimone di questo omicidio. ÃƒË† lui, un bravissimo Lukas Haas, il testimone da proteggere, da aiutare. Ad aiutarlo ed ad aiutare la madre, Kelly McGillis sarÃƒÂ  John Book, un buono per eccellenza: Harrison Ford. Ovviamente non sarÃƒÂ  un caso semplice. Il piccolo Samuel riconosce l&amp;#039;assassino. Si tratta del tenente della nercotici McFee, Danny Glover. Potete immaginare le implicazioni e cosa dovranno sopportare il bambino e John Book. Entrambi in pericolo di vita scapperanno e troveranno rifugio nella comunitÃƒÂ  amish del bimbo. ComunitÃƒÂ  cristiana di origine tedesca senza nessun aspetto moderno ma anche con un forte senso della collettivitÃƒÂ , dell&amp;#039;aiutarsi l&amp;#039;un l&amp;#039;altro. Come nella costruzione delle case. Naturalmente per John Book sarÃƒÂ  complicato adattarsi a questo nuovo mondo, come anche questo mondo in modo complicato si adatterÃƒÂ  a lui. A complicare ancor di piÃƒÂ¹ le cose naturalmente l&amp;#039;amore tra John Book e la mamma di Samuel \nDavvero un bel film e un bel poliziesco con degli attori bravi. E poi la scoperta per noi di un nuovo mondo, forse strano ma da apprezzare. \nBellissima la fotografia ispirata alla pittura fiamminga, il film ha vinto anche due Oscar per la sceneggiatura originale e il montaggio.\n","torrent":{"xt":"urn:btih:5b24babe34cbda1ae097b4194fa065ad4be325ed","amp;dn":"%5BSoM%5DWitness.Il+Testimone%5BDvdRip-Xvid-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b24babe34cbda1ae097b4194fa065ad4be325ed","infoHashBuffer":{"type":"Buffer","data":[91,36,186,190,52,203,218,26,224,151,180,25,79,160,101,173,75,227,37,237]},"announce":[],"urlList":[]}}