{"title":"Utopia Parkway - The Life and Work of Joseph Cornell (Art Ebook)","uid":10413063,"size":70868056,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b2984729488420103d9bb680736ae6ef167e68f&amp;dn=Utopia+Parkway+-+The+Life+and+Work+of+Joseph+Cornell+%28Art+Ebook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":1,"time":1403563278,"description":"Pdf / English / 426 pag / 1997 / 67 MB\n\nNo artist ever led a stranger life than Joseph Cornell, the self-taught American genius prized for his disquieting shadow boxes, who stands at the intersection of Surrealism, Abstract Expressionism and Pop art. Legends about Cornell abound--as the shy hermit, the devoted family caretaker, the artistic innocent--but never before Utopia Parkway has he been presented for what he was: a brilliant, relentlessly serious artist whose stature has now reached monumental proportions. Cornell was haunted by dreams and visions, yet the site of his imaginings couldn't have been more ordinary: a small house he shared with his mother and invalid brother in Queens, New York. In its cluttered basement, he spent his nights arranging photographs, cut-outs and other humble disjecta into some of the most romantic works to exist in three dimensions. Cornell was no recluse, however: admired by successive generations of vanguard artists, he formed friendships with figures as diverse as Duchamp, de Kooning, and Warhol and had romantically charged encounters with Susan Sontag and Yoko Ono--not to mention unrequited crushes on countless shop girls and waitresses. All this he recorded compulsively in a diary that, along with his shadow boxes, forms one of the oddest and most affecting records ever made of a life. It is from such documents, and from a decade of sustained attention to Cornell, that Deborah Solomon has fashioned the definitive biography of one of America's most powerful and unusual modern artists.","torrent":{"xt":"urn:btih:5b2984729488420103d9bb680736ae6ef167e68f","amp;dn":"Utopia+Parkway+-+The+Life+and+Work+of+Joseph+Cornell+%28Art+Ebook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b2984729488420103d9bb680736ae6ef167e68f","infoHashBuffer":{"type":"Buffer","data":[91,41,132,114,148,136,66,1,3,217,187,104,7,54,174,110,241,103,230,143]},"announce":[],"urlList":[]}}