{"title":"Muslim Massacre","uid":4393139,"size":4457183,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5bb692c836cc518b36f31064637193025b0369a7&amp;dn=Muslim+Massacre&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"DirkaSA","files":20,"time":1221297419,"description":"Author's website was hit by an airplane, rehosting game here\n\n-----\n\nMUSLIM MASSACRE\n\nThe United States of America, a leader and role model for all in the modern world, is taking drastic measures to secure the freedom and safety of the world. Having born witness to the atrocities of the followers of Islam time and time again, it has been decided that the entire Muslim race shall be wiped from the surface of the Earth.\n\nYou, the American Hero, have valiantly volunteered to make landfall in the Middle East and ensure that no Muslim man or woman is left alive. Your mission priorities are to seek out and neutralize the Muslim leader Osama bin Laden, their radical cult leader Muhammad and finally Allah, taking down any targets you meet on the way.\n\nSCREENSHOTS &lt;a href=&quot;\nhttp://bayimg.com/NAkkjaaBh&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/NAkkjaaBh&lt;/a&gt;\n\nTHE BETA\n\nThis beta will be up for a few days only so grab it while you can. There are a number of things that aren't in the beta which are listed here:\n\n* Intro sequence visuals still incomplete, but the audio is finished, so you can listen to the rest of it if you wish.\n* Instructions button doesn't do anything yet\n* Levels 7-12 not in the beta\n* Bosses 2 and 3 not in the beta\n\nThe beta does however have a &quot;debug&quot; level where you have unlimited lives and time. You get to play this if you beat the included 6 levels and boss.\n\nHOW TO PLAY\n\nThe instructions screen isn't done yet, so this is how you play:\n\n* Use the mouse to AIM\n* Press mouse button 1 to fire your weapon\n* Press mouse button 2 to throw grenades if you have any\n* Use WASD to move your man\n\nEach round lasts 90. If you are still alive after 90 seconds, enemies will stop spawning and all you have to do is clean up the rest of them to progress to the next round.\n\nNOTES\n\n* The rocket launcher will follow the cursor wherever you position it before exploding after one second of flight time. Even if you are almost surrounded by enemies, you can still guide a missile out of the crowd and explode it far enough away from you to be safe but still take down lots of guys.\n* In their battle frenzy, the enemy may often accept friendly losses in order to kill you. Use enemy friendly fire to your advantage.\n* Most of the other stuff you'll figure out on the way.\n\nDOWNLOAD &lt;a href=&quot;\nhttp://www.muslimmassacre.com/mmbeta.rar&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.muslimmassacre.com/mmbeta.rar&lt;/a&gt;\n\nHOW YOU CAN HELP\n* Report any bugs\n* Provide download mirrors for the game when it is finished, and possibly a place to host the website. My current host will definitely take the site down once they receive enough complaints, which they have done to me before.\n* Don't whinge about how offensive and &quot;edgy&quot; this is\n\nHave fun!","torrent":{"xt":"urn:btih:5bb692c836cc518b36f31064637193025b0369a7","amp;dn":"Muslim+Massacre","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bb692c836cc518b36f31064637193025b0369a7","infoHashBuffer":{"type":"Buffer","data":[91,182,146,200,54,204,81,139,54,243,16,100,99,113,147,2,91,3,105,167]},"announce":[],"urlList":[]}}