{"title":"(Blues) Elizabeth Cotten - Shake Sugaree","uid":6312680,"size":145914498,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5bc429961c80174fbf0919186accc116c1436a7e&amp;dn=%28Blues%29+Elizabeth+Cotten+-+Shake+Sugaree&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1302594103,"description":"mp3   320kbps\n\nReleased: 2004\nLabel: Smithsonian Folkways\nStyles: Traditional folk, Appalachian folk\nArt: Front\n\n\nTracklisting:\n\n(5:02) 1. Shake Sugaree\n(1:59) 2. Take Me Back To Baltimore\n(3:37) 3. Washington Blues\n(3:25) 4. I'm Going Away\n(3:42) 5. Fox Chase\n(3:45) 6. Ontario Blues\n(2:03) 7. Fare You Well, My Darling\n(3:01) 8. Untitled / George Buck\n(0:53) 9. Mama, Nobody's Here But The Baby\n(1:37) 10. Mama, Nobody's Here But The Baby\n(1:52) 11. Look And Live, My Brother\n(2:08) 12. Jesus Lifted Me\n(1:39) 13. Jesus Is Tenderly Calling\n(1:52) 14. Buck Dance\n(2:13) 15. Ruben\n(1:31) 16. Oh, Miss Lulie Gal\n(1:45) 17. Can't Get A Letter From Down The Road\n(1:40) 18. Shoot That Buffalo\n(1:48) 19. Boatman Dance\n(1:34) 20. Hallelujah, It Is Done\n(1:25) 21. Holy Ghost, Unchain My Name\n(2:22) 22. Little Brown Jug\n(2:12) 23. Delia\n(2:34) 24. Ball The Jack\n(2:03) 25. Till We Meet Again\n(2:45) 26. When The Train Comes Along\n\n\nElizabeth Cotten was a national treasure. She didn't begin recording until she was 66 years old (in 1958), but a simple song she had written when she was 11, &quot;Freight Train,&quot; became a staple of the folk revival in the 1960s, and her frequent concerts and appearances on the folk circuit were legendary for their unassuming grace and wisdom, not to mention her unique guitar skills. Left-handed, Cotten played her guitars and banjos upside down and backward, and her picking style gave the bass strings a clear sound while working muted harmonics on the treble strings, all of which resulted in an idiosyncratic guitar style that, coupled with her frequent open tunings, gave her playing a special singularity. Her vocals were often fragile-sounding and shaky, but so full of a natural clarity and joy that it's hard to imagine her singing any other way, and what might have been a weakness only added to her ability to connect with audiences. This collection from Smithsonian Folkways is a revised reissue of her second LP, which originally appeared in 1965, with ten previously unreleased tracks added. The title cut, &quot;Shake Sugaree,&quot; has had almost as long a life as &quot;Freight Train,&quot; and has been covered by the likes of the Grateful Dead and Bob Dylan in concert. Cotten's version is sung in a lovely, seemingly effortless fashion by her great grandchild, Brenda Evans (then only 12 years old), with Cotten providing the guitar lines, and the song itself is a whimsical set of half-riddles intended as a lullaby. Many of these tracks are brief guitar instrumentals, what Mike Seeger calls &quot;parlor ragtime&quot; in his liner notes, and the pair of instrumental church pieces that close the disc, &quot;Till We Meet Again&quot; and &quot;When the Train Comes Along,&quot; are particularly striking. Other highlights include &quot;Untitled/Georgie Buck,&quot; which begins with an improvised bit of banjo-style guitar picking before morphing into &quot;Georgie Buck,&quot; a well-known Appalachian banjo and fiddle tune. The goofy &quot;Shoot That Buffalo,&quot; which Cotten plays on banjo, accelerates as it unwinds, and it is easy to imagine children being delighted by its kinetic energy and playful lyrics. The haunting banjo song &quot;Reuben,&quot; here played on guitar in open D tuning, is another highlight. Libba Cotten's fans are loyal and enduring and will be delighted with this expanded edition of Shake Sugaree. Listeners new to Cotten may want to start with her first Smithsonian Folkways album, Freight Train and Other North Carolina Folk Songs and Tunes, or even 1984's Live! (which earned Cotten a Grammy Award in 1985, when she was 90 years old), or better yet, pick up all three, making a sort of collected works. She's that special. \n","torrent":{"xt":"urn:btih:5bc429961c80174fbf0919186accc116c1436a7e","amp;dn":"%28Blues%29+Elizabeth+Cotten+-+Shake+Sugaree","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bc429961c80174fbf0919186accc116c1436a7e","infoHashBuffer":{"type":"Buffer","data":[91,196,41,150,28,128,23,79,191,9,25,24,106,204,193,22,193,67,106,126]},"announce":[],"urlList":[]}}