{"title":"The Second World War, by Antony Beevor [ePub / mobi]","uid":13190841,"size":26286009,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5bebc180ea2f0390e878871199a9e7bd4e125f78&amp;dn=The+Second+World+War%2C+by+Antony+Beevor+%5BePub+%2F+mobi%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bey0nd","files":2,"time":1452431332,"description":"The Second World War began in August 1939 on the edge of Manchuria and ended there exactly six years later with the Soviet invasion of northern China. The war in Europe appeared completely divorced from the war in the Pacific and China, and yet events on opposite sides of the world had profound effects.\r\n\r\nUsing the most up-to-date scholarship and research, and writing with clarity and compassion, Beevor assembles the whole picture in a gripping narrative that extends from the North Atlantic to the South Pacific, from the snowbound steppe to the North African Desert, to the Burmese jungle, SS Einsatzgruppen in the borderlands, Gulag prisoners drafted into punishment battalions, and to the unspeakable cruelties of the Sino-Japanese War.\r\n\r\nMoral choice forms the basis of all human drama, and no other period in history has presented greater dilemmas both for leaders and ordinary people, nor offered such examples of individual and mass tragedy, the corruption of power politics, ideological hypocrisy, the egomania of commanders, betrayal, perversity, self-sacrifice, unbelievable sadism and unpredictable kindness. Although filling the broadest canvas on a heroic scale, Beevor's THE SECOND WORLD WAR never loses sight of the fate of the ordinary soldiers and civilians whose lives were crushed by the titanic forces unleashed in this, the most terrible war in history.\r\n\r\nA beautifully produced hardback edition with embossed jacket, 53 black and white photographs and 25 maps.\r\n\r\n\r\n====================================\r\nHardcover: 880 pages\r\nPublisher: Little, Brown and Company\r\nISBN-13: 9780316084079\r\nPublication date: 06/05/2012","torrent":{"xt":"urn:btih:5bebc180ea2f0390e878871199a9e7bd4e125f78","amp;dn":"The+Second+World+War%2C+by+Antony+Beevor+%5BePub+%2F+mobi%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bebc180ea2f0390e878871199a9e7bd4e125f78","infoHashBuffer":{"type":"Buffer","data":[91,235,193,128,234,47,3,144,232,120,135,17,153,169,231,189,78,18,95,120]},"announce":[],"urlList":[]}}