{"title":"The Indian Ocean in World History.pdf","uid":10941182,"size":5629880,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c3654f2a52d07d3a76d0c6e4034a9fd78bb4095&amp;dn=The+Indian+Ocean+in+World+History.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1409520084,"description":"The Indian Ocean in World History (New Oxford World History) by Edward A. Alpers\nEnglish | 2013 | 192 pages | PDF | 5,4 MB\n\nThe Indian Ocean remains the least studied of the world's geographic regions. Yet there have been major cultural exchanges across its waters and around its shores from the third millennium B.C.E. to the present day. \n\nHistorian Edward A. Alpers explores the complex issues involved in cultural exchange in the Indian Ocean Rim region over the course of this long period of time by combining a historical approach with the insights of anthropology, art history, ethnomusicology, and geography.\n\nThe Indian Ocean witnessed several significant diasporas during the past two millennia, including migrations of traders, indentured laborers, civil servants, sailors, and slaves throughout the entire basin. Persians and Arabs from the Gulf came to eastern Africa and Madagascar as traders and settlers, while Hadramis dispersed from south Yemen as traders and Muslim teachers to the Comoro Islands, Zanzibar, South India, and Indonesia. Southeast Asians migrated to Madagascar, and Chinese dispersed from Southeast Asia to the Mascarene Islands to South Africa.","torrent":{"xt":"urn:btih:5c3654f2a52d07d3a76d0c6e4034a9fd78bb4095","amp;dn":"The+Indian+Ocean+in+World+History.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c3654f2a52d07d3a76d0c6e4034a9fd78bb4095","infoHashBuffer":{"type":"Buffer","data":[92,54,84,242,165,45,7,211,167,109,12,110,64,52,169,253,120,187,64,149]},"announce":[],"urlList":[]}}