{"title":"Ghost Hunter (EMF, EVP, SCAN) v1.1.7 Android","uid":11310571,"size":9366807,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:5d066b7a2d119a8f6d4613a8a7f2a1c4bdac1e7e&amp;dn=Ghost+Hunter+%28EMF%2C+EVP%2C+SCAN%29+v1.1.7+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":".BONE.","files":-1,"time":1414509303,"description":"Ghost Hunter (EMF, EVP, SCAN) v1.1.7 \nRequirements: Android 2.1 and up\nOverview: CAUTION - This application leverages sensors and frequencies that may disturb paranormal energies and disturb unknown entities. Please use with caution. This app is for entertainment purposes only, enjoy!\n\nImage\n\nIncludes FIVE paranormal detection apps in one!\nEMF Detector\nElectromagnetic Frequency Detector uses the sensorometer and the built in magnetic frequency detector in your mobile device to detect paranormal field readings with the same accuracy as heavy equipment that costs thousands of dollars! A must have for every paranormal investigator!\nParanormal Visual Scanner\nThe only one of its kind! The Visual Scanner employs several complex algorithms which compute live data from the electromagnetic frequencies, the barometer, and hardware field sensors. This allows the Scanner to produce actual visual displays of disturbances as they occur!\nWARNING - Please exercise caution when approaching intense fields of activity as not all paranormal entities are friendly.\nEVP Detector\nCapture white noise in real time with the EVP Detector! No need for playback and analysis, the EVP detector has a built in analysis detection engine that interprets anomalous audio traffic and plays feedback in real time. This allows actual conversations with paranormal entities in real time!\n(NEW) RECORD EVP to SDCARD. This EVP Detector allows for up to 6 long term EVP recordings to be saved to the SD Card. The recordings can be played back immediately with the play button or specific recordings can be played back for analysis or deleted by using the corresponding menu button.&quot;\n(NEW) The Advanced Analysis EVP detector allows advanced and immediate analysis of EVP recordings. Recordings are saved to the device's memory bufer and can be played back at 9 various frequencies and speeds including reverse playback at 3 different frequencies! Best for use with short recordings in highly paranormal areas, longer recordings increases chances of force close error depending on the individual device's buffer space","torrent":{"xt":"urn:btih:5d066b7a2d119a8f6d4613a8a7f2a1c4bdac1e7e","amp;dn":"Ghost+Hunter+%28EMF%2C+EVP%2C+SCAN%29+v1.1.7+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d066b7a2d119a8f6d4613a8a7f2a1c4bdac1e7e","infoHashBuffer":{"type":"Buffer","data":[93,6,107,122,45,17,154,143,109,70,19,168,167,242,161,196,189,172,30,126]},"announce":[],"urlList":[]}}