{"title":"Futurama - Season 1 - Audio Commentary - DVDRip - AAC","uid":7503050,"size":150190274,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:5d34924db4739eadff5272298dfba2f2087c4bdd&amp;dn=Futurama+-+Season+1+-+Audio+Commentary+-+DVDRip+-+AAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"schleicher","files":14,"time":1344039809,"description":"A Big Piece of Garbage (1ACV08) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Lewis Morton, Susan Dietter, John DiMaggio)\n\nA Fishful of Dollars (1ACV06) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Patric M. Verrone, Gregg Vanzo and John DiMaggio)\n\nA Flight To Remember (1ACV10) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Eric Horsted, Peter Avanzino, Scott Vanzo and John DiMaggio)\n\nFear of a Bot Planet (1ACV05) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Gregg Vanzo and John DiMaggio)\n\nFry &amp; the Slurm Factory (1ACV13) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Lewis Morton, Ron Hughart and John DiMaggio)\n\nHell Is Other Robots (1ACV09) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Eric Kaplan, Gregg Vanzo and John DiMaggio)\n\nI, Roommate (1ACV03) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Gregg Vanzo, Eric Horsted, Bret Haaland and Billy West)\n\nLove's Labour's Lost In Space (1ACV04) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Brian Kelley, Brian Sheesley, Scott Vanzo and John DiMaggio)\n\nMars University (1ACV11) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, J. Stewart Burns, Bret Haaland, Gregg Vanzo and Billy West)\n\nMy Three Suns (1ACV07) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, J. Stewart Burns, Gregg Vanzo and Billy West)\n\nSpace Pilot 3000 (1ACV01) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Gregg Vanzo and John DiMaggio)\n\nThe Series Has Landed (1ACV02) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Ken Keeler, Peter Avanzino and John DiMaggio)\n\nWhen Aliens Attack (1ACV12) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Ken Keeler, Scott Vanzo, Brian Sheesley and John DiMaggio)","torrent":{"xt":"urn:btih:5d34924db4739eadff5272298dfba2f2087c4bdd","amp;dn":"Futurama+-+Season+1+-+Audio+Commentary+-+DVDRip+-+AAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d34924db4739eadff5272298dfba2f2087c4bdd","infoHashBuffer":{"type":"Buffer","data":[93,52,146,77,180,115,158,173,255,82,114,41,141,251,162,242,8,124,75,221]},"announce":[],"urlList":[]}}