{"title":"The Kinks - Lola Versus Powerman And The Money Go Round (1970/20","uid":7303868,"size":285951343,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5d51d1a35cb9543662fff49f07d5f6656e634a45&amp;dn=The+Kinks+-+Lola+Versus+Powerman+And+The+Money+Go+Round+%281970%2F20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"froogAL","files":17,"time":1338129380,"description":"Band: The Kinks\nAlbum: Lola Versus Powerman And The Money Go Round\nYear: 1970/2000\nCountry: UK\nGenre: Rock\n\nTracklist:\n\n01 The Contenders - 2:42\n02 Strangers - 3:20\n03 Denmark Street - 2:02\n04 Get Back in Line - 3:05\n05 Lola - 4:01\n06 Top of the Pops - 3:40\n07 The Moneygoround - 1:44\n08 This Time Tomorrow - 3:22\n09 A Long Way from Home - 2:27\n10 Rats - 2:40\n11 Apeman - 3:52\n12 Powerman - 4:19\n13 Got to Be Free - 3:01\n\n&quot;Lola&quot; gave the Kinks an unexpected hit and its crisp, muscular sound, pitched halfway between acoustic folk and hard rock, provided a new style for the band. However, the song only hinted at what its accompanying album Lola vs. the Powerman &amp; the Money-Go-Round, Pt. 1 was all about. It didn't matter that Ray Davies just had his first hit in years -- he had suffered greatly at the hands of the music industry and he wanted to tell the story in song. Hence, Lola -- a loose concept album about Ray Davies' own psychosis and bitter feelings toward the music industry. Davies never really delivers a cohesive story, but the record holds together because it's one of his strongest set of songs. Dave Davies contributes the lovely &quot;Strangers&quot; and the appropriately paranoid &quot;Rats,&quot; but this is truly Ray' show, as he lashes out at ex-managers (the boisterous vaudevillian &quot;The Moneygoround&quot;), publishers (&quot;Denmark Street&quot;), TV and music journalists (the hard-hitting &quot;Top of the Pops&quot;), label executives (&quot;Powerman&quot;), and, hell, just society in general (&quot;Apeman,&quot; &quot;Got to Be Free&quot;). If his wit wasn't sharp, the entire project would be insufferable, but the album is as funny as it is angry. Furthermore, he balances his bile with three of his best melancholy ballads: &quot;This Time Tomorrow,&quot; &quot;A Long Way From Home,&quot; and the anti-welfare and union &quot;Get Back in Line,&quot; which captures working-class angst better than any other rock song. These songs provide the spine for a wildly unfocused but nonetheless dazzling tour de force that reveals Ray's artistic strengths and endearing character flaws in equal measure.\n","torrent":{"xt":"urn:btih:5d51d1a35cb9543662fff49f07d5f6656e634a45","amp;dn":"The+Kinks+-+Lola+Versus+Powerman+And+The+Money+Go+Round+%281970%2F20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d51d1a35cb9543662fff49f07d5f6656e634a45","infoHashBuffer":{"type":"Buffer","data":[93,81,209,163,92,185,84,54,98,255,244,159,7,213,246,101,110,99,74,69]},"announce":[],"urlList":[]}}