{"title":"James Patterson and Mark T. Sullivan - Private Berlin (ePub/mobi","uid":8058888,"size":1241169,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d9a7507ebaeea4e1eacfd5fb4d502c31e9443c1&amp;dn=James+Patterson+and+Mark+T.+Sullivan+-+Private+Berlin+%28ePub%2Fmobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"xemius","files":-1,"time":1358988471,"description":"Source: mobilism\n\nSummary\nPublication Date: January 21, 2013\nPrivate Berlin has the extraordinary pace and international sophistication that has powered The Girl with the Dragon Tattoo and Patterson's #1 bestseller The Postcard Killers.\n\nIN EUROPE'S MOST DANGEROUS CITY\n\nChris Schneider is a superstar agent at Private Berlin, Germany headquarters for the world's most powerful investigation firm. He keeps his methods secret as he tackles Private's most high-profile cases-and when Chris suddenly disappears, he becomes Private Berlin's most dangerous investigation yet.\n\nAN INVESTIGATOR IS SEARCHING\n\nMattie Engel is another top agent at Private Berlin, gorgeous and ruthlessly determined-and she's also Chris's ex. Mattie throws herself headfirst into finding Chris, following leads to the three people Chris was investigating when he vanished: a billionaire suspected of cheating on his wife, a soccer star accused of throwing games, and a nightclub owner with ties to the Russian mob. Any one of them would surely want Chris gone-and one of them is evil enough to want him dead.\n\nAND SHE'S AFTER MORE THAN THE TRUTH\n\nMattie's chase takes her into Berlin's most guarded, hidden, and treacherous places, revealing secrets from Chris's past that she'd never dreamed of in the time they were lovers. On the brink of a terrifying discovery, Mattie holds on to her belief in Chris-in the face of a horror that could force all of Europe to the edge of destruction and chaos. \n\nJames Patterson has taken the European thriller to a masterful new level with Private Berlin, an adrenaline-charged, spectacularly violent and sexy novel with unforgettable characters of dark and complex depths. Private Berlin proves why Patterson is truly the world's #1 bestselling author.\n\nFormats provided are:\n.ePub -\nCompatible with most eReaders including the Apple iPad. If you wish to read .ePub doucuments on a Mac/PC I would recommend downloading Adobe Digital Editions. (Just google it and follow the instructions on the Adobe website.)\n.mobi -\nFor the Amazon kindle. Kindle for PC may also be available depending on your region.\n\nIf you like the book, support the author and buy it!","torrent":{"xt":"urn:btih:5d9a7507ebaeea4e1eacfd5fb4d502c31e9443c1","amp;dn":"James+Patterson+and+Mark+T.+Sullivan+-+Private+Berlin+%28ePub%2Fmobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d9a7507ebaeea4e1eacfd5fb4d502c31e9443c1","infoHashBuffer":{"type":"Buffer","data":[93,154,117,7,235,174,234,78,30,172,253,95,180,213,2,195,30,148,67,193]},"announce":[],"urlList":[]}}