{"title":"Ghost Towns of the Mountain West - Your Guide to the Hidden Hist","uid":8551414,"size":18357714,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5de29e46c432369d739033528632b4fbefab8760&amp;dn=Ghost+Towns+of+the+Mountain+West+-+Your+Guide+to+the+Hidden+Hist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1370650009,"description":"Philip Varney, &quot;Ghost Towns of the Mountain West: Your Guide to the Hidden History and Old West Haunts of Colorado, Wyoming, Idaho, Montana, Utah, and Nevada&quot; \n2010 | ISBN: 0760333580 | 320 pages | EPUB | 17,5 MB\n\nThe Rocky Mountain and Great Basin states are the heart of ghost-town country. Once-bustling pioneer outposts, mining camps, lumber towns, and railroad villages stand today as reminders of the glory days of gold rushes, industrial progress, and that pioneering spirit of the Old West. This book guides readers to the fascinating and scenic ghost towns of Colorado, Wyoming, Idaho, Montana, Utah, and Nevada. Varney highlights popular tourist destinations as well as out-of-the-way spots unfamiliar even to natives of the region. Maps, historical background, and stunning color photographs bring to life dozens of ghost towns and provide practical information for exploring this fascinating chapter of American history.\n\nPS. Uploaded for Harold Budd and Abandoned Cities Album...\n\nQuote from album:\n\n&quot;I'm in love with California place names. Burroughs call them places of dead roads. I dont call them anything but its the same thing - haunted, lonely places; fat with history and totally forgotten: Cantil, Inyo, Olancha, Cathago, obsidian shards at Gunmovin, the lost Gunsight Mine, Skidoo, White Mountain city...fat with dreams. And Im in love with titles for the same reason: what they say is one thing, what they mean as they whistle through my life is something else.&quot;","torrent":{"xt":"urn:btih:5de29e46c432369d739033528632b4fbefab8760","amp;dn":"Ghost+Towns+of+the+Mountain+West+-+Your+Guide+to+the+Hidden+Hist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5de29e46c432369d739033528632b4fbefab8760","infoHashBuffer":{"type":"Buffer","data":[93,226,158,70,196,50,54,157,115,144,51,82,134,50,180,251,239,171,135,96]},"announce":[],"urlList":[]}}