{"title":"Chip Ingram - Love, Sex, and Lasting Relationships (Big Papi) 20","uid":9277172,"size":488158189,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5e65874e2910108223b8febac35e198e713f759b&amp;dn=Chip+Ingram+-+Love%2C+Sex%2C+and+Lasting+Relationships+%28Big+Papi%29+20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"Big-Papi","files":51,"time":1385882650,"description":"\nChip Ingram - Love, Sex, and Lasting Relationships (Big Papi) 2003 Audio Book\n-\nRip is 192cbr and has the setting &quot;Remember Playback Position&quot; so when you stop in the middle of a track it will remember where you left off when you restart it later. If you're turned off by the God-centered approach of this book then try to think of it as spiritual-centered. Humans are spiritual creatures and many religions and beliefs can fill this spiritual need if the framework is pure. - Big Papi\n-\nBy G. Williams\nI read this book at the request of a woman who has profoundly impacted my life on all levels. This book focuses on society's very real issues in relationships. These issues have always existed, however today we see a steady increase in divorce, STD, abortion, etc. Why?\n\n&quot;The Hollywood Formula&quot;\nThis belief instills into current society &quot;fast love&quot; concepts, love as a 100% pain-free experience, and the love/sex identity crisis. It centers on looking to another person to complete yourself. &quot;You complete me.&quot;\n\nThe God formula emphasizes that you become your true self in Love, and by consequence you will draw true Love to yourself.\n\nChip explores what profound love is, and what it is not. Paralleling the holy trinity, he explains the 3 loves as the Greeks knew them:\nagape - Love that is selfless, without condition, without judgment. (Spirit)\nphileo - Love that begets beautiful friendship (Mind)\neros - Love that is erotic, passionate, and physical. (Body)\n\nProfound, True, Love, is rooted in all three of the these.\n\nToday, eros obviously reigns supreme. However, living only on eros is robbing you of the fullness that you could otherwise experience. Human being is mind, body and spirit. You cannot satiate the needs of mind and soul with what satiates the flesh.\n\nChip includes 12 salient points to consider in evaluating your relationship (which I recommend everyone consider before marriage if you truly seek a love that lasts). He provides 5 non-biblical arguments to avoid sex outside of marriage - again, to consider if you wish to find a love that lasts.\n\nI do not agree with everything Chip presents here, most of which because I think mankind has misinterpreted much of what God communicates in the Bible. Many of the stories he relates seem to equate with experiencing the &quot;wrath of God&quot;, but they are actually people experiencing the ravages of guilt. Perhaps guilt is a form of God's wrath... Regardless of those misgivings, I do fully agree that most people today have a warped perspective on love, sex and relationships.\n\nIf you take nothing from this book, try as hard as you can to &quot;Walk in Love.&quot; And I would like to add to Chip's work and suggest we should all learn to:\nLove everyone agape.\nLove as many as possible in phileo,\nLove one in eros.\n\nIf we could learn to do this, we would attain a far better understanding of God.\n\nI leave you to ponder the meaning of this statement:\n&quot;I am the way, the truth, and the life: no man cometh unto the Father, but by me.&quot;\n\nSubstitute &quot;me&quot; with the statement of &quot;I am.&quot;\n\n&quot;No man cometh unto the Father, but by the way, the truth, and the life.&quot;\n\nYou will truly know God when you live the way, the truth, and the life. Really think about all of what Jesus says in John 14.\n\nJesus told us 2000 years ago how to know God. Live like He did.","torrent":{"xt":"urn:btih:5e65874e2910108223b8febac35e198e713f759b","amp;dn":"Chip+Ingram+-+Love%2C+Sex%2C+and+Lasting+Relationships+%28Big+Papi%29+20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e65874e2910108223b8febac35e198e713f759b","infoHashBuffer":{"type":"Buffer","data":[94,101,135,78,41,16,16,130,35,184,254,186,195,94,25,142,113,63,117,155]},"announce":[],"urlList":[]}}