{"title":"HippoEDIT v1.60.11 x64 Incl Crack-LAXiTY [TorDigger]","uid":11723528,"size":8832283,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5f40c63c8be7c84da74d7047f59eaa2bd2c2f498&amp;dn=HippoEDIT+v1.60.11+x64+Incl+Crack-LAXiTY+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TorDigger","files":12,"time":1424962418,"description":"HippoEDIT\n\nLooking for the Best Windows Text Editor?\n\nHippoEDIT is a powerful, fast and easy to use Windows text editor, primarily targeted at power users and programmers. It has modern and lightweight user interface, which supports different interface schemes, Multi Tab environment, seamless web and help browser, File Explorer and Project Explorer, external tools integration and more smart text editor functions.\n\nFeatures:\n\nComes with pre-defined syntax highlighting for PHP, HTML, Perl, Java, Pascal, C/C++, XML, XSLT and more. Programming language definitions are inheritable and embeddable (JavaScript, PHP and CSS in HTML for example). Additional programming languages can be plugged with user syntax files.\nTo facilitate the text editing HippoEDIT provides more than 300 integrated commands with customizable keyboard shortcuts, auto-completion using syntax dictionary and statistical information, real-time code hints with best guesses from text editor and sophisticated code templates engine with big set of built-in tags.\nText editor has code outlining, current scope and changed lines indication, mismatching brace highlighting, indent guides etc. greatly help in program analysis and navigation.\nClipboard ring, full support of text and files drag &amp; drop, transparent usage of different clipboard formats to paste syntax-highlighted text into other applications, or paste highlighted code as HTML back into text editor smoothly integrates HippoEDIT in your work environment.\nOther features include powerful search and replace, support of different text encodings, WYSIWYG printing and previewing, programming language specific formatting rules, multiple undo/redo, and other text editing functions.\n\n\n\nWindows 2000/XP/Vista/Win7/Win8\n\nHomepage: http://www.hippoedit.com\n\n \n\n- Install program.\n- Copy content from crack folder and paste into default installation directory.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems","torrent":{"xt":"urn:btih:5f40c63c8be7c84da74d7047f59eaa2bd2c2f498","amp;dn":"HippoEDIT+v1.60.11+x64+Incl+Crack-LAXiTY+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f40c63c8be7c84da74d7047f59eaa2bd2c2f498","infoHashBuffer":{"type":"Buffer","data":[95,64,198,60,139,231,200,77,167,77,112,71,245,158,170,43,210,194,244,152]},"announce":[],"urlList":[]}}