{"title":"Jim Pavelec - Hell Beasts [PDF] { KT }","uid":11108859,"size":14251980,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:60f1112e53057f74d503077134ebf8038333dee8&amp;dn=Jim+Pavelec+-+Hell+Beasts+%5BPDF%5D+%7B+KT+%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"krystine","files":-1,"time":1411769300,"description":"Hell Beasts: How to Draw Grotesque Fantasy Creatures by Jim Pavelec\n\n\n\nDraw the stuff of which nightmares are made.If you harbor a love of imagery most foul, of demons and monsters and devils of all sorts ... then welcome to the book from hell. Within its pages lurk sadistic orcs, flesh-eating zombies, blood-thirsty dragons, unholy monstrosities and dreaded beasts of legend and lore.\n\nIf you dare to open this book and unleash such horror, venture forth and learn everything a good monster-maker needs to know:\n\n\nHow to spawn a loathsome range of creatures, step by gruesome step: Humanoid Monsters, Reptiles and Aquatic Creatures, Winged Beasts, Quadrupeds and more ... in 29 demonstrations.\nMasterful techniques for drawing the massive biceps of the Gaki, the jagged tentacles of the Leviathan, the wicked curved claws of the Hellhound, blood-dripping fangs, putrefied decaying wounds and other deadly features and really gross details.\nTips for making your creatures even creepier with the skillful use of point-of-view, iconic and action poses, color and shadow.\n&quot;Hell Beasts&quot; will empower you to bring forth the sinister beings that lurk in the deepest, darkest shadows of your imagination. Summon them to claw at bedroom windows and wreak havoc in the dreams of your unsuspecting audience for years to come.\n\n\n\nGenre: Art","torrent":{"xt":"urn:btih:60f1112e53057f74d503077134ebf8038333dee8","amp;dn":"Jim+Pavelec+-+Hell+Beasts+%5BPDF%5D+%7B+KT+%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60f1112e53057f74d503077134ebf8038333dee8","infoHashBuffer":{"type":"Buffer","data":[96,241,17,46,83,5,127,116,213,3,7,113,52,235,248,3,131,51,222,232]},"announce":[],"urlList":[]}}