{"title":"Landmark Supreme Court Cases: The Most Influential Decisions of ","uid":10168032,"size":2713382,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61d0d50e643e9917804a6af070a1789c2f05abdf&amp;dn=Landmark+Supreme+Court+Cases%3A+The+Most+Influential+Decisions+of+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"K-Slender","files":3,"time":1400367889,"description":"Publisher: Checkmark Books; 1 edition (November 1, 2006)\nLanguage: English\nISBN-10: 0816069239\nISBN-13: 978-0816069231\n\nA guide to groundbreaking cases in the American legal system. Through its interpretations of the Constitution and Bill of Rights, the Supreme Court issues decisions that shape American law, define the functioning of government and society, and address the most important issues of the day. Famous cases like Roe v. Wade, Plessy v. Ferguson, Dred Scott v. John F. A. Sanford, and Miranda v. Arizona are among the most important decisions made by the court, but many others have also had a profound impact on the American way of life. &quot;Landmark Supreme Court Cases&quot; provides concise, straightforward summaries of more than 350 of the most influential United States Supreme Court cases. Ideal as a quick reference or starting point for further research, this detailed encyclopedia analyzes and explains cases on such issues as freedom of speech, freedom of the press, civil rights, labor unions, abortion, antitrust and competition, due process, search and seizure, executive privilege, and more. Organized A to Z by court case, each entry includes the case title and legal citation, year of decision, key issue, historical background, legal arguments, decision (majority and dissenting opinions), aftermath and significance, related cases, and recommended reading. Other features include a chronology of cases, an index of cases by both parties and popular titles, a subject index, a glossary of legal terms, and guidance on how to read a legal citation. ","torrent":{"xt":"urn:btih:61d0d50e643e9917804a6af070a1789c2f05abdf","amp;dn":"Landmark+Supreme+Court+Cases%3A+The+Most+Influential+Decisions+of+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61d0d50e643e9917804a6af070a1789c2f05abdf","infoHashBuffer":{"type":"Buffer","data":[97,208,213,14,100,62,153,23,128,74,106,240,112,161,120,156,47,5,171,223]},"announce":[],"urlList":[]}}