{"title":"Coldplay - Parachutes [24 bit FLAC] vinyl","uid":8111585,"size":765238575,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6243c6f3f345289196b048c349aad3e232ca07cc&amp;dn=Coldplay+-+Parachutes+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"24.96","files":-1,"time":1360197212,"description":"The London foursome Coldplay were early critics' darlings in their native U.K., showcasing melodic pop on a slew of EP releases and constant live shows just after the spark of the new millennium. Not as heavy as Radiohead or snobbish as Oasis, Coldplay were revealed on Parachutes as a band of young musicians still honing their sweet harmonies. Combining bits of distorted guitar riffs and swishing percussion, Parachutes was a delightful introduction and also quickly indicated the reason why this album earned Coldplay a Mercury Music Prize nomination in fall 2000. Frontman Chris Martin's lyrical wordplay is feminist in the manner of Geneva's Andrew Montgomery, but far more withered. The imagery captured on Parachutes is exquisitely dark and artistically abrasive, and the entire composition is tractable thanks to gauzy acoustics and airy percussion. Coldplay's indie rock inclinations are also obvious, especially on songs such as &quot;Don't Panic&quot; and &quot;Shiver,&quot; but it's the dream pop soundscapes captured on &quot;High Speed&quot; and &quot;We Never Change&quot; that illustrate the band's dynamic passion. This basic pop was surely a refreshing effort in the face of big productions like the Spice Girls and Westlife. Parachutes deserved the accolades it received because it followed the general rule when introducing decent pop songs: keep the emotion genuine and real. And Coldplay did that without hesitation.","torrent":{"xt":"urn:btih:6243c6f3f345289196b048c349aad3e232ca07cc","amp;dn":"Coldplay+-+Parachutes+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6243c6f3f345289196b048c349aad3e232ca07cc","infoHashBuffer":{"type":"Buffer","data":[98,67,198,243,243,69,40,145,150,176,72,195,73,170,211,226,50,202,7,204]},"announce":[],"urlList":[]}}