{"title":"Scientific Paper: Irrefutable Proof that 911 was an inside job i","uid":3856115,"size":5021637,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62eb0f0bb0b125a7969d09e7c8a17c18cc446910&amp;dn=Scientific+Paper%3A+Irrefutable+Proof+that+911+was+an+inside+job+i&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"undeceived","files":1,"time":1193207586,"description":"Scientific Paper:  Why Indeed Did the World Trade Center Buildings Collapse - Steven Jones\n\nby Dr. Steven E. Jones, physics professor at BYU\npublished: October 8, 2006\n\nDr. Jones provides overwhelming, irrefutable, concrete, and thorough scientific evidence that the World Trade Center could not have collapsed due to any biproduct of the planes colliding with them as we have been led to believe; but in fact the manner in which they collapsed and the energy required to bring about that result, could only be attributed to two energy sources currently known to science, either an atomic weapon or thermite, both substances only available to the government.  Indeed Dr. Jones went to great lengths to obtain samples of of steel debris (from pieces used for monuments to 911, since the government conveniently disposed of the vast majority of it) and detected traces of thermite. It was a controlled demolition!\n\nThis alone rules out the so-called Middle Eastern terrorists and renders them patsies, but Dr. Jones documents several other separate and tests done based on the known laws of physics, that all support the same conclusion, it was a controlled demolition and thus an inside job.  This is shocking to most of us, not what we wanted to hear, but the facts and evidence speak for themselves and are undeniable, we owe it to our children to become well-informed and begin to deal with it.  \n\nDr. Jones is a hero for investigating the issue and having the courage to publish his findings when it would have been easier to remain anonymous.  As is common with all truth tellers (of important truths) this man of integrity (and there are many videos of him in the internet) has taken a lot of unfair abuse from deeply entrenched interests that apparently are profiting from 911.  \n\nRead and share Dr. Jones&amp;#039; historic paper (please reach at least a 1:1 share ratio!)\n\nPhysics professor Steven Jones enumerates thirteen reasons to challenge government reports and investigate the controlled-demolition hypothesis:\n\n1. Molten Metal: Flowing and in Pools\n2. Observed Temperatures around 1000ÂºC and Sulfidation in WTC 7 Steel\n3. Near-Symmetrical Collapse of WTC 7\n4. No Previous Skyscraper Collapse Due to Fires\n5. Squib-timing during the Collapse of WTC 7\n6. Early Drop of North Tower Antenna\n7. Eyewitness Accounts of Flashes and Loud Explosions\n8. Ejection of Steel Beams and Debris ? plumes from the Towers\n9. Rapid Collapses and Conservation of Momentum and Energy\n10. Controlled Demolition &quot;Implosions&quot; Require Skill\n11. Steel Column Temperatures of 800ÂºC Needed: A Problem in the Argument of Bazant and Zhou\n12. Problems in the NIST Report: Inadequate Steel Temperatures and Tweaked Models\n13. NIST&amp;#039;s Failure to Show Visualizations","torrent":{"xt":"urn:btih:62eb0f0bb0b125a7969d09e7c8a17c18cc446910","amp;dn":"Scientific+Paper%3A+Irrefutable+Proof+that+911+was+an+inside+job+i","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62eb0f0bb0b125a7969d09e7c8a17c18cc446910","infoHashBuffer":{"type":"Buffer","data":[98,235,15,11,176,177,37,167,150,157,9,231,200,161,124,24,204,68,105,16]},"announce":[],"urlList":[]}}