{"title":"Miles Davis -  Featuring Sonny Rollins - Dig TQMP","uid":4796158,"size":180892375,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6321aedeae23b69324f8d1ea6fb780dcec4f833b&amp;dn=Miles+Davis+-++Featuring+Sonny+Rollins+-+Dig+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"zootallure","files":16,"time":1237890157,"description":"Miles Davis was one of the greatest visionaries and most important figures in jazz history. He was born in a well-to-do family in East St. Louis. He became a local phenom and toured locally with Billy Eckstine's band while he was in high school. He moved to New York under the guise of attending the Julliard School of Music. However, his real intentions were to hook up with Charlie Parker and Dizzy Gillespie. He quickly climbed up the ranks while learning from Bird and Diz and became the trumpet player for Charlie Parker's group for nearly 3 years. His first attempt at leading a group came in 1949 and was the first of many occurrences in which he would take jazz in a new direction. Along with arranger Gil Evans, he created a nonet (9 members) that used non-traditional instruments in a jazz setting, such as French horn and Tuba. He invented a more subtle, yet still challenging style that became known as &quot;cool jazz.&quot; This style influenced a large group of musicians who played primarily on the west coast and further explored this style. The recordings of the nonet were packaged by Capitol records and released under the name The Birth of the Cool. The group featured Lee Konitz, Gerry Mulligan, and Max Roach, among others. This was one of the first instances in which Miles demonstrated a recurring move that angered some: he brought in musicians regardless of race. He once said he'd give a guy with green skin and &quot;polka-dotted breath&quot; a job, as long as they could play sax as well as Lee Konitz. After spending 4 years fighting a heroin addiction, he conquered it, inspired by the discipline of the boxer Sugar Ray Robinson.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health:-)\n","torrent":{"xt":"urn:btih:6321aedeae23b69324f8d1ea6fb780dcec4f833b","amp;dn":"Miles+Davis+-++Featuring+Sonny+Rollins+-+Dig+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6321aedeae23b69324f8d1ea6fb780dcec4f833b","infoHashBuffer":{"type":"Buffer","data":[99,33,174,222,174,35,182,147,36,248,209,234,111,183,128,220,236,79,131,59]},"announce":[],"urlList":[]}}