{"title":"Doctor Who - Season 24 - (1987) - 13 Episodes","uid":9210127,"size":2908484529,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6332503a9c3ad00907c64a047afcee4c8fd7968e&amp;dn=Doctor+Who+-+Season+24+-+%281987%29+-+13+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"bnaron","files":14,"time":1384767335,"description":"The twenty-fourth season of British science fiction television series Doctor Who began on 7 September 1987. Sylvester McCoy makes his first appearance as the Doctor in 'Time and the Rani', replacing Colin Baker who was fired by the BBC. The Doctor is joined by Mel as the Doctor's companion, who leaves at the end of the season in 'Dragonfire'.\n\nKate O'Mara makes her second appearance as The Rani in McCoy's first serial 'Time and the Rani'. Sophie Aldred guest stars as Ace in 'Dragonfire'; Ace would become the Doctor's companion in the next season. Tony Selby, having recently appeared in 'The Trial of a Time Lord', also made a guest appearance as Sabalom Glitz in the same story and acts as an unofficial companion to the Seventh Doctor.\n\nThe previous season, while ostensibly a single 14-part serial, was divided into three stories of four episodes and one of two episodes. For this season, this was re-jigged into a new format that would be followed over the next three years, with a pair of four-parters and a pair of three-parters. Not including 'The Two Doctors', which had episodes of 45-minute duration, 'Delta and the Bannermen' was the first standard format (25-minute) 3 part serial since 'Planet of Giants' in Season 2.\n\nTotal Episodes: 14 (Again they are only 25 minutes in length)\n\n01 - Time and the Rani - 4 Episodes\n\n     Synopsis: The Rani has taken control of the planet Lakertya and forced the\n     peaceful Lakertyans to build a rocket silo-cum-laboratory base into a cliff\n     face. She is aided by the Tetraps, a race of bat-like creatures. To aid in\n     her plans, she forces the Doctor's TARDIS to crash-land on the planet,\n     initiating the Doctor's regeneration into his seventh incarnation. Can the\n     Doctor get past his post-regenerative trauma and thwart the Rani once more?\n\n02 - Paradise Towers - 4 Episodes\n\n     Synopsis: The Doctor takes Mel to the peaceful Paradise Towers for a trip.\n     However, things are quite wrong; killer cleaners and the disembodied mind of\n     architect in the basement pose a threat.\n\n03 - Delta and the Bannermen - 3 Episodes\n\n     Synopsis: The Chimeron queen heads for a holiday camp in Wales after being a\n     target for assassination. The Doctor and Mel run into Delta and decide to\n     help her get rid of the Bannermen.\n\n04 - Dragonfire - 3 Episodes\n\n     Synopsis: Kane has waited 3,000 years to escape his ice prison. However, the\n     Doctor, Mel, Ace, and Glitz may have something to say about that.\n","torrent":{"xt":"urn:btih:6332503a9c3ad00907c64a047afcee4c8fd7968e","amp;dn":"Doctor+Who+-+Season+24+-+%281987%29+-+13+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6332503a9c3ad00907c64a047afcee4c8fd7968e","infoHashBuffer":{"type":"Buffer","data":[99,50,80,58,156,58,208,9,7,198,74,4,122,252,238,76,143,215,150,142]},"announce":[],"urlList":[]}}