{"title":"Essentials of Cataract Surgery, 2E Henderson [PDF][StormRG]{HTD1","uid":11784435,"size":6857125,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:637f618d0c2ba61683f613bb6735dc0e9ebdeec8&amp;dn=Essentials+of+Cataract+Surgery%2C+2E+Henderson+%5BPDF%5D%5BStormRG%5D%7BHTD1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":3,"time":1427693813,"description":"TITLE/EDITION Essentials of Cataract Surgery \nBy: Bonnie An Henderson \nPaperback: 408 pages\nPublisher: Slack Incorporated; Second Edition edition (January 15, 2014)\nLanguage: English\nISBN-10: 1617110671\nISBN-13: 978-1617110672\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nThe straightforward, concise, and easy-to-read reference manual which is equivalent to having the best instructor offering guidance on what to do next and how to avoid potential complications is now available in an updated Second Edition.\n\nEssentials of Cataract Surgery, Second Edition comprehensively details every step of phacoemulsification cataract extraction surgery, from preoperative evaluation to intraoperative instruction to postoperative care. The basic elements of cataract surgery are presented in a clear and easy-to-read format.\n\nDr. Bonnie An Henderson brings together advice and teaching techniques from the Harvard Intensive Cataract Surgical Training Conference at the Massachusetts Eye and Ear Infirmary. The book provides both beginning and practicing surgeons with personal tips and expert advice from leading cataract mentors of top US ophthalmology residency programs.\n\nInside Essentials of Cataract Surgery, Second Edition are detailed chapters covering fluidics, IOL calculations and design, capsular complications and management, and the latest phaco technology, including femtosecond cataract surgery. Each chapter contains a summary box, highlighting the key points of each topic discussed. Additionally, the included images, diagrams, photographs, and tables enhance understanding of specific topics.\n\nWith detailed information and expert pearls in a user-friendly format, Essentials of Cataract Surgery, Second Edition is perfect for residents, fellows, medical students, and practicing ophthalmologists looking to improve their surgical techniques","torrent":{"xt":"urn:btih:637f618d0c2ba61683f613bb6735dc0e9ebdeec8","amp;dn":"Essentials+of+Cataract+Surgery%2C+2E+Henderson+%5BPDF%5D%5BStormRG%5D%7BHTD1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"637f618d0c2ba61683f613bb6735dc0e9ebdeec8","infoHashBuffer":{"type":"Buffer","data":[99,127,97,141,12,43,166,22,131,246,19,187,103,53,220,14,158,189,238,200]},"announce":[],"urlList":[]}}