{"title":"Marissa Nadler - Songs III: Bird on the Water [2007][EAC,log,cue","uid":8633356,"size":300318426,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:649bb4ae47b661b0e8b2d46358b2bd80908e22ac&amp;dn=Marissa+Nadler+-+Songs+III%3A+Bird+on+the+Water+%5B2007%5D%5BEAC%2Clog%2Ccue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":14,"time":1372689218,"description":"Artist: Marissa Nadler\nRelease: Songs III: Bird on the Water \nReleased: 2007\nLabel: Kemado Records\nCatalog#: KEM 055\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: Folk Rock, Acoustic, Ethereal, Neofolk\n\nDiamond Heart\t3:47\t\nDying Breed\t3:38\t\nMexican Summer\t5:27\t\nThinking Of You\t3:36\t\nSilvia\t5:40\t\nBird On Your Grave\t5:02\t\nRachel\t4:20\t\nFeathers\t3:59\t\nFamous Blue Raincoat\t4:23\t\nMy Love And I\t3:32\t\nLeather Made Shoes\t4:42\n\nSongwriter Marissa Nadler's first two albums of home recordings, 2004's Ballads of Living and Dying and 2006's Saga of Mayflower May, were both issued by Eclipse and got plenty of traction from reviewers on both sides of the Atlantic. Homemade, sparsely produced, with mysterious, engaging covers, she took the critics' and punter's ears by storm, though in her homeland of America, she remained almost unheard of. Her extensive European touring attracted the notice of the U.K.'s fine Peacefrog imprint that issued Song III: Bird on the Water earlier in 2007. The album has been licensed by the Kemado label in the U.S. and is being given the proper release treatment it deserves. Nadler, who is continually associated with the freak folk underground, is actually far from it. She may be a fiercely independent artist, and her songs may be rooted in times past -- from 18th and 19th century Celtic root sources to the psychedelic folk scene -- before it got polished up in Laurel Canyon in the late '60s, yet Nadler is a very sophisticated songwriter. Her lyrics never complicate her songs, even when drenched in symbolism and obscure references that are never labored. She is also a fine guitar player who possesses a strange and wonderfully pleasant singing voice. Her earlier recordings have emerged from their humble homemade origins to gain a small but faithful audience because they're solid, and full of dark and lithe songs about people, places and situations past and present -- even if the past is distant history. The small, even skeletal production values on her previous discs only served to underscore the strength in the material itself.\n\nOn Song III, Nadler ups the ante. These songs may have been written in her bedsit, but they are executed on this disc with the kind tiny grandeur they deserve. In some ways, listening to Nadler is akin to listening to Tom Rapp of Pearls Before Swine (she covered a track of theirs on a compilation disc a while back). There is a directness to her delivery and she never flinches from her material, yet she sounds out of this time and space at the same moment. Recorded by Greg Weeks in Philadelphia, Nadler surrounds herself with a small group of very attentive and sympathetic musicians. Weeks plays synth and distorted lead guitar parts; Helena Espvall sits at the cello; Orion Rigel Dommisse appears on mandolin and harp; and Otto Hauser lends a hand on percussion. At the center of every song is Nadler's guitar playing: fingerpicked, rhythmic, and full of a kind of forward movement that sometimes stands at delightful odds with the timelessness of her lyrics and singing voice.","torrent":{"xt":"urn:btih:649bb4ae47b661b0e8b2d46358b2bd80908e22ac","amp;dn":"Marissa+Nadler+-+Songs+III%3A+Bird+on+the+Water+%5B2007%5D%5BEAC%2Clog%2Ccue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"649bb4ae47b661b0e8b2d46358b2bd80908e22ac","infoHashBuffer":{"type":"Buffer","data":[100,155,180,174,71,182,97,176,232,178,212,99,88,178,189,128,144,142,34,172]},"announce":[],"urlList":[]}}