{"title":"Easy Disk Catalog Maker v1.2.6.0","uid":15219728,"size":16744770,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:64b442c2d2aa3da7e2db29943aefb36aaf5c3366&amp;dn=Easy+Disk+Catalog+Maker+v1.2.6.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ZarkBit","files":1,"time":1467723520,"description":"Easy Disk Catalog Maker v1.2.6.0\r\n\r\nYou probably have many optical disks with documents, MP3 music files, photos and videos collections, software setups, small games, data backups and other disks at home or at your business.\r\n\r\nWhat if you need one of your files which is only 1 MB in size, but you cannot remember where it is and searching on the internet doesn't help?\r\nWhat if you need an important document but you cannot remember on which disk it was stored?\r\nWhat if you just want to know what files are on your optical disks and want to print reports of each disk's content?\r\nYou might have to check all your disks for that file or document, insert them into the drive one after another, waste a huge amount of time and waste the precious electricity for file 1 MB in size.\r\n\r\nBut, you don't have to do this if you use Easy Disk Catalog Maker! With Easy Disk Catalog Maker, you can quickly and easily find the necessary disk or file and view the contents of your disks without inserting them into the drive!\r\n\r\nThis tool will be also useful for those store owners and people with lots of relatives and friends. You no longer have to remember who you lent a movie, music or a game disk to. It helps you organize your disks in more manageable and searchable format. It can also catalog files and folder under archives (ZIP, RAR, 7Z, ISO, TAR and many others) so you don't have to remember which archive has the file, just compress the data to save the disk space and burn the disk.\r\n\r\nOfficial Site: http://rbsoft.org/downloads/easy-disk-catalog-maker","torrent":{"xt":"urn:btih:64b442c2d2aa3da7e2db29943aefb36aaf5c3366","amp;dn":"Easy+Disk+Catalog+Maker+v1.2.6.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64b442c2d2aa3da7e2db29943aefb36aaf5c3366","infoHashBuffer":{"type":"Buffer","data":[100,180,66,194,210,170,61,167,226,219,41,148,58,239,179,106,175,92,51,102]},"announce":[],"urlList":[]}}