{"title":"Duke Pearson - Prairie Dog (1966)","uid":9551564,"size":101998135,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:64deee0f1435e1c303ca73ce20b0d980db2b5f03&amp;dn=Duke+Pearson+-+Prairie+Dog+%281966%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":-1,"time":1391275759,"description":"mp3 320\n\nThis 1966 date by Duke Pearson with an octet was originally issued by Atlantic. Reissued by Collectables, this is Pearson in full soul-jazz mode, driven deeply by the blues, with an all-star band (not all members play on all tunes): drummer Mickey Roker; Harold Vick on soprano; James Spaulding on flute and alto; bassist Bob Cranshaw; trumpeter Johnny Coles; tenor George Coleman; guitarist Gene Bertoncini; and Pearson on piano and celeste. Most of these tunes start out delicately, almost like chamber jazz (nearly MJQ style), moving around on small melodic figures. &quot;The Fakir&quot; begins with a tender, gentle flute solo by Spaulding, and uproots itself by turning into a massive Latin-style groover based on the rhythmic middle of &quot;My Favorite Things.&quot; &quot;Prairie Dog&quot; opens with the horns playing a slow, drawling blues that Pearson fills with his piano. It's a re-visioning of &quot;I'm An Old Cowhand&quot; morphed into a blues. Joe Henderson's &quot;Soulin'&quot; is exactly that: a strutting blues, where Coleman digs deep into the nasty edge of his horn, and Pearson's changes are short, choppy, percussive. The reading of &quot;Angel Eyes&quot; that closes the set is so utterly sophisticated in its arrangement, it's like Pearson telling the band to lay nothing all the time, as the melody floats in after a gorgeous little rhythmic pattern played by the section, it finds its charm in an airy counterpoint and with beautiful soloing from Bertoncini, Coles' muted trumpet, and Coleman. This is as fine as any date Pearson released for Atlantic, and grooves all the way through, seamlessly. ","torrent":{"xt":"urn:btih:64deee0f1435e1c303ca73ce20b0d980db2b5f03","amp;dn":"Duke+Pearson+-+Prairie+Dog+%281966%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64deee0f1435e1c303ca73ce20b0d980db2b5f03","infoHashBuffer":{"type":"Buffer","data":[100,222,238,15,20,53,225,195,3,202,115,206,32,176,217,128,219,43,95,3]},"announce":[],"urlList":[]}}