{"title":"Hippocrates' Woman: Reading the Female Body in Ancient Greece","uid":11739067,"size":1138034,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6579e707e5136d367057500a4e58d30d78450d15&amp;dn=Hippocrates%27+Woman%3A+Reading+the+Female+Body+in+Ancient+Greece&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425683206,"description":"Hippocrates' Woman demonstrates the role of Hippocratic ideas about the female body in the subsequent history of western gynaecology. It examines these ideas not only in the social and cultural context in which they were first produced, but also the ways in which writers up to the Victorian period have appealed to the material in support of their own theories.\nAmong the conflicting tange of images of women given in the Hippocratic corpus existed one tradition of the female body which says it is radically unlike the male body, behaving in different ways and requiring a different set of therapies. This book sets this model within the context of Greek mythology, especially the myth of Pandora and her difference from men, to explore the image of the body as something to be read.\nHippocrates' Woman presents an arresting study of the origins of gynaecology, an exploration of how the interior workings of the female body were understood and the influence of Hippocrates' theories on the gynaecology of subsequent ages","torrent":{"xt":"urn:btih:6579e707e5136d367057500a4e58d30d78450d15","amp;dn":"Hippocrates%27+Woman%3A+Reading+the+Female+Body+in+Ancient+Greece","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6579e707e5136d367057500a4e58d30d78450d15","infoHashBuffer":{"type":"Buffer","data":[101,121,231,7,229,19,109,54,112,87,80,10,78,88,211,13,120,69,13,21]},"announce":[],"urlList":[]}}