{"title":"Tony Joe White - The Best of Tony Joe White - 2CD 1994","uid":6746626,"size":532653837,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:658924d02d1b8ba0a125fae1758f7d4b399d9ab5&amp;dn=Tony+Joe+White+-+The+Best+of+Tony+Joe+White+-+2CD+1994&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"barber9","files":-1,"time":1318715175,"description":"Tony Joe White has accomplished much in the years since he emerged from his home in Louisianas swamp country and the hardscrabble circuit of Texas honky-tonks. His music is part of Americas soundtrack - sparse and elegant, filled with shadows, sadness and beauty. Nobody else writes songs like these - songs that evoke both the mysteries of the place were he was raised and the spirits that haunt us all in our most private, lonely moments.\n\nNobody sings them like White either. That dark baritone, scarred and sweet, brings these songs to life like none other.  Even so, others have memorably interpreted his songs, from Brook Bentons unforgettable take on Rainy Night in Georgia in 1970 to Tina Turners intensely soulful rendition of Steamy Windows.  Elvis Presley, Ray Charles, Roy Orbison, Dusty Springfield, Etta James - iconic artists in their own right have honored the Swamp Fox by cutting his tunes. Others have joined White, with Eric Clapton, Mark Knopfler, Michael McDonald, Waylon Jennings, Emmylou Harris, Lucinda Williams and Shelby Lynne among those who have paid tribute as guests on recent, theme-oriented projects such as The Heroines and Uncovered. (tonyjoewhite.com)\n\n- - -\n\nThis compilation of Tony Joe White's most successful recordings includes unforgetable standards like Polk Salad Annie and ballads like Rainy Night In Georgia. His smooth, soulful baritone voice and straight-ahead musicianship defines a rewarding genre in rock music. Known as the Swamp Fox, Tony Joe White's music incorporates a tasty touch of soul (without the heavy brass instrumentation usually associated with this form of music). The album has some 70's overtones, but they are tastefully done and scaled down to the basic 4-piece unit of lead, rhythm, bass, and drums. His themes deal mostly with snapshots of life on the bayou, as well as some enduring issues of social consciousness. His work has influenced many artists, and this is the album to add to your collection if you are interested in acquiring some of the most brilliant work of an influential and talented artist. \n(Robert D. Hunter on amazon.com)\n\n- - -\n\nTony Joe White - The Best of Tony Joe White 1968-1970\n(2CD Intermusic 1994)\n\n 1. Polk Salad Annie\n 2. Willie &amp; Laura Mae Jones\n 3. Don't Steal My Love\n 4. Wichita Lineman\n 5. Look Of Love\n 6. Roosevelt &amp; Ira Lee\n 7. Woodpecker\n 8. Groupy Girl\n 9. Hard To Handle\n10. What Does It Take\n11. My Friend\n12. Boom Boom\n13. Rainy Night In Georgia\n14. For Le Ann\n15. Old Man Willis\n16. Woman With Soul\n17. I Want You\n18. I Thought I Knew You Well \n19. Stud Spider\n20. Conjure Woman\n21. Save Your Sugar For Me\n22. Who's Making Love\n23. Scratch My Back\n24. Little Green Apples\n\nTracks taken from the albums:\nBlack &amp; White 1968 (1-5, 22-24)\nContinued 1969 (6-7, 13-18)\nTony Joe 1970 (8-12, 19-21)\n","torrent":{"xt":"urn:btih:658924d02d1b8ba0a125fae1758f7d4b399d9ab5","amp;dn":"Tony+Joe+White+-+The+Best+of+Tony+Joe+White+-+2CD+1994","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"658924d02d1b8ba0a125fae1758f7d4b399d9ab5","infoHashBuffer":{"type":"Buffer","data":[101,137,36,208,45,27,139,160,161,37,250,225,117,143,125,75,57,157,154,181]},"announce":[],"urlList":[]}}