{"title":"MS-DOS 6.0 Source Code Leaked","uid":6989294,"size":11425555,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:65e9d9989e129ab544d9bed07fee28b53ed097dc&amp;dn=MS-DOS+6.0+Source+Code+Leaked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"andersonrclark","files":1,"time":1327654194,"description":"The real thing. Sure, it's old, but it is the actual source code, mostly in Assembly language, for Microsoft MS-DOS 6.0. I traced back some relevant magazine articles discussing this particular leak. It came from a company who licenses the source code legally in order to write a compatible operating system. Some higher level code is in C.\n\nHere is a sample from the contents of &quot;command1.asm&quot; that has comments about COMMAND.COM.\n\nDESCRIPTIVE NAME:    Default DOS command interpreter\n\nFUNCTION: This version of COMMAND is divided into three distinct parts.  First is the resident portion, which includes handlers for interrupts 23H (Cntrl-C), 24H (fatal error), and 2EH (command line execute); it also has code to test and, if necessary, reload the transient portion. Following the resident is the init code, which is overwritten after use.  Then comes the transient portion, which includes all command processing (whether internal or external).  The transient portion loads at the end of physical memory, and it may be overlayed by programs that need as much memory as possible. When the resident portion of command regains control from a user program, a check sum is performed on the transient portion to see if it must be reloaded.  Thus programs which do not need maximum memory will save the time required to reload COMMAND when they terminate.","torrent":{"xt":"urn:btih:65e9d9989e129ab544d9bed07fee28b53ed097dc","amp;dn":"MS-DOS+6.0+Source+Code+Leaked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65e9d9989e129ab544d9bed07fee28b53ed097dc","infoHashBuffer":{"type":"Buffer","data":[101,233,217,152,158,18,154,181,68,217,190,208,127,238,40,181,62,208,151,220]},"announce":[],"urlList":[]}}