{"title":"Albert Ammons - 1936-1939 (The Chronogical Classics)(jazz)(mp3@3","uid":7032310,"size":174330138,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6694e3bd5ae943c198d6424f24da7a7563ae3000&amp;dn=Albert+Ammons+-+1936-1939+%28The+Chronogical+Classics%29%28jazz%29%28mp3%403&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rogercc1","files":21,"time":1329256754,"description":"Albert Ammons - 1936-1939 {The Chronological Classics}\nYear Of Release: 1996\nLabel: Classics\nFormat:Mp3@320\n\n\nAlbert Ammons, father of Gene Ammons, became so thoroughly associated with boogie-woogie and Blue Note Records that it is thrilling to hear him in 1936 leading a straightforward swing band in a solid stride treatment of &quot;Nagasaki&quot; for the Decca record label. Naturally, the flip side is an authentic, upbeat rendition of &quot;Pinetop's Boogie Woogie,&quot; and most of the material on this disc contains five times its weight in danceable blues protein. &quot;Mile-Or-Mo Bird Rag,&quot; however, swings like &quot;Nagasaki&quot; did, and once again we get to hear Albert playing genuine stride piano with outstanding support from bassist Israel Crosby and guitarist Ike Perkins. There are refreshing solos from trumpeter Guy Kelly and from a fine alto player by the name of Dalbert Bright. Act two opens in 1939 with ten piano solos, packed with blues and boogie. While some folks disparage the woogie, they are most likely complaining about imitators rather than this archetypal, fundamental body of definitive good-time piano. If you're lucky enough to be able to submerge yourself in this many Albert's solos, you'll most likely succumb to his dignified realism, his gut-level understanding of the blues. The coolest surprise of the whole package is the session of February 1, 1939, whereby Harry James made two sides for Brunswick backed by the &quot;Boogie Woogie Trio.&quot; The pure excitement of &quot;Woo-Woo&quot; is worth a million bucks, as muted trumpet wails over a churning rhythm section, egged on by neat little crashes of the cymbal. &quot;Jesse&quot; is a minor stomp on open horn, with Albert back in a Harlem stride piano groove. When James puts the mute back on his horn it becomes clear that these are two of the very best undiluted jazz records that this trumpeter ever made! The CD ends with four sides recorded at the Blue Note &quot;Port of Harlem&quot; session of April 7, 1939. The sound quality is a bit misty, but that seems to be the case with most reissues of this material. On the &quot;Weary Land Blues,&quot; trombonist J.C. Higginbotham was designated as leader. Frankie Newton's expressive trumpet was added to this band to form the Port of Harlem Jazzmen, resulting that day in three 12&quot; 78 rpm records, each containing more than four minutes of undiluted blues. The moods are disarmingly intimate and uncontrived. Teddy Bunn's guitar sounds particularly good throughout the entire session. Things begin to solidify during a stern walk through the &quot;Mighty Blues,&quot; and everybody cuts loose during &quot;Rocking the Blues,&quot; a boogie-woogie for sextet driven at a healthy clip by two powerful engines: the drumming of Sidney Catlett and the double-fisted piano of Albert Ammons.\n\nAlbert Ammons - 1936-1939 {The Chronological Classics}\n\nTracklist:\n\nAlbert Ammons and His Rhythm Kings\n\nGuy Kelly trumpet, Dalbert Bright clarinet-alto sax, Albert Ammons piano\nIke Perkinson guitar Isreal Crosby bass Jimmy Hoskins drums\nRecorded Chicago 13 Febuary 1936\n01. Nagasaki (2:53)\n02. Boogie Woogie Stomp (3:01)\n[color=deepskyblue]Recorded Chicago 14 Febuary 1936[/color]\n03. Early Mornin' Blues (3:12)\n04. Mile-Or-Mo Bird Rag (3:15)\n\nAlbert Ammons \n\npiano\nRecorded New York 1January 1939\n05. Shout For Joy (2:27)\n\nRecorded New York 6 January 1939\n06. Boogie Woogie Stomp (3:39)\n07. Chicago In Mind (4:02)\n08. Suitcase Blues (3:52)\n09. Boogie Woogie Blues (3:43)\n10. Untitled Ammons Original (4:08 )\n11. Bass Goin' Crazy (3:22)\n12. Backwater Blues (4:06)\n13. Changes In Boogie Woogie (4:08 )\n14. Easy Rider Blues (4:12)\n\nHarry James and The Boogie Woogie  Trio\n\nHarry James trumpet Albert Ammons piano Johnny Williams bass Eddie Dougherty drums\n15. Woo-Woo (3:16)\n16. Jesse (2:46)\n\nJ,C. Higginbotham Quintet\n\nJ.C.Higginbotham trombone Albert Ammons piano Teddy Bunn guitar  Johnny Williamson bass, Sidney Catlett drums[/color]\nRecorded New York 7 April 1939\n17. Weary Land Blues (2:54)\n\nPort of Harlem Jazzmen\n\nFrank Newton trumpet, J.C, Higginbotham trombone, Albert Ammons piano, Teddy Bunn guitar, Johnny Williams bass, Sidney Catlett drums\nRecorded New York 7 April 1939\n18. Port Of Harlem Blues (4:35)\n19. Mighty Blues (4:36)\n20. Rocking The Blues (4:25)\n\n","torrent":{"xt":"urn:btih:6694e3bd5ae943c198d6424f24da7a7563ae3000","amp;dn":"Albert+Ammons+-+1936-1939+%28The+Chronogical+Classics%29%28jazz%29%28mp3%403","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6694e3bd5ae943c198d6424f24da7a7563ae3000","infoHashBuffer":{"type":"Buffer","data":[102,148,227,189,90,233,67,193,152,214,66,79,36,218,122,117,99,174,48,0]},"announce":[],"urlList":[]}}