{"title":"The Gold's Gym Guide to Getting Started in Bodybuilding{BBS}","uid":6861497,"size":6062043,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66b9525e6710fc20e632a8a0a6e5df511c5908d3&amp;dn=The+Gold%5C%27s+Gym+Guide+to+Getting+Started+in+Bodybuilding%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1322917467,"description":"Get the body you have always dreamed of with help from Gold's Gym\n\nDo you dream of becoming the next Mr. or Ms. Universe? Or maybe you'd just like to replace some of that unsightly fat with lean, shapely muscle. No matter what your fitness goals, age, or physical condition, The Gold's Gym Guide to Getting Started in Bodybuilding gets you on track with what you need to know to create a weightlifting regimen that's right for you.\n\nDesigned to inspire beginners and keep them motivated while providing a solid foundation on which to build, it offers a sound systematic approach to realizing your muscular potentials through proper weightlifting technique. You'll learn:\n\n    * Bodybuilding fundamentals, such as proper form and optimum number of sets and reps\n    * Specialized routines for building pecs, abs, biceps, shoulders, glutes, thighs, and all the important muscle groups\n    * How to eat right in order to feel great, stay healthy, and get the biggest bang for the weightlifting buck\n    * Important mental aspects of bodybuilding, including tips on how to stay focused and motivated for maximum results\n    * How to prepare for and compete in bodybuilding contests \n\nWith the knowledge and authority of the experts at Gold's Gym in one book, this is your golden opportunity to learn bodybuilding basics from the best.\nAbout the Author\n\nEd Housewright is an award-winning reporter for the Dallas Morning News, for which he has covered a wide range of topics, including state and local government, politics, criminal justice, health care, religion, and sports. His work has appeared in newspapers around the country and in Golf Digest magazine. He is the author of Winning Track and Field for Girls.\n\nEstablished in Venice Beach, California, in 1965--and now located in 500 locations in 23 countries--Gold's Gym is the world's most trusted authority on bodybuilding and strength training. Long known as the Mecca of hardcore bodybuilders, the original Gold's was the setting for the 1976 bodybuilding classic Pumping Iron starring Arnold Schwarzenegger.\nProduct Details\n\n    * Paperback: 177 pages\n    * Publisher: McGraw-Hill; 1 edition (August 26, 2004)\n    * Language: English\n    * ISBN-10: 0071422846\n    * ISBN-13: 978-0071422840","torrent":{"xt":"urn:btih:66b9525e6710fc20e632a8a0a6e5df511c5908d3","amp;dn":"The+Gold%5C%27s+Gym+Guide+to+Getting+Started+in+Bodybuilding%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66b9525e6710fc20e632a8a0a6e5df511c5908d3","infoHashBuffer":{"type":"Buffer","data":[102,185,82,94,103,16,252,32,230,50,168,160,166,229,223,81,28,89,8,211]},"announce":[],"urlList":[]}}