{"title":"El Chico [DVDRip][Spanish]","uid":6475227,"size":680984576,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:67146ca02b28e9e49f1734bbf3398feae9323c1a&amp;dn=El+Chico+%5BDVDRip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"virana","files":-1,"time":1308294725,"description":"THE KID (2000)\n\nDirector: Jon Turteltaub\nIntÃƒÂ©rpretes: Bruce Willis, Spencer Breslin, Lily Tomlin, Emily Mortimer.\n\nUn asesor de imagen inflexible, altivo y adicto a su trabajo que evita a toda costa a su familia recibirÃƒÂ¡ una visita inesperada en vÃƒÂ­speras de cumplir su 40 aniversario, un rechoncho niÃƒÂ±o de 8 aÃƒÂ±os que resulta ser ÃƒÂ©l mismo.\n\nLa productora Disney expone una pelÃƒÂ­cula con tÃƒÂ­tulo de clÃƒÂ¡sico de Charles Chaplin en la cual presenta a un Bruce Willis de nuevo acompaÃƒÂ±ado por un pequeÃƒÂ±o niÃƒÂ±o.\nSi la anterior experiencia de Willis con infante (vÃƒÂ©ase &quot;El sexto sentido&quot;) resultÃƒÂ³ muy satisfactoria, esta vez el fruto no serÃƒÂ¡ demasiado provechoso.\nLo mejor de esta cinta es la interesante idea de la exposiciÃƒÂ³n de un viaje introspectivo de un hombre que materialmente lo tiene todo pero que resulta fracasado tanto en su vida familiar como amistosa y sentimental, serÃƒÂ¡ con la ayuda y confrontaciÃƒÂ³n con su propio yo infantil como podrÃƒÂ¡ superar sus traumas derivados de una infancia triste y pesarosa.\n\nComo un aviÃƒÂ³n, el tiempo vuela y fluctÃƒÂºa para Russ Duritz (Willis) que va asimilando con ese contacto los principales valores que tienen que primar en la vida de un ser humano en vez de la apariencia artificiosa: los buenos sentimientos y la interactuaciÃƒÂ³n de los mismos con la gente que le rodea.\nTambiÃƒÂ©n es vÃƒÂ¡lido para mostrar los afanes de la inocencia y la realidad final del adulto, un adulto que si pierde la imaginaciÃƒÂ³n y deseos que se mantienen en la niÃƒÂ±ez termina asimismo por perderse a sÃƒÂ­ mismo.\n\nLo peor es que las situaciones desarrolladas para establecer esa idea no terminan de ser excesivamente bien culminadas.\nEl humor resulta flÃƒÂ¡ccido y la quÃƒÂ­mica que se establece entre el niÃƒÂ±o Spencer Breslin (un actor para nada comparable al talentoso Hayley Joel Osment de &quot;El sexto sentido&quot;) y Bruce Willis no estÃƒÂ¡ suficientemente explotada.\nAÃƒÂºn asÃƒÂ­, &quot;The Kid (El chico)&quot; es una comedia familiar mediana con ecos del maestro Frank Capra y de Steven Spielberg que harÃƒÂ¡ pasar un buen rato a la gente fan de Willis y de las historias de buenas intenciones. ","torrent":{"xt":"urn:btih:67146ca02b28e9e49f1734bbf3398feae9323c1a","amp;dn":"El+Chico+%5BDVDRip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67146ca02b28e9e49f1734bbf3398feae9323c1a","infoHashBuffer":{"type":"Buffer","data":[103,20,108,160,43,40,233,228,159,23,52,187,243,57,143,234,233,50,60,26]},"announce":[],"urlList":[]}}