{"title":"Brent av frost (K. E. Jensen, 1997) [VHS/XviD]","uid":4717330,"size":719308800,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:67760d4bc712665fc138de1f6bc4ab7b272f5fe5&amp;dn=Brent+av+frost+%28K.+E.+Jensen%2C+1997%29+%5BVHS%2FXviD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mesothorax","files":1,"time":1234348843,"description":"Brent av frost\n\nBrent av frost er Knut Erik Jensens andre spillefilm, etter debuten Stella Polaris (1993). Jensen er fÃƒÂ¸dt i 1940 i Finnmark, og beskrives som en latiner med rÃƒÂ¸tter i Nordkapp. Jensen har aldri gÃƒÂ¥tt stille i dÃƒÂ¸rene, han banner som en kystfisker og har en tung intellektuell bagasje. I dag tenker man nok fÃƒÂ¸rst gamle menn i hvite luer nÃƒÂ¥r man hÃƒÂ¸rer navnet hans, men Jensen har mange filmer pÃƒÂ¥ samvittigheten innenfor mange sjangre. Han har fotografert mer enn 30 filmer, og har vÃƒÂ¦rt lydmann pÃƒÂ¥ og produsert mange av sine egne filmer. Hans bakgrunn som finnmarking preger dem alle.\n\nUnder andre verdenskrig skjuler Simon russiske partisaner for tyskerne. Etter at krigen er over blir han vervet av russisk etterretning. Han blir tvunget til ÃƒÂ¥ gjÃƒÂ¸re et valg mellom det sovjetrussiske, det amerikanske og det norske. Midt oppi dette gÃƒÂ¥r barndomsvennen og kjÃƒÂ¦resten Lilian. GÃƒÂ¥r det an ÃƒÂ¥ kombinere kjÃƒÂ¦resterier og spionasje? Historien fortelles med mange hopp, og det er ikke like lett ÃƒÂ¥ fÃƒÂ¸lge med bestandig. OgsÃƒÂ¥ bruken av usynkron lyd pÃƒÂ¥ talescener gjÃƒÂ¸r filmen dristig.\n\nGjennomgangstemaet er Finnmarks strategisk viktige betydning for maktkampen mellom stormaktene USA og Sovjetunionen. Filmen benytter seg ogsÃƒÂ¥ av Nord-Norges sÃƒÂ¦regne landskap, som virkelig kommer til sin rett i en av norsk films mest berÃƒÂ¸mte elskovsscener. Stikkord: to nakne mennesker, en stor sjÃƒÂ¸, en bÃƒÂ¥t og en hel masse fisk.\n\nBrent av frost er en frisk og dristig film, skapt i et heftig mÃƒÂ¸te mellom filmpoeten Jensen og dokumentaristen Jensen. Alf R. Jacobsen, som var medforfatter av manuset, har en bakgrunn som redaktÃƒÂ¸r av NRK-programmet &quot;Brennpunkt&quot;. Jensen sier at de deler en &quot;felles interesse for Norges mest trakasserte og oppegÃƒÂ¥ende fylke&quot;. DistributÃƒÂ¸ren karakteriserer filmen som &quot;et stykke nordnorsk historie om kjÃƒÂ¦rlighetens kÃƒÂ¥r nÃƒÂ¥r storpolitikken rÃƒÂ¥der&quot;.\n\nDette er en komplisert film, like sammensatt som mannen som har skapt den. Men den tÃƒÂ¥ler et gjensyn. PÃƒÂ¥ grunn av gode skuespillerprestasjoner, flott fotografering og handling lagt til en historisk periode som ikke bÃƒÂ¸r glemmes.","torrent":{"xt":"urn:btih:67760d4bc712665fc138de1f6bc4ab7b272f5fe5","amp;dn":"Brent+av+frost+%28K.+E.+Jensen%2C+1997%29+%5BVHS%2FXviD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67760d4bc712665fc138de1f6bc4ab7b272f5fe5","infoHashBuffer":{"type":"Buffer","data":[103,118,13,75,199,18,102,95,193,56,222,31,107,196,171,123,39,47,95,229]},"announce":[],"urlList":[]}}