{"title":"Wonders of Life (2013) [720p][Bluray]","uid":12624090,"size":6084989828,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:699946d952f6fb6fb7b63b2e72331f5607b246ee&amp;dn=Wonders+of+Life+%282013%29+%5B720p%5D%5BBluray%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"redback9","files":5,"time":1445643397,"description":"Thanks to tlacatlc6 for providing and ripping the Bluray\r\n\r\nPhysicist and professor Brian Cox travels across the globe to uncover the secrets of the most extraordinary phenomenon in the universe: life.\r\n\r\nSeason 1\r\n\r\nWhat Is Life? S1, Ep1\r\nIn this episode Brian Cox visits South East Asia's 'Ring of Fire'. In the world's most volcanic region he explores the thin line that separates the living from the dead and poses that most enduring of questions: what is life? The traditional answer is one that invokes the supernatural, as seen at the annual Day of the Dead celebrations in the Philippine highlands. Brian sets out to offer an alternative answer: one bound up in the flow of energy through the universe. On the edge of Taal Volcano lake, Brian demonstrates how the first spark of life may have arisen. Here,...\r\n \r\nExpanding Universe S1, Ep2\r\nAmidst the rich natural history of the United States, Professor Brian Cox encounters the astonishing creatures that reveal how the senses evolved. Every animal on Earth experiences the world in a different way, using a unique suite of senses to detect its physical environment. Tracing the evolution of these mechanisms is a story that takes us through life's journey - from single-celled organisms to more complex, sentient beings. Brian finds that over the course of 3.8 billion years, the senses have driven life in new directions and may, ultimately, have led to our own...\r\n \r\nEndless Forms Most Beautiful S1, Ep3\r\nThe universe is almost entirely devoid of life. Earth, the planet we call home, seems to defy the laws of physics. It is teeming with life in all colors, shapes and sizes. No-one knows for sure how many different species are alive right now, our best guess is close to 8.7 million. In this film, Professor Brian Cox asks how, from a lifeless cosmos ruled by the laws of physics and chemistry, it is possible that a planet can produce so much wonderful, varied biology. It's an epic journey through time that begins with Brian undertaking a species count in the cloud forests...\r\n \r\nSize Matters S1, Ep4\r\nProfessor Brian Cox travels to Australia, the big country down under, to explain how size determines the nature of life. Gravity and electromagnetism impact heavily on different types of life - from a single bacterium to a 110 meter tree - determining shape, movement and longevity.\r\n \r\nHome S1, Ep5\r\nAs far as we know, there is only one place in the universe on which life has taken hold - Earth - but for how much longer will this distinction remain? Astronomers are on the brink of finding other worlds the same size as Earth and the same distance from their star. Professor Brian Cox considers what it is about our world that has made it a home and asks what ingredients are necessary to turn a tiny spec of rock in space into a living, vibrant planet. To find out, Brian has come to one of Earth's richest and most bio-diverse territories, Mexico","torrent":{"xt":"urn:btih:699946d952f6fb6fb7b63b2e72331f5607b246ee","amp;dn":"Wonders+of+Life+%282013%29+%5B720p%5D%5BBluray%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"699946d952f6fb6fb7b63b2e72331f5607b246ee","infoHashBuffer":{"type":"Buffer","data":[105,153,70,217,82,246,251,111,183,182,59,46,114,51,31,86,7,178,70,238]},"announce":[],"urlList":[]}}