{"title":"Harper Sloan - Corps Security Books 1 - 5","uid":11993349,"size":1022158547,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:69badd6e17818f5790adfad26c88e009dc6e8740&amp;dn=Harper+Sloan+-+Corps+Security+Books+1+-+5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"katelynor","files":6,"time":1433583823,"description":"Axel\n\nIsabelle West has learned the hard way how hard life can be when fate isn't by your side. For the last two years Isabelle has been slowly clearing the clouds of her past. Happiness is finally on the horizon. She has a thriving business, great friends, and her life back. All she has to do is jump over the last hurdle... her ex-husband. Axel never thought he would look into the eyes of Isabelle West again, and he wasn't sure he wanted to now.\n\nCage\n\nGreg Cage was born to protect. While growing up, he was his mother and sister's shield against the world... until he failed. For the last decade, he has carried that guilt and need for vengeance around. Now, with his best friend getting married and no longer needing his protection, he is even more lost, completely adrift, and desperate for some control. Melissa Larson will never let anyone hold the reins in her life.\n\nBeck\n\nDee has always been good at wearing masks. Not letting anyone see the real her. She's content being the happy-go-lucky best friend. The strong willed boss. The independent woman who doesn't need a man. She's terrified that all it will take is one person to make all her carefully constructed walls crumble into fine dust. The second Beck sees Dee, he knows that she will be his. He sees past the gorgeous smiles and heart-stopping laughter.\n\nCooper\n\nDo you take me seriously? Because I don't. I use my jokes and easygoing personality to hide the pain I've felt since he took his last breath. I'm adrift without my partner in crime, my best friend...my brother. I can taste the vengeance that's just within my grasp. Until she barges into my life. Promising me happiness and a peace I've been craving for years, she is the sun to my darkness, the happy to my despair. But she holds secrets. Just like I do. She holds hers close, where I just pray mine don't rock the walls we're trying to build.\n\nLocke\n\nDarkness is the only thing I see. Ever since the day my life changed. The day that everything and everyone I held close to me ceased to exist. The day I lost it all, and the demons of my past consumed my every waking moment.\n\n\nPlease seed and enjoy!","torrent":{"xt":"urn:btih:69badd6e17818f5790adfad26c88e009dc6e8740","amp;dn":"Harper+Sloan+-+Corps+Security+Books+1+-+5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69badd6e17818f5790adfad26c88e009dc6e8740","infoHashBuffer":{"type":"Buffer","data":[105,186,221,110,23,129,143,87,144,173,250,210,108,136,224,9,220,110,135,64]},"announce":[],"urlList":[]}}