{"title":"Balseros.(Documental,Carles Bosch).DVDrip.XviD.mp3","uid":4646328,"size":943827982,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:69be03702e8504e3e74e5eef2b2dfc891d6f265a&amp;dn=Balseros.%28Documental%2CCarles+Bosch%29.DVDrip.XviD.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"zecarlos","files":3,"time":1231893594,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0321376/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0321376/&lt;/a&gt;\n\nAn Academy Award nominee for Best Documentary, BALSEROS is the heartrending yet triumphant account of seven Cuban refugees--and their families--who risked their lives and beliefs to venture towards America's shores on homemade rafts. The Village Voice raves that BALSEROS is an &quot;engrossing documentary&quot; with an &quot;extraordinary sense of recording stories as they unfold!&quot;\n\nWhile Presidents Clinton and Fidel Castro argued over the closing of Cuba's coast in the chaotic summer of 1994, nearly 50,000 &quot;balseros&quot; (a slang term for Cuban rafters) set out towards Florida, navigating the shark-infested waters on vessels made of wood, nails, and tar. The television reporting team of Charles Bosch and Josep M. DomÃƒÂ¨nech began filming this remarkable story over those landmark 15 days. Then, as most of the rafters were picked up by the U.S. Coast Guard, Bosch and DomÃƒÂ¨nech continued to follow their lively cast of characters, some of whom were detained for more than a year at the Guantanamo naval base before finally being allowed onto American soil.\n\nSpanning seven years within the complex and utterly fascinating lives of these Cuban survivors, BALSEROS intimately crosscuts out-of-sequence to show family reactions to moments just unfurled. What results is a poignant piece of filmmaking which mirrors the universal spirit, drama and adventure of the immigrant experience.\n (Copied from MVG)","torrent":{"xt":"urn:btih:69be03702e8504e3e74e5eef2b2dfc891d6f265a","amp;dn":"Balseros.%28Documental%2CCarles+Bosch%29.DVDrip.XviD.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69be03702e8504e3e74e5eef2b2dfc891d6f265a","infoHashBuffer":{"type":"Buffer","data":[105,190,3,112,46,133,4,227,231,78,94,239,43,45,252,137,29,111,38,90]},"announce":[],"urlList":[]}}