{"title":"Hypnotica MP3 Collection, Yoga-Nidra, Double-Induction, Whitelig","uid":6013915,"size":90293193,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:69cabf10013156d447d4b66a3e0e7c253b03d069&amp;dn=Hypnotica+MP3+Collection%2C+Yoga-Nidra%2C+Double-Induction%2C+Whitelig&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"jus01","files":1,"time":1291510762,"description":"A Collection of 5 trances, meditation music, and anything that has to do with stimulating or enhancing your mind from the great Hypnotica.\n\nAll 5 tracks are in MP3 format.\n\nThe 2 best tracks are the Yoga Nidra and Double Induction, for best results make sure you have the time free needed, lie down and use good quailty headphones making sure the left &amp; right ear plugs are in the correct ears.\nRelax and take the phone off the hock.\n\nHypnotica has done fantasic work with this kind of thing for many years and its worth checking out his website and other products.  &lt;a href=&quot;\nhttp://www.hypnotica.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hypnotica.org/&lt;/a&gt;\nHis other paid products are also on Pirate bay which you can find if you type \\'Hypnotica\\' into the search bar but if you like his products please remember to buy them to support him.\n\nTrack list &amp; info...\nHypnotica - Creative Wonderment 10:09\nAn invitation to open up the doors to greater Creativity.\n\nHypnotica - Stonecutter 3:56\nPerformed by Hypnotica\n\nHypnotica - Whitelight 16:24\nPerformed by Hypnotica, music by Denver Clay.\nHealing white light meditation.\n\nHypnotica/Steve Piccus - Double Induction 37:53\nwith Hypnotica and Steve Piccus, Music By Denver Clay.\nThe Power of Trance.\nA special dual induction session recorded using binaural microphones, specifically engineered for maximum effect when played back using headphones.\nThis trance is designed to initiate a person who is new to trance-like effects into the power of the subconscious mind.\n\nHypnotica - Yoga Nidra 49:33\nYoga Nidra by Hypnotica\n\nA 50-minute meditation, the Yoga Nidra helps in restoring mental, emotional, and physical health by way of relaxation.\n\nYoga Nidra is a wonderful technique, not only for physical or mental relaxation but also for preparing the mind for spiritual discipline.\n\nYoga Nidra helps in restoring mental, emotional, and physical health by way of relaxation. Such a practice helps harmonize two hemispheres of the brain and the two aspects of the autonomic nervous system viz. sympathetic and parasympathetic. The impressions in the subconscious are brought to surface, experienced and removed.\n\nYoga Nidra (\\&quot;Yoga sleep\\&quot;), is an expression widely used to denote the highest state of consciousness. Although Yoga Nidra means yogic sleep, it is actually a wakeful state of deep introversion. Some contemporary Yoga authorities employ the phrase Yoga Nidra to designate a state of deep relaxation. In the initial stages, the process involves relaxing the body, part by part, and harmonizing the mind. Yoga Nidra, however, is an inner awareness, a movement of consciousness, rather than a deliberate auto-suggestion. You cannot relax by trying to relax. You need to feel relaxed. Yogis also believe that you cannot relax your body unless your mind is relaxed.\n\nPlease help seed once you have finished downloading and if you like products remember to support the creators by buying them and please rate and comment on this torrent and give a comment how the tracks worked for you.\n\n","torrent":{"xt":"urn:btih:69cabf10013156d447d4b66a3e0e7c253b03d069","amp;dn":"Hypnotica+MP3+Collection%2C+Yoga-Nidra%2C+Double-Induction%2C+Whitelig","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69cabf10013156d447d4b66a3e0e7c253b03d069","infoHashBuffer":{"type":"Buffer","data":[105,202,191,16,1,49,86,212,71,212,182,106,62,14,124,37,59,3,208,105]},"announce":[],"urlList":[]}}