{"title":"KSP Kerbal Space Program 1.2.0.1586 [Win/Mac/Linux]","uid":16021239,"size":1753503246,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6a4caa6b55a7a704583fddcbac20b401f76eaa93&amp;dn=KSP+Kerbal+Space+Program+1.2.0.1586+%5BWin%2FMac%2FLinux%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"70","files":5,"time":1476333291,"description":"OFFICIAL FINAL 1.2 RELEASE!!!\r\n\r\nKerbal Space Program v1.2.0 for Windows, Mac, and Linux. Compressed using 7zip.\r\n\r\nInstallation: \r\nTo extract, just extract the &quot;Common.7z&quot; file and then the file appropriate for your operating system - &quot;Windows.7z&quot;, &quot;Windows64.7z&quot;, &quot;Mac.7z&quot;, or &quot;Linux.7z&quot; to the same folder (any folder will do). Extracted files will match exactly to the official release (no viruses!)\r\n\r\nGenre: Simulation, Building, Sci-fi\r\nLanguages: English\r\nReleased: October 11, 2016\r\nCompany: Squad\r\n\r\nSystem Requirements (Minimum/Recommended):\r\nMemory: 3GB / 4GB RAM\r\nGraphics: SM3 512MB / SM4 1GB VRAM\r\nFree Disk Space: 2.5GB / 5GB\r\nMouse + Keyboard \r\n\r\nDescription:\r\nKerbal Space Program is a multi-genre game where players create their own space program.\r\nIn KSP, you must build space-worthy craft, capable of flying your crew out into space, without killing them. At your disposal is a collection of parts, which must be assembled to create a functional ship. Each part has its own function and will affect the way a ship flies (or doesn't). So strap yourself in, and get ready to try some Rocket Science!\r\nThe game has different game modes, you can play the Career Mode if you want to expand and manage your own Space Center, taking on missions and researching new technologies. Or you can play Sandbox mode if you're only interested in flying and discovering the Kerbal universe without restrictions. There is even a mid point between these two, Science mode.\r\n\r\n• The Vehicle Assembly Building and the Space Plane Hangar allows players to build spacecraft out of any imaginable combination of parts.\r\n• Fully-fledged, Physics-based Space Flight Simulation ensures everything will fly (and crash) as it should.\r\n• Take your Kerbal crew out of the ship and do Extra Vehicular Activities.\r\n• Fly out to Moons and other Planets.\r\n• Procedural Terrain delivers detailed terrain at a vast scale. The Kerbal Planet is 600km in radius!\r\n• Mod-enabled, allows players to create new content and modify the game.\r\n• Ship systems. Keep an eye out for engine temperatures and fuel levels, and try not to explode.\r\n• Build ships with multiple stages, and jettison parts away as they burn out.\r\n• Full control over the ship’s setup allows for complex ships and advanced functionality.\r\n• Dock spacecraft together to build Space Stations, Massive Starships, or even surface bases on other worlds.\r\n• Manage your crewmembers, hire them, and send them out into space and make them into heroes.\r\n• Research and Develop new technologies to advance your Space Program.\r\n• Take on Missions to attract interest in your Space Program.\r\n• Discover new worlds and expand the scientific knowledge of Kerbalkind.\r\n• And a whole lot more!","torrent":{"xt":"urn:btih:6a4caa6b55a7a704583fddcbac20b401f76eaa93","amp;dn":"KSP+Kerbal+Space+Program+1.2.0.1586+%5BWin%2FMac%2FLinux%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a4caa6b55a7a704583fddcbac20b401f76eaa93","infoHashBuffer":{"type":"Buffer","data":[106,76,170,107,85,167,167,4,88,63,221,203,172,32,180,1,247,110,170,147]},"announce":[],"urlList":[]}}