{"title":"Canon EOS Rebel T3 / 1100D Guide to DSLR Photography - David Bus","uid":6525684,"size":12772542,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a58b350c980f2d3cd9ffa6d48551fc2371df175&amp;dn=Canon+EOS+Rebel+T3+%2F+1100D+Guide+to+DSLR+Photography+-+David+Bus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MrDowntown","files":1,"time":1310150789,"description":"Canon EOS Rebel T3 / 1100D Guide to DSLR Photography - David Busch\n\nProduct Description\nThe Rebel T3/1100D is one of the most affordable entry-level cameras Canon has \never introduced. It boasts 12.2 megapixels of resolution, fast automatic focus, \nand cool features like the real-time preview system called Live View, and \nstandard high definition (1280 x 720 pixel) movie shooting. As the owner of \na Rebel T3/1100D, you demand the ability to take outstanding pictures with \nyour new camera. DAVID BUSCH'S CANON EOS REBEL T3/1100D GUIDE TO DIGITAL \nSLR PHOTOGRAPHY shows you how, when, and why to use all the cool features, \ncontrols, and functions of the Rebel T3/1100D to take great photographs. \nIntroductory chapters will help you get comfortable with the basics of \nyour camera before you dive right into exploring creative ways to apply \nfile formats, resolution, aperture/priority exposure, and other automatic \nexposure features. Beautiful, full-color images illustrate where the \nessential buttons and dials are, so you'll quickly learn how to use \nthe Rebel T3/1100D, and use it like a pro!\n\n\nFrom the Author\nIn depth, yet accessible, for beginners and Canon veterans\n\nRather than rush to be first on the shelves with a cursory overview of the \nCanon EOS T3, I decided to take some extra time putting together this \ncomprehensive, 400-page guide that answers all the questions that both \nbeginners and more experienced amateurs will have about this sophisticated \ncamera.  If you're serious about photography, you need:\nDetailed coverage of the T3's autofocus features.  Are you confused by \nall the T3's autofocus options? Learn how to choose focus modes and zone \nselection methods to snap into sharp focus every time.  You'll find \nexplanations of exactly how phase detection and contrast detection work, \nand step-by-step instructions for using techniques like stack focus.  \nEssential advice on settings options.  You need more than just a rehash \nof menu options and settings.  You want advice on when you should use \n(or not use) each option.  I've included two full chapters (more than \n100 pages) of tips so you can set up your camera with confidence.\nA full chapter on shooting movies and Live View.  My tips go beyond \njust the camera controls to show you how to get better movies and \naudio using storyboards, establishing shots, close-ups, two-shots, \nand more.  Get the most from your T3's full HD video capabilities.\nFirst-hand experience with the full array of Canon lenses for the T3.  \nI own and use virtually every lens in the Canon line, and have \nsummarized my recommendations on a full chapter that evaluates the \navailable lenses.\nThe latest technology. I'm always looking at new stuff, like Eye-Fi \ncards, GPS, and smartphone/tablet apps, and provide the latest news \nin my books.\nEntire chapters on exposure and histograms, flash and other topics. \nImprove your photography skills as you learn to use your T3.\nI know you'll enjoy using your new T3 as much as I have.  Sit down \nwith me and let me show you how to get the most from your camera.  \nAnd if you need a camera-bag-friendly guide to take with you \neverywhere, I have written a Compact Field Guide for this camera, too.\n\nEnjoy and Please SEED","torrent":{"xt":"urn:btih:6a58b350c980f2d3cd9ffa6d48551fc2371df175","amp;dn":"Canon+EOS+Rebel+T3+%2F+1100D+Guide+to+DSLR+Photography+-+David+Bus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a58b350c980f2d3cd9ffa6d48551fc2371df175","infoHashBuffer":{"type":"Buffer","data":[106,88,179,80,201,128,242,211,205,159,250,109,72,85,31,194,55,29,241,117]},"announce":[],"urlList":[]}}