{"title":"Stephen King 11.22.63 UNabr 32kbs mp3","uid":6803217,"size":439735220,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6b542cd5534114556cc20cf1008718b393fb54ab&amp;dn=Stephen+King+11.22.63+UNabr+32kbs+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"audiobookman","files":6,"time":1320761707,"description":"11.22.63\n\nUNABRIDGED\nby Stephen King\nNarrated by Craig Wasson\n\nLENGTH\n30 hrs and 38 mins\nAUDIBLE RELEASE DATE\n11-08-11\nWhat if you could go back in time and change the course of history? What if the watershed moment you could change was the JFK assassination? 11.22.63, the date that Kennedy was shot - unless....\n\nKing takes his protagonist Jake Epping, a high school English teacher from Lisbon Falls, Maine, 2011, on a fascinating journey back to 1958 - from a world of mobile phones and iPods to a new world of Elvis and JFK, of Plymouth Fury cars and Lindy Hopping, of a troubled loner named Lee Harvey Oswald and a beautiful high school librarian named Sadie Dunhill, who becomes the love of Jake's life - a life that transgresses all the normal rules of time.\n\nWith extraordinary imaginative power, King weaves the social, political and popular culture of his baby-boom American generation into a devastating exercise in escalating suspense.\n\n\n\nUploaders note-\n\nThis is 32kbs mp3., the originals are the same bitrate, ive been ripping audiobooks for years and many of my rips are around on dumpsites now.\nIve spent a lot of time getting the quality vs size trade off to work the best.\nIm sick to death of people saying why not do it this way, or why not just do it 8hz as your quality is bad. Well these people can move along, i have had no complaints from genuine users just the trolls.\nI rip and encode for ME not everyone else, i like to hear good quality and my rips reflect that, so before you start making judgements on the quality download it and listen.\nI like to recieve reports of any problems but not on the way i do things, its free for you so stop moaning - you will see what i mean if you check my other torrents.\n","torrent":{"xt":"urn:btih:6b542cd5534114556cc20cf1008718b393fb54ab","amp;dn":"Stephen+King+11.22.63+UNabr+32kbs+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b542cd5534114556cc20cf1008718b393fb54ab","infoHashBuffer":{"type":"Buffer","data":[107,84,44,213,83,65,20,85,108,194,12,241,0,135,24,179,147,251,84,171]},"announce":[],"urlList":[]}}