{"title":"911 - Painful Deceptions: An Analysis of the 911 Attack","uid":3412484,"size":732973056,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6c16972338dbad34274bfe4cec508e7d8bc34985&amp;dn=911+-+Painful+Deceptions%3A+An+Analysis+of+the+911+Attack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ReVIsed","files":1,"time":1132681810,"description":"***Some folks in here have a nasty habit of spamming my posts with false virus warnings, and would eventually, possibly, try to get me banned from this place. I upload A LOT of material about 9/11 being a staged event, and they seem to trigger a lot of those false virus warnings from a user named &quot;b2pilot187&quot;. Now, he is obviously either a disinformer or simply just the everyday-idiot, because my files are videofiles, hence impossible to infect with a virus. This user has been reported to the admins of this place, so I hope this matter will be setled sooner rather than later. Until then, simply ignore this person. But I would urge anyone not to ignore a virusscan in any event. I suspect he won't even read this, because he simply searches for &quot;911&quot; and spam each and every post with these warnings. Hence, you will probably find another one below, in the comment section.***\n\nReVIsed alias Masterpiece\n\nSynopsis:\n\nBy Eric Hufschmid (Revised by reopen911.org)\n\nSummary of the Video's Accusations:\n\nFlight 77: \n?There is no evidence of Flight 77 or the dead passengers at the Pentagon. \n?The Pentagon security video suggests a Global Hawk was shattered by a missile. The missile may have been launched from a defensive missile system around the Pentagon. \n\nThe World Trade Center Towers: \n?Explosives were placed in both towers before the attack to cause the towers to disintegrate into dust. \n?Explosives were detonated via radio by a computer in Building 7. \n\nBuilding 7: \n?It was a 47 story, steel-framed building that disintegrated later in the day, also from explosives. \n?The 23rd floor was the Mayor?s &quot;Emergency Command Center,&quot; which had its own air supply. This appears to be the command center for destroying the towers. \n\nPlus, an explanation of turbofans, explosives, the Oklahoma City bombing, the media that Americans mistakenly refer to as our &quot;Free Press,&quot; and why deception is the main weapon in this war to control us. \n\nFilesize.....: 699 MB (or 715,794 KB or 732,973,056 bytes)\nRuntime......: 01:23:44 (150,573 fr)\nVideo Codec..: XviD\nVideo Bitrate: 1021 kb/s\nAudio Codec..: 0x0055(MP3) ID'd as MPEG-1 Layer 3\nAudio Bitrate: 137 kb/s (68/ch, stereo) VBR LAME3.96r\nFrame Size...: 480x352 (1.36:1) [=15:11]","torrent":{"xt":"urn:btih:6c16972338dbad34274bfe4cec508e7d8bc34985","amp;dn":"911+-+Painful+Deceptions%3A+An+Analysis+of+the+911+Attack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c16972338dbad34274bfe4cec508e7d8bc34985","infoHashBuffer":{"type":"Buffer","data":[108,22,151,35,56,219,173,52,39,75,254,76,236,80,142,125,139,195,73,133]},"announce":[],"urlList":[]}}