{"title":"[SoM]36. Quai des Orfevres[DvdRip-Xvid-Ita-Mp3]","uid":4378872,"size":733856390,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6c2e775d1bfc36d1fc5d923d25effbc4764b0fbe&amp;dn=%5BSoM%5D36.+Quai+des+Orfevres%5BDvdRip-Xvid-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mitimex","files":1,"time":1220550696,"description":"La Francia torna a sfornare film di grande qualitÃƒÂ . Premiato dal pubblico al recente &quot;Noir in Festival&quot; di Courmayeur, 36-Quai des orvefres, presenta assieme per la prima volta, tre nomi notissimi del cinema d&amp;#039;oltralpe: DepardieÃƒÂ¹, Auteil e Dussolier, invischiati in una sordida storia di tradimenti e vendette all&amp;#039;ombra della centrale di polizia con sede nella via da cui il film prende il suo titolo.I primi trenta minuti del film presentano le migliori sequenze &quot;poliziottesche&quot; degli ultimi vent&amp;#039;anni : dure, violente, ricche di suspance, pathos, originali nella forma e perfette nella realizzazione pratica ed interpretate alla grande non solo dai due giganti Auteil e Depardieu, che peraltro possono dare libero sfogo alla loro bravura durante il resto della pellicola, ma anche e sopratutto da un cast di seconde linee, assolutamente strepitoso. Una volta esauritasi la forza dirompente dell&amp;#039;incipit, 36 cambia lentamente ed inesorabilmente faccia, diventando qualcosa di simile ad una tragedia shakespeariana, con la lotta a distanza tra i due protagonisti che si fronteggiano e lottano a forza di colpi bassi entrando in una spirale di violenza e morte che lascerÃƒÂ  ben pochi personaggi vivi sul campo di battaglia. Diretto alla grande e sceneggiato alla stra-grande, 36 colpisce lo spettatore grazie alla freschezza e realismo della messa in scena, alla bravura degli interpreti, alla eccezionale colonna sonora, evocativa ma mai ridondante, ad una serie di dialoghi che, se fossero inseriti in un film americano, probabilmente, sarebbero oggi giÃƒÂ  sulla bocca di tutti. Insomma, in una parola, imperdibile.","torrent":{"xt":"urn:btih:6c2e775d1bfc36d1fc5d923d25effbc4764b0fbe","amp;dn":"%5BSoM%5D36.+Quai+des+Orfevres%5BDvdRip-Xvid-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c2e775d1bfc36d1fc5d923d25effbc4764b0fbe","infoHashBuffer":{"type":"Buffer","data":[108,46,119,93,27,252,54,209,252,93,146,61,37,239,251,196,118,75,15,190]},"announce":[],"urlList":[]}}