{"title":"The Nano-Micro Interface - Bridging the Micro and Nano Worlds","uid":15405781,"size":20269951,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c51a0f188e3703fe1a89995a5516b1c38bcfefd&amp;dn=The+Nano-Micro+Interface+-+Bridging+the+Micro+and+Nano+Worlds&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1469502748,"description":"The Nano-Micro Interface - Bridging the Micro and Nano Worlds - Marcel Van de Voorde et al. (Wiley-VCH, 2015).pdf\r\n\r\nControlling the properties of materials by modifying their composition and by manipulating the arrangement of atoms and molecules is a dream that can be achieved by nanotechnology. As one of the fastest developing and innovative -- as well as well-funded -- fields in science, nanotechnology has already significantly changed the research landscape in chemistry, materials science, and physics, with numerous applications in consumer products, such as sunscreens and water-repellent clothes. It is also thanks to this multidisciplinary field that flat panel displays, highly efficient solar cells, and new biological imaging techniques have become reality.\r\n\r\nThis second, enlarged edition has been fully updated to address the rapid progress made within this field in recent years. Internationally recognized experts provide comprehensive, first-hand information, resulting in an overview of the entire nano-micro world. In so doing, they cover aspects of funding and commercialization, the manufacture and future applications of nanomaterials, the fundamentals of nanostructures leading to macroscale objects as well as the ongoing miniaturization toward the nanoscale domain. Along the way, the authors explain the effects occurring at the nanoscale and the nanotechnological characterization techniques. An additional topic on the role of nanotechnology in energy and mobility covers the challenge of developing materials and devices, such as electrodes and membrane materials for fuel cells and catalysts for sustainable transportation. Also new to this edition are the latest figures for funding, investments, and commercialization prospects, as well as recent research programs and organizations","torrent":{"xt":"urn:btih:6c51a0f188e3703fe1a89995a5516b1c38bcfefd","amp;dn":"The+Nano-Micro+Interface+-+Bridging+the+Micro+and+Nano+Worlds","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c51a0f188e3703fe1a89995a5516b1c38bcfefd","infoHashBuffer":{"type":"Buffer","data":[108,81,160,241,136,227,112,63,225,168,153,149,165,81,107,28,56,188,254,253]},"announce":[],"urlList":[]}}