{"title":"Planetary - Complete","uid":5118734,"size":405964252,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6c75f82788c416ad6c6793c3871cc597d1428544&amp;dn=Planetary+-+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zkmattos","files":33,"time":1255200389,"description":"Issues 1 to 27 of the regular series, plus one-shots\n\nPlanetary is an organization billing themselves as &quot;Archaeologists of the Impossible&quot;, tracking down the world's secret history. Funded by the mysterious Fourth Man, who it is said could be anyone from Bill Gates to Adolf Hitler, the field team consists of three superhumans: Jakita Wagner, who is strong, fast and nearly invulnerable; The Drummer, who can detect and manipulate nearby information streams, most commonly used to manipulate computers and other electronics; the new recruit Elijah Snow, who can extract heat from nearby substances at will, freezing them; and the former third man Ambrose Chase, who has a &quot;selective physics-distortion field&quot;.\n\nThe series is set in the Wildstorm Universe, along with other titles such as Stormwatch, The Authority, DV8 and GenÃ‚Â¹Ã‚Â³. Snow was born on January 1, 1900, as was Jenny Sparks of the Authority, and the two know each other. Planetary rarely crosses over with other Wildstorm series, although references are made to characters in other series, such as Henry Bendix from Stormwatch.\n\nPlanetary's field team travels the world investigating strange phenomena: monsters and other beings, unusual relics, other superhumans, and powerful secrets which certain individuals are trying to keep hidden from the rest of the world. Their purpose in doing this is partly curiosity, and partly to use what they learn for the betterment of mankind. There are, however, groups who oppose their goals, and the organization has a substantial history which is gradually revealed during the series.","torrent":{"xt":"urn:btih:6c75f82788c416ad6c6793c3871cc597d1428544","amp;dn":"Planetary+-+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c75f82788c416ad6c6793c3871cc597d1428544","infoHashBuffer":{"type":"Buffer","data":[108,117,248,39,136,196,22,173,108,103,147,195,135,28,197,151,209,66,133,68]},"announce":[],"urlList":[]}}