{"title":"People on People: The Oxford Dictionary of Quotations","uid":8552139,"size":6263075,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c9945aa0d35e474ac52ba3e30003ec9106436ee&amp;dn=People+on+People%3A+The+Oxford+Dictionary+of+Quotations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1370667216,"description":"\nPeople on People: The Oxford Dictionary of Biographical Quotations\nEnglish | ISBN: 0198662610 | 2001-12-20 | PDF | 496 pages | 6 MB\n\nThis is the ultimate collection of quotations from famous people about famous people. From Martin Amis on Jimmy Connors and Jane Austen on Henry VIII, to Liz Hurley on Marilyn Monroe, there are over 4,000 quotations about both historical and contemporary figures from all over the world. The speakers are often as well known as the people they are talking about, and come from a broad range of disciplines rnd professions, including actors, architects, dancers, historians, mathematicians, literary figures, politicians, academics, sports personalities, and scientists. All the quotations about each individual are brought together in an entry headed by a brief description, making it possible to compare what different people have said about one particular person. A detailed author index gives a context line from each quotation, biographical information on authors, and an overview of their comments, often revealing their personalities. Entertaining and perfect for browsing, it is also a valuable biographical resource. Who could fathom Plato's mind? Unless one is a genius philosophy is a mug's game Iris Murdoch on Plato He was a good man, but did not know how to paint El Greco on Michelangelo Madame Curie is very intelligent but as cold as a herring Albert Einstein on Marie Curie We elected a President, not a Pope Barbara Streisand on Bill Clinton His technique is astounding, yet everything is accomplished with the air of someone sauntering through the park on a spring morning Margot Fonteyn on Fred Astaire Keep your eyes on him; some day he will give the world something to talk about Mozart on Beethoven","torrent":{"xt":"urn:btih:6c9945aa0d35e474ac52ba3e30003ec9106436ee","amp;dn":"People+on+People%3A+The+Oxford+Dictionary+of+Quotations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c9945aa0d35e474ac52ba3e30003ec9106436ee","infoHashBuffer":{"type":"Buffer","data":[108,153,69,170,13,53,228,116,172,82,186,62,48,0,62,201,16,100,54,238]},"announce":[],"urlList":[]}}