{"title":"M. F. Burnyeat - Explorations in Ancient and Modern Philosophy. ","uid":10396616,"size":7025345,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d198e8e3d17120494d14a6ecfcc6199139ceb78&amp;dn=M.+F.+Burnyeat+-+Explorations+in+Ancient+and+Modern+Philosophy.+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Anette14","files":-1,"time":1403275086,"description":"Description\nProduct Details\nBook Title: Explorations in Ancient and Modern Philosophy, 2 Volume Hardback Set\t\nBook Author: M. F. Burnyeat\nHardcover: 776 pages\nPublisher: Cambridge University Press (July 30, 2012)\nLanguage: English\nISBN-10: 1107400066\nISBN-13: 978-1107400061\n\n===================================================================================\nBook Description\nPublication Date: July 30, 2012 | ISBN-10: 1107400066 | ISBN-13: 978-1107400061\nM.F. Burnyeat taught for 14 years in the Philosophy Department of University College London, then for 18 years in the Classics Faculty at Cambridge, 12 of them as the Laurence Professor of Ancient Philosophy, before migrating to Oxford in 1996 to become a Senior Research Fellow in Philosophy at All Souls College. The studies, articles and reviews collected in these two volumes of Explorations in Ancient and Modern Philosophy were all written, and all but two published, before that decisive change. Whether designed for a scholarly audience or for a wider public, they range from the Presocratics to Augustine, from Descartes and Bishop Berkeley to Wittgenstein and G.E. Moore. Their subject-matter falls under four main headings: Part I on Logic and Dialectic, Part II on Scepticism Ancient and Modern, Part III on Knowledge, Part IV on Philosophy and the Good Life. The title 'Explorations' well expresses Burnyeat's ability to discover new aspects of familiar texts, new ways of solving old problems. In his hands the history of philosophy becomes itself a philosophical activity.\n\n===================================================================================\nReview\n&quot;...The collection as a whole reveals the historical and philosophical power of a truly extraordinary mind, one whose influence has been almost as great through his teaching as through his books and the papers collected here.... It would be foolish to pick out one or two of these papers for discussion. Every reader will have his or her favorites.... Readers who have come this far will already know what to do - buy this book or make sure that their library does so as soon as possible.... the reader has been brought to deeper insights in a way that is as much literary and historical as it is philosophical...&quot;--Brad Inwood, University of Toronto, Bryn Mawr Classical Review\n\n===================================================================================\nBook Description II\nTwo volumes collecting the published work from the period up to 2000 of one of the greatest living scholars of ancient philosophy alive today. It ranges widely over many topics, although with a particular emphasis on Plato and Aristotle and the intersection between aspects of ancient and modern philosophy.\n\n===================================================================================\nAbout the Author\nM. F. Burnyeat is an Honorary Fellow of Robinson College, Cambridge, and an Emeritus Fellow of All Souls College, Oxford. He is also a Fellow of the British Academy and a Foreign Honorary Member of the American Academy of Arts and Sciences and was awarded a CBE for his services to scholarship in 2007.\n===================================================================================","torrent":{"xt":"urn:btih:6d198e8e3d17120494d14a6ecfcc6199139ceb78","amp;dn":"M.+F.+Burnyeat+-+Explorations+in+Ancient+and+Modern+Philosophy.+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d198e8e3d17120494d14a6ecfcc6199139ceb78","infoHashBuffer":{"type":"Buffer","data":[109,25,142,142,61,23,18,4,148,209,74,110,207,204,97,153,19,156,235,120]},"announce":[],"urlList":[]}}