{"title":"Mickeys Christmas Carol (Ultimate Christmas Classics)","uid":9171709,"size":368230410,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6d46508588ac483f57be5686ad911c2f7959bdd7&amp;dn=Mickeys+Christmas+Carol+%28Ultimate+Christmas+Classics%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"IndianChristian","files":3,"time":1384084300,"description":"Mickeys Christmas Carol (Ultimate Christmas Classics)\n\n\nThis 1983 Disney adaptation of Dickens's &quot;A Christmas Carol&quot; has animals playing the parts of characters. However, it doesn't pander down to its audiences. This makes it a family film which the whole family can enjoy.\n\nEbenezer Scrooge (Scrooge McDuck) is a miserable and greedy old miser. His sole employee Bob Crachit (Mickey Mouse) has a large workload but receives meager sums. Scrooge expects Bob's family to do his laundry for him. Bob was even expected to work on Christmas Day if he did not want to be docked pay.\n\nScrooge continues his assaults on people until he receives a visit from the ghost of his partner Jacob Marley (Goofy). He was like Scrooge while alive and now has to do penance for that behavior. Three spirits visit Scrooge to offer him the all-critical one last chance.\n\nThe Ghost of Christmas Future is by far the scariest of the apparitions. After seeing that Tiny Tim Crachit (Morty Fieldmouse) will die in the future present, Scrooge is then pushed into his own coffin by this spirit.\n\nHe wakes up in a panic on Christmas morning, tangled in his bed sheets. The reformed Scrooge showers the Crachit family with presents and elevates Bob to partner of the counting house. This very big promotion will enable Tiny Tim to receive the very best medical care then available and Scrooge himself becomes an uncle to the kids.\n\nThe animation is good, but the music is even better. It captures the sentiment of this film and the holiday season in general.\n\nA enjoyable classic for kids as well as adults alike. \n\nRuntime: 26 mins\nLanguage: English\nYear: 1993\nQuality: 10/10\nFormat: avi format \n\nSee reviews here,  &lt;a href=&quot;\nhttp://www.amazon.com/Mickeys-Christmas-Carol-Disney-Classics/dp/6300276473&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Mickeys-Christmas-Carol-Disney-Classics/dp/6300276473&lt;/a&gt;\n\nI would ask every Christian to do 2 things.\n\n1. If possible please buy this movie. Do you know that there are 2.2 billion Christians on earth today. But only a privileged few, around 12% have the means and the accessibility to buy Christian films. Many Christians are too poor to buy movies or live in places where Christian films are not available. \nThat's not all. Out of the 12% who have the means and accessibility to buy Christian media, only around 0.5% ever buys a Christian movie. In other words only 1 out of 200 Christians ever buys a Christian movie. Pathetic isn't it?\nPlease buy the movies to keep Christian films in business. And please do pray for the Christian movie makers and their families.\n\n2. Please seed the movies for as long as possible. If possible make copies and distribute to your poor neighbors. And please do pray for the movie makers and their families. Remember the Kingdom of Heaven is in you and so is the choice of Heaven/Hell. \n\nPS: If you need any specific Christian movie or have something to say then kindly send a mail to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;254c4b414c444b464d574c56514c444b1715151c655c444d4a4a0b464a0b4c4b&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nKindly mention the subject as Christian Movies or something similar. \n\n&quot;Don't ask me what Christ can do for you! He has done all he could. Tell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\n","torrent":{"xt":"urn:btih:6d46508588ac483f57be5686ad911c2f7959bdd7","amp;dn":"Mickeys+Christmas+Carol+%28Ultimate+Christmas+Classics%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d46508588ac483f57be5686ad911c2f7959bdd7","infoHashBuffer":{"type":"Buffer","data":[109,70,80,133,136,172,72,63,87,190,86,134,173,145,28,47,121,89,189,215]},"announce":[],"urlList":[]}}