{"title":"Cook - Big Brother NSA &amp; its Little Brothers (1998)","uid":4537824,"size":14241780,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d5c71c58f14b14e0d8a3f5f99d1f0800768a9d4&amp;dn=Cook+-+Big+Brother+NSA+%26+its+Little+Brothers+%281998%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227809531,"description":"This is Terry L. Cook&amp;#039;s explosive book Big Brother NSA &amp; its Little Brothers - National Security Agency&amp;#039;s Global Survellance Network (1998) which is the best researched, best documented book ever written regarding the Beast&amp;#039;s international computer system which will ultimately enslave all humanity and produce a microchipped population controlled by a planetary big brother. Many rumors and overly dramatic, undocumented speculations have been postulated regarding a possilbe Beast computer system in Brussels, Belgium. The solid research in &quot;Big Brother NSA&quot; refutes these rumors by informing people that the Beast system is in reality located in America at the National Security Agency in Fort Meade, Maryland! There is a huge, classified, European Union database center in Brussels, but it is nowhere near the size and capability of the NSA with its ten acres of underground computers at the Fort Meade Army Base. And as you might guess, the Belgium system is connected to NSA via modern telecommunications technology. In fact, virtually every major database in the world, either government or private, is connected to the NSA. It is a fact that most of human history is replete with controlling authoritarian dictatorships. Therefore, who can deny that one day very soon America itself will NOT become a socialistic dictatorship? Combining all information on everyone into one huge government database system, such as the National Security Agency, really makes that probability viable. In the Pentagon research effort to detect terrorism by electronically monitoring the civilian population, the most remarkable detail may be this: Most of the pieces of the system are already in place. Because of the inroads the Internet and other digital network technologies have made into everyday life over the last decade, it is increasingly possible to amass Big Brother-like surveillance powers through Little Brother means. The basic components include everyday digital technologies like e-mail, online shopping and travel booking, A.T.M. systems, cellphone networks, electronic toll-collection systems and credit-card payment terminals. The civilian population, in other words, has willingly embraced the technical prerequisites for a national surveillance system that Pentagon planners are calling Total Information Awareness. Big Brother NSA is a carefully researched, solidy documented, reliable work that should help to dispel all previous misunderstandings and &quot;Christian&quot; dogma regarding this issue. 430 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:6d5c71c58f14b14e0d8a3f5f99d1f0800768a9d4","amp;dn":"Cook+-+Big+Brother+NSA+%26+its+Little+Brothers+%281998%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d5c71c58f14b14e0d8a3f5f99d1f0800768a9d4","infoHashBuffer":{"type":"Buffer","data":[109,92,113,197,143,20,177,78,13,138,63,95,153,209,240,128,7,104,169,212]},"announce":[],"urlList":[]}}