{"title":"Sherri Model (Sherri Chanel) Complete 90 Minute Version Botched","uid":9909475,"size":164009512,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6df82614d9c75bd6e3e63999b85af5bcc28e0b0d&amp;dn=Sherri+Model+%28Sherri+Chanel%29+Complete+90+Minute+Version+Botched+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"onitafmw55","files":-1,"time":1396865569,"description":"Complete 90 Minute Uncut Version of the Webcam Video in MP4 Format\n\nHere is an updated version.  The whole webcam with Sherri trying on several dresses before the botched topless incident.  She then signs off and says she quits modeling.  She didn't, she came back and pretends this never happened.\n\nSherri Model is a non-nude 18+ model who during this photoshoot saw a wardrobe malfunction and suddenly the non-nude web model became, accidently for a few brief seconds, the nude web model.\n\nThis is the complete version and there is several sample pictures included to see the stuff she was trying on before the oops topless incident.  \n\nSherri is the younger sister of Marie-Chanel (Brittany Guzik) who herself is an internet nude model and appeared in Playboy.\n\nThe official release of this webcam has been pulled from her official sites and as far as sherri model and her people are concerned, this webcam/video doesn't exist.  \n\nQuality is about as good as a webcam can get, which is to say solid, not spectacular.  See the sample pictures to get a fairly good idea.  There is some audio skipping but the video plays smooth and it is in sync.  I recommend you use the VLC Media Player for the best playback.\n\nENJOY!","torrent":{"xt":"urn:btih:6df82614d9c75bd6e3e63999b85af5bcc28e0b0d","amp;dn":"Sherri+Model+%28Sherri+Chanel%29+Complete+90+Minute+Version+Botched+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6df82614d9c75bd6e3e63999b85af5bcc28e0b0d","infoHashBuffer":{"type":"Buffer","data":[109,248,38,20,217,199,91,214,227,230,57,153,184,90,245,188,194,142,11,13]},"announce":[],"urlList":[]}}