{"title":"Nutrition For Dummies - 6th Edition - Carol Ann Rinzler","uid":14397627,"size":4907774,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6e0fd4ff5d569607845ca963ccdc05b7784a7ab6&amp;dn=Nutrition+For+Dummies+-+6th+Edition+-+Carol+Ann+Rinzler&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1461359809,"description":"Get the straight facts on nutrition, slim down, and feel great\r\n\r\nYou've been hearing it since you were a kid: &quot;You are what you eat.&quot; And this wise saying is true! Good nutrition is the key to achieving and maintaining healthy weight and lifelong good health—no matter how you slice it. Nutrition For Dummies, 6th Edition is a one-size-fits-all guide to nutrition that shows you how to manage your diet so you get the most bang for your buck. This book gives you the know-how to put together a shopping list, prepare healthy foods, and easily cut calories.\r\n\r\nThe latest edition of The Dietary Guidelines for Americans encourages individuals to eat a healthful diet—one that focuses on foods and beverages that help achieve and maintain a healthy weight, promote health, and prevent chronic disease. This updated edition of Nutrition For Dummies reflects the latest suggested guidelines and details in plain English so you can incorporate these recommendations for living a nutritionally sound life. You'll get updated RDAs on vitamins and nutritional supplements; find out why you should eat more fruits, vegetables, nuts, whole grains, and other plant-based foods; understand the importance of cholesterol for brain health; get the latest information on obesity; and more.\r\n\r\n• Decipher the latest nutrition facts, labels, and guidelines\r\n• Understand why sugar is the most controversial subject in diet today\r\n• Grasp the truth about vitamin supplements and energy drinks\r\n• Make informed decisions about your own nutrition choices\r\n\r\nAn apple a day may not necessarily keep the doctor away, but with the simple guidance of Nutrition For Dummies, 6th Edition you can be on your way to living a happier, healthier, and longer life","torrent":{"xt":"urn:btih:6e0fd4ff5d569607845ca963ccdc05b7784a7ab6","amp;dn":"Nutrition+For+Dummies+-+6th+Edition+-+Carol+Ann+Rinzler","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e0fd4ff5d569607845ca963ccdc05b7784a7ab6","infoHashBuffer":{"type":"Buffer","data":[110,15,212,255,93,86,150,7,132,92,169,99,204,220,5,183,120,74,122,182]},"announce":[],"urlList":[]}}