{"title":"A Life Under Russian Serfdom: The Memoirs of Savva Dmitrievich P","uid":8880649,"size":1998445,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6e11b23b2cd909c6e8ddf3ca00f677b3f0f59f83&amp;dn=A+Life+Under+Russian+Serfdom%3A+The+Memoirs+of+Savva+Dmitrievich+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"blackatk","files":-1,"time":1378313964,"description":"This is a translation of one of the very few Russian serfs' memoirs. Savva Purlevskii recollects his life in Russian serfdom and the lives of his grandparents, parents, and fellow villagers. He describes family communal life and the serfs' daily interaction with landlords and authorities. Purlevskii came from an initially prosperous family that later became impoverished. Early in his childhood, he lost his father. Purlevskii did not have a chance to gain a formal education. He lived under serfdom until 1831 when at the age of 30, he escaped his servitude.\n\n\n\nAbout the Author\nBoris B. Gorshkov teaches world history at Kennesaw State University. He is author of many articles on the Russian pre-emancipation peasantry and child labor, including &quot;Democratizing Habermas: Peasant Public Sphere in Pre-Reform Russia,&quot; Canadian American Slavic Studies Special Issue (Fall 2004); &quot;Factory Children&quot; in New Labor History, ed. Michael Melancon and Alice Pate (Bloomington, 2002); &quot;Serfs on the Move,&quot; Kritika 1 (Fall 2000); and &quot;Serfdom in Eastern Europe&quot; in Encyclopedia of European Social History, ed. Peter N Stearns 6 volumes (New York, 2001) \n\n\n\nPaperback: 119 pages\nPublisher: Central European Univ Pr (March 2005)\nLanguage: English\nISBN-10: 9637326154\nISBN-13: 978-9637326158\n\n\n\nTags: russia, russian, romanov, serf, serfdom, bondage, servitude, poverty, famine, struggle, education, uneducation, debt, bondage, slavery, memoir, savva, dmitrievich, purlevskii, corruption, wealth, inequality, social, society, dynasty, Velikoe, Yaroslavl,capitlism, 1871, 1868, Russki,vestnik, village, europe. european studies, political science, social, studies, international, relations, anthropology, refom, revolution, 1917, class, struggle, oppression,poland, ukraine, baltics, baltic, central europe, eastern, europe, northern, europe, eurasia,  ","torrent":{"xt":"urn:btih:6e11b23b2cd909c6e8ddf3ca00f677b3f0f59f83","amp;dn":"A+Life+Under+Russian+Serfdom%3A+The+Memoirs+of+Savva+Dmitrievich+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e11b23b2cd909c6e8ddf3ca00f677b3f0f59f83","infoHashBuffer":{"type":"Buffer","data":[110,17,178,59,44,217,9,198,232,221,243,202,0,246,119,179,240,245,159,131]},"announce":[],"urlList":[]}}