{"title":"Buddy Guy - Sweet Tea-2001-Mp3[CR-Bt]","uid":4624596,"size":92124215,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6e8dbed8ae131576074a2bdb16c21dfcf72c69a6&amp;dn=Buddy+Guy+-+Sweet+Tea-2001-Mp3%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"tathiana","files":9,"time":1231165797,"description":"Ogni disco di Buddy Guy suona come qualcosa di profondamente antico, ma allo stesso tempo vivo e genuino.\n&quot;Sweet tea&quot; ÃƒÂ¨ il sesto lavoro del buon Buddy per la Silvertone, dopo che la sua carriera era rimasta bloccata per una decina d'anni e, per fugare ogni dubbio, meglio dire subito che questo ÃƒÂ¨ un grande disco, per niente nostalgico o datato, che meriterebbe di essere preso a modello da qualsiasi neochitarrista, rock o metal che sia.\nIl blues ÃƒÂ¨ la madre di ogni musica dei nostri tempi e questo sessantacinquenne della Louisiana ÃƒÂ¨ ancora qui a ricordarcelo, fondendo alla perfezione la scuola di Chicago con quella del Mississippi.\nLe canzoni vanno a pescare nel catalogo della Fat Possum (Robert Cage, T-Model Ford, Junior Kimbrough), ovvero nella parte nord del Mississippi, dove il blues rurale scorre mescolandosi con le correnti piÃƒÂ¹ arcigne del country. Le versioni che trovano posto in questo disco sono estremamente dirette, tanto solide quanto rozze, proprio come la vecchia casa in legno, sperduta in mezzo ai boschi, che campeggia in copertina.\nSi comincia con &quot;Done got hold&quot;: Buddy Guy, trascinandosi con una scarna chitarra acustica, canta tutta la desolante amarezza del tempo che passa inesorabile, &quot;Well, I done got old / Can't do the things I used to do / 'Cause I'm an old man&quot;, ma la sua presa di coscienza suona anche come una rabbia a fatica contenuta. E il grido non puÃƒÂ² essere trattenuto a lungo: la batteria introduce &quot;Baby please don't leave me&quot;, un pezzo minaccioso con la chitarra che suona disperata, passando tra alti e bassi, e la voce di Buddy che si arroventa da vero shouter. &quot;Look what you got&quot; e &quot;Stay all night&quot; sono piene di polvere, giocate su un call and response travolgente tra voce e chitarra. &quot;Tramp&quot; ÃƒÂ¨ un lungo blues alla Hendrix con un sottofondo malsano, d'altronde cosa sarebbe oggi il blues elettrico se non ci fosse stato Jimi? E non poteva mancare nemmeno la presenza del diavolo (&quot;She got the devil&quot;), inteso nella migliore tradizione sia come male in sÃƒÂ¨ sia come parte oscura dell'uomo, anzi della donna.\n&quot;I gotta try you girl&quot; non abbassa il tiro e continua sulla stessa linea ritmica cupa e sensuale che fa del pezzo quasi un voodoo ipnotico. &quot;Who's been foolin' you&quot; porta crescendo sempre piÃƒÂ¹ veloci che inseguono gli ululati della chitarra e della voce.\n&quot;It's a jungle out there&quot; chiude il disco come meglio non si poteva: le note della Stratocaster sembrano arrivare da lontano a ribadire il suono primitivo e selvaggio del blues. ÃƒË† impressionante tutta la forza evocativa che Buddy Guy riesce ad esprimere, ma, a ben vedere, questa ÃƒÂ¨ una prerogativa di tutti i veri bluesmen, che l'etÃƒÂ  sembra solo rinvigorire.\nSe qualcuno crede questo sia ormai un genere buono solo per le cosiddette enciclopedie del rock, non ha che da ascoltare questo disco e poi arrossire di vergogna. E se di Grammy per il miglior album blues ne ha giÃƒÂ  vinti quattro, ora che cosa meriterebbe?\n","torrent":{"xt":"urn:btih:6e8dbed8ae131576074a2bdb16c21dfcf72c69a6","amp;dn":"Buddy+Guy+-+Sweet+Tea-2001-Mp3%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e8dbed8ae131576074a2bdb16c21dfcf72c69a6","infoHashBuffer":{"type":"Buffer","data":[110,141,190,216,174,19,21,118,7,74,43,219,22,194,29,252,247,44,105,166]},"announce":[],"urlList":[]}}