{"title":"Son House - Live At The Gaslight Cafe [320k MP3]","uid":6866895,"size":140201929,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6f6033afb496c91a9a6bd1e9eb89ec704d74209d&amp;dn=Son+House+-+Live+At+The+Gaslight+Cafe+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"smbdownload","files":-1,"time":1323135945,"description":"Recorded live at The Gaslight Cafe, New York, New York on January 3, 1963.\n\n[320k MP3]\n\nSon House's earliest recordings, three two-sided 78s (&quot;My Black Mama,&quot; &quot;Preachin' the Blues,&quot; &quot;Dry Spell Blues&quot;) recorded in New York on May 28, 1930, proved to be a hard act to follow, and House never really equaled these fierce, driving performances again, although he came close. The field recordings he did for Alan Lomax in 1941 and 1942 are certainly indispensable, featuring a loose, ad hoc Delta string band on half the cuts, and the intimacy on these is amazing, but the larger-than-life roar of his 1930s Paramount tracks is muted (Catfish Records has released the early 78s and the Lomax field material on a single disc as Preachin' the Blues -- still the best Son House purchase out there). House's rediscovery in 1964 led to some interesting sessions for Columbia Records, and a handful of live recordings from his time on the folk and blues coffee house circuit have surfaced, including a set from House's Rochester home, recorded in 1969, but on each of these House sounds increasingly tired, worn, and wearied. The fire had long since gone out, although he was capable of generating a facsimile of the old roar on occasion, as this set recorded at Gaslight CafÃƒÂ© in New York in 1965 shows. The versions here of &quot;Empire State Express&quot; and &quot;Death Letter Blues&quot; (nearly nine minutes long and still incomplete, even at that length) are startling in their intensity, showing some of the power of the 1930s material, but it is obvious on most of the other tracks that age and a long, hard life have left House a mere shadow of his former musical self. Still, just like you don't want to be caught by a Baptist preacher (an occupation House once practiced) trying to sneak out on the sermon, it's nearly impossible not to listen to this set clear through once it begins. It feels like an important bit of living history, and behind every tortured, exhausted note you can almost hear the ghost of Son House in his fiery prime.\n\n------------------------------------------------------------------------------\n\n01. Pony Blues\t4:27\n02. Motherless Children\t4:10\n03. Preachin' The Blues\t4:59\n04. This Little Light Of Mine\t3:53\n05. Son's Blues\t6:53\n06. Death Letter Blues (Incomplete)\n07. I Shall Not Be Moved\t3:17\n08. Levee Camp Moan\t8:32\n09. Empire State Express\t4:29\n10. Pearline\t4:00\n11. Yonder Comes My Mother (When The Roll Is Called Up Yonder)\t3:35\n12. Louise Mcghee (Incomplete)\t4:22","torrent":{"xt":"urn:btih:6f6033afb496c91a9a6bd1e9eb89ec704d74209d","amp;dn":"Son+House+-+Live+At+The+Gaslight+Cafe+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f6033afb496c91a9a6bd1e9eb89ec704d74209d","infoHashBuffer":{"type":"Buffer","data":[111,96,51,175,180,150,201,26,154,107,209,233,235,137,236,112,77,116,32,157]},"announce":[],"urlList":[]}}