{"title":"[ExploitedCollegeGirls] Lacey (05.07.2015)","uid":11893476,"size":717302843,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:6f71303dfc3e4a667b8468509bcf39aff806f6ac&amp;dn=%5BExploitedCollegeGirls%5D+Lacey+%2805.07.2015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"chkm8te","files":1,"time":1431074888,"description":"[ExploitedCollegeGirls] Lacey (05.07.2015)\n\nThis week meet Lacey, a sexy but shy 19 year old with the kind of innocent girl next door sexuality that inspired us to start this site in the first place. Look past her various odd tattoos and piercings and what you see is an earnest teenage girl exploring her sexuality and sharing it with you, loyal viewers! What more could you ask for? Probably anal, you guys always ask for more anal.\n\nAs Jay interviews Lacey we find out that she's a little nervous but the rush is a turn on for her - listen to her excitement as she describes how she masturbates every morning with her bathtub faucet or how she likes to be manhandled and choked during sex. Notice how she shows off her pierced tongue and explains how much it's helped her learn to enjoy giving blowjobs? That's what we call foreshadowing. Or you can just fast forward to the hummer and watch, your call.\n\nJay starts off fingering Lacey and as she gets more and more aroused he turns to a vibrator to finish the job and in no time she's thrusting her hips and humping his hand as she has several small orgasms in a row. It's very sexy stuff as she completely loses herself. Next up the beej we alluded to mere sentences ago. Lacey attacks Jay's cock and treats him to an enthusiastic, sloppy, noisy blowjob. For the record, yes folks we actually pay him for this. Technically he's holding the camera at the same time, it's not like we pay him to sit around his bungalow binging on Netflix and getting models to drop by to paint his penis with their tongues.\n\nLacey gets him nice and hard and he has her climb on top of him to ride in reverse cowgirl, which drives her nuts. From RCG to hard fucking on her back to doggy, Jay pounds her to what seems like one continuous, non-stop orgasm. Eventually Jay's got to empty his balls too and he splashes a huge load over her cute face. Always the gentleman, he manages to avoid getting a single drop of jizz in her hair.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=fgzub6mhihqlanxaht0z.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=fgzub6mhihqlanxaht0z.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=3iofeeututavm29upau8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=3iofeeututavm29upau8.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:6f71303dfc3e4a667b8468509bcf39aff806f6ac","amp;dn":"%5BExploitedCollegeGirls%5D+Lacey+%2805.07.2015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f71303dfc3e4a667b8468509bcf39aff806f6ac","infoHashBuffer":{"type":"Buffer","data":[111,113,48,61,252,62,74,102,123,132,104,80,155,207,57,175,248,6,246,172]},"announce":[],"urlList":[]}}