{"title":"The New Teen Titans v1 01-40 + Ex (1980-1984|C2C|TCR+DCP+)","uid":9684754,"size":1223997050,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6ff2f5759834386aa156c0297861263b5f430b6a&amp;dn=The+New+Teen+Titans+v1+01-40+%2B+Ex+%281980-1984%7CC2C%7CTCR%2BDCP%2B%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1393741863,"description":"For more information about this series, please see the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Teen_Titans#The_New_Teen_Titans_.281980.E2.80.931996.29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Teen_Titans#The_New_Teen_Titans_.281980.E2.80.931996.29&lt;/a&gt;\n\nAfter their creation in 1964 and subsequent ongoing title, the original four members of the Teen Titans (Aqualad, Speedy, Robin and Wonder Girl) seemed bound to fade into obsurity as a team. That is, until the legendary duo of Marv Wolfman and George Perez got ahold of them in 1980 and turned the title into a smart and accessible showcase for the young guns of the DC Universe, as well as making it an extremely profitable and long-running franchise to this day. Speedy was off dealing with his heroin addiction in the pages of Green Arrow and Aqualad was running around underwater, but the new additions of Starfire, Cyborg, Raven and Beast Boy proved extremely popular. Robin and Donna Troy were aged more appropriately forward and the team itself functioned more like a group of wisecracking friends in their early adventures - and later, as a true family, a dynamic that Wolfman and Perez fully explored. The Teen Titans dealt with extraplanetary threats, magical attacks, demons and puppetmasters, and most famously treachery from within in The Judas Contract. This is one of the most lauded runs in mainstream comics and it all begins here.\n\nThis torrent contains the complete first volume, issues 01-40 and the two annuals released in this period. After issue 40, the title was renamed Tales of the Teen Titans and featured new content until issue 59 and part of 60; after which, it was a reprint title from 61-91 and a new volume of Teen Titans was created that continued the original story. These scans are the best currently available and significantly higher resolution than what is in the MTCDC and other places; the readability is also vastly improved and everything is in the correct page order with no duplicating unlike previous copies. There is some color bleeding early on but that is to be expected due to the limitations of the source material. However, it quickly gets really quite good IMHO. I have alao added the special DC Presents issue that functions as a &quot;prequel&quot; to the volume and shows the new team for the first time. Thanks go to TCR, bluejeff1954 and Hatful Of Hollow-DCP for all the issues and the upgrade in quality. Please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:6ff2f5759834386aa156c0297861263b5f430b6a","amp;dn":"The+New+Teen+Titans+v1+01-40+%2B+Ex+%281980-1984%7CC2C%7CTCR%2BDCP%2B%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ff2f5759834386aa156c0297861263b5f430b6a","infoHashBuffer":{"type":"Buffer","data":[111,242,245,117,152,52,56,106,161,86,192,41,120,97,38,59,95,67,11,106]},"announce":[],"urlList":[]}}