{"title":"Yes - Fly From Here [2011]","uid":6517962,"size":114057968,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:70b3ab2b8f05a5b48a80aecb827dcd32eafe1d5a&amp;dn=Yes+-+Fly+From+Here+%5B2011%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"KioskBerra","files":11,"time":1309894037,"description":"\n\nYes are an English progressive rock band formed in London in 1968. Regarded as one of the archetypal bands and pioneers of the genre, the group has survived multiple trends within popular music to sell nearly 50 million albums,retain a large following and sustain a career of over 40 years across many line-up changes. The band's music blends symphonic and other classical structures with their own brand of rock music.\n\nYes are generally noted for their lavish musical arrangements, psychedelic lyrics, ambitious stage performances, and a distinctive instrumental styling and unique harmony-oriented vocal style. This has been performed by a shifting team of distinctive and individual musicians, of whom the &quot;classic&quot; Yes lineup is considered to be bassist Chris Squire, the band's sole consistent member, former lead vocalist Jon Anderson (with his characteristic high-register vocals), eclectic guitarist / background vocalist Steve Howe, keyboard player Rick Wakeman, and drummer Alan White.\n\nA succession of other pioneering musicians have made their mark on the Yes sound as well, most notably guitarists Peter Banks and Trevor Rabin; keyboardists Tony Kaye, Patrick Moraz, and Geoff Downes; and drummer Bill Bruford, along with an array of other guest contributors over the years. Several band members became celebrated musicians and/or bandleaders in their own right, and a 1980 lineup of the band was briefly fronted by Trevor Horn (before he became a well known record producer). The band's current lineup is Squire, Howe,White, Downes and lead singer BenoÃƒÂ®t David.\n\nThe band's latest album, Fly from Here is due for release on July 12, 2011,with a joint tour with Styx to commence July 4.\n\n\n\n\n`Fly From Here` [2011]\n\n01. Fly From Here - Overture (1:54)\n02. Fly From Here - Pt. I - We Can Fly (6:01)\n03. Fly From Here - Pt. II - Sad Night at the Airfield (6:41)\n04. Fly From Here - Pt. III - Madman at the Screens (5:16)\n05. Fly From Here - Pt. IV - Bumpy Ride (2:15)\n06. Fly From Here - Pt. V - We Can Fly Reprise (1:45)\n07. The Man You Always Wanted Me to Be (5:08)\n08. Life on a Film Set (5:01)\n09. Hour of Need (3:07)\n10. Solitaire (3:30)\n11. Into The Storm (6:54)\n","torrent":{"xt":"urn:btih:70b3ab2b8f05a5b48a80aecb827dcd32eafe1d5a","amp;dn":"Yes+-+Fly+From+Here+%5B2011%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70b3ab2b8f05a5b48a80aecb827dcd32eafe1d5a","infoHashBuffer":{"type":"Buffer","data":[112,179,171,43,143,5,165,180,138,128,174,203,130,125,205,50,234,254,29,90]},"announce":[],"urlList":[]}}