{"title":"David Runciman - Political Hypocrisy. The Mask of Power, from Ho","uid":10454199,"size":1232669,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70c6024c44981181494413f50f0f552d2adad2b3&amp;dn=David+Runciman+-+Political+Hypocrisy.+The+Mask+of+Power%2C+from+Ho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Anette14","files":-1,"time":1404058704,"description":"Description\nProduct Details\nBook Title: Political Hypocrisy: The Mask of Power, from Hobbes to Orwell and Beyond\t\nBook Author: David Runciman (Author)\nHardcover: 288 pages\nPublisher: Princeton University Press (April 1, 2008)\nLanguage: English\nISBN-10: 0691129312\nISBN-13: 978-0691129310\n\n===================================================================================\nBook Description\nPublication Date: April 1, 2008\nWhat kind of hypocrite should voters choose as their next leader? The question seems utterly cynical. But, as David Runciman suggests, it is actually much more cynical to pretend that politics can ever be completely sincere. The most dangerous form of political hypocrisy is to claim to have a politics without hypocrisy. Political Hypocrisy is a timely, and timeless, book on the problems of sincerity and truth in politics, and how we can deal with them without slipping into hypocrisy ourselves. Runciman tackles the problems through lessons drawn from some of the great truth-tellers in modern political thought--Hobbes, Mandeville, Jefferson, Bentham, Sidgwick, and Orwell--and applies his ideas to different kinds of hypocritical politicians from Oliver Cromwell to Hillary Clinton.\nRunciman argues that we should accept hypocrisy as a fact of politics, but without resigning ourselves to it, let alone cynically embracing it. We should stop trying to eliminate every form of hypocrisy, and we should stop vainly searching for ideally authentic politicians. Instead, we should try to distinguish between harmless and harmful hypocrisies and should worry only about its most damaging varieties.\nWritten in a lively style, this book will change how we look at political hypocrisy and how we answer some basic questions about politics: What are the limits of truthfulness in politics? And when, where, and how should we expect our politicians to be honest with us, and about what?\n\n===================================================================================\nReviews\nA very intelligent, subtle, and learned guide to the classics and to the pre-eminent historical examples of hypocrisy from Mandeville and Hobbes, to Jefferson and the Victorians, with some concluding examples to illustrate the special problems of hypocrisy and sincerity in democracies. (David Martin Times Literary Supplement )\n\n[Political Hypocrisy] contains a plethora of shrewd and quotable remarks. . . . What struck a chord with me was his gentle demolition of the idea that a politician's profession of his own sincerity, or passionate belief, proves anything at all. (Samuel Brittan Financial Times )\n\nUniversity of Cambridge political theorist David Runciman takes a far more textured, sophisticated approach to the phenomenon in Political Hypocrisy, a timely, long overdue study of one of public life's in-your-face puzzles. (Carlin Romano The Philadelphia Inquirer )\n\nPolitical Hypocrisy is not just another denunciation of politicians as liars. Instead, it offers us a tour, from Hobbes and Mandeville to Bentham and Orwell. Runciman is best on the American revolutionaries and our eminent Victorians, perhaps because both the US war of independence and the British empire required self-aware democratic politicians to gloss over the gaps between their proclaimed beliefs and their actual behaviour. (David Willetts Prospect Magazine )\n\nPolitical Hypocrisy is a deep and thought-provoking work. (Tim Dunne THE )\n\nIn the excellent Political Hypocrisy, British journalist David Runciman uses the 2008 campaign to test his thesis that hypocrisy and anti-hypocrisy are joined in a 'discrete system' and that our obsession with this antagonistic tango is making modern politics impossible. (Richard King The Australian Literary Review )\n\nIn a masterly survey of political philosophers, practitioners and writers, he has brought out how they have dealt with hypocrisy in politics and addressed the question of when it is worth worrying over and when it is not worth worrying. (D. N. Ghosh Economic &amp; Political Weekly )\n\nRunciman's book should be appreciated for its attempt to present an alternate--and historical--approach to the issue of political hypocrisy. He successfully delves into the many fine distinctions that make up each theorist's approach and response to hypocrisy, which is particularly useful for a topic that so utterly lacks a clear division between black and white, and what is right and wrong. (Kiku Huckle Peace and Justice Studies )\n\n===================================================================================\nFrom the Back Cover\n&quot;David Runciman's great achievement is to take the notion of hypocrisy, well-known as a term of moral disapprobation, and to relocate it as a central concept in the history of rational liberal discourse. This illuminating, wide-ranging, and subtle study presents the exposing of hypocrisy, and its simultaneous retention, as an uncomfortable and largely deliberate feature of the writings of some major political theorists and disputants from Hobbes to the present, and argues persuasively and with characteristic elegance that hypocritical deception is necessarily embedded in political life and language.&quot;--Michael Freeden, University of Oxford\n\n&quot;David Runciman is a master navigator through the psychology of democracy.&quot;--Simon Jenkins, author and journalist\n\n&quot;A fascinating, stimulating read. It treats an issue of immediate political interest in a subtle and engaging way, finding in the history of political liberalism a wealth of insights relevant to contemporary politics. Anyone discussing political hypocrisy in the future will have to deal with this book.&quot;--Bryan Garsten, Yale University\n\n&quot;David Runciman's Political Hypocrisy is a superb, beautifully written book on a crucial topic, unmatched in the field and likely to shape it for a long time to come. I was consistently surprised and enlightened by its arguments.&quot;--Andrew Sabl, University of California, Los Angeles\n\n===================================================================================\nAbout the Author\nDavid Runciman is reader in political theory at the University of Cambridge and a fellow of Trinity Hall. He is the author of &quot;The Politics of Good Intentions&quot; (Princeton), and writes regularly about politics for the &quot;London Review of Books&quot;.\n===================================================================================","torrent":{"xt":"urn:btih:70c6024c44981181494413f50f0f552d2adad2b3","amp;dn":"David+Runciman+-+Political+Hypocrisy.+The+Mask+of+Power%2C+from+Ho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70c6024c44981181494413f50f0f552d2adad2b3","infoHashBuffer":{"type":"Buffer","data":[112,198,2,76,68,152,17,129,73,68,19,245,15,15,85,45,42,218,210,179]},"announce":[],"urlList":[]}}