{"title":"(3DS) AXCE - Super Smash Bros. (US) GW 2.6","uid":11566351,"size":2147483648,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:70e0f78049ce80df07beccca1d653c41a4cf505c&amp;dn=%283DS%29+AXCE+-+Super+Smash+Bros.+%28US%29+GW+2.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"BanterJ","files":1,"time":1416956457,"description":"Super Smash Bros. for Nintendo 3DS (Japanese: å¤§ä¹±é—˜ã‚¹ãƒžãƒƒã‚·ãƒ¥ãƒ–ãƒ©ã‚¶ãƒ¼ã‚º for Nintendo 3DS)\n\nLike in previous games in the series, Super Smash Bros. is a fighting game in which up to four players use various attacks, techniques, and items to deal damage to their opponents. The aim of the game is for players to increase their opponents' damage percentage, causing them to fly back further when attacked, and knock them out of the playing field. To assist players during fights, items appear on the battlefield, including items from the various video games represented in the series or items unique to Super Smash Bros.. Among these are the Smash Ball, an item that allows players to summon a powerful and unique Final Smash attack,[6] and Assist Trophies, which summon various other video game characters onto the field to attack opponents or help in other ways,[9][10] both previously introduced in Super Smash Bros. Brawl. Like its predecessors, Super Smash Bros. features collectible in-game trophies based on characters or items seen in various Nintendo or third-party games.[11] Each stage now features an alternate Omega form, which replaces the stage's layout with a flat surface and removes all stage hazards.[12] Certain stages, collectible trophies, and Assist Trophies are exclusive to each version of game, with the Wii U version primarily featuring elements taken from console titles and the 3DS version taking elements primarily from handheld games. Both games feature revisited stages from past entries in the series.[6][11][13]\n\n-Wikipedia\n\nHeader has been zeroed to protect original copy. Playable as is. To play online, get this: http://thepiratebay.se/torrent/11550246/Gateway_ROM_Patcher_1.0\n\nAdd your own header to avoid a future potential ban.\n\nNote: At the time of this upload, Nintendo hasn't banned any systems or cartridges. Changing the game header to your own, personal one is a security measure to ensure you never get banned","torrent":{"xt":"urn:btih:70e0f78049ce80df07beccca1d653c41a4cf505c","amp;dn":"%283DS%29+AXCE+-+Super+Smash+Bros.+%28US%29+GW+2.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70e0f78049ce80df07beccca1d653c41a4cf505c","infoHashBuffer":{"type":"Buffer","data":[112,224,247,128,73,206,128,223,7,190,204,202,29,101,60,65,164,207,80,92]},"announce":[],"urlList":[]}}