{"title":"Stone Temple Pilots - Purple (1994) [24 bit FLAC] vinyl","uid":8165624,"size":912054045,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:70fa9b04f6db99345df9e0a7aa352f866d57b2b8&amp;dn=Stone+Temple+Pilots+-+Purple+%281994%29+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"24.96","files":-1,"time":1361327854,"description":"  Stone Temple Pilots - Purple (1994) [24 bit FLAC] vinyl\n\n  Released: 1994\n  Duration: 47:02\n  Genre: Pop/Rock\n  Style: Alternative, Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 2,600 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  01. Meatplow\n  02. Vasoline\n  03. Lounge Fly\n  04. Interstate Love Song\n  05. Still Remains\n  06. Pretty Penny\n  07. Silvergun Superman\n  08. Big Empty\n  09. 'Unglued'\n  10. Army Ants\n  11. Kitchenware &amp; Candybars\n\n  Stone Temple Pilots had hits with Core, but they got no respect. They suffered a barrage of savage criticism and it must have hurt, since their second effort seems a conscious effort to distinguish themselves as a band not indebted to grunge. That didn't get them anywhere, as they were attacked as viciously as before, but Purple is nevertheless a quantum leap over their debut, showcasing a band hitting its stride. They still aren't much for consistency, and there's more than a fair share of filler over this album's &quot;12 Gracious Melodies.&quot; Still, this filler isn't cut-rate grunge, as it was on the debut; it has its own character, heavily melodic and slightly psychedelic. That's a fair assessment of the hits, as well, but there's a difference there -- namely, expert song and studiocraft. Yes, they were considerably more mainstream than their peers, but time has proven that that's their primary charm, since they were unafraid to temper their grunge with big arena hooks and swirling melodies. It works particularly well on the tight, concise &quot;Vasoline&quot; and the acoustic-based &quot;Pretty Penny,&quot; but it really shines on the record's two masterpieces, &quot;Big Empty&quot; and &quot;Interstate Love Song.&quot; &quot;Big Empty&quot; is ominous and foreboding, yet remains anthemic, a perfect encapsulation of mainstream alienation that is surpassed only by &quot;Interstate Love Song,&quot; a concise epic as alluring as the open highway. These two songs are so good (really, mainstream hard rock didn't get better than these two cuts) that the unevenness of the rest of the record is all the more frustrating, but the filler here is better than before -- and those singles are proof positive that STP was the best straight-ahead rock singles outfit of their time.","torrent":{"xt":"urn:btih:70fa9b04f6db99345df9e0a7aa352f866d57b2b8","amp;dn":"Stone+Temple+Pilots+-+Purple+%281994%29+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70fa9b04f6db99345df9e0a7aa352f866d57b2b8","infoHashBuffer":{"type":"Buffer","data":[112,250,155,4,246,219,153,52,93,249,224,167,170,53,47,134,109,87,178,184]},"announce":[],"urlList":[]}}