{"title":"ACE magazine 01-55 complete OCR'd PDFs *rework*","uid":6922955,"size":5015573810,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:715d8ebcee23591ec1c17550cd20b61ccda9b393&amp;dn=ACE+magazine+01-55+complete+OCR%5C%27d+PDFs+%2Arework%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Ken__D","files":58,"time":1325291270,"description":"ACE (Advanced Computer Entertainment) Magazine \nIssues 01-55 (October 1987 - April 1992)\n\n** This is a rework of a previously-released collection - files are\n** slightly larger but with better image quality\n\nAdvanced Computer Entertainment was a multi-format UK publication,\noriginally one of Future's launch titles before being sold to EMAP. It\ncovered all contemporary machines for the era, with the emphasis on the\nemerging 16-bit computers and consoles; it's often said that ACE was the\nprecursor to Future's EDGE magazine. Regular features included game\nreviews (with an innovative &quot;Predicted Interest Curve&quot;) and industry\nnews and gossip.\n\nThese PDFs are the complied collections of page scans already available.\nThey've been OCR'd to allow text searching and copying - this should\nprove very useful for the retro archivist who'd like to have their own\nlocal searchable archive. They look great on most PDF readers, including\nthe iPad.\n\nThe OCR software has done it's best, but has struggled with some of the\nmore unusual fonts and layouts used. Also, paragraph formatting is a bit\nrandom at best.\n\nThe file size is a bit larger than the combined size of the original JPG\nimages; I've done my best to make the PDF's as compact as possible\nwithout losing image quality. Be grateful for cheap storage :)\n\nMore OCR'd scans will be periodically available - please check\nretropdfswordpresscom for more information.\n\nThanks to Martijn van der Heide for the wonderful World Of Spectrum site\n(wwwworldofspectrumorg), and all the visitors to RetroPDFs\nfor their support.\n\n90's style &quot;greets&quot; to anyone formally or currently involved in the\nAmiga scene, especially Pazza, Mic Flair, Violator, Denzil, Tango, Fat\nWill, mUb and Maximan, and anyone else who read or wrote for LSD\nGrapevine. Nostalgia ain't what it used to be ;)\n\nKen D \nfabwhack [at] gmailcom \nretropdfswordpresscom\n\n\n\n\n","torrent":{"xt":"urn:btih:715d8ebcee23591ec1c17550cd20b61ccda9b393","amp;dn":"ACE+magazine+01-55+complete+OCR%5C%27d+PDFs+%2Arework%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"715d8ebcee23591ec1c17550cd20b61ccda9b393","infoHashBuffer":{"type":"Buffer","data":[113,93,142,188,238,35,89,30,193,193,117,80,205,32,182,28,205,169,179,147]},"announce":[],"urlList":[]}}