{"title":"Volgarr The Viking (Latest Version With 1.2 Patch)","uid":9271234,"size":180421760,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7197ed0fc2e0b62d4cd117eeb8301dc335dd83ad&amp;dn=Volgarr+The+Viking+%28Latest+Version+With+1.2+Patch%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Sarah116","files":4,"time":1385783658,"description":"Hey guys, here the latest version of the gog edition of volgarr the viking. It includes all of the bonus content that comes with the gog version. Game info, change log and bonus content info below. Hope you guys enjoy and please seed.\n\nPatch 1.2 Notes\n\n Completely new graphics engine based on DirectX 9 to resolve \ncompatibility issues with some systems. The original DirectX 7-based \ngraphics engine is also still available just in case anyone has issues \nwith the new one. \n\nGraphics Options menu overhauled and includes more options such as \nselecting graphics engine and manually overriding full-screen resolution. \n\nThe timer for individual World time will no longer start from \npressing the camera zoom-out button at the start of a World. You must \npress a button that affects Volgarr (movement, attack, jump, etc) to \nstart the timer. \n\nFixed a very rare bug that could cause a spear platform to float in \nmid-air (by having it form at the exact moment that the object the spear \nhit is destroyed by other means). \n\nAdded command-line options to force renderer (-dx7, -dx9, -dxlevel \n70, -dxlevel 90). \n\nAdded command-line option to force full-screen mode (-fullscreen). \n\nAdded command-line option to delete all data the game stores \nlocally, which can be useful to reset all settings if the game worked \nthe first time but then has problems later (-reset). This can also be \nused as a way to essentially uninstall the game completely (run it once \nwith the -reset option before deleting the .exe). \n\n &lt;a href=&quot;\nhttp://www.gog.com/game/volgarr_the_viking&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/game/volgarr_the_viking&lt;/a&gt;\n\nClassic hardcore arcade action with support for Dinput and Xinput controllers!\nSeven worlds to explore across 30 maps, all bristling with high quality handcrafted pixel animation.\nOver 30 unique traps and enemies, including huge bosses that take up the entire screen!\n\nRemember when games were tough? Return to the Golden Age of arcades with an all-NEW hardcore action experience that pulls no punches. Volgarr the Viking possesses all the hallmarks of the true classics - simple controls, high challenge, and meticulous design - combined with hand-made pixel animation, an epic soundtrack, and buckets of blood. Flex your gaming muscles and step into the arena with Volgarr the Viking. We dare you.\n","torrent":{"xt":"urn:btih:7197ed0fc2e0b62d4cd117eeb8301dc335dd83ad","amp;dn":"Volgarr+The+Viking+%28Latest+Version+With+1.2+Patch%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7197ed0fc2e0b62d4cd117eeb8301dc335dd83ad","infoHashBuffer":{"type":"Buffer","data":[113,151,237,15,194,224,182,45,76,209,23,238,184,48,29,195,53,221,131,173]},"announce":[],"urlList":[]}}