{"title":"88 Natural Remedies: Ancient Healing Traditions for Modern Times","uid":9412049,"size":3164758,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:725316aef04083b242e05fcaa2a18991dbd9bc80&amp;dn=88+Natural+Remedies%3A+Ancient+Healing+Traditions+for+Modern+Times&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MucGar","files":-1,"time":1388327509,"description":"88 Natural Remedies: Ancient Healing Traditions for Modern Times\n\n\n\n\neISBN: 1426210477, ASIN: B008EDNOWG | 2013 | EPUB | 41 pages | 3 MB\n\n\n\n\n\nThis National Geographic health book provides portable answers to treating common ailments using proven natural therapies.\n\nRunny nose, watery eyes, sinus headache? Don't reach for the Claritin. Instead, learn how to treat seasonal allergies with nasal lavage, a time-honored practice. Upset stomach? Forget chalky antacids; instead wear an acupressure wrist band or chew on a teaspoon of fennel, favored by Indians for combating the effects of spicy food. Fight insomnia with valerian root, the leading natural herb to promote quality sleep with no side effects.\n\nSections include:\n\nÂ· Acupressure (use a wrist band to relieve motion sickness, soothe sore feet, treat constipation, relieve wrist tension, alleviate headaches and neck tension, and more)\nÂ· Aromatherapy (De-stress in the tub, relieve a headache, scent a room to create a mood, mix a body oil, make a compress, and more)\nÂ· Ayurvedic Medicine (learn the Sanskrit history of &quot;the science of life and longevity,&quot; how to evaluate practitioners, about ayurvedic &quot;energy prints,&quot; and more)\nÂ· Breath Therapy (Relax with Wu, Do the 4-7-8 relaxation breath, strengthen diaphragm muscles, use the 20-Cycle Breath to improve concentration, and more)\nÂ· Herbs (Fennel, Peppermint, Valerian Root, Chamomile)\nÂ· Hydrotherapy (drink the correct amount of water for your body, fight a cold, treat a bruise, rub away fatigue, soothe a sunburn, and more)\nÂ· Massage Therapy (learn quickie massages to do on yourself to: release facial tension, relax your shoulders, help your hands, and release your lower back)\nÂ· Meditation (specific exercises designed to focus on your breath, chant, focus on touch, be mindful)\nÂ· Nasal Lavage and Steam Therapy (clears sinuses, relieves congestion)\nÂ· Qigong (a five-minute meditation to focus your qi energy, learn and practice the simple eight postures of qigong)\nÂ· Reflexology (follow instructions to perform a simple reflexology treatment that can be done anywhere to relax and invigorate your hands)\nÂ· Shiatsu (learn how to choose a good shiatsu practitioner, follow instructions to perform a full body shiatsu routine on yourself)\nÂ· Traditional Chinese Medicine (learn about herbs, heat, and cupping)\nÂ· Yoga (learn or perfect your chair pose, tree pose, and cobra)\n","torrent":{"xt":"urn:btih:725316aef04083b242e05fcaa2a18991dbd9bc80","amp;dn":"88+Natural+Remedies%3A+Ancient+Healing+Traditions+for+Modern+Times","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"725316aef04083b242e05fcaa2a18991dbd9bc80","infoHashBuffer":{"type":"Buffer","data":[114,83,22,174,240,64,131,178,66,224,95,202,162,161,137,145,219,217,188,128]},"announce":[],"urlList":[]}}