{"title":"Space Engine - Space Simulator","uid":7183303,"size":420537558,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:728001ceeaab17bc5c92aa6b42d67ca4705fc25f&amp;dn=Space+Engine+-+Space+Simulator&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"FelixLynx","files":-1,"time":1334343287,"description":"Space Engine - Space Simulator\n\nIncluded files.:\n\n- SpaceEngine 0.95.rar\n- 6_SE-patch-0951.zip\n\nProjects website.: &lt;a href=&quot;\nhttp://en.spaceengine.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.spaceengine.org/&lt;/a&gt;\n\nSpaceEngine - is a free space simulation software that lets you explore the universe in three dimensions, starting from planet Earth to the most distant galaxies. Areas of the known universe are represented using actual astronomical data, while regions uncharted by human astronomy are generated procedurally. Millions of galaxies, trillions of stars, countless planets!\n\nCapabilities\n\nAll types of celestial objects are represented:\nplanets, moons, asteroids, stars, star clusters, nebulae and galaxies.\nThe observer is free to move around the universe.\nTransition between any celestial body and any scale occurs continuously.\nThe observer can move around in space using the WASD keys,\nlike in First Person Shooters.\nMovement with inertia is made possible in Spacecraft mode or Aircraft mode.\n&quot;Select and fly&quot; autopilot: just click on any object with the mouse,\nand hit the 'G' key to automatically go directly to the object.\nSearch for celestial objects by name.\nView planetary system maps. Save locations and an autopilot's journal.\nThe orbital motion of planets and stars is calculated in real time,\nwith the ability to accelerate, decelerate, or reverse the flow of time.\nThe orbital paths of celestial objects can be shown, along with their labels and grids.\nAutomatic binding of the observer to the moving object,\nand automatic selection of optimum flight speed.\nKnown celestial objects are represented using data from the catalogs:\ngalaxies (NGC/IC), stars (HIPPARCOS), star clusters, nebulae, planets\n(our Solar system data and known extrasolar planets).\nUncharted regions of space feature procedurally generated objects:\nstars, star clusters, nebulae and planetary systems.\n3D landscapes of planets and stars:\nfor many solar system bodies actual data from space probes is used.\nFor uncharted exo-planets the surface is generated procedurally.\nVolumetric 3D sprite models of galaxies and nebulae,\nincluding light-absorbing dust clouds, optimized render to a skybox and impostors.\nLighting effects: lens flares, solar eclipses, shadows of planetary rings.\nCelestial objects cast light and shadow on to each other.\nThe exact model of the Earth's atmosphere (code by Eric Bruneton),\nadapted for the other planets.\nAbility to import users addons: models, catalogs, and textures.\n\n\nSystem minimum requirements\n\nCPU\t2 GHz\nRAM\t2 Gb\nVideo\t512 Mb\nOpenGL\t3.0\nOS\tWindows XP\n\nLook out for more addons I will be posting for this program:\n\nEarth-bump (Highres heightmap for Earth)\nEarth-surface (Highres texturemap for Earth)\nEarth-clouds (Highres clouds for Earth)\nJupiter-moons (Highres texturemaps for Jupiters moons)\nMars-bump (Highres heightmap for Mars)\nMars-surface (Highres texturemap for Mars)\nMars-surface-nonshaded (Highres texturemap for mars unshaded)\nMoon-bump (Highres heightmap for Earths moon)\n\nAddons are also possible to download from the projects home page.","torrent":{"xt":"urn:btih:728001ceeaab17bc5c92aa6b42d67ca4705fc25f","amp;dn":"Space+Engine+-+Space+Simulator","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"728001ceeaab17bc5c92aa6b42d67ca4705fc25f","infoHashBuffer":{"type":"Buffer","data":[114,128,1,206,234,171,23,188,92,146,170,107,66,214,124,164,112,95,194,95]},"announce":[],"urlList":[]}}