{"title":"The Taming of The Queen - Philippa Gregory","uid":13024532,"size":777299,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7295031c671f95adc8cddd8e6cb909bb404e8e28&amp;dn=The+Taming+of+The+Queen+-+Philippa+Gregory&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1450388879,"description":"The Taming of The Queen - Philippa Gregory\r\n\r\nBy the #1 New York Times bestselling author behind the Starz original series The White Queen, a riveting new Tudor tale featuring King Henry VIII’s sixth wife Kateryn Parr, the first English queen to publish under her own name.\r\n\r\nWhy would a woman marry a serial killer?\r\n\r\nBecause she cannot refuse…\r\n\r\nKateryn Parr, a thirty-year-old widow in a secret affair with a new lover, has no choice when a man old enough to be her father who has buried four wives—King Henry VIII—commands her to marry him.\r\n\r\nKateryn has no doubt about the danger she faces: the previous queen lasted sixteen months, the one before barely half a year. But Henry adores his new bride and Kateryn’s trust in him grows as she unites the royal family, creates a radical study circle at the heart of the court, and rules the kingdom as Regent.\r\n\r\nBut is this enough to keep her safe? A leader of religious reform and the first woman to publish in English, Kateryn stands out as an independent woman with a mind of her own. But she cannot save the Protestants, under threat for their faith, and Henry’s dangerous gaze turns on her. The traditional churchmen and rivals for power accuse her of heresy—the punishment is death by fire and the king’s name is on the warrant…\r\n\r\nFrom an author who has described all of Henry’s queens comes a deeply intimate portrayal of the last: a woman who longed for passion, power, and education at the court of a medieval killer.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:7295031c671f95adc8cddd8e6cb909bb404e8e28","amp;dn":"The+Taming+of+The+Queen+-+Philippa+Gregory","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7295031c671f95adc8cddd8e6cb909bb404e8e28","infoHashBuffer":{"type":"Buffer","data":[114,149,3,28,103,31,149,173,200,205,221,142,108,185,9,187,64,78,142,40]},"announce":[],"urlList":[]}}