{"title":"Max Hastings - The Korean War.epub","uid":9104911,"size":3237657,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72ba4871e95d80ad176a98815a4b8aeecfe5e28b&amp;dn=Max+Hastings+-+The+Korean+War.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"dickspic","files":1,"time":1382841864,"description":"'A brilliant and compelling book which must rank, even by the standards Max Hastings has set, as a masterpiece' - Professor Michael Howard, London Review of Books. On 25 June 1950, the invasion of South Korea by the Communist North launched one of the bloodiest and most devastating conflicts of our battle-scarred century. The seemingly limitless power of the Chinese-backed North was thrown against the ferocious firepower of the UN-backed South in a war that can be seen today as the stark prelude to Vietnam. Max Hastings, the acclaimed author of &quot;Overlord and Bomber Command&quot;, has drawn on first-hand accounts of those who fought on both sides to produce this vivid and incisive reassessment of the Korean War, bringing the military and human dimensions of the conflict into sharp focus. 'Excellent, readable history by a master of the genre' - &quot;Daily Mail.&quot; 'The description of the stand of the Gloucesters on the Imjin is exemplary. Hastings has spared no pains to dig deep in search of the real truth, and to seek out and interview those who took part in the events he chronicles with such finely balanced judgement' - Field Marshall Lord Carver, &quot;Times Literary Supplement.&quot;","torrent":{"xt":"urn:btih:72ba4871e95d80ad176a98815a4b8aeecfe5e28b","amp;dn":"Max+Hastings+-+The+Korean+War.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72ba4871e95d80ad176a98815a4b8aeecfe5e28b","infoHashBuffer":{"type":"Buffer","data":[114,186,72,113,233,93,128,173,23,106,152,129,90,75,138,238,207,229,226,139]},"announce":[],"urlList":[]}}