{"title":"'Honour' Killing and Violence - Aisha K. Gill, Carolyn Strange, ","uid":10721024,"size":475063,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72dd82826804ff26f86cc02183c3dff6f14bd529&amp;dn=%27Honour%27+Killing+and+Violence+-+Aisha+K.+Gill%2C+Carolyn+Strange%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1407482528,"description":"This interdisciplinary collection provides a compelling analysis of the practices and beliefs that lead to violence against women, men and children in the name of 'honour', with a range of international insights from criminology, psychology, law and history.\n\nThe volume advances legal and theoretical debates through the analysis of established research and presents new evidence and insights, addressing key questions such as: What psychological processes are relevant in the motivation of honour violence? Under what historical circumstances, and through what strategies, have honourable masculinity and violence been dissociated? Can honour be reconceptualised in ways that challenge violent practices justified in its name?\n\nBy locating 'honour' killing and 'honour' based violence within and beyond debates on violence against women and girls, this collection offers recommendations to inform both theory and practice, making this an essential resource for teachers and students, health professionals, police officers, lawyers, social workers, policy-makers, and activists working against gendered forms of violence.","torrent":{"xt":"urn:btih:72dd82826804ff26f86cc02183c3dff6f14bd529","amp;dn":"%27Honour%27+Killing+and+Violence+-+Aisha+K.+Gill%2C+Carolyn+Strange%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72dd82826804ff26f86cc02183c3dff6f14bd529","infoHashBuffer":{"type":"Buffer","data":[114,221,130,130,104,4,255,38,248,108,192,33,131,195,223,246,241,75,213,41]},"announce":[],"urlList":[]}}