{"title":"Lawrence M. Krauss - Fear of Physics","uid":9028030,"size":727372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:72edbd044a6518a7ae95e0c3e412ede78beeed94&amp;dn=Lawrence+M.+Krauss+-+Fear+of+Physics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"epub_888","files":-1,"time":1381403183,"description":"Fear of Physics - A Guide for the Perplexed\n\nFear of Physics is a lively, irreverent, and informative look at everything from the physics of boiling water to cutting-edge research at the observable limits of the universe. Rich with anecdotes and accessible examples, it nimbly ranges over the tools and thought behind the world of modern physics, taking the mystery out of what is essentially a very human intellectual endeavor.\n\nFrom Publishers Weekly\n\nKrauss ( Cosmic Strings ), who teaches physics at Yale University, delivers a three-part lecture for lay readers on today's dominant research questions in theoretical physics. In six broad-ranging chapters with such titles as &quot;The Art of Numbers&quot; and &quot;The Search for Symmetry,&quot; he examines and explains &quot;the tools that guide physicists in their work.&quot; The accomplishments and views of such giants of modern physics as Einstein, Feynman and Heisenberg are used to illustrate the inventiveness required of those in the field. While Krauss acknowledges that this is a limited selection of ideas--the &quot;hidden realities&quot; of physics, not its stuff--he nonetheless serves quantum mechanics well. Also well-served are the interests of the general reader as Krauss, persistently hewing to the basics, never falls into patronization or catchy metaphor. Supplemented by Larry Gonick and Art Huffman's The Cartoon Guide to Physics , this is a primer on the wonders of physics. Library of Science selection. \nCopyright 1993 Reed Business Information, Inc.\n\nFrom Library Journal\n\nIn describing &quot;the flavor of physics&quot; and how physicists &quot;do&quot; and have &quot;done&quot; physics, this short, charming, quick-paced book conveys the joy of &quot;making new connections&quot; in the physical world. Aiming his book at the nonscientist, the author hopes to give readers their own insight into the wonder associated with the art of physics and the symmetry and hidden realities of the world. Krauss, a professor of theoretical physics at Yale University who teaches a course called Physics for Poets, insistently reminds readers that physics is a part of &quot;our cultural experience,&quot; a part of who we are and even that we are. Highly recommended.\n- Diane M. Fortner, Univ. of California Lib., Berkeley","torrent":{"xt":"urn:btih:72edbd044a6518a7ae95e0c3e412ede78beeed94","amp;dn":"Lawrence+M.+Krauss+-+Fear+of+Physics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72edbd044a6518a7ae95e0c3e412ede78beeed94","infoHashBuffer":{"type":"Buffer","data":[114,237,189,4,74,101,24,167,174,149,224,195,228,18,237,231,139,238,237,148]},"announce":[],"urlList":[]}}