{"title":"Tom.Clancy's.Splinter.Cell.Blacklist.Deluxe.Edition.Repack.R.G.M","uid":8848381,"size":12666169959,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:73159c7a98ef23e372627e27d85482fe60500589&amp;dn=Tom.Clancy%27s.Splinter.Cell.Blacklist.Deluxe.Edition.Repack.R.G.M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":5,"uploader":"Taker009","files":23,"time":1377458825,"description":"Tom.Clancy's.Splinter.Cell.Blacklist.Deluxe.Edition.Repack.R.G.Mechanics\n\n\nYear: 2013\nPublication Type: RePack \nCrack: enclosing | RELOADED\nVersion: 1.01\nLanguage: RUS, ENG\nSound language: RUS, ENG\n\nDescription:\n\nEvents Splinter Cell: Blacklist will start six months after the end of Splinter Cell: Conviction. One day, a few militant nations put an ultimatum to the United States of America - the birthplace of democracy or withdraw its military forces from their territory, or reaping the benefits of the terrible consequences that follow disobedience. These same effects are directly related to the title of &quot;black listsÂ» (Blacklist) - a string of successive terrorist attacks on the United States objects of high importance. Who will help the country get out of this situation? Name savior everyone knows - Sam Fisher (Sam Fisher). Early in the game, Sam becomes a part of the &quot;Fourth EchelonÂ» (Fourth Echelon), whose mobile headquarters is a strategic reconnaissance aircraft, gains access to the so-called &quot;Interface Strategic Planning MissionÂ» (Strategic Mission Interface) - the operating system, which allows the fly to analyze all of the available information and choose the best of all possible options for action - and sent to punish enemies of the U.S..\n\n&quot;The infinite war on terror. To perform the job Sam got the latest weapons and equipment, as well as the complete freedom of action. No matter where the events unfold, whether it be the largest U.S. metropolitan areas or remote places of the world, Sam will stop at nothing to find the terrorists before they leave the country allotted time.\n&quot;Your own style of play. Splinter Cell Blacklist does not depart from the spirit of the series and at the same time is not afraid to explore new ways to present the gameplay. Players can define the style of the game and will be rewarded for their choices.\n&quot;Phantom - for those who want to stay in the shadows, who analyzes the situation and planning a safe way without leaving any traces. This is the ideal style for spies.\n&quot;Stormtrooper - for those who rely on the reaction and frontal attacks. Style for those who immediately opened fire.\n&quot;Panther - for those who are looking for the most efficient way, making a professional killing. Style surgically precise operations.\n&quot;Perfect tool. Destroy&quot; engineer &quot;with the help of new gadgets, such as an improved camera and a flexible three-rotor drone. Among the guns Sam fans will also find their favorite shocker and a curved, terrifying sword for close combat. Fans will be able to use stealth operations Sam opportunities in neutralizing opponents, while &quot;Murder on the move&quot; will allow players to destroy a group of enemies in one motion with surgical precision.\nÂ»Create a new echelon. Given the task of the President, Sam started to create a new group - the team that is ready to play by his rules. Anna Grimsdottir - operational leader, a CIA agent Isaac Briggs is responsible for fire support, completes the list of hacker Charlie Cole. With its limitless resources and the latest technologies, including its own refitted aircraft invisible &quot;Paladin&quot; detachment &quot;fourth tier&quot; is ready to do the job of any complexity.\n&quot;Rate the high technology. Interface Strategic Operations on board the &quot;Paladin&quot; monitors events occurring around the world, in real time, so that Sam and his team will be able to learn about the events immediately after they occurred. This will allow access to the details of the operation for another approach to the goal. &quot;Paladin&quot; is also a center for access to all game content, including cooperative and competitive modes. With ISO players can use the global economy game that allows you to fully modify and improve Sam, his suit, goggles, weapon, &quot;Paladin&quot; and much more.\n\nSystem requirements:\n\n&quot;Operating system: Windows XP (SP3), Windows Vista (SP2), Windows 7 (SP1), Windows 8 \n&quot;Processor: Intel Core 2 &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;7430011b34465a40&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; GHz or AMD Athlon II X2 2.8 GHz \n&quot;Memory: 2 GB / 4 GB \n&quot;Video card: compatible with DirectX 10, which has 512 MB of video memory \n&quot;Sound Card: DirectX compatible \n&quot;Free space on hard drive: 18 GB\nRunning: Before installing disable antivirus, and add to the game folder to the exceptions!\n\nRepack Features\n\n&quot;Do not cut / recoded \n&quot;Game Version - 1.01 \n&quot;The ability to select a combination of text and voice \n&quot;Release from RG Mechanics","torrent":{"xt":"urn:btih:73159c7a98ef23e372627e27d85482fe60500589","amp;dn":"Tom.Clancy%27s.Splinter.Cell.Blacklist.Deluxe.Edition.Repack.R.G.M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73159c7a98ef23e372627e27d85482fe60500589","infoHashBuffer":{"type":"Buffer","data":[115,21,156,122,152,239,35,227,114,98,126,39,216,84,130,254,96,80,5,137]},"announce":[],"urlList":[]}}