{"title":"Glenn Harrold's Ultimate Guide to Overcoming Stress","uid":4812509,"size":44141358,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:736654679f095e0b2af68cebfcecd1e71aacb545&amp;dn=Glenn+Harrold%5C%27s+Ultimate+Guide+to+Overcoming+Stress&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"prince213","files":4,"time":1238430076,"description":"Product Details\n\n    * Language: English\n    * Type: Audio Book\n    * Format: MP3 @ 128 Kbps\n    * Publisher: BBC Audiobooks Ltd (3 Jan 2005)\n\nProduct Description\n\nThis book talks about mind and body relaxation using skilled hypnotherapy techniques and innovative sound production. This high quality recording, by the UK's best selling hypnotherapist Glenn Harrold, combines the very latest clinical hypnotherapy techniques with state-of-the-art digital sound. On both tracks you will hear a pleasant voice, and absorbing 60 bpm sound effects guiding you into a deeply relaxed state of mental and physical relaxation. In this very receptive relaxed state you will be given a number of post hypnotic suggestions and carefully layered affirmations to help you achieve your goals. The background echoed affirmations pan from left to right in your headphones, and this deeply relaxing method of delivering multiple suggestions simultaneously to the unconscious mind can facilitate positive changes. At the end of each track you will be gently brought back to full waking consciousness with a combination of suggestion and music. There are also a number of positive subliminal suggestions (listed inside), which are embedded in the fade out music and facilitate the overall effect. This powerful CD is a completely safe and effective way of helping you to feel more relaxed and composed in your everyday life.\n\n\nVisit http://prince213.blogspot.com/ for more...","torrent":{"xt":"urn:btih:736654679f095e0b2af68cebfcecd1e71aacb545","amp;dn":"Glenn+Harrold%5C%27s+Ultimate+Guide+to+Overcoming+Stress","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"736654679f095e0b2af68cebfcecd1e71aacb545","infoHashBuffer":{"type":"Buffer","data":[115,102,84,103,159,9,94,11,42,246,140,235,252,236,209,231,26,172,181,69]},"announce":[],"urlList":[]}}