{"title":"Star Wars vs Star Trek - The Rivalry Continues","uid":6390016,"size":712037838,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:740d4c8bb1261871a7a6e7bca950e8428c5967d4&amp;dn=Star+Wars+vs+Star+Trek+-+The+Rivalry+Continues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"catflap","files":9,"time":1305326678,"description":"Star Wars vs Star Trek - The Rivalry Continues\nxvid mp3 dvd rip\n\nPlay duration: 00:49:58\nResolution: 448 x 336\naspect ratio: 4:3\n\n\nFor years, STAR WARS fans have squared off against STAR TREK fans over which space fantasy is the better choice. As a result, both franchises have been embroiled in a continuing battle for merchandise sales, publicity, and box-office receipts. The science-fiction genre has never seen anything like it and, as these fictional universes continue to expand, the competition seems to be never ending.\n\nStar Wars vs. Star Trek: The Rivalry Continues compares the space opera worlds of George Lucas and Gene Roddenberry for a one-of-a-kind intergalactic documentary. It traces the origin and development of STAR TREK from conception to the spin-offs and film series. It also takes an in-depth look at STAR WARS from its sci-fi influences in the past to its continuing box-office clout.\n\nInterviews with such stars as William Shatner, George Lucas, Leonard Nimoy, Anthony Daniels, Bill Dee Williams, Carrie Fisher, James Doohan and many more help to explain the amazing phenomenon. Whether you're a Trekkie or a Jedi Knight, this is one show you won't want to miss!\n\nCollectors' bonus! Enjoy the comprehensive coverage of the 1997 re-release of STAR WARS and the opening of the Las Vegas attraction THE STAR TREK EXPERIENCE. Also included are the complete interviews with Carrie Fisher, Harrison Ford, Liam Neeson, Leonard Nimoy and William Shatner.\n\nthis is my own dvd rip and encode.","torrent":{"xt":"urn:btih:740d4c8bb1261871a7a6e7bca950e8428c5967d4","amp;dn":"Star+Wars+vs+Star+Trek+-+The+Rivalry+Continues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"740d4c8bb1261871a7a6e7bca950e8428c5967d4","infoHashBuffer":{"type":"Buffer","data":[116,13,76,139,177,38,24,113,167,166,231,188,169,80,232,66,140,89,103,212]},"announce":[],"urlList":[]}}