{"title":"Nurses (Digital Playground) [DVDRip]","uid":7054607,"size":1472002048,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:744d31d85edd2f25d45db031167d81cc4620d789&amp;dn=Nurses+%28Digital+Playground%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"chkm8te","files":2,"time":1330071038,"description":"Screens: &lt;a href=&quot;\nhttp://4ufrom.me/viewer.php?file=v9uzncd5s0ulc1k5z6iy.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://4ufrom.me/viewer.php?file=v9uzncd5s0ulc1k5z6iy.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://4ufrom.me/viewer.php?file=fuzdb5fx3ov52nmoahzw.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://4ufrom.me/viewer.php?file=fuzdb5fx3ov52nmoahzw.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://4ufrom.me/viewer.php?file=woh5pf33xuz9uq0yi6ud.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://4ufrom.me/viewer.php?file=woh5pf33xuz9uq0yi6ud.jpg&lt;/a&gt;\n\n\nDescription:\nThe sexy nurses of Coos County General Hospital are patient care experts of the most FEVERISH kind. With these hot nurses bathing, pampering, and tending to your every need, it's easy to see why no one wants to check out!\nKatsuni plays the dictatorial head nurse at her hospital and oversees the work of several nurses and candy stripers. Known by her charges as the &quot;nurse from hell&quot;, Katsuni demands perfection from people who are all-too-human. She's also a massive pain in the ass to the patients. Believe me when I say that nobody could play the part of a bitchy and tyrannical nurse better than French-accented Asian siren Katsuni. She really shines both in her acting and sexual performances.\nOne of the best things about Nurses is that it features Digital Playground's entire stable of contract girls (as of the time the movie was shot). Each girl has a unique and effective role to play. For example, cutie Riley Steele plays a bumbling candy striper who, besides being the consummate klutz, can't seem to stop making mistakes. Jesse Jane plays a role that I can best describe as &quot;Jesse Jane the supermodel pretending she's a nurse&quot;. Jesse, clad in a cleavage-enhancing bra with her blouse buttons opened nearly to her navel, prances around the hospital flirting blatantly and posing for photos with everybody she meets. It's hilarious and extremely sexy! Stoya plays a kinky nurse who thinks nothing of introducing a little anal sex into a patient's sponge bath. Gabriella Fox, who just might be the prettiest girl on the planet, portrays a visitor who, along with her girl-pal Shawna, comes to the hospital to cheer up Shawna Lenee's boyfriend Scott Nails. Finally, Shay Jordan plays a nurse who's so fucking horny that her pussy literally creams continuously while she gives some of the best fucking performances of her career.\nIn addition to the Digital Playground contract girls, Nurses also boasts some of the best non-contract performers in the business, including oh-so-classy Shyla Stylez, highly-acclaimed Jenna Haze, and darling blond Shawna Lenee (all these non-contract are among my Dr. Jay's Must-See Girls!).\nNurses features eight sex scenes and all but one are absolutely superb and earn &quot;A+&quot; grades. The eighth scene, an incendiary reverse gangbang, pits five Digital Playground contract girls against superstud Erik Everhard in one of the very best group scenes ever captured.\n\nScene Breakdowns:\nScene 1. Jenna Haze, Evan Stone\nScene 2. Stoya, James Deen\nScene 3. Gabriella Fox, Shawna Lenee, Scott Nails\nScene 4. Katsuni, Shay Jordan, Tommy Gunn\nScene 5. Shyla Stylez, Danny Mountain\nScene 6. Sasha Grey, Mr. Pete, Tony T.\nScene 7. Jesse Jane, Riley Steele, Manuel Ferrara\nScene 8. Jesse Jane, Katsuni, Riley Steele, Shay Jordan, Stoya, Erik Everhard","torrent":{"xt":"urn:btih:744d31d85edd2f25d45db031167d81cc4620d789","amp;dn":"Nurses+%28Digital+Playground%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"744d31d85edd2f25d45db031167d81cc4620d789","infoHashBuffer":{"type":"Buffer","data":[116,77,49,216,94,221,47,37,212,93,176,49,22,125,129,204,70,32,215,137]},"announce":[],"urlList":[]}}