{"title":"Edgar Rice Burroughs - The War Chief &amp; Apache Devil (Duology","uid":10440687,"size":5983290,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7452ff9ff2ea06e8fd643fb5d2671c4b25baba72&amp;dn=Edgar+Rice+Burroughs+-+The+War+Chief+%26amp%3B+Apache+Devil+%28Duology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Iznogoud9","files":-1,"time":1403885635,"description":"EDGAR RICE BURROUGHS - THE WAR CHIEF (1927) &amp; APACHE DEVIL (1933)\n\nThis torrent contains 4 formats: EPUB, MOBI, PDF and TXT (included, because .txt is the only text file format my MP4 player supports, so I'd have converted them anyway.) \n\nThis duology by Edgar Rice Burroughs is among the best work he ever did IMO. It tells the story of a white boy raised as an Apache. These books are actually in the public domain, at least in some parts of the world, and can be downloaded on the net legally or &quot;legally.&quot;\n\nPosted here to raise awareness that they are available.\n\n*****\n\nBurroughs enlisted in the 7th Cavalry and saw active service in the Apache country of Southern Arizona. Knowing the country and its people, and endowed with a fertile imagination, Burroughs was able to see the great Indian wars from the Indian point-of-view.\n\nHe wrote two books on the subject--THE WAR CHIEF (1927), and APACHE DEVIL (magazine 1928; book 1933.) The first of these tells of the bitterly harsh rearing of a boy in the Apache tradition, a white boy who became known as Shoz-Dijiji, the Black Bear, adopted son of Geronimo, with a venomous hatred for all whites: Shoz-Dijiji who, in time, becomes a great war chief--like his dreaded stepfather.\n\nThe second book, APACHE DEVIL, takes the story of Shoz-Dijiji further, telling of his lifelong battle with the Pony Soldiers as he and Geronimo fight desperately to maintain life and dignity for their people; it tells also of the Black Bear's love for a white woman.","torrent":{"xt":"urn:btih:7452ff9ff2ea06e8fd643fb5d2671c4b25baba72","amp;dn":"Edgar+Rice+Burroughs+-+The+War+Chief+%26amp%3B+Apache+Devil+%28Duology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7452ff9ff2ea06e8fd643fb5d2671c4b25baba72","infoHashBuffer":{"type":"Buffer","data":[116,82,255,159,242,234,6,232,253,100,63,181,210,103,28,75,37,186,186,114]},"announce":[],"urlList":[]}}