{"title":"[Giuseppe Grosso , Giuseppe Pastori Parravicini]Solid State Phys","uid":11228094,"size":11195770,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:753d0c41d71a41958ae72ede2ea3909146403f70&amp;dn=%5BGiuseppe+Grosso+%2C+Giuseppe+Pastori+Parravicini%5DSolid+State+Phys&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"zombie_rox","files":1,"time":1413479891,"description":"Product Description\nReview\n.&quot;.. A very nice book ... I would personally buy it&quot;- Professor Henry Ehrenreich, Harvard University\nProduct Description\n\nSolid State Physics is a textbook for students of physics, material science, chemistry, and engineering. It is the state-of-the-art presentation of the theoretical foundations and application of the quantum structure of matter and materials.\n\nThis second edition provides timely coverage of the most important scientific breakthroughs of the last decade (especially in low-dimensional systems and quantum transport). It helps build readers' understanding of the newest advances in condensed matter physics with rigorous yet clear mathematics. Examples are an integral part of the text, carefully designed to apply the fundamental principles illustrated in the text to currently active topics of research.\n\nBasic concepts and recent advances in the field are explained in tutorial style and organized in an intuitive manner. The book is a basic reference work for students, researchers, and lecturers in any area of solid-state physics.\n\n\n    Features additional material on nanostructures, giving students and lecturers the most significant features of low-dimensional systems, with focus on carbon allotropes\n    Offers detailed explanation of dissipative and nondissipative transport, and explains the essential aspects in a field, which is commonly overlooked in textbooks\n    Additional material in the classical and quantum Hall effect offers further aspects on magnetotransport, with particular emphasis on the current profiles\n    Gives a broad overview of the band structure of solids, as well as presenting the foundations of the electronic band structure. Also features reported with new and revised material, which leads to the latest research\n\nPage Numbers Source ISBN: 0123850304\nPublisher: Academic Press; 2 edition (17 October 2013)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B00G9855IO","torrent":{"xt":"urn:btih:753d0c41d71a41958ae72ede2ea3909146403f70","amp;dn":"%5BGiuseppe+Grosso+%2C+Giuseppe+Pastori+Parravicini%5DSolid+State+Phys","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"753d0c41d71a41958ae72ede2ea3909146403f70","infoHashBuffer":{"type":"Buffer","data":[117,61,12,65,215,26,65,149,138,231,46,222,46,163,144,145,70,64,63,112]},"announce":[],"urlList":[]}}