{"title":"Assembly programming book collection","uid":9621441,"size":534865450,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7558b18aa579baf0f0b81de2c45735389e95fe34&amp;dn=Assembly+programming+book+collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"281094v","files":61,"time":1392504444,"description":"AMD's Athlon Assembler Optimization Guide (PDF)\nArt Of Assembly Language Programming In Linux x86.zip\nArt of Assembly Language Programming (PDF)\nAssembler Intel Code Table (PDF)\nAssembly Language for Intel-Based Computers, Fourth Edition.iso\nBarry B. Brey, The Intel Microprocessors. 8th 0135026458 (PDF)\nBarry Kauler, Winsows Assembly Language and System Programming 1997 (PDF)\nBob Neveln, Linux Assembly Language Programming 2000 (PDF)\nBryant, O'Hallaron, Computer Systems. A Programmer's Perspective (PDF)\nChris Eagle, The IDA Pro Book 2nd Edition (EPUB)\nChris Eagle, The IDA Pro Book 2nd Edition (PDF)\nComprehensive PMode Tutorials with C &amp; ASM.zip\nDaniel W. Lewis, Fundamental of embedded software. Where C and assembly meets (DJVU)\nDan Kaminsky, Reverse Engineering With IDA Pro (PDF)\nDean Elsner, Jay Fenlanson, Using as 2.19 (PDF)\nDeveloping Utilities in Assembly Language.zip\nHarlan Carvey, Reverse Engineering Code with IDA Pro (PDF)\nIntel, Assembler - Englisch - x86 Assembly Instruction Set Reference (PDF)\nJames Leterman, 32-64-BIT 80 x 86 Assembly Language Architecture (CHM)\nJames T. Streib, Guide to Assembly Language (PDF)\nJeff Duntemann, Assembly Language Step-by-Step Programming with DOS and Linux 2nd ed 2000 (CHM)\nJeff Duntemann, Assembly Language Step by Step [Wiley] (PDF)\nJeff Dunteman, Wiley Assembly Language Step by Step Programming with Linux 3rd 2009 (PDF)\nJohn R. Levine, Linkers and Loaders (PDF)\nJonathan Bartlett, Programming from the Ground Up (PDF)\nKip R. Irvine, Assembly Language for Intel-Based Computers. 4th (PDF)\nKip R. Irvine, Assembly Language for X86 processors-15 BIOS Level Programming (PDF)\nKip R. Irvine, Assembly Language for X86 processors (PDF)\nKnaggs, Welsh, ARM: Assembly Language Programming 2004 (PDF)\nKris Kaspersky, Hacker Disassembling Uncovered (2003) (CHM)\nMichael Abrash, The zen of assembly language (PDF)\nM. Rafiquazzaman, Microprocessor Theory and applications with 68000, 68020 and Pentium (PDF)\nPatrick Juola, Principles of Computer Organization and Assembly Language. Using the Java Virtual Machine (PDF)\nPaul Carter, PC Assembly language 2006 (PDF)\nPavol Cerven, Crackproof Your Software (PDF)\nPC Intern, The Encyclopedia of System Programming.rar\nPC Underground, Assembly Language; The True Language of Programmers (PDF)\nPete Cockerell, ARM Assembly Language Programming (PDF)\nPeter Calingaert, Assemblers, Compilers, and Program Translation (DJVU)\nRandal Hyde, The Art Of Assembly Language 2003 (CHM)\nRandal Hyde, Write Great Code Understanding the Machine Volume I (CHM)\nRandal Hyde, Write Greate Code Vol: 2. Thinking Low-Level, Writing High-Level. 2006 (PDF)\nRandall Hyde, The Art of Assembly Language 2nd (EPUB)\nRandall Hyde, The Art of Assembly Language 2nd (PDF)\nRay Seyfarth, Introduction to 64 Bit Intel Assembly Language Programming for Linux-EXTRA.zip\nRay Seyfarth, Introduction to 64 Bit Intel Assembly Language Programming for Linux (PDF)\nRichard Blum, Professional Assembly Language. Wrox 2005 (PDF)\nRichard C. Detmer, 80x86 Assembly Language and Computer Architecture (PDF)\nRichard C. Detmer, Introduction to 80X86 Assembly Language and Computer Architecture 2001 (CHM)\nRichard P. Paul, Sparc Architecture, Assembly Lan (PDF)\nRobert Britton, Mips Assembly Language Programming 2003 Prentice-Hall (PDF)\nSivarama P. Dandamudi, Guide to Assembly Language Programming in Linux (PDF)\nSivarana D. Dandamundi, Introduction to Assembly Language Programming. For Pentium and RISC (PDF)\nTHE 8088 and 8086 MICROPROCESSORS Triebel and Singh 4e Solution Manual (PDF)\nThe Assembly Programming Master Book by Vlad Pirogov 2005 (CHM)\nTom Shanley, x86 Instruction Set Architecture (PDF)\nTom Swan, Mastering Turbo Assembler. 2nd (PDF)\nVincent Mahout, Assembly Language Programming- ARM Cortex-M3 (PDF)\nVlad Pirogov, Disassembling Code: IDA Pro and SoftICE (CHM)\nWikibooks, X86 Disassembly (PDF)","torrent":{"xt":"urn:btih:7558b18aa579baf0f0b81de2c45735389e95fe34","amp;dn":"Assembly+programming+book+collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7558b18aa579baf0f0b81de2c45735389e95fe34","infoHashBuffer":{"type":"Buffer","data":[117,88,177,138,165,121,186,240,240,184,29,226,196,87,53,56,158,149,254,52]},"announce":[],"urlList":[]}}