{"title":"New Creative Collage Techniques (gnv64)","uid":7300539,"size":25688351,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:756e864fefd02a617f5a2a31abc4a0e532650d69&amp;dn=New+Creative+Collage+Techniques+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"gnv65","files":-1,"time":1338025088,"description":"New Creative Collage Techniques: How to Make Original Art Using Paper, Color and Texture (2 edition)\nby Nita Leland\nNorth Light Books | October 2011 | 162 Pages | ISBN: 1440309213 | PDF | 24.4 mb &lt;a href=&quot;\nhttp://www.amazon.com/New-Creative-Collage-Techniques-Original/dp/1440309213&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/New-Creative-Collage-Techniques-Original/dp/1440309213&lt;/a&gt;\n\nNew Creative Collage Techniques is filled with the guidance you need to make striking collages with a range of materials and mediums. It?s fun and easy to jump right in, whether you?re an experienced artist looking for something new or a new artist looking to make something unique. From basic methods to the latest innovations, this guide illustrates more than 60 exciting collage projects complete with detailed instruction, quick tips, charts and glossaries. In addition, seven start-to-finish demonstrations show you how to use these techniques to create your own stunning work.\n\nYou'll create:\n* Fantastic found-paper collages formed from items right within your reach\n* Compelling collage designs using decorative and ready-made papers\n* Mixed-media collages combining acrylics, watercolor, rice paper and more\n* Compositions featuring textured backgrounds made from paper, paint, natural materials and other collage materials\n* Original paper (hand made by you) artfully arranged to form collages that are uniquely yours\n* Collage that stands the test of time through the use of archival materials and techniques\n\nYou'll also be inspired to push the potential of this limitless art form by studying the diverse work of 60 featured artists. As author Nita Leland says, ?Experiment. Be Creative. Have fun. You?re a collage artist!? With this guide, you?ve got what you need to get started today.\n\nAbout the Author\nNita Leland is a graduate of Otterbein College. She has taught classes and workshops in watercolor, collage, creativity and color at art centers in Dayton, Ohio for more than thirty years. She is active as a judge for art exhibits, conducts workshops throughout the United States and Canada and appears in ArtistsNetwork.TV DVDs on color and collage (2009) as well as a creativity webinar (2009). Visit her website at www.nitaleland.com. Leland lives in Dayton, Ohio.\n\nNOTE : If Adobe Reader gives you trouble with this book, use Foxit Reader","torrent":{"xt":"urn:btih:756e864fefd02a617f5a2a31abc4a0e532650d69","amp;dn":"New+Creative+Collage+Techniques+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"756e864fefd02a617f5a2a31abc4a0e532650d69","infoHashBuffer":{"type":"Buffer","data":[117,110,134,79,239,208,42,97,127,90,42,49,171,196,160,229,50,101,13,105]},"announce":[],"urlList":[]}}