{"title":"Why Science Does Not Disprove God (2014) epub","uid":10278883,"size":2319546,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7583a4678aaa966d91d474bea7b7f83d5f593c73&amp;dn=Why+Science+Does+Not+Disprove+God+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1401670742,"description":"The renowned science writer, mathematician, and bestselling author of Fermat's Last Theorem masterfully refutes the overreaching claims of the &quot;New Atheists,&quot; providing millions of educated believers with a clear, engaging explanation of what science really says, how there's still much space for the Divine in the universe, and why faith in both God and empirical science are not mutually exclusive\n\n In recent years a highly publicized coterie of scientists and thinkers, including Richard Dawkins, the late Christopher Hitchens, and Lawrence Krauss, have vehemently contended that breakthroughs in modern science have disproven the existence of God, asserting we must accept that the creation of the universe came out of nothing, that religion is evil, that evolution fully explains the dazzling complexity of life, and more. However, in this much-needed book, veteran science journalist Amir Aczel profoundly disagrees and convincingly demonstrates that science has not, as yet, provided any definitive proof refuting the existence of God.\n\n Based on interviews with eleven Nobel Prize winners and many other prominent physicists, biologists, anthropologists, and psychologists, as well as leading theologians and spiritual leaders, Why Science Does Not Disprove God is a fascinating tour through the history of science and a brilliant and incisive analysis of the religious implications of our ever-increasing understanding of life and the universe. Throughout, Aczel reminds us that science, at its best, is about the dispassionate pursuit of truth--not a weapon in cultural debates. Respectful of both science and faith--and argued from the perspective of no single religious tradition--Aczel's book is an essential corrective that should be read by all.","torrent":{"xt":"urn:btih:7583a4678aaa966d91d474bea7b7f83d5f593c73","amp;dn":"Why+Science+Does+Not+Disprove+God+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7583a4678aaa966d91d474bea7b7f83d5f593c73","infoHashBuffer":{"type":"Buffer","data":[117,131,164,103,138,170,150,109,145,212,116,190,167,183,248,61,95,89,60,115]},"announce":[],"urlList":[]}}