{"title":"Mathematical Problem Solving - Alan H. Schoenfeld","uid":14391767,"size":3187804,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:75dec344b5a6827d53302c7048006396fe6a4fd9&amp;dn=Mathematical+Problem+Solving+-+Alan+H.+Schoenfeld&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1461309109,"description":"This book is addressed to people with research interests in the nature of mathematical thinking at any level, topeople with an interest in &quot;higher-order thinking skills&quot; in any domain, and to all mathematics teachers. The focal point of the book is a framework for the analysis of complex problem-solving behavior. That framework is presented in Part One, which consists of Chapters 1 through 5. It describes four qualitatively different aspects of complex intellectual activity: cognitive resources, the body of facts and procedures at one's disposal; heuristics, &quot;rules of thumb&quot; for making progress in difficult situations; control, having to do with the efficiency with which individuals utilize the knowledge at their disposal; and belief systems, one's perspectives regarding the nature of a discipline and how one goes about working in it.  \r\n\r\nPart Two of the book, consisting of Chapters 6 through 10, presents a series of empirical studies that flesh out the analytical framework. These studies document the ways that competent problem solvers make the most of the knowledge at their disposal. They include observations of students, indicating some typical roadblocks to success. Data taken from students before and after a series of intensive problem-solving courses document the kinds of learning that can result from carefully designed instruction. Finally, observations made in typical high school classrooms serve to indicate some of the sources of students' (often counterproductive) mathematical behavior","torrent":{"xt":"urn:btih:75dec344b5a6827d53302c7048006396fe6a4fd9","amp;dn":"Mathematical+Problem+Solving+-+Alan+H.+Schoenfeld","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75dec344b5a6827d53302c7048006396fe6a4fd9","infoHashBuffer":{"type":"Buffer","data":[117,222,195,68,181,166,130,125,83,48,44,112,72,0,99,150,254,106,79,217]},"announce":[],"urlList":[]}}