{"title":"The Vampire Diaries Seizoen 1 (2009) DivX HDTV NL Subs NLtoppers","uid":9122258,"size":11355806677,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7659258c7e9c9a93cc057cc24896370d97a5a272&amp;dn=The+Vampire+Diaries+Seizoen+1+%282009%29+DivX+HDTV+NL+Subs+NLtoppers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ChickieChicken","files":-1,"time":1383157348,"description":"Seizoen 1\n\nAls het schooljaar begint, zijn Elena en haar beste vriendinnen Bonnie en Caroline, gefascineerd door de nieuwe mysterieuze student Stefan Salvatore (Paul Wesley). Stefan en Elena voelen zich meteen tot elkaar aangetrokken. Niet wetende dat Stefan een vampier is.\n\nIn een korte tijd worden er in en rondom Mystic Falls verschillende mensen dood aangetroffen, die worden toegeschreven aan een aanval van een wild beest. Iedereen gelooft dit, behalve Stefan. Zijn vermoeden wordt bevestigd nadat hij thuiskomt en zijn oudere broer Damon (Ian Somerhalder) aantreft, die hij al jaren niet meer heeft gezien. Ze hebben een hekel aan elkaar, en Stefan heeft het, vooral in het begin, druk met Damons gemanipuleer en moorddadige buien. Hij probeert te voorkomen dat zijn broer de bewoners van Mystic Falls kwaad doet, maar slaagt hier niet altijd in. Damon gebruikt onder andere Caroline als &quot;bloedbank&quot;, door met haar te flirten, bloed te drinken en daarna haar het bloeddrinken weer te doen vergeten.\n\nNa een poosje komt Elena erachter dat Stefan en Damon vampiers zijn. Stefan en Elena krijgen een relatie, maar ondertussen blijven de moorden doorgaan. Er duiken meer vampiers op in de omgeving en ook de legendes over heksen en weerwolven blijken waarheid te bevatten. Later in het verhaal blijkt dat Elena geadopteerd is. Dit brengt een hoop onrust en vragen. Ze probeert te ontdekken wie haar echte ouders zijn en waarom ze geadopteerd is. Het blijkt dat John Gilbert, waarvan ze dacht dat hij eigenlijk haar oom is, haar vader is en Isobel Flemming, die tot vampier getransformeerd is door Damon, haar moeder. Hier komt ze, op het einde van seizoen 1, achter.\n\nIntussen lijkt Damon toch menselijke trekjes te hebben en raken hij en Elena bevriend. Het blijkt dat Elena precies lijkt op de vampier Katherine (een dubbelrol voor Nina Dobrev), de vroegere geliefde van zowel Stefan als Damon. Deze kwaadaardige vrouw was de belangrijkste reden van de strijd tussen de broers. Elena is een heel ander type dan Katherine. Terwijl Elena steeds meer ontdekt over het verleden van de broers, geeft Damon blijk van zijn gevoelens voor Elena.\n\nFile extension : Avi \nAfleveringen: 1 T/m 22\nAudio: English\nSubtitles: Dutch ( Ingebakken )\nCategory: Series \nSource: HDTV\nGenre: Drama, Horror, Romance\nIMDB: http://www.imdb.com/title/tt1405406/\n\n\nVeel kijkplezier en blijf seeden!\n\n\nGroetjes CC","torrent":{"xt":"urn:btih:7659258c7e9c9a93cc057cc24896370d97a5a272","amp;dn":"The+Vampire+Diaries+Seizoen+1+%282009%29+DivX+HDTV+NL+Subs+NLtoppers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7659258c7e9c9a93cc057cc24896370d97a5a272","infoHashBuffer":{"type":"Buffer","data":[118,89,37,140,126,156,154,147,204,5,124,194,72,150,55,13,151,165,162,114]},"announce":[],"urlList":[]}}