{"title":"The Rejection of Continental Drift- Theory and Method in America","uid":11005967,"size":34932285,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77097c3eefacaedecf59c3d6e9c6969911a4bdb6&amp;dn=The+Rejection+of+Continental+Drift-+Theory+and+Method+in+America&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"gratefuldawg77","files":1,"time":1410233878,"description":"In the early twentieth century, American earth scientists were united in their opposition to the new--and highly radical--notion of continental drift, even going so far as to label the theory &quot;unscientific.&quot; Some fifty years later, however, continental drift was heralded as a major scientific breakthrough and today it is accepted as scientific fact. Why did American geologists reject so adamantly an idea that is now considered a cornerstone of the discipline? And why were their European colleagues receptive to it so much earlier? This book, based on extensive archival research on three continents, provides important new answers while giving the first detailed account of the American geological community in the first half of the century. Challenging previous historical work on this episode, Naomi Oreskes shows that continental drift was not rejected for the lack of a causal mechanism, but because it seemed to conflict with the basic standards of practice in American geology. This account provides a compelling look at how scientific ideas are made and unmade.","torrent":{"xt":"urn:btih:77097c3eefacaedecf59c3d6e9c6969911a4bdb6","amp;dn":"The+Rejection+of+Continental+Drift-+Theory+and+Method+in+America","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77097c3eefacaedecf59c3d6e9c6969911a4bdb6","infoHashBuffer":{"type":"Buffer","data":[119,9,124,62,239,172,174,222,207,89,195,214,233,198,150,153,17,164,189,182]},"announce":[],"urlList":[]}}