{"title":"Dora op Pad met de Landkaart (DivXNL-Team) Nederlands Gesproken","uid":4742158,"size":748376850,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:77355b38494d3bf0a6f96a8c9c644e701396457e&amp;dn=Dora+op+Pad+met+de+Landkaart+%28DivXNL-Team%29+Nederlands+Gesproken&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"DivXNL-Team","files":-1,"time":1235608695,"description":"[b]De Kaart is Weg:[/b] Dora, Boots, Rugzak en Kaart zijn klaar voor een nieuwe dag vol avonturen. Maar als een grote, rare vogel Kaart per ongeluk aanziet voor een takje en hem naar zijn nest op de hoogste 'berg' brengt, hebben Dora en Boots de hulp van de kleuters nodig om hun eigen kaart te tekenen en hun vriend te bevrijden!\n\n[b]Superkaart:[/b] Dora, Boots en de kleuters moeten snel weer de berg af om de superverrassing te bekijken die bij Dora thuis op hen wacht. Wie neemt deze taak op zich? SuperKaart! Als Kaart zijn tovercape omhangt, wordt hij een superheld. Hij kan dan heel hoog vliegen om aanwijzingen te geven, zijn superadem en superkracht gebruiken om obstakels te verplaatsen en ons zelfs helpen Zwieber tegen te houden!\n\nBonus afleveringen:\n\n[b]Drie Varkentjes:[/b] Oh nee! Drie kleine biggetjes zijn uit hun hok ontsnapt! Dora en Boots hebben je hulp nodig om de biggetjes te vinden, voordat Zwieber de vos hun blauwe linten te pakken krijgt. Help je mee de drie kleine biggetjes te redden?\n\n[b]Alleen Op De Wereld:[/b] Dora en Boots vinden een kleine, blauwe babyvogel die\nEngles spreekt. De vogel is nat, heeft het koud en mist haar moeder. Help Dora en Boots en breng de vogel terug naar zijn moeder in de kleine blauwe boom.\nBijzonderheden: Terwijl de kleuters samen spelen met Dora, Boots en\nKaart in &quot;Op pad met de landkaart&quot;, leren zij:\n\n- Engels taalvaardigheden:Zeg &quot;Red&quot; of &quot;Yellow&quot; om een rood of geel pad te kiezen en &quot;Jump&quot; om een vriend te laten springen!\n\n- Visuele en ruimtelijke vaardigheden: Teken een kaart,\ngebruik tekens om de juiste weg te vinden, zoek bij elkaar\npassende kleuren en vind verborgen voorwerpen!\n\n- Kinestetische vaardigheden: Spring hoog over houtblokken om door de jungle te komen en spring over rollende watermeloenen!\n\n- Bovendien leren zij spelenderwijs nog veel meer en wordt hun probleemoplossend vermogen gestimuleerd!\n\n\nMeer Nederlandse items vind je op:  &lt;a href=&quot; http://www.divxnl-team.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.divxnl-team.nl&lt;/a&gt;   \nDivXNL, De NL Films Site","torrent":{"xt":"urn:btih:77355b38494d3bf0a6f96a8c9c644e701396457e","amp;dn":"Dora+op+Pad+met+de+Landkaart+%28DivXNL-Team%29+Nederlands+Gesproken","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77355b38494d3bf0a6f96a8c9c644e701396457e","infoHashBuffer":{"type":"Buffer","data":[119,53,91,56,73,77,59,240,166,249,106,140,156,100,78,112,19,150,69,126]},"announce":[],"urlList":[]}}