{"title":"Foster the People - Supermodel [2014] [Album]","uid":11900944,"size":346383635,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7760738a9efbf30ad05edc0a1f77f981905db36b&amp;dn=Foster+the+People+-+Supermodel+%5B2014%5D+%5BAlbum%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"mindcrasher","files":14,"time":1431314461,"description":"Supermodel is the highly anticipated new album from Foster The People featuring first single &quot;Coming Of Age&quot;. The globally influenced album is the follow-up to the group's critically acclaimed 2011 debut Torches. Recorded in various locations around the world, Supermodel began as frontman Mark Foster and producer Paul Epworth set up a writing studio in a riad in Essaouira, Morocco at the end of 2012. &quot;We didn't have any rules. We just created as much as we could in seven days,&quot; Foster recalls, &quot;And in the spirit of wanderlust and discovery we ended up stumbling on the musical identity of what this record was going to feel like.&quot; From Morocco the album continued to migrate with Foster and the band. Work continued at Woodshed Studios in Malibu, Henson Studios and Bronson Island in Los Angeles, and was finished at Epworth's Wolf Tone Studios in London. Foster The People achieved success with the 2011 release of their debut album Torches, featuring the #1 hit single &quot;Pumped Up Kicks,&quot; which was declared &quot;the year's anthem&quot; by SPIN. Foster The People garnered three GRAMMY nominations for their monumental debut, including Best Alternative Album, Best Pop Duo/Group Performance for &quot;Pumped Up Kicks,&quot; and Best Short Form Music Video for &quot;Houdini&quot;. ~\n\nSupermodel is the second studio album by American indie rock band Foster The People. The album was co-produced by their frontman Mark Foster and British musician Paul Epworth, and is scheduled for release by Columbia Records on March 14, 2014 in Friday-release countries and March 18, 2014 in the United States. It is the follow-up to the band's 2011 debut album Torches. A concept album, Supermodel features common and heavy themes of negativity towards modern popular culture and consumer ideology throughout the record and its related artworks. Conceived mostly by Foster, the album deals primarily with social issues and &quot;the ugly side of capitalism,&quot; issues that had affected and fascinated Foster during the creative process of the album. Recorded and produced throughout 2012 and 2013, the album also features a minor departure from the sound of Torches, importing instruments and various sounds of different cultures of the world while retaining the &quot;perfect pop record&quot; sound. The album was heavily promoted by the band and Columbia Records in the lead-up to its release, with an accompanying documentary series of the same name and a 130-foot mural painted in Los Angeles, the largest on the West Coast of the United States. The album was preceded by three singles released by Columbia in 2014: &quot;Coming Of Age&quot; released in January 2014, &quot;Pseudologia Fantastica&quot; in February, and &quot;Best Friend&quot; in March. ~ en.wikipedia.org\n\nTracklist\n1. Are You What You Want to Be? (04:30)\n2. Ask Yourself (04:23)\n3. Coming of Age (04:40)\n4. Nevermind (05:17)\n5. Pseudologia Fantastica (05:31)\n6. The Angelic Welcome of Mr. Jones (00:33)\n7. Best Friend (04:27)\n8. A Beginner's Guide to Destroying the Moon (04:39)\n9. Goats in Trees (05:09)\n10. The Truth (04:29)\n11. Fire Escape (04:22)","torrent":{"xt":"urn:btih:7760738a9efbf30ad05edc0a1f77f981905db36b","amp;dn":"Foster+the+People+-+Supermodel+%5B2014%5D+%5BAlbum%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7760738a9efbf30ad05edc0a1f77f981905db36b","infoHashBuffer":{"type":"Buffer","data":[119,96,115,138,158,251,243,10,208,94,220,10,31,119,249,129,144,93,179,107]},"announce":[],"urlList":[]}}