{"title":"The Bhagavad Gita - A Biography by Richard H. Davis (2014)","uid":11389184,"size":6091851,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:784abc5fa035d5efabb166f84071702c22269fce&amp;dn=The+Bhagavad+Gita+-+A+Biography+by+Richard+H.+Davis+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1415302844,"description":"Title: The Bhagavad Gita - A Biography\nAuthor: Richard H. Davis\nCategory: Academic/Religion/History\nSeries: Lives of Great Religious Books\nHardcover: 256 pages\nPublisher: Princeton University Press (October 26, 2014)\nLanguage: English\nISBN-10: 0691139962\nISBN-13: 978-0691139968\n\nPublisher's Summary: &quot;The Bhagavad Gita, perhaps the most famous of all Indian scriptures, is universally regarded as one of the world's spiritual and literary masterpieces. Richard Davis tells the story of this venerable and enduring book, from its origins in ancient India to its reception today as a spiritual classic that has been translated into more than seventy-five languages. The Gita opens on the eve of a mighty battle, when the warrior Arjuna is overwhelmed by despair and refuses to fight. He turns to his charioteer, Krishna, who counsels him on why he must. In the dialogue that follows, Arjuna comes to realize that the true battle is for his own soul.\n\nDavis highlights the place of this legendary dialogue in classical Indian culture, and then examines how it has lived on in diverse settings and contexts. He looks at the medieval devotional traditions surrounding the divine character of Krishna and traces how the Gita traveled from India to the West, where it found admirers in such figures as Ralph Waldo Emerson, Henry David Thoreau, J. Robert Oppenheimer, and Aldous Huxley. Davis explores how Indian nationalists like Mahatma Gandhi and Swami Vivekananda used the Gita in their fight against colonial rule, and how contemporary interpreters reanimate and perform this classical work for audiences today.\n\nAn essential biography of a timeless masterpiece, this book is an ideal introduction to the Gita and its insights into the struggle for self-mastery that we all must wage.&quot;\n\nReviews:\n&quot;No work of traditional India needs a biography more than the Bhagavad Gita, for no text has had a more complicated life, from its birth in the epic world of the Mahabharata to its maturity in Indian modernity. Reading intelligently depends in part on knowing how others in the past have read, and for the Gita's past, Richard Davis has provided the best guidance available.&quot; -Sheldon Pollock, Arvind Raghunathan Professor of Sanskrit and South Asian Studies, Columbia University\n\n&quot;This superb and beautifully written book represents a substantial contribution to the field, and will become a first-tier resource for anyone interested in the subject. Davis's authoritative voice is a dependable guide throughout. I cannot imagine this book being done better by anyone else.&quot; -John Stratton Hawley, author of Three Bhakti Voices: Mirabai, Surdas, and Kabir in Their Times and Ours\n\n&quot;I thoroughly enjoyed reading this biography of the Bhagavad Gita. Its uniqueness rests in its breadth and historical scope--each chapter opens new contexts and perspectives. Davis is a careful scholar who writes clear, straightforward prose, remarkably free of jargon.&quot; -Diana L. Eck, author of India: A Sacred Geography\n\nThis torrent contains the retail EPUB and MOBI editions of the book, as well as the front cover image. Please seed and enjoy","torrent":{"xt":"urn:btih:784abc5fa035d5efabb166f84071702c22269fce","amp;dn":"The+Bhagavad+Gita+-+A+Biography+by+Richard+H.+Davis+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"784abc5fa035d5efabb166f84071702c22269fce","infoHashBuffer":{"type":"Buffer","data":[120,74,188,95,160,53,213,239,171,177,102,248,64,113,112,44,34,38,159,206]},"announce":[],"urlList":[]}}