{"title":"Principles of Geometry, Volume 1 ,2","uid":8119766,"size":5717658,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7872a06f20fcb1eff70eee3543ea4e5f31d550af&amp;dn=Principles+of+Geometry%2C+Volume+1+%2C2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1360371091,"description":"\nPrinciples of Geometry, Volume 1 (Cambridge Library Collection - Mathematics) By H. F. Baker\n2010 (1922) | 202 Pages | ISBN: 1108017770 | DJVU | 2 MB\n\n\n\nHenry Frederick Baker (1866-1956) was a renowned British mathematician specialising in algebraic geometry. He was elected a Fellow of the Royal Society in 1898 and appointed the Lowndean Professor of Astronomy and Geometry in the University of Cambridge in 1914. First published between 1922 and 1925, the six-volume Principles of Geometry was a synthesis of Baker's lecture series on geometry and was the first British work on geometry to use axiomatic methods without the use of co-ordinates. The first four volumes describe the projective geometry of space of between two and five dimensions, with the last two volumes reflecting Baker's later research interests in the birational theory of surfaces. The work as a whole provides a detailed insight into the geometry which was developing at the time of publication. This, the first volume, describes the foundations of projective geometry. \n\nPrinciples of Geometry, Volume 2 (Cambridge Library Collection - Mathematics) By H. F. Baker\n2010 (1922) | 266 Pages | ISBN: 1108017789 | DJVU | 3 MB\n\n\n\nHenry Frederick Baker (1866-1956) was a renowned British mathematician specialising in algebraic geometry. He was elected a Fellow of the Royal Society in 1898 and appointed the Lowndean Professor of Astronomy and Geometry in the University of Cambridge in 1914. First published between 1922 and 1925, the six-volume Principles of Geometry was a synthesis of Baker's lecture series on geometry and was the first British work on geometry to use axiomatic methods without the use of co-ordinates. The first four volumes describe the projective geometry of space of between two and five dimensions, with the last two volumes reflecting Baker's later research interests in the birational theory of surfaces. The work as a whole provides a detailed insight into the geometry which was developing at the time of publication. This, the second volume, describes the principal configurations of space of two dimensions. ","torrent":{"xt":"urn:btih:7872a06f20fcb1eff70eee3543ea4e5f31d550af","amp;dn":"Principles+of+Geometry%2C+Volume+1+%2C2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7872a06f20fcb1eff70eee3543ea4e5f31d550af","infoHashBuffer":{"type":"Buffer","data":[120,114,160,111,32,252,177,239,247,14,238,53,67,234,78,95,49,213,80,175]},"announce":[],"urlList":[]}}