{"title":"Marvin Gaye - What's Going On [FLAC] TNT Village","uid":8776400,"size":221471287,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:78ad2e7a713307580b038728ea271664462024ea&amp;dn=Marvin+Gaye+-+What%27s+Going+On+%5BFLAC%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"l.diliberto","files":9,"time":1375567192,"description":"Marvin Gaye - What's Going On [FLAC] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=354288&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=354288&lt;/a&gt;\n\nAnno: 1971\nGenere: Soul\n\nWhat's Going On is not only Marvin Gaye's masterpiece, it's the most important and passionate record to come out of soul music, delivered by one of its finest voices, a man finally free to speak his mind and so move from R&amp;B sex symbol to true recording artist. With What's Going On, Gaye meditated on what had happened to the American dream of the past -- as it related to urban decay, environmental woes, military turbulence, police brutality, unemployment, and poverty. These feelings had been bubbling up between 1967 and 1970, during which he felt increasingly caged by Motown's behind-the-times hit machine and restrained from expressing himself seriously through his music. Finally, late in 1970, Gaye decided to record a song that the Four Tops' Obie Benson had brought him, &quot;What's Going On.&quot; When Berry Gordy decided not to issue the single, deeming it uncommercial, Gaye refused to record any more material until he relented. Confirmed by its tremendous commercial success in January 1971, he recorded the rest of the album over ten days in March, and Motown released it in late May. Besides cementing Marvin Gaye as one of the most important artists in pop music, What's Going On was far and away the best full-length to issue from the singles-dominated Motown factory, and arguably the best soul album of all time.\n\nConceived as a statement from the viewpoint of a Vietnam veteran (Gaye's brother Frankie had returned from a three-year hitch in 1967), What's Going On isn't just the question of a baffled soldier returning home to a strange place, but a promise that listeners would be informed by what they heard (that missing question mark in the title certainly wasn't a typo). Instead of releasing listeners from their troubles, as so many of his singles had in the past, Gaye used the album to reflect on the climate of the early '70s, rife with civil unrest, drug abuse, abandoned children, and the spectre of riots in the near past. Alternately depressed and hopeful, angry and jubilant, Gaye saved the most sublime, deeply inspired performances of his career for &quot;Mercy Mercy Me (The Ecology),&quot; &quot;Inner City Blues (Make Me Wanna Holler),&quot; and &quot;Save the Children.&quot; The songs and performances, however, furnished only half of a revolution; little could've been accomplished with the Motown sound of previous Marvin Gaye hits like &quot;Stubborn Kind of Fellow&quot; and &quot;Hitch Hike&quot; or even &quot;I Heard It Through the Grapevine.&quot; What's Going On, as he conceived and produced it, was like no other record heard before it: languid, dark, and jazzy, a series of relaxed grooves with a heavy bottom, filled by thick basslines along with bongos, conga, and other percussion. Fortunately, this aesthetic fit in perfectly with the style of longtime Motown session men like bassist James Jamerson and guitarist Joe Messina. When the Funk Brothers were, for once, allowed the opportunity to work in relaxed, open proceedings, they produced the best work of their careers (and indeed, they recognized its importance before any of the Motown executives). Bob Babbitt's playing on &quot;Inner City Blues (Make Me Wanna Holler)&quot; functions as the low-end foundation but also its melodic hook, while an improvisatory jam by Eli Fountain on alto sax furnished the album's opening flourish. (Much credit goes to Gaye himself for seizing on these often tossed-off lines as precious; indeed, he spent more time down in the Snakepit than he did in the control room.) Just as he'd hoped it would be, What's Going On was Marvin Gaye's masterwork, the most perfect expression of an artist's hope, anger, and concern ever recorded.\n\n.: Cover :.\n\n[img]http://media.tumblr.com/tumblr_ls3x4bdAdM1r0ob6s.jpg[/img]\n\n.: Tracklist :.\n\n1. What's Goin On\n2. What's Happening Brother\n3. Flyin' High\n4. Save The Children\n5. God Is Love\n6. Mercy Mercy Me\n7. Right On\n8. Wholly Holly\n9. Inner City Blue","torrent":{"xt":"urn:btih:78ad2e7a713307580b038728ea271664462024ea","amp;dn":"Marvin+Gaye+-+What%27s+Going+On+%5BFLAC%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78ad2e7a713307580b038728ea271664462024ea","infoHashBuffer":{"type":"Buffer","data":[120,173,46,122,113,51,7,88,11,3,135,40,234,39,22,100,70,32,36,234]},"announce":[],"urlList":[]}}