{"title":"InfiniteSkills - Web Programming With Python","uid":8297208,"size":685906618,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:78e09e41714473f07c7a8082ea19e7f869ac87e7&amp;dn=InfiniteSkills+-+Web+Programming+With+Python&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"h714375","files":102,"time":1364172353,"description":"A Verifiable Certificate of Completion is presented to all students who undertake this course.\n\nThis Web Programming with Python course takes you through a hands-on guide to object-oriented development for the web, working with multiple types of servers, databases and web frameworks. All that is required to get started is a very basic background knowledge of Python, as instructor Mike McMillan begins these Python tutorials with two chapters of review and then goes step by step through the necessary concepts at every stage of development. You'll get a detailed primer on database programming with Python, installing an SQLite server and performing routine data selections and operations; you'll learn how to interact with FTP and email services using native Python code; see how to process web form data via Python; and learn how to interact with web database applications and utilize XML. Finally, the course ends with a chapter on configuring and working with Django, a modern web framework that allows you to create and manage complex database-driven websites. There's not a better course for taking Python concepts and applying them to real world projects.\n\n\nWhat You Will Learn\n\n- How to use Python object-oriented programming techniques within web-based projects, from online databases to complete websites.\n- How to install and configure basic web-based databases using Python code.\n- The essentials of XML and how it can be used in conjunction with Python projects.\n- How to implement and work with Django to manage full database-driven websites.\n\n\nWho Should Take This Course\n\n- Anyone with a basic background knowledge of Python and object-oriented programming (OOC) who wants to see how the language can be used for web-specific projects.\n- Anyone who wants a better understanding of SQLite, XML, and online database standards.\n- Anyone looking to increase their knowledge of the Python programming language and its practical application.","torrent":{"xt":"urn:btih:78e09e41714473f07c7a8082ea19e7f869ac87e7","amp;dn":"InfiniteSkills+-+Web+Programming+With+Python","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78e09e41714473f07c7a8082ea19e7f869ac87e7","infoHashBuffer":{"type":"Buffer","data":[120,224,158,65,113,68,115,240,124,122,128,130,234,25,231,248,105,172,135,231]},"announce":[],"urlList":[]}}