{"title":"Toni Iordache Discography","uid":5020689,"size":365701739,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:79161ed44dadc85e5ecfc5e63cbf165b573d472f&amp;dn=Toni+Iordache+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ill88eagle","files":-1,"time":1248446775,"description":"I uploaded these albums half a year ago at a lowsy bitrate. The torrent never got a lot of seeds (propably due to my newbish disorganization of the included files). So here goes second try, this time properly named and organized, and in HQ bitrate (256 kbps). Enjoy.\n\nFor a video preview of Toni's style go here:  &lt;a href=&quot;\nhttp://suprbay.org/showthread.php?t=51767&amp;page=10#post381304&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://suprbay.org/showthread.php?t=51767&amp;page=10#post381304&lt;/a&gt;\n\nQuote (Grit Friedrich):&quot;A black and white photo shows Toni Iordache at the tambal in a crooked house somewhere on the outskirts of Bucharest with half a dozen tape recorders beneath the instrument. Private live recordings originated back then, in the sixties and seventies, definitely hot property for Toni Iordache aficionados, because he truly was a once-in-a-century talent and the most popular wedding musician in the whole country.\n\nHe was born on 17th December 1942 in the village of Bildana, near Bucharest. At the age of four this son of a tambal player got to know the smaller portable version of this instrument. A little after this the musician's family moved into a small house in the Bucharest quarter of Herestrau. Many Lautari Tonimusicians lived here, including the Gore brothers and the singer Dona Dumitru Siminica. Toni went into the wedding business and soon rose to the position of guest soloist with the Romanian radio folk music ensemble. Small in physique, he became an unrivalled performer on the tambal. The trumpeter Costel Vasilescu remembers their first meeting well: &quot;I met Toni in 1954, at that time I was playing in my father's brass band in Chitila, a village on the outskirts of Bucharest. Toni was playing there too and everyone was just standing around him and getting scared, because his playing was so insanely good.&quot;\n\nToni Iordache learned a lot from the Bucharest tambal player Mitica Ciuciu, Costel Vasilescu remembers. When the young musicians visited Ciuciu, the old Lautar played them his arrangements and interpretations of traditional dances. And at the next wedding a day later, the young Iordache would shine with them. Toni Iordache rose to become an export hit for the People's Republic of Romania - he toured through many European countries, the USA and Asia with the state folklore ensembles. He often drove from Bucharest Airport straight to a wedding where the other musicians were waiting for him. \n\nWeddings were sweat-inducing but lucrative work - they began in the morning and lasted until the following morning, sometimes the celebration continued for two or three days - the musicians worked to the edge of exhaustion. For Toni Iordache struck the strings of his instrument at a breathtaking speed (25 beats per second). He was famous for his complex solos, a gifted ensemble player, who enriched many melodies with oriental elements and sophisticated rhythms. For Toni Iordache the technique of playing the tambal was not made up solely of speed, but also of stroke, interpretation, fantasy and inspiration.\n\nIordache's genius was recognised by important people; it is said that during one of his Bucharest visits Sergiu Celibidache, the world-famous Romanian conductor, heard Toni Iordache, and on leaving embraced him with tears in his eyes. And it is no coincidence that many Electrecord records of &quot;muzica lautareasca&quot; were recorded with Toni Iordache between 1965 and 1980. Except during his forced break in prison.\n\nBecause on returning from a tour at the beginning of the seventies, the musician was arrested for the illegal possession of foreign currency. The story goes in Bucharest that he wanted to buy his wife a fur coat with the money he had earned abroad. \n\nEven the prestigious orchestra leader Florian Economu couldn't help his soloist at the trial when he spoke up for him: &quot;We have three giants in Romania, Nicolae Ceausescu (head of state), Ilie Nastase (Romanian Wimbledon doubles tennis champion) and the tambal player Toni Iordache! Do you really want to convict him for a few dollars?&quot;.\n\nHowever it remained a crime in Romania to possess a single dollar until December 1989. The court sentenced Iordache to three years in prison, of which he had already served more than one year. The trial was not mentioned in the newspapers; only the musicians in the scene knew about it and had been warned. However there were fellow inmates who were able to save Toni Iordache from hard physical labour, because they - for a fee - took over his share. It is due to these people, that Iordache was still able to play on leaving prison. The musician, who already suffered from diabetes, lost so much weight in prison that he looked like an adolescent, but after his release soon recovered his old stage persona.\n\nToni Iordache also played a decisive role for Dan Armeanca, the godfather of Romanian Gypsy pop. &quot;Toni was a genius on the tambal, ones like that are not born twice. He respected tradition, but even back then he allowed jazz influences to sound through. He gave us young musicians courage due to his musical audacity.&quot; And he passed on his talent: following a tour of the USA Toni Iordache bought two Bohak tambals, on which today his 44-year-old son Leonard in Bucharest's Jaristea Restaurant and his 18-year-old grandson Bogdan play the repertoire of the dynasty's founder.\nSeriously ill with diabetes, Toni Iordache's last foreign tour took him to the Netherlands. Upon his return he was advised to have his leg amputated, but Toni Iordache only survived the operation by a few hours. The crÃƒÂ¨me de la crÃƒÂ¨me of the Lautari scene made a pilgrimage to his funeral in February 1988, family, friends and fans following the hearse, which was drawn by four black horses. Iordache's friend, the trumpeter Costel Vasilescu, co-organized the funeral. It was a worthy farewell from Toni Iordache, the tambal god of Romania.&quot;\n\n-Grit Friedrich\nJournalist and editor of the compilation Suburban Bucharest (trikont)\n\nGlossary:\n\ntzambal- tzimbel- cymbalum-tzimbalom-dulcimer-zimbalon\n\nThe tambal is an instrument with its origins in the Orient; it is made of a wooden soundbox above which a certain number of metal strings are stretched. These strings are beaten with two small wooden sticks with their heads wrapped in cotton. The tambal was played at the court of the Wallachian prince Alexandru Ipsilanti in the 18th century. The instrument soon became a popular folk instrument not to be missed at a wedding or village ball.\n\n\nTorrent contains:\n\nToni Iordache - A Virtuoso of The Cimbalom (CD1)\nElectrecord (Romania) | MP3 | 44100 Hz | stereo | 256 kbps\n\n1. Toni Iordache - CÃ„Æ’luÃ…Å¸ul (2:25) \n2. Toni Iordache - CÃƒÂ¢ntÃ„Æ’ cucul primavara (2:07) \n3. Toni Iordache - Hora moldoveneascÃ„Æ’ (2:22) \n4. Toni Iordache - VariaÃ…Â£iuni la cÃƒÂ¢ntecul &quot;AÃ…Å¸a be (2:07) \n5. Toni Iordache - Geamparalele de la Babadag (1:42) \n6. Toni Iordache - AsearÃ„Æ’ fusei la mÃƒÂ¢ndra (3:50) \n7. Toni Iordache - Ca la Breaza (2:37) \n8. Toni Iordache - MandruÃ…Â£o, de dorul tÃ„Æ’u (2:53) \n9. Toni Iordache - CÃƒÂ¢ntec la ÃƒÂ®mbracatul miresei (3:03) \n10. Toni Iordache - Hora de la Rudari (2:18) \n11. Toni Iordache - Joc de doi (2:58) \n12. Toni Iordache - SÃƒÂ¢rba lui Floarea CioacÃ„Æ’ (2:04) \n13. Toni Iordache - Jocul ciocÃ„Æ’nelelor (2:50) \n14. Toni Iordache - Nuneasca de la Craiova (2:44) \n15. Toni Iordache - CÃƒÂ¢ntec de ascultare Ã…Å¸i BreazÃ„Æ’ (2:36) \n16. Toni Iordache - Hora de la PopeÃ…Å¸ti (2:24) \n17. Toni Iordache - SÃƒÂ¢rba dobrogeanÃ„Æ’ (3:13) \n18. Toni Iordache - HorÃ„Æ’ (4:45) \n19. Toni Iordache - Geamparalele lui Haidim (2:29) \n20. Toni Iordache - Hora dinspre ziua din Bolintin (2:30) \n21. Toni Iordache - SÃƒÂ¢rba de la Medgidia (3:23) \n22. Toni Iordache - CÃƒÂ¢ntec Ã…Å¸i BreazÃ„Æ’ ca la Fantane (4:39) \n23. Toni Iordache - LeliÃ…Â£a Floare (2:27) \n24. Toni Iordache - MÃ„Æ’i neicuÃ…Â£Ã„Æ’, mÃ„Æ’i gorjene (1:48) \n25. Toni Iordache - Braul pe Ã…Å¸ase ca la Muscel (1:47) \n26. Toni Iordache - PÃ„Æ’saricÃ„Æ’ de sub nori (2:49) \n27. Toni Iordache - Hora lÃ„Æ’utarilor (1:56) \n28. Toni Iordache - PasÃ„Æ’rea Ã…Å¸i piÃ…Â£ulicu (3:55) \n29. Toni Iordache - De doi (1:15)\n\n \nToni Iordache - A Virtuoso of The Cimbalom (CD 2)\nElectrecord (Romania) | MP3 | 44100 Hz | stereo | 256 kbps\n\n1.Hora de la BÃƒÂ¢ldana \n2.SÃƒÂ¢rba olteneascÃ„Æ’ \n3.Variatiuni pe tema &quot;Foaie verde Ã…Å¸i-o crÃ„Æ’iÃ…Â£Ã„Æ’&quot; \n4.Doina Oltului \n5.Hora de la Bolintin \n6.Geaba ma mai duc acasa si Hora lui Leonard \n7.Doina de jale \n8.Cantec de ascultare si Sarba de la SÃ„Æ’bÃ„Æ’reni \n9.Cantec de dragoste \n10.Hora din Ialomita \n11.Doina &quot;Trandafir imbobocit&quot; \n12.Breaza fetelor \n13.Balada lui Corbea \n14.Ma dusei in lumea larga \n15.Doina transilvana \n16.Hora lautareasca \n17.Doina &quot;Cand eram copil mic&quot; \n18.Hora de la Medgidia \n19.Balada haiduceasca \n\nOrchestrele conduse de Gheorghe Zamfir(1-3,5-10), Tudor PanÃ„Æ’(4,12-15,18), Florian Economu(11,16,17,19)\n\nToni Iordache - Sounds from a Bygone Age vol 4\nASPHALT TANGO (Germany) | MP3 | 44100 Hz | stereo | 256 kbps\n\n1. Variatiuni Pe Tema &quot;Foaie Verde Si-O Craita&quot;  \n2. Grea Mi-E Doamne, Inima  \n3. SÃƒÂ®rba de La Medgidia  \n4. CÃƒÂ¢ntec de Ascultare Si Breaza  \n5. ÃƒÅ½ntr-O Joi de Dimineata  \n6. Balada Haiduceasca  \n7. Ca La Breaza  \n8. Omul Bun N-Are Noroc  \n9. CÃƒÂ¢ntec de Masa  \n10. As Munci La Plug Si La Coasa  \n11. CÃƒÂ¢ntec de Ascultare al Lui Stoican BatrÃƒÂ®nul  \n12. Geamparale de La Babadag  \n13. Tinerete, Tinerete  \n14. Doina Transilvania  \n\nMusicians\n\nBuze Pane - accordion\nCostel Vasilescu - trumpet\nIon Barbulea - double bass\nBebe Serban - accordino\nMitica Chiru - violin\nNicu Bela - accordino","torrent":{"xt":"urn:btih:79161ed44dadc85e5ecfc5e63cbf165b573d472f","amp;dn":"Toni+Iordache+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79161ed44dadc85e5ecfc5e63cbf165b573d472f","infoHashBuffer":{"type":"Buffer","data":[121,22,30,212,77,173,200,94,94,207,197,230,60,191,22,91,87,61,71,47]},"announce":[],"urlList":[]}}