{"title":"Blake Shelton - Pure BS (Deluxe Edition) (2008-VBR-Country)","uid":4176874,"size":76063799,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:793ac8c8f712e2ea35dd8d9bfdb8710dbe349cb9&amp;dn=Blake+Shelton+-+Pure+BS+%28Deluxe+Edition%29+%282008-VBR-Country%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cheng","files":18,"time":1210184154,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51uEUrIavEL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51uEUrIavEL._SS500_.jpg&lt;/a&gt;\n\n-=About DELUXE EDITION=-\n\nBlake Shelton releases his fifth album. Due to the success of his current single, &quot;Home,&quot; he is re-releasing his &quot;PURE BS&quot; album as &quot;PURE BS DELUXE EDITION.&quot; The album will include all of the previously released songs that were on &quot;PURE BS,&quot; including singles &quot;Don&amp;#039;t Make Me&quot; and &quot;The More I Drink.&quot; It will also include three new tracks - &quot;Home&quot; and two Shelton-penned songs, &quot;Chances&quot; and &quot;I Can&amp;#039;t Walk Away.&quot; &quot;How strange to be re-releasing an album - but it&amp;#039;s what makes sense. I wasn&amp;#039;t due for another album for a while and &quot;Home&quot; was being so well received the label had to find a way to get it out to the fans - so now there&amp;#039;s a PURE BS DELUXE EDITION,&quot; says Shelton. Shelton reflects on &quot;Chances,&quot; &quot;When I moved to Nashville in &amp;#039;94, it seemed like every song on the radio was about positive family things and falling in love. I wanted to write a song about falling in love the way it really happens sometimes. A guy just meeting a girl in a bar.&quot; \n\n-=Review=- by Thom Jurek\n\nWith Pure BS Blake Shelton proves he is one of the country music artists who are in it for the long haul and cannot rest on his laurels. From the cover photo to the last track the listener can easily be startled by what is on offer here. As his first three albums showcased, Shelton has always had a powerful baritone range and can write and sing drinking, heartbreak and driving songs all night. Working with producer Bobby Braddock, Shelton forged a sound that showcased him as a country music hell raiser who had a tender side, but he did it all with one voice. On Pure BS (a great double entendre), Shelton worked not only with Braddock, but with producers Paul Worley and Brent Rowan as well. What the sum total of these 11 songs reveals is that Shelton is really and truly a singer of modern country music. The opener is a Southern rocker with napalm guitars called &quot;This Can&amp;#039;t Be Good&quot; (a tale with a humorous twist). It&amp;#039;s the Shelton everyone knows, but he reaches for notes he hasn&amp;#039;t hit before. &quot;The More I Drink&quot; is one of the first sobriety songs since Ray Wylie Hubbard&amp;#039;s classic &quot;Hey, That&amp;#039;s Alright&quot; to actually make sense even as it makes the listener laugh. (It&amp;#039;s interesting that they are both from small towns in Oklahoma) Then there&amp;#039;s the bittersweet &quot;I Don&amp;#039;t Care,&quot; with steel guitars and strings, where Shelton digs deep into the heart of his voice where searing honesty, even as it begins in lying to oneself, comes to the fore as he digs deeper into the lyric than he ever has before, and yes, that&amp;#039;s saying something. &quot;Back There Again&quot; is the most haunting and moving loving and leaving songs Shelton&amp;#039;s ever recorded. Written by Tom Douglas, it&amp;#039;s on a par with &quot;By the Time I Get to Phoenix.&quot; Transformations, turnarounds, realizations and reflection are at the heart of Pure BS. That&amp;#039;s not to say that there aren&amp;#039;t the trademark Shelton rollicking country-rock tunes here; there are, in the aforementioned &quot;This Can&amp;#039;t Be Good,&quot; &quot;The More I Drink,&quot; and to a slightly lesser degree &quot;I Have Been Lonely,&quot; with its acoustic and electric guitar shuffles and popping snare drums. But even in these songs, Shelton&amp;#039;s ability as a singer (with help from Rachel Proctor on harmony vocals) to get the message across over the music is rather startling. His previous three recordings offered him a solid ground to get this one across. To build on what he&amp;#039;s accomplished as an artist he&amp;#039;s reached inside himself to pull these songs off so convincingly. The album ends with &quot;The Last Country Song,&quot; written by Shelton and Braddock. It&amp;#039;s a stellar, hard-driving country-rock song that offers a very insightful view of how music itself is changing as the landscape changes as corporate interests swallow up the land the music got made on, with help from John Anderson and George Jones quoting from their own songs &quot;Swingin&amp;#039;&quot; and &quot;He Stopped Loving Her Today.&quot; Pure BS is the album Shelton&amp;#039;s been waiting to make his entire career and gives us an absolutely stunning new view of an established artist who is here to stay. \n\n____________________________________________________________________\n\n             Blake Shelton - Pure BS (Deluxe Edition)\n____________________________________________________________________\n\n\n   Artist  : Blake Shelton\n   Album   : Pure BS (Deluxe Edition)\n\n   Genre   : Country\n   Label   : Warner Bros\n\n   Source  : CDDA\n   Size    : 72,3 MB\n\n   Quality : VBRkbps\n           : 44.1kHz\n           : Joint\n____________________________________________________________________\n\n   Tracklist:\n____________________________________________________________________\n\n   01    This Can&amp;#039;t Be Good                                  03:33\n   02    Don&amp;#039;t Make Me                                       04:07\n   03    The More I Drink                                    03:37\n   04    I Don&amp;#039;t Care                                        03:52\n   05    She Don&amp;#039;t Love Me                                   03:04\n   06    Back There Again                                    04:18\n   07    It Ain&amp;#039;t Easy Bein&amp;#039; Me                              03:20\n   08    What I Wouldn&amp;#039;t Give                                04:22\n   09    I Have Been Lonely                                  03:15\n   10    She Can&amp;#039;t Get That                                  03:46\n   11    The Last Country Song                               03:24\n   12    Chances                                             03:53\n   13    I Can&amp;#039;t Walk Away                                   03:43\n   14    Home                                                03:50\n\n                                              Total Runtime: 52:04\n____________________________________________________________________\n\n   Release Notes:\n____________________________________________________________________\n\n  Now, there&amp;#039;s red-haired blue ticks all in the south...\n  Love got me in here and love got me ouuuuuutttttttttt\n\n____________________________________________________________________\n","torrent":{"xt":"urn:btih:793ac8c8f712e2ea35dd8d9bfdb8710dbe349cb9","amp;dn":"Blake+Shelton+-+Pure+BS+%28Deluxe+Edition%29+%282008-VBR-Country%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"793ac8c8f712e2ea35dd8d9bfdb8710dbe349cb9","infoHashBuffer":{"type":"Buffer","data":[121,58,200,200,247,18,226,234,53,221,141,155,253,184,113,13,190,52,156,185]},"announce":[],"urlList":[]}}