{"title":"Chelsea Handler_ My Horizontal Life_ MP3","uid":4828172,"size":359968474,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7949b65cb390786146c0e63440bcedcc65d7cf75&amp;dn=Chelsea+Handler_+My+Horizontal+Life_+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KwyjiboLinguist","files":18,"time":1239029813,"description":"Chelsea's first book which is read by actress and director Cassandra Campbell\n***********************************************************\n\nMy Horizontal Life: A Collection of One-Night Stands.\nFirst Sentence:\nI WAS SEVEN years old when my sister told me she'd give me five dollars to run upstairs into my parents' room while they were having sex and take a picture.\n\n&quot;There are other funny stories included in this book that, while hilarious - ... waking up on someone's couch after a Halloween party, getting locked out of said apartment and having to walk home and break into her own apartment while still wearing her M&amp;M's costume from the night before - they're not about one-night stands or anything remotely sexual.&quot;            \n                                 - Stephanie Sims - Celebrity News Service Reporter\n\n*********************************************************\nPublished in 2005, it STILL receives wonderful reviews on Amazon:\n\n5.0 out of 5 stars Hilarious\nI thought this book was GREAT, I could not stop laughing or reading...now I am passing this around to my friends. A definite buy for a quick read with lots of laughs!!\nPublished 2 days ago by A. Deerwester\n\n5.0 out of 5 stars Hilarious!\nI read this book after reading Handler's other book, Are You There Vodka, It's Me Chelsea. Both books are hilarious and very entertaining light reads.\nPublished 2 days ago by K. Mulhall\n\n5.0 out of 5 stars MORE, Chelsea! MORE!!\nFor those who complained about this being trashy...if you've ever caught Chelsea Handler before on late nights, you would have known that she's brash, offensive to all (she...\nPublished 3 days ago by Christina\n\n5.0 out of 5 stars FABULOUS!\nEveryone should buy a copy of this hilarious memoir. Whether it be for yourself or a stocking stuffer, there's bound to be a few people in the family who will enjoy this book...\nPublished 6 days ago by Megan Hall\n\n5.0 out of 5 stars love love love Chelsea\nShe has the tell it like we think it sense of humor, she isnt afraid to say things that may offend, and most of us have thought it before, her book keeps you laughing!\nPublished 7 days ago by J. Spear\n\n5.0 out of 5 stars FUNNY!\nI have read a lot of &quot;funny&quot; books, but this is the funniest thing I have ever read. It's frank, slightly vulgar, and HILARIOUS!\nPublished 8 days ago by Lauren\n\n**********************************************************\nIn a word: hilarious. In two: absolutely hilarious. These are some of the funniest stories I have ever read and they''re also some of the most unexpectedly heartfelt.&quot; (Laura Zigman, author of Animal Husbandry, Dating Big Bird, and Her )\n\n&quot;Chelsea Handler is a terrific comedian and a hilarious writer.&quot; (Jay Leno )\n\n&quot;This book is no-holds-barred hilarious.&quot; (Jennifer Weiner, author of In Her Shoes and Little Earthquakes )\n\n&quot;[Chelsea] just might be funnier than David Sedaris.&quot; (Dallas Observer )\n\n&quot;Prime reading material for anyone looking to laugh their hiney off.&quot; (About.com )\n\n*********************************************\nFor Chelseas most recent book in MP3 format: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4826261/CHELSEA_HANDLER_ARE_YOU_THERE_VODKA_MP3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4826261/CHELSEA_HANDLER_ARE_YOU_THERE_VODKA_MP3&lt;/a&gt;","torrent":{"xt":"urn:btih:7949b65cb390786146c0e63440bcedcc65d7cf75","amp;dn":"Chelsea+Handler_+My+Horizontal+Life_+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7949b65cb390786146c0e63440bcedcc65d7cf75","infoHashBuffer":{"type":"Buffer","data":[121,73,182,92,179,144,120,97,70,192,230,52,64,188,237,204,101,215,207,117]},"announce":[],"urlList":[]}}