{"title":"Shmuel Yosef Agnon - Nobel Prize in Literature, 1966 (8 books)","uid":11768302,"size":22392713,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:79ae7b0e5841cd7f6c9b50d6f9dea4c6007ca4af&amp;dn=Shmuel+Yosef+Agnon+-+Nobel+Prize+in+Literature%2C+1966+%288+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"workerbee","files":23,"time":1426955481,"description":"\nSHMUEL YOSEF AGNON (1888-1970) was born in eastern Galicia (then Austria-Hungary) and immigrated to Palestine in 1908, where he became one of the central figures of modern Hebrew literature.  He twice received the Bialik Prize for literature (1934 and 1950) as well as the Israel Prize for literature (1954 and 1958).  He was the co-recipient (with Nelly Sachs) of the 1966 Nobel Prize in Literature &quot;for his profoundly characteristic narrative art with motifs from the life of the Jewish people.&quot;\n\nCalled &quot;a man of unquestionable genius&quot; and &quot;one of the great storytellers of our time,&quot; Agnon's unique style and language influenced the writing of subsequent generations of Hebrew authors.  Much of his works deal with the conflict between the traditional Jewish life and language and the modern world.  It also attempts to recapture the fading traditions of the European shtetl (village), but his stories are never a simple act of preservation.  Agnon's tales deal with the most important psychological and philosophical problems of his generation.  &quot;Via realistic and surrealistic modes,&quot; the New York Times wrote, &quot;Agnon has transmuted in his many words the tensions inherent in modern man's loss of innocence, and his spiritual turmoil when removed from home, homeland and faith.&quot;\n\nA SIMPLE STORY (1935) is a short novel about a young man, his search for a bride, and the lessons of marriage.  Set in a small town in Jewish Galicia at the beginning of the twentieth century, this engaging tale reveals the profound psychological and social insights of the Agnon's finest fiction.\n\nONLY YESTERDAY (1945), his most celebrated work, tells a seemingly simple tale about a man who immigrates to Palestine with the Second Aliya -- the several hundred idealists who returned between 1904 and 1914 to work the Hebrew soil as in Biblical times and revive Hebrew culture.  The novel quickly became recognized as a monumental work of world literature, but not only for its vivid historical reconstruction of Israel's founding society.  This epic novel also engages the reader in a fascinating network of meanings, contradictions, and paradoxes all leading to the question: what, if anything, controls human existence?\n\nTWO TALES contains two short novellas, each belonging to a different cycle in Agnon's literary corpus.  BETROTHED (1943) portrays a teacher, whose love for the sea and all that it holds leads him to the town of Jaffa.  Though many pursue him, Rechnitz eschews romantic love for his studies until he can no longer resist.  The second tale, EDO AND ENAM (1950), is set after World War II in Jerusalem and considers how love evolves throughout the course of a marriage.  Both stories transcend their respective locales and cast of characters as tradition and mythic symbols interplay with reality.\n\nTHE PARABLE AND ITS LESSON is set shortly after the massacres of hundreds of Jewish communities in the Ukraine in 1648 and tells the tale of a journey into the Netherworld taken by a rabbi and his young assistant. What the rabbi finds in his infernal journey is a series of troubling theological contradictions that bear on divine justice.  Agnon's story gives us a fascinating window onto a community in the throes of mourning its losses and reconstituting its spiritual, communal, and economic life in the aftermath of catastrophe.\n\nSHIRA (1971) is Agnon's final, epic novel that was unfinished at the time of his death.  Enacted against the background of Jerusalem life in the gathering shadows of a historical cataclysm of inconceivable proportions, Shira is so brilliantly rendered that, even without an ending, it deserves a place among the major modern novels.  This is a newly revised English translation by Zeva Shapiro, including archival material never before published in English and a newly illustrated Afterword by Robert Alter. \n\nTWO SCHOLARS WHO WERE IN OUR TOWN includes the title novella plus several others.  &quot;Two Scholars&quot; tells of the epic clash between two Torah scholars who according to the Talmudic phrase cannot abide each other in matters of halakhah.  Related from a point three or four generations after the action, the narrator waxes nostalgic even elegiac for a time when Torah was beloved by Israel and the entire glory of a man was Torah, and yet, as the plot unwinds and insults are traded in the Study House, an ancient Talmudic curse begins to work its dark power, leading to the tragic denouement.\n\nTWENTY-ONE STORIES collects a number of Agnon's short fictions and is a good representation of his subtle form of writing.  He is heavily influenced by fable and fairy tales, and many of the stories have the dream-like, simple quality of a children's stories (&quot;The Lady and the Peddler&quot;, &quot;First Kiss&quot;).  A number of these stories are considered masterpieces (&quot;Agunot&quot;, &quot;The Doctor's Divorce&quot;).  Although deeply indebted to the Jewish Diaspora experience, with its traditions and religious context, Agnon was very much a modernist.  All the stories in this collection embody a kind of disjointedness which says less about the skills of the writer and more about the world he wrote about: this is a world of discontinuities where there are often strange shifts in daily life and the end comes quite abruptly.\n\n\nThe following books are in PDF or ePUB/MOBI format as indicated:\n\n* NOBEL PRIZE LIBRARY: S. Y. Agnon &amp; Ivo AndriÄ‡ (Alexis Gregory, 1971).  Includes Presentation and Acceptance Speeches / Two Tales / Biography &amp; more. -- PDF\n\n* ONLY YESTERDAY (Princeton UP, 2002).  Translated by Barbara Harshav. -- PDF\n\n* THE PARABLE AND ITS LESSON: A Novella (Stanford UP, 2014).  Translated and annotated by James S. Diamond, with an Introduction and Critical Essay by Alan Mintz. -- ePUB/MOBI\n\n* SHIRA (Toby, 2013).  Newly revised translation by Zeva Shapiro, with an illustrated Afterword by Robert Alter. -- ePUB/MOBI\n\n* A SIMPLE STORY (Toby, 2014).  Newly revised translation by Hillel Halkin. -- ePUB/MOBI\n\n* TWENTY-ONE STORIES (Schocken, 1970).  Edited by Nahum N. Glatzer. -- PDF\n\n* TWO SCHOLARS WHO WERE IN OUR TOWN &amp; OTHER NOVELLAS (Toby, 2014).  New and revised translation by Jeffrey Saks. -- ePUB/MOBI\n\n* TWO TALES: Betrothed / Edo and Enam (Schocken, 1966 / Toby, 2014).  Translated by Walter Lever; revised and annotated by Jeffrey Saks. -- PDF + ePUB/MOBI\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n        &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;  \n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:79ae7b0e5841cd7f6c9b50d6f9dea4c6007ca4af","amp;dn":"Shmuel+Yosef+Agnon+-+Nobel+Prize+in+Literature%2C+1966+%288+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79ae7b0e5841cd7f6c9b50d6f9dea4c6007ca4af","infoHashBuffer":{"type":"Buffer","data":[121,174,123,14,88,65,205,127,108,155,80,214,249,222,164,198,0,124,164,175]},"announce":[],"urlList":[]}}