{"title":"DOOM STONER PROG METAL Night Sun - 1972 - Mournin'  !Amazing!","uid":3528209,"size":98215936,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:79be2fded8803978d406937dcd317917a3c84f9b&amp;dn=DOOM+STONER+PROG+METAL+Night+Sun+-+1972+-+Mournin%5C%27++%21Amazing%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"r0b0c0p","files":9,"time":1159028971,"description":"PLEASE DON&amp;#039;T FORGET TO SAY THANKS!!! \nMY LAST POST HAD 100+ DOWNLOADS AND ABOUT 20 THANKS, SHAMEFULL!!\n\nBand: Night Sun\nAlbum: Mournin&amp;#039;\nYear: 1972\nCountry Of Origin: Germany\n\nBit Rate: 320 kbit/sec, CBR (Lame - High Quality) \nSize: 94 Mb\nTracker: &lt;a href=&quot; http://tracker.prq.to/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://tracker.prq.to/announce&lt;/a&gt;\n\nThis is an incredible find for any rock fans, from death metal to thrash to stoner to classic rock. A german band, in 1972 they mixed up frantic prog and early doom metal, to make some of the most exciting and heavy music i&amp;#039;ve ever heard from the period. They will intrigue anyone who?s into the early development of hard rock and metal.\n\nThe first two tracks show off twisting proggy start-stop dynamics. Metal is perfectly represented on Track 3 &amp;#039;Got A Bone Of My Own&amp;#039;, which has a long haunting build up to fantastically sludgy riff, and track 5 &amp;#039;Living With The Dying&amp;#039;, which has an evil intro and doomy staccato riffing. Then there is track 6, the beautiful affecting mellow song ?Come down?. All the other tracks demonstrate various combinations of these elements.\n\nAll over this album there is amazing talent and variation, the vocals range from loosing-it screaming, power metal shrieking, to hauntingly emotional. The guitar playing shows equal ability between weightiness, complexity and fragility. The songs all contain considered pauses and spaces, which makes their heaviness even more jarring. There is also a general air of extremity and nastiness that I?m yet to hear on anything else this old, barring Sabbath. In some ways I would consider their sound to be more complete and extreme than Sabbath in that they show a more disparate range of styles, including the frantic keyboard playing which complements the riffs perfectly. This range of dynamics gives them more in common with the complexity and progressive nature of modern extreme metal than Sabbath.\n\nI feel they were way-ahead of their time and that if this band had developed beyond this 1972  album release, it would have benefited heavy metal the world over, alas they only made one album and gained no notoriety. They are an amazingly well kept secret and a joy to discover.\n\n","torrent":{"xt":"urn:btih:79be2fded8803978d406937dcd317917a3c84f9b","amp;dn":"DOOM+STONER+PROG+METAL+Night+Sun+-+1972+-+Mournin%5C%27++%21Amazing%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79be2fded8803978d406937dcd317917a3c84f9b","infoHashBuffer":{"type":"Buffer","data":[121,190,47,222,216,128,57,120,212,6,147,125,205,49,121,23,163,200,79,155]},"announce":[],"urlList":[]}}