{"title":"Water's Edge - Robert Whitlow.epub","uid":10022931,"size":572431,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:79c936bfb881d25a036e0d5dc2087862d70e60f4&amp;dn=Water%27s+Edge+-+Robert+Whitlow.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1398225756,"description":"Sometimes small towns hold the biggest secrets.\n\nAmbitious young attorney Tom Crane is about to become a partner in a high-profile Atlanta law firm. But first he must clear one final matter from his docket-the closing of his deceased father's law practice in his hometown of Bethel, Georgia. Killed in a mysterious boating accident, John Crane didn't appear to leave his son anything except the hassle of wrapping up loose ends.\n\nBut instead of celebrating his promotion, Tom finds himself packing up his office, having suddenly been &quot;consolidated.&quot; To add insult to injury, that same night his girlfriend breaks up with him . . . by letter.\n\nReturning to Bethel with no sense of his future and no faith to fall back on, Tom just wants to settle his father's final affairs and get back to Atlanta. But then he runs into an unexpected roadblock-two million dollars of unclaimed money stashed in a secret bank account. And evidence that his father's death may not have been accidental. Worse still, a trail of data suggests his father played a role in an international fraud operation.\n\nTom follows the money into a tangled web of lies, theft, and betrayal. Along the way, he meets a woman who is as beguiling as she is beautiful. And her interest in the outcome of the case is just as high as his. She challenges Tom's assumptions . . . and his faith. Now he has to decide who he can trust-and how far a father's love can reach.","torrent":{"xt":"urn:btih:79c936bfb881d25a036e0d5dc2087862d70e60f4","amp;dn":"Water%27s+Edge+-+Robert+Whitlow.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79c936bfb881d25a036e0d5dc2087862d70e60f4","infoHashBuffer":{"type":"Buffer","data":[121,201,54,191,184,129,210,90,3,110,13,93,194,8,120,98,215,14,96,244]},"announce":[],"urlList":[]}}