{"title":"Story Fix - Larry Brooks","uid":12969682,"size":417897,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:79fbb745a943a22176c5f8ef1ce01c94b1adee6d&amp;dn=Story+Fix+-+Larry+Brooks&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZamKhan","files":1,"time":1449930759,"description":"Reinvigorate Your Fiction!\r\n\r\nYou've written the first draft of your novel or screenplay, and you've released it into the world: to your critique group, to your most trusted beta readers, or even to an agent or an editor. But something's wrong. You're not getting the glowing response you had expected, or you might have even received a rejection. Your story is getting a &quot;Meh...&quot; when you had hoped for an &quot;Amazing!&quot;\r\n\r\nBut have no fear--the piece you've sweated and bled over isn't dead on arrival. It just needs fixing.\r\n\r\nStory Fix is the answer to your revision needs. With practical techniques from critically acclaimed author and story coach Larry Brooks, you will learn how to:\r\n\r\nDevelop a story-fixing mind-set\r\nNavigate the two essential realms of revision: story and execution\r\nEvaluate your novel or screenplay against twelve crucial storytelling elements and essences.\r\nStrengthen your concept and premise.\r\nPunch up the dramatic tension, pacing, thematic weight, characterization, and more.\r\nAlign your story with proven structural principles.\r\n\r\nFilled with candid advice on the realities of the publishing world and helpful case studies of real authors who fixed their own stories, Story Fix isn't just about revision--it's about resurrection. Infuse your fiction with a much-needed jolt of electricity, and bring it back to life.\r\n\r\n&quot;Larry Brooks is a superb storyteller and teacher. If anyone can fix your novel, it's him. Put this one on your desk and read it often.&quot; --Robert Dugoni, #1 Amazon and New York Times best-selling author of My Sister's Grave\r\n\r\n&quot;Story Fix is the ultimate writer's companion for taking any manuscript to the next level. A staple for the beginner, a refresher for the pro.&quot; --Joe Moore, #1 Amazon and international best-selling co-author of The Blade and The Shield","torrent":{"xt":"urn:btih:79fbb745a943a22176c5f8ef1ce01c94b1adee6d","amp;dn":"Story+Fix+-+Larry+Brooks","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79fbb745a943a22176c5f8ef1ce01c94b1adee6d","infoHashBuffer":{"type":"Buffer","data":[121,251,183,69,169,67,162,33,118,197,248,239,28,224,28,148,177,173,238,109]},"announce":[],"urlList":[]}}