{"title":"Two Worlds II 2 [Mac]","uid":6806229,"size":3592313238,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:7a2fb185622c90445d52df50d019921c9623a689&amp;dn=Two+Worlds+II+2+%5BMac%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"FatFreddy347","files":-1,"time":1320872589,"description":"Two Worlds 2\n\nNative Mac Port\n\nSometimes you just can't choose your company...\nof all the races that could have freed you from Gandohar's dungeons, why on earth does a troop of normally hostile Orcs decide to do it?\n\nThat road and your journey begin here. Your voyage will take you from the incredible bustling cityscapes of Hatmandor and New Ashos, through the massive and stunning Antaloor countryside, all the way to the darkest forgotten corners of the world. Forge alliances and seek out those in need of assistance. But be mindful of your decission, they often bear consequences with a further reach than you may realize. \n\nCharge in to battle using variable tactics and weaponry. Information can be more valuable than the most precious of stones. Utilize intuition and sound judgment to unearth your enemy's secrets. Make use of the vast array of specializations and crafting methods to better tailor your skills and abilities. Master crafting to customize armor and weaponry, brew complex potions, and craft unique and powerful spells.\n\nTeam up with friends to explore the five different game modes offered in multiplayer. You can even manage your own village whilst exploring the surrounding landscape and questing with the added help of your friends.\n\n\n\n- Powerful campaign narrative, with plenty of unexpected twists and turns along the way and countless side quests provide enlightening revelations and useful rewards\n- Extensive Character Development system - a huge skill tree giving the player total control over their class and how they want to play\n- Flexible combat system with variable attack moves, parrying and special tricks. along with state-of-the-art technology, thanks to a powerful GRACE game engine and special tools\n- Complex object management with movable and usable items, and the special &quot;CRAFT Tool&quot; that enables individual configuration of armor and weapon\n- Lots of mini-games for breaking up gameplay and an intuitive user interface for the D.E.M.O.N.S Magic system and the PAPAK Alchemy system\n\nSystem requirements: \n\nMinimum:\nOS: MACOSX 10.6,\nCPU: Intel Core2Duo CPU,\nRAM: 2 GB RAM,\nGraphics: NVIDIA GF 8800 or AMD RADEON HD\n\nRecommended:\nOS: MACOSX 10.6 or higher,\nCPU: Intel Core i5 CPU,\nRAM: 4 GB RAM,\nGraphics: AMD Radeon HD 5750 1GB\n\n\nTopWare Interactive","torrent":{"xt":"urn:btih:7a2fb185622c90445d52df50d019921c9623a689","amp;dn":"Two+Worlds+II+2+%5BMac%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a2fb185622c90445d52df50d019921c9623a689","infoHashBuffer":{"type":"Buffer","data":[122,47,177,133,98,44,144,68,93,82,223,80,208,25,146,28,150,35,166,137]},"announce":[],"urlList":[]}}