{"title":"Philip Zimbardo: How ordinary people become monsters ... or hero","uid":4569056,"size":79293945,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7a400c0f88f658a7e3794e3ee60ec28583c3d5be&amp;dn=Philip+Zimbardo%3A+How+ordinary+people+become+monsters+...+or+hero&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1228991193,"description":"Philip Zimbardo: How ordinary people become monsters ... or heroes\n\nPhilip Zimbardo knows how easy it is for nice people to turn bad. In this talk, he shares insights and graphic unseen photos from the Abu Ghraib trials. Then he talks about the flip side: how easy it is to be a hero, and how we can rise to the challenge.\n\nPhilip Zimbardo was the leader of the notorious 1971 Stanford Prison Experiment -- and an expert witness at Abu Ghraib. His book The Lucifer Effect explores the nature of evil; now, in his new work, he studies the nature of heroism.\n\nPhilip Zimbardo knows what evil looks like. After serving as an expert witness during the Abu Ghraib trials, he wrote The Lucifer Effect: Understanding How Good People Turn Evil. From Nazi comic books to the tactics of used-car salesmen, he explores a wealth of sources in trying to explain the psychology of evil.\n\nA past president of the American Psychological Association and a professor emeritus at Stanford, Zimbardo retired in 2008 from lecturing, after 50 years of teaching his legendary introductory course in psychology. In addition to his work on evil and heroism, Zimbardo recently published The Time Paradox, exploring different cultural and personal perspectives on time.\n\nStill well-known for his controversial Stanford Prison Experiment, Zimbardo in his new research looks at the psychology of heroism. He asks, &quot;What pushes some people to become perpetrators of evil, while others act heroically on behalf of those in need?&quot;\n\n    &quot;Professor Zimbardo deserves heartfelt thanks for disclosing and illuminating the dark, hidden corners of the human soul.&quot;\n\nVÃƒÂ¡clav Havel, former president of the Czech Republic","torrent":{"xt":"urn:btih:7a400c0f88f658a7e3794e3ee60ec28583c3d5be","amp;dn":"Philip+Zimbardo%3A+How+ordinary+people+become+monsters+...+or+hero","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a400c0f88f658a7e3794e3ee60ec28583c3d5be","infoHashBuffer":{"type":"Buffer","data":[122,64,12,15,136,246,88,167,227,121,78,62,230,14,194,133,131,195,213,190]},"announce":[],"urlList":[]}}