{"title":"AFRICA - Songs &amp; Instrumental Music of Tanganyika (vinyl rip)","uid":4683196,"size":64876088,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7a9708478add68359066e489f3b554bca52147c4&amp;dn=AFRICA+-+Songs+%26+Instrumental+Music+of+Tanganyika+%28vinyl+rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starinar","files":25,"time":1233103950,"description":"CLICK ON starinar TO GET MORE TRIBAL, RITUAL, SACRED AND INDIGENOUS MUSIC. ENJoY!\n\nHUGH TRACEY RECORDINGS - Songs &amp; Instrumental Music of Tanganyika\n\nHugh Tracey (1903-77) was an English farmer in South Africa who couldn't understand why no one was interested in native music or traditions and set out to document it. His archive constitutes the collective musical memory of half the continent. He had great taste and superb skill with the simple recording equipment he used. The Bosco material is particularly important because two songs, &quot;Masanga&quot; and &quot;Mama na mwana,&quot; were included on the breakthrough GUITARS OF AFRICA record (Decca LF1170 1952) and one of them, &quot;Masanga&quot; (which I call the &quot;Classical Gas&quot; of Africa), was picked to lead off the African Music Society's LP BEST MUSIC FOR 1952. Consequently Pete Seeger and other American folkies learned to play it and the finger-picking style of Bosco became a test of musical prowess for young guitarists. &quot;Mama na mwana&quot; was included on ORIGINS OF GUITAR MUSIC (SWP015/HT09) but I was surprised that &quot;Masanga&quot; was omitted. It is here, in all its impeccable clockwork precision, like a Bach prelude &amp; fugue, along with five more tracks. Producer Michael Baird points out that only two songs survived in the archive but then he came across a radio air-check tape where Tracey had played the whole session! So now we are the fortunate beneficiaries of this treasure trove of early African music.\n\nHiQuality: 320Kbps + full cover scans (vinyl rip)\n\n\n\nThis OLD collection of Hugh Tracey recordings is very hard to get.\nI released No.1, No.7 and No.8 - If you have any other recordings \nof the old collection please let us know - just post a comment. \nThank you!","torrent":{"xt":"urn:btih:7a9708478add68359066e489f3b554bca52147c4","amp;dn":"AFRICA+-+Songs+%26+Instrumental+Music+of+Tanganyika+%28vinyl+rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a9708478add68359066e489f3b554bca52147c4","infoHashBuffer":{"type":"Buffer","data":[122,151,8,71,138,221,104,53,144,102,228,137,243,181,84,188,165,33,71,196]},"announce":[],"urlList":[]}}