{"title":"Educator.com - General Statistics with Dr. Ji Son","uid":9469111,"size":4200352106,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7b1cac5ca2c6b1ee8656c20706e392be39fe6e5a&amp;dn=Educator.com+-+General+Statistics+with+Dr.+Ji+Son&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":5,"uploader":"ahnaqsh2","files":70,"time":1389518344,"description":"In Educator's General Statistics course, Dr. Ji Son covers information applicable for both high school and college statistics courses. She teaches through a combination of equations, diagrams, and relevant examples. Dr. Son also uses Excel to breakdown the difficult concepts of statistics into understandable and memorable ideas. Topics include everything from Central Tendency and Normal Distribution to Correlation, Probability, and Hypothesis Testing. Dr. Son has a Ph.D. in Psychology and Cognitive Science and is a published researcher on how people learn and apply abstract concepts.\n\nTotal Length - 36:33\n\nVideo Format\nContainer: MKV\nCodec: H264 @ 128 kbps\n\nAudio Format: \nCodec: MP3 @ 128 kbps\n\nThe program i used to download the videos was flashgot (a firefox addon). Two videos will be downloaded, one labeled &quot;cam&quot; at the end and the other labeled with &quot;Tablet&quot;. The tablet is video only with no audio and the cam is video of the professor speaking. I used the program MKVmerge to mix the video of the tablet with the audio of the cam. \n\nThe downloaded files are FLV format which doesn't work with MKVmerge. So it's necessary to first extract the audio and video streams, which you can do with a program called FLVextract. Once extracted, you'll get AVI files and an MP3 file. These file types do work with MKVmerge. \n\nto Siddiee - The original FLV videos use a codec called VP6. It's possible that your browser is able to play it but your video player can't. You need to download the codec to play it (K-Lite Codec Pack worked for me). If that doesn't solve it, convert to H264 like I've done with these videos and see if that works (I used a program called Handbrake). ","torrent":{"xt":"urn:btih:7b1cac5ca2c6b1ee8656c20706e392be39fe6e5a","amp;dn":"Educator.com+-+General+Statistics+with+Dr.+Ji+Son","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b1cac5ca2c6b1ee8656c20706e392be39fe6e5a","infoHashBuffer":{"type":"Buffer","data":[123,28,172,92,162,198,177,238,134,86,194,7,6,227,146,190,57,254,110,90]},"announce":[],"urlList":[]}}