{"title":"Red House Painters - Discography (1992-2001) [FLAC]","uid":8143349,"size":3117044220,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7b36fddf9fe62ccddbc86dd13194d7b44f1aba8f&amp;dn=Red+House+Painters+-+Discography+%281992-2001%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"politux","files":-1,"time":1360856502,"description":"\n  Red House Painters - Discography (1992-2001) [FLAC]\n\n  Genre: Pop/Rock\n  Style: Slowcore, Singer/Songwriter\n  Codec: FLAC\n  Bit Rate: ~ 800 - 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  \n  Albums:\n\n  1992 Down Colorful Hill\n  1993 Red House Painters 1\n  1993 Red House Painters 2\n  1994 Shock Me EP\n  1995 Ocean Beach\n  1996 Songs for a Blue Guitar\n  1999 Retrospective\n  2001 Old Ramon\n\nRed House Painters was primarily the vehicle of singer/songwriter Mark Kozelek, an evocative, compelling performer of rare emotional intensity. Like Mark Eitzel of American Music Club, to whose work the Painters were invariably compared and to whom their early success owed a tremendous debt, Kozelek laid his soul bare on record, conjuring harrowingly acute tales of pain, despair, and loss; unlike Eitzel, Nick Drake, and other poets of decay, Kozelek's autobiographical songs walked their tightrope without a net -- forsaking the safety offered by metaphor and allegory, he faced his demons in the first person, creating a singularly haunting body of work unparalleled in its vulnerability and honesty.\n \n  Kozelek was born and raised in the Midwest, and formed his first band, God Forbid, while in his teens. After relocating to Atlanta, GA, he struck up a friendship with drummer Anthony Koutsos, and formed the first incarnation of Red House Painters. A move to San Francisco followed, where guitarist Gorden Mack and bassist Jerry Vessel rounded out the group's roster.\n\n  While performing on the Bay Area club circuit, the quartet came to the attention of American Music Club's Eitzel, who often named Red House Painters his favorite band. Through Eitzel, a demo tape of recordings cut in 1989 and 1990 made their way to the London offices of 4AD Records, which signed the group and in 1992 issued the unvarnished demos -- a superb collection of spartan, atmospheric melodies lurking behind Kozelek's ghostly vocals -- as the LP Down Colorful Hill.\n\n  In 1993, Red House Painters emerged from the studio with over two-dozen new recordings, which they issued on back-to-back eponymously titled albums. Taken in tandem, the LPs established Kozelek as a unique songwriter capable of conveying stunning emotional depths; compositions like &quot;Grace Cathedral Park,&quot; &quot;Katy Song,&quot; &quot;Strawberry Hill,&quot; &quot;Evil,&quot; and &quot;Uncle Joe&quot; expanded greatly upon the emotional palette evidenced on the first record, unflinchingly detailing Kozelek's erratic, abusive nature and troubled background.\n\n  A two-year lay-off followed, during which time only an EP, Shock Me -- a brief set built around a dramatic reading of an old Kiss song -- appeared in 1994. Finally, the luminous Ocean Beach, a collection of pastoral, almost sunny performances, appeared in 1995, although not without controversy; initially, 4AD did not want to release the record, further straining already tenuous relations between the band and the label.\n\n  When Kozelek began work on a long-discussed solo album, 4AD threw in the towel; the album, a more rock-oriented work dubbed Songs for a Blue Guitar, appeared in 1996 on the Island imprint Supreme. Although Kozelek was the only bandmember to appear on the record, it was nonetheless issued under the Red House Painters name in order to give the group a push as it headed into the second phase of its career. However, the major-label mergers of the late '90s left Red House Painters without a record deal, and their album, Old Ramon, in limbo. During that time, 4AD released the simply titled Retrospective, a best-of collection, and Kozelek kept busy, appearing in Cameron Crowe's critically acclaimed rock &amp; roll love story Almost Famous, and releasing several projects on the Badman label, including a John Denver tribute album, a benefit album for a San Francisco AIDS charity, and Rock 'n' Roll Singer, a mini-album of classic rock covers and new material. Eventually, Kozelek bought back the rights to Old Ramon and Sub Pop released it in spring 2001, nearly four years after it was recorded.","torrent":{"xt":"urn:btih:7b36fddf9fe62ccddbc86dd13194d7b44f1aba8f","amp;dn":"Red+House+Painters+-+Discography+%281992-2001%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b36fddf9fe62ccddbc86dd13194d7b44f1aba8f","infoHashBuffer":{"type":"Buffer","data":[123,54,253,223,159,230,44,205,219,200,109,209,49,148,215,180,79,26,186,143]},"announce":[],"urlList":[]}}