{"title":"William Elliott Whitmore...Field Songs(2011)[FLAC]","uid":7285779,"size":189514565,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7b3a35acceab4704e51c602d8a1674256ea0a488&amp;dn=William+Elliott+Whitmore...Field+Songs%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":13,"time":1337579771,"description":"On first listen, Field Songs may seem more related to the concerns of his earlier trilogy of recordings; one whose focus expresses only the necessity of returning to life's basics as seen from the front porch of a farmhouse. It's where this album begins and ends geographically. That said, Field Songs, structured as an eight-song cycle to be taken in one sitting, has implications that are far wider--it contains the entire world. With the sound of actual field recordings of birds and crickets chirping throughout these songs, a grander vision unfolds. It begins with &quot;Lay Your Burdens Down,&quot; where Whitmore urges the listener to shed what holds her back and uses his own history to illustrate the consequence of not doing so. His strummed banjo links a chain from ancient griots and farmers to survivors of war and poverty, to prisoners and all oppressed people in asking the question: &quot;How long can this night time last?&quot; In &quot;Field Song,&quot; driven by a choppy, percussive guitar, Whitmore remembers &quot;three square meals and a livin' wage&quot; as the &quot;good old days,&quot; before the &quot;Manifest Destiny of the factory farms.&quot; He even asserts &quot;much was lost when the West was won,&quot; that the gilded age is over; the best of times have yet to come if only we get into the field and do the work. What work? It may be building a house with our own hands, or it may be organizing with others.\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/about/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/about/&lt;/a&gt;","torrent":{"xt":"urn:btih:7b3a35acceab4704e51c602d8a1674256ea0a488","amp;dn":"William+Elliott+Whitmore...Field+Songs%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b3a35acceab4704e51c602d8a1674256ea0a488","infoHashBuffer":{"type":"Buffer","data":[123,58,53,172,206,171,71,4,229,28,96,45,138,22,116,37,110,160,164,136]},"announce":[],"urlList":[]}}