{"title":"Portable Architecture - Design and Technology (Art Ebook).pdf","uid":10503431,"size":28465972,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b5038a6c4aa20da9e0c3a8164255e5129ab4c0b&amp;dn=Portable+Architecture+-+Design+and+Technology+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1404732019,"description":"Portable Architecture: Design and Technology by Robert Kronenburg\nEnglish | 2008 | ISBN-10: 3764383240 | 160 pages | PDF | 27,4 MB\n\nSince the earliest people lived as nomads, their buildings were portable, constructed in a way that allowed them to be rebuilt as they moved to new locations for better living conditions as the seasons changed. \n\nThis book discusses the forerunners, present context, and technology of portable architecture. It documents numerous international examples, organized by areas of application, and offers a broad array of suggestions for practical design. In the Arts and Culture section, Shigeru Bans Nomadic Museum, made of shipping containers in the USA and Japan is examined, as is Mark Fishers event architecture for concert tours by the Rolling Stones and U2. Suggestions for flexible living include Richard Hordens micro compact home and the Container Home Kit from LOT/EK. The design of mobile structures used in extreme situations, such as the Antarctic or in the aftermath of natural catastrophes, is explored. Exhibition and entertainment facilities are other typical areas of application for light, mobile structures. Demountable, temporary structures allow for exciting architectural experimentation which can then be prototyped for regular use.","torrent":{"xt":"urn:btih:7b5038a6c4aa20da9e0c3a8164255e5129ab4c0b","amp;dn":"Portable+Architecture+-+Design+and+Technology+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b5038a6c4aa20da9e0c3a8164255e5129ab4c0b","infoHashBuffer":{"type":"Buffer","data":[123,80,56,166,196,170,32,218,158,12,58,129,100,37,94,81,41,171,76,11]},"announce":[],"urlList":[]}}