{"title":"On Killing: The Psychological Cost of Learning to Kill in War an","uid":4467138,"size":2099388,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7bb1bb4c0adc1e9b87536914b907c6d7bc00af40&amp;dn=On+Killing%3A+The+Psychological+Cost+of+Learning+to+Kill+in+War+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":2,"time":1224962517,"description":"On Killing: The Psychological Cost of Learning to Kill in War and Society\n\n&quot;The twentieth century, with its bloody world wars, revolutions, and genocides accounting for hundreds of millions dead, would seem to prove that human beings are incredibly vicious predators and that killing is as natural as eating. But Lieutenant Colonel Dave Grossman, a psychologist and U.S. Army Ranger, demonstrates this is not the case. The good news, according to Grossman - drawing on dozens of interviews, first-person reports, and historic studies of combat, ranging from Frederick the Great&amp;#039;s battles in the eighteenth century through Vietnam - is that the vast majority of soldiers are loath to kill. In World War II, for instance, only 15 to 25 percent of combat infantry were willing to fire their rifles. The provocative news is that modern armies, using Pavlovian and operant conditioning, have learned how to overcome this reluctance. In Korea about 50 percent of combat infantry were willing to shoot, and in Vietnam the figure rose to over 90 percent. The bad news is that by conditioning soldiers to overcome their instinctive loathing of killing, we have drastically increased post-combat stress - witness the devastated psychological state of our Vietnam vets as compared with those from earlier wars. And the truly terrible news is that contemporary civilian society, particularly the media, replicates the army&amp;#039;s conditioning techniques and - according to Grossman&amp;#039;s controversial thesis - is responsible for our rising rates of murder and violence, particularly among the young. In the explosive last section of the book, he argues that high-body-count movies, television violence (both news and entertainment), and interactive point-and-shoot video games are dangerously similar to the training programs that dehumanize the enemy, desensitize soldiers to the psychological ramifications of killing, and make pulling the trigger an automatic response. \n\nAn eye-opening psychological study of killing in wartime--why soldiers must be trained to kill, how killing affects them, and what the military experience with killing means for society at large. Drawing on dozens of interviews, first-person reports and studies of combat soldiers, Grossman shows that almost all humans have an innate aversion to killing.&quot;\n\nAnother fascinating book.\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world&amp;#039;s longest running largest explosives and weapons forum on the web!\n","torrent":{"xt":"urn:btih:7bb1bb4c0adc1e9b87536914b907c6d7bc00af40","amp;dn":"On+Killing%3A+The+Psychological+Cost+of+Learning+to+Kill+in+War+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bb1bb4c0adc1e9b87536914b907c6d7bc00af40","infoHashBuffer":{"type":"Buffer","data":[123,177,187,76,10,220,30,155,135,83,105,20,185,7,198,215,188,0,175,64]},"announce":[],"urlList":[]}}