{"title":"Ini Kamoze - Debut ( flac ) ","uid":6874642,"size":714755410,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7bbf8741730e4473f63d9dac54014c6facfcd132&amp;dn=Ini+Kamoze+-+Debut+%28+flac+%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"jokersmoker","files":35,"time":1323369640,"description":"\n\n\nA special kind of maverick, Ini Kamoze first came on the reggae scene as a poignant waif, then made a slick and swaggering comeback as the muscular tough guy who sang &quot;Here Comes the Hotstepper,&quot; a global phenomenon that ruled the clubs, radio, and sporting events across the world in the mid-'90s before being dismissed by Kamoze. He's almost always at war with record companies and disappears for a decade at a time for reasons only he knows, plus he releases two CD re-recordings of his earlier hits and decides to call it Debut. While consumers have every right to be angry the outside packaging doesn't willfully give up that this album is mostly new takes on old chestnuts, Debut has its charm fore longtime fans. First off, there are the &quot;Vibin&quot; tracks: snippets from a recent interview with Kamoze that round out his character without ruining his &quot;man of mystery&quot; status. Then there's Kamoze's delivery of the songs with his voice in fine form all these years later and his conviction as strong as ever. Tracks like &quot;Gunshot Respect Not&quot; and &quot;Pirate&quot; also benefit from a beefier 21st century sound while the band -- featuring Earl &quot;Chinna&quot; Smith on guitar and Kamoze himself on bass -- is incredibly tight if a bit unadventurous. It all seems very purposeful so perhaps the title Debut is a reference to Kamoze reclaiming these tracks for himself and re-birthing them with new titles. &quot;Gunshot Respect Not&quot; used to be &quot;Gunshot,&quot; and &quot;World a Reggae&quot; is actually &quot;World-A-Music,&quot; the track Damian &quot;Junior Gong&quot; Marley used as the basis for his massive hit &quot;Welcome to Jamrock,&quot; something Kamoze already exploited with a tossed-off reggaeton update that's not included here thankfully. While fans will enjoy a chance to experience what a lengthy VH1 Storytellers with Kamoze would be like, the two-CD Debut will try the newcomer's patience and they might not make it to the two gems tacked on the end. &quot;World Affairs&quot; and &quot;Trainers Choice&quot; are early-'80s singles from the man, two rare killer cuts in their original recordings, sourced from scratchy vinyl but strong enough to overcome their shaky sound quality. They're gifts for the hardcore, Debut's target audience\n\n\n--------------------------------------------------------------------------------\n\nTrk Song \n1 World a Reggae \n2 Statement \n3 Police \n4 Gunshot Respect Not \n5 Living In A Dream \n6 Reggae General \n7 Burnin' \n8 Wings With Me \n9 Betty Brown's Mother \n10 One of Them Things \n11 Hail Mi Idren \n12 Ital \n13 Betty Brown's Mother \n14 One of Them Things \n15 Vibin' \n16 Hail Mi Idren \n17 Ital \n\n\nDisc 2 \n1 Trouble \n2 Gimme Your Attention \n3 England Be Nice \n4 Taxi \n5 Settle \n6 Queen \n7 Little Love \n8 Pull the Cork \n9 Pirate \n10 Jump For Jah \n11 World Affairs \n12 Trainers Choice \n13 Pirate \n14 Vibin' \n15 Jump For Jah \n16 World Affairs \n17 Trainers Choice \n\n\nWell Enjoyy and Seed this ya one Brothers ........   \nAs i couldnt find a better tracklist ......but this is the original cd ....\n","torrent":{"xt":"urn:btih:7bbf8741730e4473f63d9dac54014c6facfcd132","amp;dn":"Ini+Kamoze+-+Debut+%28+flac+%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bbf8741730e4473f63d9dac54014c6facfcd132","infoHashBuffer":{"type":"Buffer","data":[123,191,135,65,115,14,68,115,246,61,157,172,84,1,76,111,172,252,209,50]},"announce":[],"urlList":[]}}