{"title":"Artful Rainwater Design (2015).pdf Gooner","uid":14013920,"size":58949161,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7bf8eb92b6e59c61b7cb75bf09bbaa02c92f4ad2&amp;dn=Artful+Rainwater+Design+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1458853083,"description":"Artful Rainwater Design - Creative Ways to Manage Stormwater (2015).pdf Gooner\r\n\r\nPublisher: Island Press (May 19, 2015)\r\nLanguage: English\r\nISBN-10: 1610912667\r\nISBN-13: 978-1610912662\r\n\r\nStormwater management as art? Absolutely. Rain is a resource that should be valued and celebrated, not merely treated as an urban design problem—and yet, traditional stormwater treatment methods often range from ugly to forgettable. Artful Rainwater Design shows that it's possible to effectively manage runoff while also creating inviting, attractive landscapes.\r\n \r\nThis beautifully illustrated, comprehensive guide explains how to design creative, yet practical, landscapes that treat on-site stormwater management as an opportunity to enhance site design. Artful Rainwater Design has three main parts: first, the book outlines five amenity-focused goals that might be highlighted in a project: education, recreation, safety, public relations, and aesthetic appeal. Next, it focuses on techniques for ecologically sustainable stormwater management that complement the amenity goals. Finally, it features diverse case studies that show how designers around the country are implementing principles of artful rainwater design.\r\n \r\nArtful Rainwater Design is a must-have resource for landscape architects, urban designers, civil engineers, and architects who won't let stormwater regulations cramp their style, and who understand that for a design to truly be sustainable, people must appreciate and love it. It is a tool for creating landscapes that celebrate rain for the life-giving resource it is—and contribute to more sustainable, healthy, and even fun, built environments","torrent":{"xt":"urn:btih:7bf8eb92b6e59c61b7cb75bf09bbaa02c92f4ad2","amp;dn":"Artful+Rainwater+Design+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bf8eb92b6e59c61b7cb75bf09bbaa02c92f4ad2","infoHashBuffer":{"type":"Buffer","data":[123,248,235,146,182,229,156,97,183,203,117,191,9,187,170,2,201,47,74,210]},"announce":[],"urlList":[]}}