{"title":"The Blackwell History of the Latin Language","uid":5489633,"size":1418308,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c358dca43c593e98810f2a997a18df43a066501&amp;dn=The+Blackwell+History+of+the+Latin+Language&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"artpepper","files":-1,"time":1270916347,"description":"James Clackson, Geoffrey Horrocks, The Blackwell History of the Latin Language\n\nWiley-Blackwell | 2007 | ISBN: 1405162090 | 336 pages | PDF | 1,2 MB\n\n\n\nThe Blackwell History of the Latin Language charts the development of Latin from its prehistoric origins in the Indo-European language family, through the earliest texts, to the creation of the Classical Language of Cicero and Virgil, and examines the impact of the spread of spoken Latin through the Roman Empire. Accessible and intelligent, this is the first book in English in more than 50 years to provide comprehensive coverage of the history of the language.\n\nThe authors make use of contemporary work in linguistics, particularly the insights gained from modern socio-linguistic research, to provide up-to-date commentary on key linguistic issues in the field. Offering a full account of the language's transformation in the context of the rise and fall of Ancient Rome, they examine a number of broad topics, including the impact of Greek, the linguistic implications of Christianity, the tension between written and spoken regional varieties of the language, the lives and social positions of Latin speakers, and the fate of the language in late antiquity and beyond.\n\nThe book includes maps and glossary as well as fully translated and annotated sample texts that illustrate the different stages of the language. Readable and fully up-to-date, The Blackwell History of the Latin Language is ideal for both students and scholars of Latin, linguistics, and ancient history.\n","torrent":{"xt":"urn:btih:7c358dca43c593e98810f2a997a18df43a066501","amp;dn":"The+Blackwell+History+of+the+Latin+Language","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c358dca43c593e98810f2a997a18df43a066501","infoHashBuffer":{"type":"Buffer","data":[124,53,141,202,67,197,147,233,136,16,242,169,151,161,141,244,58,6,101,1]},"announce":[],"urlList":[]}}