{"title":"The Man From Planet X (Edgar G. Ulmer, 1951) [RePoPo]","uid":4414663,"size":1468210457,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7c387fa814f0fdd0a8fafe3d0e267e3110de5d4e&amp;dn=The+Man+From+Planet+X+%28Edgar+G.+Ulmer%2C+1951%29+%5BRePoPo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"repopo","files":6,"time":1222450609,"description":"-------------------------------------------------------------------------------\n                              Technical Information\n-------------------------------------------------------------------------------\nType..................: Movie\nContainer file........: AVI\nVideo Format..........: H.264\nTotal Bitrate.........: 2775Kbps\nAudio format..........: AC3 (untouched)\nAudio Languages.......: English 1.0 Mono\nSubtitles Ripped......: Spanish\nSubtitles in Subpack..: Spanish, French\nResolution............: 640x480\nAspect Ratio..........: 1.37:1\nOriginal Aspect Ratio.: 1.37:1\nColor.................: B/W\nFPS...................: 23.976\nSource................: DVD NTSC\nDuration..............: 01:10:28\nGenre.................: Science-Fiction\nIMDb Rating...........: 5.6\nMovie Information.....: http://www.imdb.com/title/tt0043778/\n\n-------------------------------------------------------------------------------\n                              General Information\n-------------------------------------------------------------------------------\n\nSYNOPSIS: An inexpensive but atmospheric sci-fi film, Man from Planet X takes \nplace on a lonely Scottish island. Science professor Raymond Bond is monitoring \nthe orbit of the mysterious &quot;Planet X,&quot; which has entered the solar system and \nis travelling close to Earth. A spaceship lands from this planet, out of which \npops a strange little man who looks something like an Easter Island statue. He \nhas come to make contact with friendly Earthlings, but evil scientist William \nSchallert wants to exploit the spaceman's highly developed intellect for his own \nselfish ends. Schallert's nastiness turns the alien against the other \nEarthlings; the creature enslaves their minds and transforms them into zombies. \nBoth Schallert and the alien are eventually destroyed--as Planet X, failing to \nestablish a bond with Earth, spirals off into deep space.\n\nCAST:\nRobert Clarke           - John Lawrence\nMargaret Field          - Enid Elliot\nRaymond Bond            - Prof. Elliot\nWilliam Schallert       - Mears\nRoy Engel               - Constable\nCharles Davis           - Geordie\nGilbert Fallman         - Dr. Blane\nTom Daly\n\nCREW\nEdgar G. Ulmer          - Director\nJack Pollexfen          - Producer / Screenwriter\nAubrey Wisberg          - Producer / Screenwriter\nJohn L. Russell         - Cinematographer\nCharles Koff            - Composer (Music Score)\nFred R. Feitshans, Jr.  - Editor\nJoel Moss               - Sound/Sound Designer\nWilliam Randall         - Sound/Sound Designer\nAndy Anderson           - Special Effects\nJack R. Rabin           - Special Effects\nHoward Weeks            - Special Effects\n\n\n-------------------------------------------------------------------------------\nReview\tby Craig Butler\n\nAlthough filmed in six days on a ridiculously low budget (reportedly about \n$50,000), The Man from Planet X manages to be a nifty little sc-fi picture (and \narguably the first of the alien invader sub-genre). Credit director Edgar G. \nUlmer, who knew how to make the most with the least, for the majority of Planet \nX's success. Necessity being the mother of invention, Ulmer chose to shroud his \npainted back drops in the thickest of fogs, creating in the process a film that \nscreams &quot;atmosphere&quot; from the get-go. Ulmer is also an old hand at creating \nsuspense and tension and resolving the same, and the first appearance of the \ntitle character packs a pretty solid wallop, even today and in spite of the \nphoniness of the alien. Note, too, that despite the shock that the appearance \ncarries, Ulmer takes the unusual option of having the character appear not as \nomnipotent but as a creature in need of aid. Indeed, Ulmer and the screenwriters \ndeserve credit for the ambiguity they allow to permeate the script. While the \nalien eventually has plans for world domination on his mind, it's not clear \nwhether he came to Earth with that in mind or whether he might have actually \nbeen willing to consider a more collaborative arrangement. While the screenplay \non the whole is fairly typical of the genre, it is well packaged and plays its \nhand very effectively. Throw in a good &quot;B&quot; cast, and the result is a worthy \nlittle flick that's great to watch on a stormy night.\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------\nIMDB forums (march9hare)\nA diminuative alien arrives on Earth in what looks for all the world like an \noversized Christmas tree ornament and terrorizes a sleepy little Scottish town. \nUltimately, both he and his spaceship are destroyed just as Planet X whisks by \nthe Earth. This early fifties sci-fi effort was rushed into production to \ncapitalize on Howard Hawks' &quot;The Thing&quot;, and looks it. How rushed? Would you \nbelieve a six day shooting schedule? Six days; that's all Mid-Century Films \ncould afford with a budget of less than $60,000. Shot on sets leased from the \nHal Roach Studios (most were originally used in the film &quot;Joan of Arc&quot;) and with \nless-than-convincing backdrops, this film somehow manages to capture a moody \natmosphere that's perfect for the genre. Add to this an eerie score, and you can \njust overlook the genuinely hilarious alien. Everything about this creature \nscreams &quot;CHEAP!!!&quot;, from the obvious duct tape around the mouthpiece to the \ncontrol valve on his backpack that looks like it was stolen from Alice Kramden's \nsink. What optical effects there are are nicely rendered by Jack Glass, and most \nof the performances are okay, especially that of Roy Engel, who plays Constable \nTommy with an accent that would make James Doohan envious. Margaret Field plays \nEnid, Professor Eliot's daughter and the (we guess) love interest for Robert \nClarke, the American reporter. We used the modifier &quot;we guess&quot; because there's \nno chemistry between the two, despite Clarke's repeated - and obvious - \nadvances. A good deal of the dialogue is pretty strained, as well. Example: \nProf. Eliot says to the two: &quot;Let us concentrate on this remarkable object&quot; \nand:&quot;Ssshh! The scale is delicate; it responds to a breath upon it.&quot; Does \nanybody talk like this? Nobody we know. In spite of all this, plus the fact that \nthe terror is somewhat forced and just why the alien's spaceship comes equipped \nwith a hypnotic ray is never explained, believe it or not, &quot;The Man from Planet \nX&quot; isn't really a bad film, just a cheap one, and Robert Schallert fans can add \na star. Try it; believe us, you COULD do worse! \n\n-------------------------------------------------------------------------------\n                                 PLEASE NOTICE\n-------------------------------------------------------------------------------\n\nCheck you have installed the right codecs, as listed in this .nfo file, before\ntrying to play it.  VLC will play this file without having to install any codec.\n\nIf you don't like the codec(s), container, resolution, file size, languages or\nany technical aspect on this rip, keep it to yourself and go and do your own.\n\nSerious feedback on quality will always be welcome\n\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:7c387fa814f0fdd0a8fafe3d0e267e3110de5d4e","amp;dn":"The+Man+From+Planet+X+%28Edgar+G.+Ulmer%2C+1951%29+%5BRePoPo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c387fa814f0fdd0a8fafe3d0e267e3110de5d4e","infoHashBuffer":{"type":"Buffer","data":[124,56,127,168,20,240,253,208,168,250,254,61,14,38,126,49,16,222,93,78]},"announce":[],"urlList":[]}}