{"title":"Snuf de Hond - En de Jacht op Vliegende Volckert( 2Lions-Team)","uid":5939981,"size":4650266164,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7d443a99ec165def8ff49da064c200f751a0f8ec&amp;dn=Snuf+de+Hond+-+En+de+Jacht+op+Vliegende+Volckert%28+2Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"juutje","files":-1,"time":1289129927,"description":"Snuf de Hond - En de Jacht op Vliegende Volckert (2008) \n\nNederland\nFamilie / Mystery\n97 minuten\n\ngeregisseerd door Steven de Jong\nmet Tom van Kalmthout, Casper van Bohemen en Vivian van Huiden\n\nTom en Mirjam horen van Bouke de legende van een spookachtige verschijning 'Vliegende Volckert' die vroeger iedereen in het dorp lastig viel. Samen met Snuf gaan Tom en Mirjam op onderzoek uit. Vlakbij het moeras komen ze jachtopziener Grevendonk tegen die zegt in de val te zijn gelokt door een spook. Als er in het dorp meerdere onverklaarbare gebeurtenissen plaatsvinden komen de dorpelingen in actie en gaan onder leiding van agent Bantvink het moeras in. Daar komen ze voor een nare verassing te staan. De dorpelingen zijn van mening dat het spook 'Vliegende Volckert' echt bestaat. In het dorp ontmoet Tom een oude bekende die denkt samen met Snuf het mysterie op te lossen, maar zullen ze erachter komen wie de echte Vliegende Volckert is?\n\nTom and Miriam Bouke hear the legend of a ghostly &quot;Flying Volckert&quot; everyone in the village that once bothered. Together with Tom and Miriam Snuf going to investigate. Near the swamp they come against the gamekeeper Greven Donk says in the fall to be lured by a ghost. If in the village more unexplainable events occur, the villagers into action and led by agent Bant Check the swamp. Here they come to stand for a nasty surprise. The villagers believe that the ghost 'Flying Volckert' really exists. In the village, Tom meets an old friend who works together with Snuf to solve the mystery, but they will find out who the real Flying Volckert is?\n\n\nWeblink http://www.moviemeter.nl/film/53477\n\n\nVideo             : Retail DVD 5\nAudio             : AC3  2 Dutch AC 3 5.1 Dutch\nSubs              : English Dutch\nID                : 224 (0xE0)\nFormaat           : MPEG Video\nFormaatversie     : Version 2\nBitrate-modus     : Variabel\nBreedte           : 720 pixels\nHoogte            : 576 pixels\nBeeldverhouding   : 16:9\nFramerate         : 25,000 fps\nStandaard         : PAL\nCover+Label       : Yes\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\nEnjoy\n2Lions-Team\n\n                        \nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n","torrent":{"xt":"urn:btih:7d443a99ec165def8ff49da064c200f751a0f8ec","amp;dn":"Snuf+de+Hond+-+En+de+Jacht+op+Vliegende+Volckert%28+2Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d443a99ec165def8ff49da064c200f751a0f8ec","infoHashBuffer":{"type":"Buffer","data":[125,68,58,153,236,22,93,239,143,244,157,160,100,194,0,247,81,160,248,236]},"announce":[],"urlList":[]}}