{"title":"The Shifts and the Shocks (2014) epub","uid":11303691,"size":1411175,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7dedefe95f2aff11df9af8bc9d62ee8d30b6a502&amp;dn=The+Shifts+and+the+Shocks+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bookzilla","files":1,"time":1414449596,"description":"The Shifts and the Shocks: What We've Learned - And Have Still to Learn - From the Financial Crisis\n\nIn The Shifts and the Shocks, Martin Wolf - one of the world's most influential economic commentators and author of Why Globalization Works - presents his controversial and highly original analysis of the economic course of the last seven years\n\n\n There have been many books that have sought to explain the causes and courses of the financial and economic crisis which began in 2007-8. The Shifts and the Shocks is not another detailed history of the crisis, but the most persuasive and complete account yet published of what the crisis should teach us us about modern economies and economics.\n\n\n The book identifies the origin of the crisis in the complex interaction between globalization, hugely destabilizing global imbalances and our dangerously fragile financial system. In the eurozone, these sources of instability were multiplied by the tragically defective architecture of the monetary union. It also shows how much of the orthodoxy that shaped monetary and financial policy before the crisis occurred was complacent and wrong. In doing so, it mercilessly reveals the failures of the financial, political and intellectual elites who ran the system.\n\n\n The book also examines what has been done to reform the financial and monetary systems since the worst of the crisis passed. 'Are we now on a sustainable course?' Wolf asks. 'The answer is no.' He explains with great clarity why 'further crises seem certain' and why the management of the eurozone in particular 'guarantees a huge political crisis at some point in the future.' Wolf provides far more ambitious and comprehensive plans for reform than any currently being implemented.\n\n\n Written with all the intellectual command and trenchant judgement that have made Martin Wolf one of the world's most influential economic commentators, The Shifts and the Shocks matches impressive analysis with no-holds-barred criticism and persuasive prescription for a more stable future. It is a book no-one with an interest in global affairs will want to neglect","torrent":{"xt":"urn:btih:7dedefe95f2aff11df9af8bc9d62ee8d30b6a502","amp;dn":"The+Shifts+and+the+Shocks+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dedefe95f2aff11df9af8bc9d62ee8d30b6a502","infoHashBuffer":{"type":"Buffer","data":[125,237,239,233,95,42,255,17,223,154,248,188,157,98,238,141,48,182,165,2]},"announce":[],"urlList":[]}}