{"title":"IO VI TROVERO'[DVDRIP-XVID-ITA-SOM]","uid":4368892,"size":719826944,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7e5aef22af47755fd5aec6f6da421f972f316638&amp;dn=IO+VI+TROVERO%5C%27%5BDVDRIP-XVID-ITA-SOM%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mitimex","files":1,"time":1220031105,"description":"L&amp;#039;agente segreto Bryan, dopo tanti anni di servizio nei quali ha piÃƒÂ¹ e piÃƒÂ¹ volte sacrificato la famiglia per amore della patria, si ÃƒÂ¨ dimesso per poter stare vicino alla figlia diciassettenne che vive con la madre e il facoltoso patrigno in una lussuosa villa a Los Angeles. Quando Kim gli chiede il permesso di poter andare a Parigi con un&amp;#039;amica lui, da prima un po&amp;#039; titubante, acconsente a patto che la figlia lo chiami ogni giorno e lo informi dei suoi spostamenti. Giunte nella capitale francese le due ragazze vengono rapite da un&amp;#039;organizzazione che commercia in prostitute per venderle al miglior offerente. Bryan ha le ore contate per mettersi sulle tracce dei criminali e ritrovare Kim.\nL&amp;#039;operatore e direttore alla fotografia di Luc Besson, Pierre Morel, torna a dirigere un film scritto e prodotto dal maestro francese a quattro anni da District B13, il rocambolesco esordio in lungo. Quando non si ÃƒÂ¨ seduto dietro la macchina da presa, Besson ha sempre prediletto l&amp;#039;ironia dell&amp;#039;action movie (fatta eccezione forse solo per Danny The Dog). Tuttavia, con Io vi troverÃƒÂ² tenta la carta del thriller e insieme allo sceneggiatore di Karate Kid Robert Mark Kamen, giÃƒÂ  al suo fianco in Transporter 1, 2 e 3 (di prossima uscita), confeziona uno script &quot;accidentalmente&quot; paradossale. Se, infatti, la presenza nel cast di Liam Neeson e il soggetto gravoso del film fanno sperare in un prodotto autentico, il personaggio interpretato dall&amp;#039;ex Oskar Schindler - che ÃƒÂ¨ ritratto come una sorta di antieroe imbattibile e incorruttibile neanche fosse Jack Bauer in 24 - e l&amp;#039;evolversi della trama ne compromettono la natura espropriandolo del diritto di appartenenza al genere. Io vi troverÃƒÂ² torna cosÃƒÂ¬ ad assumere le sembianze del popcorn action movie amato da Besson e trova nella figura di Neeson un volto poco credibile e un corpo impreparato all&amp;#039;azione tutta cazzotti e sparatorie. Se Bryan fosse stato portato sullo schermo da un Bruce Willis i conti sarebbero tornati, ma senza l&amp;#039;ironia di un attore abituato ai tempi &quot;comici&quot; e alla leggerezza del genere finisce per sembrare un prodotto geneticamente modificato.","torrent":{"xt":"urn:btih:7e5aef22af47755fd5aec6f6da421f972f316638","amp;dn":"IO+VI+TROVERO%5C%27%5BDVDRIP-XVID-ITA-SOM%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e5aef22af47755fd5aec6f6da421f972f316638","infoHashBuffer":{"type":"Buffer","data":[126,90,239,34,175,71,117,95,213,174,198,246,218,66,31,151,47,49,102,56]},"announce":[],"urlList":[]}}