{"title":"The Official Ubuntu Server Book - 2nd Edition - July 2010","uid":6172889,"size":5386003,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7e6d5810517d86fac2b1f36607da678b688e6550&amp;dn=The+Official+Ubuntu+Server+Book+-+2nd+Edition+-+July+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TSRloader","files":2,"time":1297652163,"description":"The Official Ubuntu Server Book, 2nd Edition \nEnglish | 592 pages | ISBN 10: 0137081332 | ISBN 13: 9780137081332 | 16MB\n\n\nBook Description \nUbuntu Server is a complete, free server operating system that just works, with the extra Ubuntu polish, innovation, and simplicity that administrators love. \n\nNow, theres a definitive, authoritative guide to getting upandrunning quickly with the newest, most powerful versions of Ubuntu Server. Written by leading members of the Ubuntu community, The Official Ubuntu Server Book, Second Edition, covers all you need to know to make the most of Ubuntu Server, whether youre a beginner or a battlehardened senior system administrator. \n\nThe authors cover Ubuntu Server from start to finish: installation, basic administration and monitoring, security, backup, troubleshooting, system rescue, and much more. They walk through deploying each of the most common server applications, from file and print services to stateoftheart, costsaving virtualization and cloud computing. \n\nIn addition, youll learn how to \n\n. Make the most of Ubuntu Servers latest, most powerful technologies \n. Discover easy, fast ways to perform key administration tasks \n. Automate Ubuntu installs, no matter how many servers youre installing \n. Quickly set up lowcost Web servers and email \n. Protect your server with Ubuntus builtin and optional security tools \n. Minimize downtime with fault tolerance and clustering \n. Master proven, stepbystep server and network troubleshooting techniques \n. Walk through rescuing an Ubuntu server that wont boot \n. Create your own private cloud computing infrastructure \n","torrent":{"xt":"urn:btih:7e6d5810517d86fac2b1f36607da678b688e6550","amp;dn":"The+Official+Ubuntu+Server+Book+-+2nd+Edition+-+July+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e6d5810517d86fac2b1f36607da678b688e6550","infoHashBuffer":{"type":"Buffer","data":[126,109,88,16,81,125,134,250,194,177,243,102,7,218,103,139,104,142,101,80]},"announce":[],"urlList":[]}}