{"title":"Miracles And Massacres - True And Untold Stories Of The Making o","uid":9608192,"size":2126037,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7e75a5c515816d2d5344bdf94b0939b05d717f92&amp;dn=Miracles+And+Massacres+-+True+And+Untold+Stories+Of+The+Making+o&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1392256877,"description":"Miracles and Massacres: True and Untold Stories of the Making of America\nby Glenn Beck\n\n\nFormat: mobi/epub/azw3\nLength: 304 pages\nGenre: History\nDate: 19 November 2013\n\nThomas Edison was a bad guy - and bad guys usually lose in the end. \n\nWorld War II radio host 'Tokyo Rose' was branded as a traitor by the U.S. government and served time in prison. In reality, she was a hero to many.\n\nTwenty U.S. soldiers received medals of honor at the Battle of Wounded Knee - yet this wasn't a battle at all; it was a massacre.\n\nPaul Revere's midnight ride was nothing compared to the ride made by a guy named Jack whom you've probably never heard of.\n\nHistory is about so much more than memorizing facts. It is, as more than half of the word suggests, about the story. And, told in the right way, it is the greatest one ever written: Good and evil, triumph and tragedy, despicable acts of barbarism and courageous acts of heroism.\n\nThe things you've never learned about our past will shock you. The reason why gun control is so important to government elites can be found in a story about Athens that no one dares teach. Not the city in ancient Greece, but the one in 1946 Tennessee. The power of an individual who trusts his gut can be found in the story of the man who stopped the twentieth hijacker from being part of 9/11. And a lesson on what happens when an all-powerful president is in need of positive headlines is revealed in a story about eight saboteurs who invaded America during World War II. \n\nAuthor:\n\nBeck is the author of six consecutive #1 New York Times Bestsellers including his latest book, the thriller The Overton Window. When The Christmas Sweater, his first novel, debuted at #1 on the fiction list, Beck became one of a handful of authors to write books that reached #1 on both the fiction and non-fiction NYT lists.","torrent":{"xt":"urn:btih:7e75a5c515816d2d5344bdf94b0939b05d717f92","amp;dn":"Miracles+And+Massacres+-+True+And+Untold+Stories+Of+The+Making+o","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e75a5c515816d2d5344bdf94b0939b05d717f92","infoHashBuffer":{"type":"Buffer","data":[126,117,165,197,21,129,109,45,83,68,189,249,75,9,57,176,93,113,127,146]},"announce":[],"urlList":[]}}