{"title":"Revolution.Ace-HI2U","uid":11439599,"size":1806927722,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7e90317432ccb120bd71f2695ae433b14c4854ca&amp;dn=Revolution.Ace-HI2U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"thenoobish","files":2,"time":1415790744,"description":"HI2U!\n\nRevolution Ace (c) Laser Guided Games, LLC\n\nRelease Date: 11th November, 2014\nProtection: Steam\nType: Action, Indie\nSize: 1 Disc\n\nDescription:\n\nAbout This Game Take to the skies and fight waves of enemies across varied\nland, sea, and air environments with your highly customizable and upgradable\nfighter jet! A shoot'em up with classic gameplay, modern accessibility, and\nunique multiplayer, Revolution Ace adds to the tried-and-true without\ndiminishing what makes the genre great\n\nFeatures:\n\n* Fight a wide variety of air, land, and sea enemies with a customizable\nloadout of more than 20 weapons. Level up to unlock more weapon slots and\nperks that add additional passive bonuses like piercing and shield stealing\n* Your armor and shielding won't quit on you the first time you get hit so\nyou can concentrate more on destroying enemies and less on evading bullets\nYou can also upgrade your armor and shields for a stronger defense\n* Unique Versus mode features two players competing side by side on their own\nfields with various ways to affect the other. Send additional enemies\nhazards, make ships invisible or invulnerable and more to disrupt your\nopponent and get the higher score\n* Play an asynchronous Versus variant with the Battle Chains mode! Each\nplayer plays the stage while contending against the extras created by the\nprevious player's turn. Upload your turn globally or send it to a specific\nfriend to compete against. Every link forged in the chain will be tougher\nthan the last!\n* Local and online two player co-op expands the playable area while adding\nmore enemies and modified patterns\n\nNote:\n\nThis game is from march 2014, but looks good enough to release it even now\nespecially for shmup genre fans\n\nInstall:\n\nUnrar, mount/burn, install the game, copy crack, block the game exe in your\nfirewall and play!","torrent":{"xt":"urn:btih:7e90317432ccb120bd71f2695ae433b14c4854ca","amp;dn":"Revolution.Ace-HI2U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e90317432ccb120bd71f2695ae433b14c4854ca","infoHashBuffer":{"type":"Buffer","data":[126,144,49,116,50,204,177,32,189,113,242,105,90,228,51,177,76,72,84,202]},"announce":[],"urlList":[]}}