{"title":"The Spychips Threat - Katherine Albrecht","uid":11715592,"size":1911968,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7eafcb4fbb082158993c122b4915cd81c2e86bbf&amp;dn=The+Spychips+Threat+-+Katherine+Albrecht&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1424555927,"description":"\nEver feel like you're being watched? This eye-opening book shows how a new technology may soon track your every move . . . and pave the way for the fulfillment of end-time biblical prophecy.\n\nA revolutionary technology called RFID (Radio Frequency IDentification) is poised to expose our habits, secrets, and slip-ups to money-hungry marketers, savvy criminals, and government snoops. One day soon, our shoes could keep track of our footsteps. Stores could ID us as we walk in the door. Hidden &quot;tracking units&quot; could log even our restroom visits.\n\nGlobal corporations and government agencies have already invested millions in a plan that uses tiny microchips to uniquely number and track everyday items. Parts of this Orwellian vision are uncannily similar to the prophesies of Revelation. Chipping inanimate objects is just the start-the endpoint is a form of RFID that can be injected into the flesh. This work-an updated version of Katherine Albrecht and Liz McIntyre's controversial and award-winning book Spychips-is a clarion call to Christians to take a stand against plans to monitor and control people through this unnerving new technology.\n\nUsing public records, real-world examples, and biblical prophesies, Albrecht and McIntyre uncover the frightening story behind RFID and show us how to protect our privacy and civil liberties while there's still time. \n\n\nAbout the author:\nDr. Katherine Albrecht is the director of CASPIAN (Consumers Against Supermarket Privacy Invasion and Numbering), an organization she founded in 1999 to advocate free-market, consumer-based solutions to the problem of retail privacy invasion.\nKatherine is widely recognized as one of the world's leading experts on consumer privacy. She regularly speaks on the consumer privacy and civil liberties impacts of new technologies, with an emphasis on RFID and retail issues. She has testified on RFID technology before the Federal Trade Commission, state legislatures, the European Commission, and the Federal Reserve Bank, and she has given over a thousand television, radio and print interviews to news outlets all over the world. Her efforts have been featured on CNN, NPR, the CBS Evening News, Business Week, and the London Times, to name just a few.\nExecutive Technology Magazine has called Katherine &quot;perhaps the country's single most vocal privacy advocate&quot; and Wired magazine calls her the &quot;Erin Brockovich&quot; of RFID&quot;. Her success exposing corporate misdeeds has earned her accolades from Advertising Age and Business Week and caused pundits to label her a PR genius. \nKatherine graduated magna cum laude with a Bachelor of Science degree in Business Administration with a concentration in International Marketing. She holds a Doctorate in Education from Harvard University with a research focus in consumer education, privacy and psychology","torrent":{"xt":"urn:btih:7eafcb4fbb082158993c122b4915cd81c2e86bbf","amp;dn":"The+Spychips+Threat+-+Katherine+Albrecht","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7eafcb4fbb082158993c122b4915cd81c2e86bbf","infoHashBuffer":{"type":"Buffer","data":[126,175,203,79,187,8,33,88,153,60,18,43,73,21,205,129,194,232,107,191]},"announce":[],"urlList":[]}}