{"title":"Kabouter Plop Collectie (5 Films op 1 DVD)(Dutch) 2Lions-Team","uid":5524458,"size":4433708143,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7ef4d73affa883c9b85251801caa2aa3c230a5b7&amp;dn=Kabouter+Plop+Collectie+%285+Films+op+1+DVD%29%28Dutch%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Pioen","files":-1,"time":1272728832,"description":" Kabouter Plop Collectie (5 Films op 1 DVD)       \n \n\nKabouter Plop: De Kabouterschat (1999) \n\nBelgiÃƒÂ«\nFamilie / Avontuur\n94 minuten\n\ngeregisseerd door Bart Van Leemputten\nmet Walter de Donder, AimÃƒÂ© Anthoni en Agnes De Nul\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/7925&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/7925&lt;/a&gt;\n\n\nEnglish\n\nPlop does with his dwarf friends Lui, DIY and chatter a spring cleaning in his mushroom. When cleaning the chimney Klus discovered a treasure map. The elves decide to join the Gnome Treasure search. But ... The journey is hard and dangerous. Along the way they meet two other elves, and Pif Paf her brother. Lui is madly in love with Pif. By coincidence, the treasure map and in the hands of Pif Paf. They also went in search of treasure.\n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0199663&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0199663&lt;/a&gt;\n\n=====================================================================================\n\nPlop in de Wolken (2000) \n\nBelgiÃƒÂ«\nFamilie / Avontuur\n75 minuten\n\ngeregisseerd door Bart Van Leemputten\nmet Walter de Donder, AimÃƒÂ© Anthoni en Chris Cauwenbergs\n\nOp een dag ontvangt Kabouter Plop een brief van zijn Oom Knap. Daarin staat dat Oom Knap heel erg ziek is en dat hij enkel kan genezen als hij het sap drinkt van de Karbonkelwortel. Maar die wortel groeit enkel in het bos van Plop. Plop, Klus, Kwebbel, Lui, Smul en Smal besluiten om de plant naar de zieke Oom Knap te brengen. Maar Oom Knap woont heel ver weg! Klus besluit een heus luchtschip te bouwen waarmee de kabouters kunnen vliegen naar het kabouterbos van Oom Knap. Maar de tocht is moeilijk en niet zonder gevaren. Zullen de kabouters het sap van de Karbonkelwortel tijdig bij Oom Knap kunnen brengen?\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/5949&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/5949&lt;/a&gt;\n\nEnglish\n\nOn one day receives Kabouter Plop a letter from his Uncle Knap. It says that Uncle Handsome very ill and that he can only heal if he drinks the juice Karbonkelwortel. But this root grows only in the forest of Plop. Plop, Klus, chatter, Lui, tuck and Narrow decide to plant to bring the sick Uncle Handsome. But Uncle Handsome live very far away! Job decides to build a real airship that can fly to the elves kabouterbos Uncle Knap. But the journey is difficult and not without risks. Will the elves of the juice Karbonkelwortel time at Uncle Handsome can spend?\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0271723&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0271723&lt;/a&gt;\n\n\n=====================================================================================\n\nKabouter Plop en de Toverstaf (2003) \n\nBelgiÃƒÂ«\nAvontuur / Familie\n50 minuten\n\ngeregisseerd door Bart Van Leemputten en Matthias Temmermans\nmet Walter de Donder, AimÃƒÂ© Anthoni en Chris Cauwenberghs\n\nKabouter Plop verwacht, net als alle andere jaren, een bezoekje van de kerstkabouter. Alleen loopt het dit jaar een beetje mis. Mik en Mak, twee kabouters die jaar na jaar door de kerstkabouter vergeten worden, gooien roet in het eten. De twee gaan aan de haal met de slee van de kerstkabouter. Die is daarmee niet alleen al z?n cadeautjes kwijt, maar ook z?n toverstaf. Met die staf kun je cadeautjes toveren, maar ook vreselijke dingen aanrichten. Kabouter Plop en kabouter Klus gaan samen op pad om de toverstaf terug te halen en hem weer aan de kerstkabouter te geven.\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/16329&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/16329&lt;/a&gt;\n\nEnglish\n\nPlop expected, like all other years, a visit from the Christmas elf. Only run this year a bit wrong. Mik and Mak, two gnomes who year after year by the Christmas elf forget, throwing a spanner in the. The two start off with the sled of the Christmas elf. Which is therefore not only lost all his gifts, but his magic wand. With this magic wand you gifts, but also cause terrible things. Kabouter Plop Kabouter Klus and go on the road together for the magic wand and get him back again to the Christmas elf.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0437272&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0437272&lt;/a&gt;\n\n\n=====================================================================================\n\n\nPlop en Kwispel (2004) \n\nBelgiÃƒÂ«\nFamilie\n53 minuten\n\ngeregisseerd door Matthias Temmermans\nmet Walter de Donder, AimÃƒÂ© Anthoni en Chris Cauwenbergs\n\nAls Plop en zijn vrienden in het kabouterbos een kleine golden retriever ontdekken, schrikken ze zich te pletter! Maar al snel verovert deze schattige hond de harten van onze kabouters en willen ze niets liever dan dat Kwispel bij hen in het bos blijft wonen. Maar aan de andere kant van het bos, in de grote-mensen-wereld, is er een jongetje heel erg verdrietig. Hij mist Kwispel. Hij zou er alles aan doen om zijn puppie terug te vinden. Als Plop en zijn vrienden vernemen dat Kwispel een grote-mensen-baasje heeft, besluiten ze om het hondje terug te brengen. Maar daardoor storten de kabouters zich in een ongekend avontuur. Als dat maar goed afloopt!\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/27544&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/27544&lt;/a&gt;\n\nEnglish\n\nIf Plop and his friends in a small golden retriever kabouterbos discover scare them to death! But soon this cute dog conquers the hearts of our gnomes and they want nothing more than Kwispel with them continues to live in the forest. But on the other side of the wood, the grown-up world, there is a very sad boy. He misses Kwispel. He would do everything in order to find his puppy. If Plop and his friends learn that Kwispel a grown-owner has, they decide to bring back the dog. But because the landfill gnomes in an unprecedented adventure. I hope it ends well!\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0446435/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0446435/&lt;/a&gt;\n\n=====================================================================================\n\nPlop en het Vioolavontuur (2005) \n\nBelgiÃƒÂ«\nFamilie\n65 minuten\n\ngeregisseerd door Matthias Temmermans\nmet Walter de Donder, Chris Cauwenbergs en Frans Bauer\n\nTerwijl Kabouter Plop en zijn vrienden een wandeling maken, horen ze mooie vioolmuziek uit een huisje aan de rand van het kabouterbos. Ze besluiten een kijkje te nemen. Kabouter Klus klimt via de regenpijp omhoog en ontdekt dat de hemelse klanken wordt gespeeld door het meisje Anna. Zodra Anna de kabouters ziet, gaat het helemaal mis. Anna laat door de schrik haar viool op de grond vallen. Deze is helemaal kapot en morgen heeft ze een belangrijk optreden! Hoe kunnen de kabouters haar helpen? Komen ze op tijd met een oplossing? Ze schakelen de hulp in van Kabouter Amadeus (Frans Bauer). Nu maar hopen dat het allemaal goed afloopt!\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/33718&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/33718&lt;/a&gt;\n\nEnglish\n\nPlop, Klus, Lui and Kwebbel are gathering berries in the forest. Suddenly they hear violin music, which Plop tells must be from the big people living at the edge of the forest, and we see a young girl (granddaughter of a famous female violin player) practicing, with her father nervous for the performance for the audience for the centennial anniversary of her school. Lui goes with Klus to watch the violin itself. Klus climbs up the wall to the window. Just then the girl looks out with her violin, sees Klus, and drops the violin in surprise, and Klus falls as well. The violin breaks. The gnomes escape. The father attempts to repair the violin in the night. Meanwhile, the gnomes cannot sleep, concerned the violin cannot be repaired, and return to the cottage. The father falls asleep on his workbench. The gnomes, intimidated a little by the pet goose, set to work on repairing the violin. One problem emerges when they are half done: one string has broken, something that can only be replaced but not repaired. Plop ponders that the only possible solution lies in seeing the musical gnome Amadeus, who lives in the attic of the music theatre in the big city, which is, however, two days journey away. In another brainwave, Plop strikes a bargain with the goose in return for Plop cookies to carry Lui to Amadeus. Lui flies there, and meets the eccentric Johann Wolfgang Sebastian Amadeus. Lui forgets the violin string for a moment while the others are sleepily repairing the violin. When Lui remembers what he came for, he quickly grabs the one violin string, and returns. Meanwhile, the others have fallen asleep. When they awake, it is by the daughter coming to wake her father, happily surprised that the violin has been repaired. The daughter and the bewildered father leave, but leave the fiddlestick behind. The gnomes help again, and the performance goes beautifully, and that is the end.\n\n\n=====================================================================================\nSource: Dvd 5\nAudio: Vlaams\nSubs: Nee\nMenu : Ja\nLand: BelgiÃƒÂ«\nGenre: Avontuur / Familie\nLeeftijd: AL\nCover : nee\n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : (S)VCD\n \nOndertitels : Geen\n \nGenre : Avontuur\nFamiliefilm\n \nThanks: ZonneAngel\n\n*****************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\nTo the fakers Get a Live\n\n\n  \n \n\n \n \n \n","torrent":{"xt":"urn:btih:7ef4d73affa883c9b85251801caa2aa3c230a5b7","amp;dn":"Kabouter+Plop+Collectie+%285+Films+op+1+DVD%29%28Dutch%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ef4d73affa883c9b85251801caa2aa3c230a5b7","infoHashBuffer":{"type":"Buffer","data":[126,244,215,58,255,168,131,201,184,82,81,128,28,170,42,163,194,48,165,183]},"announce":[],"urlList":[]}}