{"title":"African American Architects - A Biographical Dictionary, 1865-19","uid":10587317,"size":12476158,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f0c98a6a3f51267529fb48075c673c5ce12e3ab&amp;dn=African+American+Architects+-+A+Biographical+Dictionary%2C+1865-19&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1405760929,"description":"African American Architects: A Biographical Dictionary, 1865-1945 \nISBN: 0415929598 | edition 2004 | PDF | 576 pages | 11,3 mb\n\nSince the end of the Civil War, African-American architects have been responsible for creating houses, schools, research institutes, and other significant buildings throughout the United States. The Widener Library at Harvard University, the Sixteenth Street Baptist Church in Birmingham, Alabama, and Tuskegee Institute's Butler Chapel are just a few examples of prominent buildings designed by African Americans. But even though many of the structures they helped create survive to this day, most of these architects remain virtually unknown.This unique reference source brings the lives and work of these pioneers to light for the first time. Written by over 100 experts, ranging from archivists to architectural historians, this book chronicles African-American architects from the era of Emancipation to the end of World War II, filling a key gap in existing scholarship. The number of architects and the scope of their accomplishments will surprise and fascinate readers. Some 160 illustrated A-Z entries include biographical essays as well as commentary on the work of each architect, offering a wealth of information about their lives, their buildings, and the obstacles many had to overcome. Articles provide insight on the history of architectural education at traditionally black colleges and universities, such as Tuskegee Institute, Howard University, Hampton Institute, Florida A&amp;M, and Prairie View A&amp;M. The book features a helpful introductory overview of African Americans in domestic architecture, and an appendix containing a list of buildings by geographical location and architect makes for a handy reference tool","torrent":{"xt":"urn:btih:7f0c98a6a3f51267529fb48075c673c5ce12e3ab","amp;dn":"African+American+Architects+-+A+Biographical+Dictionary%2C+1865-19","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f0c98a6a3f51267529fb48075c673c5ce12e3ab","infoHashBuffer":{"type":"Buffer","data":[127,12,152,166,163,245,18,103,82,159,180,128,117,198,115,197,206,18,227,171]},"announce":[],"urlList":[]}}