{"title":"[MP3] Economics in One Lesson by Henry Hazlitt","uid":4650987,"size":57142366,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:800cf381a92b21780489bcd959ee114736d92fb1&amp;dn=%5BMP3%5D+Economics+in+One+Lesson+by+Henry+Hazlitt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"liberty-books","files":1,"time":1232045294,"description":"Economics in One Lesson: The Shortest and Surest Way to Understand Basic Economics\n\n\n\nAudio book conversion by Liberty-Books\n\n\n\nThe following is the Foreword by Steve Forbes.\n\nWe have been inundated lately with a barrage of 50th anniversaries of important events--the dropping of the atomic bombs, Iwo Jima, VE and VJ days, Bretton Woods. And with this edition of Henry Hazlitt's best-known work we commemorate another. Five decades have passed since the publication of a book on economics so powerful in its clarity and simplicity that we can declare, without question, it has shaped our world.\n\nWith Economics in One Lesson, Henry Hazlitt provided a loaded arsenal for those who would do combat with the cloudy and mistaken economic wisdom of the day. In that respect, he is something of a refuter. He addressed every mayor economic fallacy, all prominently and widely held, and refuted them. He showed why protective tariffs are not protective, why minimum wage laws hurt those they are intended to benefit, and why government attempts to stabilize and fix prices throw them out of whack. And in doing so he advanced the notion that markets freed from government intervention can best serve and improve society.\n\nIn a period when the economics undergirding the New Deal were ascendant, Hazlitt emerged as one of the most successful proponents of free markets, and one of the most forceful opponents of the Keynesian nostrums dictating U.S. economic policy. From his perch as an editorial writer for The New York Times he gave the Roosevelt Administration fits. At The Nation, where he signed on as literary editor but wrote extensively on economics, he gave his editors similar fits. And as a regular columnist for Newsweek from 1946 to 1966 he helped educate millions about the rudiments of economics and the failures of widespread government intervention. As a sign of the times, today we would be rightly suspicious of any economics writer with that sort of resume.\n\nLudwig von Mises called him &quot;our leader.&quot; Friedrich Hayek lauded him similarly. H. L. Mencken, not known for lavishing praise on many, revered Hazlitt as &quot;one of the few economists in human history who could really write.&quot; But Henry Hazlitt was no economist. At least, not officially. No Ph.D.--or bachelor's degree, for that matter--adored his walls. Hazlitt's insatiable curiosity about the way the world works led him, self-taught, to an understanding of basic economics astonishing in its breadth and scope.","torrent":{"xt":"urn:btih:800cf381a92b21780489bcd959ee114736d92fb1","amp;dn":"%5BMP3%5D+Economics+in+One+Lesson+by+Henry+Hazlitt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"800cf381a92b21780489bcd959ee114736d92fb1","infoHashBuffer":{"type":"Buffer","data":[128,12,243,129,169,43,33,120,4,137,188,217,89,238,17,71,54,217,47,177]},"announce":[],"urlList":[]}}