{"title":"Guy Vanthemsche - Belgium and the Congo, 1885-1980 [2012][A]","uid":9953207,"size":2681928,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:80aa7fcebc0cb8e8db9cacb4df4bbcae77db9979&amp;dn=Guy+Vanthemsche+-+Belgium+and+the+Congo%2C+1885-1980+%5B2012%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Anette14","files":-1,"time":1397433184,"description":"Description\nProduct Details\nBook Title: Belgium and the Congo, 1885-1980\t\nBook Author: Guy Vanthemsche\nHardcover: 300 pages\nPublisher: Cambridge University Press (July 5, 2012)\nLanguage: English\nISBN-10: 0521194210\nISBN-13: 978-0521194211\n\nBook Description\nRelease date: July 5, 2012 | ISBN-10: 0521194210 | ISBN-13: 978-0521194211\nWhile the impact of a colonising metropole on subjected territories has been widely scrutinized, the effect of empire on the colonising country has long been neglected. Recently, many studies have examined the repercussions of their respective empires on colonial powers such as the United Kingdom and France. Belgium and its African empire have been conspicuously absent from this discussion. This book attempts to fill this gap. Belgium and the Congo, 1885-1980 examines the effects of colonialism on the domestic politics, diplomacy and economics of Belgium, from 1880 - when King Leopold II began the country's expansionist enterprises in Africa - to the 1980s, well after the Congo's independence in June of 1960. By examining the colonial impact on its mother country Belgium, this study also contributes to a better understanding of Congo's past and present.\n\nReviews\n&quot;This is an important book that provides the first scholarly study of the impact that the acquisition of the Congo had on Belgium. It is an important contribution to the history of European colonialism, but also to understanding the contemporary history of the Congo.&quot; - Martin Conway, Balliol College, University of Oxford\n\n&quot;An indispensable - indeed unique - economic, social, and political history of Belgium and the Congo.&quot; - Wm. Roger Louis, University of Texas at Austin\n\n&quot;Guy Vanthemsche's exploration of the influence of the massive colony at the very center of the African continent on the small European nation that inherited it from a king with imperial ambitions is captivating. Vanthemsche, one of Belgium's leading contemporary historians, is perfectly placed to invert the traditional studies of Belgium in the Congo with his meticulously researched, thoroughly documented, subtly probing, compelling investigation of how the Congo shaped the domestic politics, foreign relations, and economic development of Belgium. Belgium and the Congo, 1885-1980, rich in nuance, will be crucial reading alongside the studies ranging from the gruesome tales of King Leopold's Congo to the accounts of the politics of decolonization in France and Britain.&quot; - Janet Polasky, Presidential Professor of History, University of New Hampshire\n\n&quot;Guy Vanthemsche provides an authoritative and detailed account of the history of Belgian linkages with the Congo, colonial and post-colonial. This invaluable and richly documented volume is an indispensable source for understanding both Belgian and Congolese history. Balanced and judicious, the book is also an invaluable guide to the published sources on this subject, which receive exhaustive coverage.&quot; - Crawford Young, Professor Emeritus, University of Wisconsin-Madison\n\n&quot;...a welcom and trailblazing work. Highly recommended.&quot; -Choice\n\nBook Description\nThis book explains how and why Belgium, a small but influential European country, was changed through its colonial activities in the Congo, from the first expeditions in 1880 to the Mobutu regime in the 1980s. Belgian politics, diplomacy, economic activity and culture were influenced by the imperial experience. Belgium and the Congo, 1885-1980 yields a better understanding of the Congo's past and present.\n\nAbout the Author\nGuy Vanthemsche is Professor of Contemporary History at Free University Brussels (Vrije Universiteit Brussel). Professor Vanthemsche is also Secretary of the Royal Commission of History in Belgium. He is co-director of the Belgium-based journal Revue Belge de Philogie et d'Histoire.\n","torrent":{"xt":"urn:btih:80aa7fcebc0cb8e8db9cacb4df4bbcae77db9979","amp;dn":"Guy+Vanthemsche+-+Belgium+and+the+Congo%2C+1885-1980+%5B2012%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80aa7fcebc0cb8e8db9cacb4df4bbcae77db9979","infoHashBuffer":{"type":"Buffer","data":[128,170,127,206,188,12,184,232,219,156,172,180,223,75,188,174,119,219,153,121]},"announce":[],"urlList":[]}}