{"title":"Samla Mammas Manna - Studio Albums (Swedish Avant Prog)","uid":6455298,"size":1460679915,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:80f18634f8d8efc5a30017f6baad44a0d3f3a84a&amp;dn=Samla+Mammas+Manna+-+Studio+Albums+%28Swedish+Avant+Prog%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"lonesomecowboy","files":-1,"time":1307562959,"description":"S A M L A   M A M M A S   M A N N A\n- Studio Album Collection -  \n\n\\&quot;Instrumental music with vocal addition at its best! A bastard meeting between some musical individualists resulted in a series of records that stunned the world. High quality performance combined with musical integrity gives you a unique amount of satisfaction.\\&quot;\n\nThey were, at the end of the Seventies and in the Eighties, the Swedish representative of the collective Rock In Opposition founded by Chris CUTLER. I can tell you that their music is a blend of mostly instrumental 70\\'s progressive rock, Scandinavian folk, jazz-fusion, avant-garde, RIO (Rock In Opposition) and World Music. The vocals in Swedish, the use of accordion, handbells, marimbas and percussions of all kinds gives a very personal touch to this music.\n\nAs was popular at the time, the germ of the SMM sound came from adapting traditional Scandinavian folk themes into modern music. After, there followed an intensive period of jam sessions, trying out all sorts of ideas, with unlikely combinations of folk, rock and jazz structures. \\&quot;Klossa Knapitatet\\&quot; (1974) expanded on their improvisational side, and maybe their best. It\\'s a FUN album! The legacy of \\&quot;Snorungarnas Symfoni\\&quot; was the end of a phase, and was also where SMM history became complicated. Now the long awaited reunion on album for SMM is finally here. \\&quot;Kaka\\&quot; marks the return of the original line-up in 1999. While very good, the band\\'s early energy and creativeness is hard to recreate some 23 years later. If you haven\\'t heard them before, this album is a perfect starter. Highly recommended!\n\nSMM to ZMM and other directions...\nIn January 1977, SMM reformed as the subtly renammed ZAMLA MAMMAS MANNA, to indicate a new start and a new style with much more fiery and distinctly RIO type of rock fusion. \\&quot;Familjesprickor\\&quot; (1980) was their final album, and by far the most intense. This album is, nonetheless, an excellent place to start.\\&quot;\n-- from www.progarchives.com (author unnkown) --\n\nAlbums:\n\n1971 - Samla Mammas Manna\n1973 - Maltid\n1974 - Klossa Knapitatet\n1976 - Snorungarnas Symfoni\n1999 - Kaka\n\nmore infos at:\n &lt;a href=&quot;\nhttp://www.progarchives.com/artist.asp?id=621&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.progarchives.com/artist.asp?id=621&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Samla_Mammas_Manna&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Samla_Mammas_Manna&lt;/a&gt;","torrent":{"xt":"urn:btih:80f18634f8d8efc5a30017f6baad44a0d3f3a84a","amp;dn":"Samla+Mammas+Manna+-+Studio+Albums+%28Swedish+Avant+Prog%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80f18634f8d8efc5a30017f6baad44a0d3f3a84a","infoHashBuffer":{"type":"Buffer","data":[128,241,134,52,248,216,239,197,163,0,23,246,186,173,68,160,211,243,168,74]},"announce":[],"urlList":[]}}