{"title":"The Clash - Sound System (2013) [FLAC]","uid":9441551,"size":4808751398,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:810876adebe59d087d056f4deb34744149b2ee2b&amp;dn=The+Clash+-+Sound+System+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"politux","files":-1,"time":1389017788,"description":"\n  The Clash - Sound System (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Style: Punk, New Wave\n  Source: 11 CD Boxset\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  The Clash (2013 Remaster)\n  Give 'Em Enough Rope (2013 Remaster)\n  London Calling (2013 Remaster - Disc 1)\n  London Calling (2013 Remaster - Disc 2)\n  Sandinista! (2013 Remaster - Disc 1)\n  Sandinista! (2013 Remaster - Disc 2)\n  Sandinista (2013 Remaster - Disc 3)\n  Combat Rock [2013 Remaster]\n  Sound System Extras (Disc 1)\n  Sound System Extras (Disc 2)\n  Sound System Extras (Disc 3)\n\n  Most box sets are designed to enshrine an artist in the amber of posterity. The idea is that the artist has transcended their time, that they can now be appreciated outside of the context of their era. The digital age, where recordings from the past sit comfortably with tunes from the present, accelerates this trend, suggesting that all the classic artists exist upon their own continuum, that their development was almost a product of self-divination. What is interesting about Sound System is that it throws this notion out the window and celebrates the era that produced the Clash as much as it celebrates the band itself. As designed by Clash bassist Paul Simonon, Sound System looks like an old-school ghetto blaster, and it's filled with replicas of fanzines, stickers, badges, press photos, posters, dog tags -- all manner of period-specific tchotchkes that walk the line between nostalgia and commercial art. \n\n  This aesthetic trickles down to the presentation of the music itself, with London Calling split over two CDs where it could easily fit onto one and Sandinista! taking up a full three discs. Such details slightly impede playability if Sound System is listened to as a series of CDs, but once the set is ripped and listened to digitally, the divided discs are simply another design flourish, one of many little things to appreciate. But Sound System is also attractive in delivering what effectively is the Complete Clash in one sitting. Apart from the disowned Cut the Crap, all the albums are here -- the U.K. version of The Clash, Give 'Em Enough Rope, London Calling, Sandinista!, Combat Rock -- along with three discs of extras that include all the non-LP singles (i.e., the singles that were added to the U.S. pressing of the debut, plus everything that wound up on the clearinghouse Super Black Market Clash, such as the Cost of Living EP), oddities that appeared on the first Clash box Clash on Broadway in 1991, and B-sides; then, most attractively for collectors, previously unreleased mixes, outtakes from Combat Rock, &quot;extracts&quot; from the band's first recording session in 1976, Polydor demos from that same year produced by Guy Stevens, and six live cuts from the Lyceum in 1979. \n\n Perhaps there are still some stray tracks in the vaults -- this seems to excavate all the unheard songs from Rat Patrol from Fort Bragg, aka the original version of Combat Rock and some cuts may be left behind -- but this is as complete as we'll get and if it doesn't present any fresh revelations, it brings the Clash's era back to life, both sonically and visually.","torrent":{"xt":"urn:btih:810876adebe59d087d056f4deb34744149b2ee2b","amp;dn":"The+Clash+-+Sound+System+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"810876adebe59d087d056f4deb34744149b2ee2b","infoHashBuffer":{"type":"Buffer","data":[129,8,118,173,235,229,157,8,125,5,111,77,235,52,116,65,73,178,238,43]},"announce":[],"urlList":[]}}