{"title":"Grace Slick Manhole MP3 320 kbps","uid":4355256,"size":94817532,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8111a301699ed6b4e44d4635a48da852f72b0890&amp;dn=Grace+Slick+Manhole+MP3+320+kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"miona45","files":16,"time":1219378600,"description":"This is it!  The greatest soundtrack to the movie that was never made:  Manhole by Grace Slick, released in 1973.  I have read that &quot;Dreams&quot; is Slick&amp;#039;s favorite solo recording, but personally, I think this is the better of the two.  I&amp;#039;ve spent many hours listening to this great music and I hope you will enjoy it as much as I have and still do.  This was ripped from the cd at 320 kbps.  You may notice a slight hiss at the beginning of tracks 1 and 2 but that is how it is on the cd and on the LP as I recall.  I have included images of the cd, covers and the booklet.  Please seed if you enjoy this.  Here is a small blurb from Wikipedia:\n\nManhole is Grace Slick&amp;#039;s first solo album credited solely to her (she had previously recorded Sunfighter with Paul Kantner and Baron von Tollbooth and the Chrome Nun with Kantner and David Freiberg, both of whom co-produced Manhole). The album was recorded in 1973, when Jefferson Airplane had stopped touring, and Jorma Kaukonen and Jack Casady were making the Hot Tuna album, The Phosphorescent Rat. All the members who would form Jefferson Starship in 1974 performed on this album, except for Papa John Creach. The album was conceived as a soundtrack to a movie, (noted by the title of the second track, &quot;Theme from the Movie Manhole&quot;), although there was no such movie made. Grace drew all of the artwork for the album, and wrote on the cover &quot;Child Type Odd Art by Grace.&quot; The album only reached #127 on the Billboard charts.\n\nTrack listing:\nJay 2.43\nTheme from Manhole 15.23\nCome Again Toucan 4.40\nIt&amp;#039;s Only Music 4.32\nBetter Lying Down 3.15\nEpic 7.23","torrent":{"xt":"urn:btih:8111a301699ed6b4e44d4635a48da852f72b0890","amp;dn":"Grace+Slick+Manhole+MP3+320+kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8111a301699ed6b4e44d4635a48da852f72b0890","infoHashBuffer":{"type":"Buffer","data":[129,17,163,1,105,158,214,180,228,77,70,53,164,141,168,82,247,43,8,144]},"announce":[],"urlList":[]}}