{"title":"Atom Man Vs Superman (1950) Xvid - Theatrical Serial - All 15 Ch","uid":9284856,"size":2740510720,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8136257d982e4f2ae3ccdee743a35b68ce71f42c&amp;dn=Atom+Man+Vs+Superman+%281950%29+Xvid+-+Theatrical+Serial+-+All+15+Ch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"SaM","files":-1,"time":1385995916,"description":"Atom Man Vs Superman (1950) Xvid - Theatrical Serial - All 15 Chapters [DDR]\n\n\nAtom Man vs. Superman (1950), Columbia's 43rd serial and the second live-action Superman screen appearance, both featuring Kirk Alyn as Superman, finds Lex Luthor (Lyle Talbot), secretly the Atom Man, blackmailing the city of Metropolis by threatening to destroy the entire community. Perry White (Pierre Watkin), editor of the Daily Planet, assigns Lois Lane (Noel Neill), Jimmy Olsen (Tommy Bond) and Clark Kent (Kirk Alyn) to cover the story.\n\nCAST:-\nKirk Alyn as Superman/Clark Kent\nNoel Neill as Lois Lane\nLyle Talbot as Lex Luthor/The Atom Man\nTommy Bond as Jimmy Olsen\nPierre Watkin as Perry White\nJack Ingram as Foster (dapper henchman)\nDon C. Harvey as Albor (lab henchman)\nRusty Wescoatt as Carl (beefy henchman)\nTerry Frost as Baer (medium henchman)\nWally West as Henchman Dorr\nPaul Stader as 'Killer' Lawson\nGeorge Robotham as Earl, TV truck cameraman-driver\n\nDirected by Spencer Gordon Bennet\nProduced by Sam Katzman\nWritten by David Mathews, George H. Plympton, Joseph F. Poland,\nBased on \tCharacters by Jerry Siegel, Joe Shuster\n\nPRODUCTION NOTES:-\nDespite their onscreen personas, Talbot (Lex Luthor), who wore a rubber scalp to create the impression of baldness, and Alyn (Superman) spent much of their time, when not shooting, exchanging recipes; both actors shared an interest in cookery.\n\nThe final set piece shows Metropolis under attack by &quot;poorly animated&quot; flying saucers and a torpedo.\n\nThe flying effects were somewhat improved in this film than in the original, by the simple expedient of turning the camera on its side. Kirk Alyn stood with arms raised in front of a cyclorama, while a wind machine and smoke pot were placed above him (out of frame). This gave an inexpensive illusion of flight. Longer shots continued to use cartoon animation of the Man of Steel.\n\nIn their book The Great Movie Serials, Jim Harman and Donald F. Glut describe the serial as &quot;far more gimmicky and gadget prone&quot; than the first Superman serial. In addition to this, they also found it to be &quot;flawed by the same Katzman cheapness.&quot;\n\nSYNOPSIS:- Atom Man Vs Superman (1950)\nLex Luthor, the Atom Man, invents a number of deadly devices to plague the city, including a disintegrating machine which can reduce people to their basic atoms and reassemble them in another place. But Superman manages to thwart each scheme. Since Kryptonite can rob Superman of his powers, Luthor decides to create a synthetic Kryptonite and putters about obtaining the necessary ingredients: plutonium, radium and the undefined 'etc.' Luthor places the Kryptonite at the launching of a ship, with Superman in attendance. He is exposed to the Kryptonite and passes out. Superman is taken off in an ambulance driven by Luthor's henchmen, and he is now under the control of Luthor. Superman is placed in a device, a lever is pulled, and the Man of Steel vanishes into &quot;The Empty Doom&quot; (which bears a similarity to the Phantom Zone of the comic books). Most of chapter 7 is a repeat of the origin story from chapter 1 of Columbia's first &quot;Superman&quot; serial, and this serial also finds a way to work in stock footage from Ken Maynard's 1936 Avenging Waters (also directed by Spencer Gordon Bennet[1]). The serial features several elements re-used in later Superman features: the Man of Steel is exposed to synthetic Kryptonite during a public function, as he is in the motion picture Superman III. When he escapes from &quot;The Empty Doom&quot;, the headline of the Daily Planet proclaims: Superman Returns, the title of the 2006 Superman movie.\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 252 mins\nSubtitles: ENGLISH, SPANISH, FRENCH\nRipped by: Trinidad [DDR]\nDuration: 252 min","torrent":{"xt":"urn:btih:8136257d982e4f2ae3ccdee743a35b68ce71f42c","amp;dn":"Atom+Man+Vs+Superman+%281950%29+Xvid+-+Theatrical+Serial+-+All+15+Ch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8136257d982e4f2ae3ccdee743a35b68ce71f42c","infoHashBuffer":{"type":"Buffer","data":[129,54,37,125,152,46,79,42,227,204,222,231,67,163,91,104,206,113,244,44]},"announce":[],"urlList":[]}}