{"title":"Battles for Atlanta-Sherman moves east (Time-Life The Civil War)","uid":11776518,"size":30971729,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:818123df5a970938e37648c9d41e2302172f1a97&amp;dn=Battles+for+Atlanta-Sherman+moves+east+%28Time-Life+The+Civil+War%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":1,"time":1427318894,"description":"Pdf / English / 1985 Time-Life / 176 pages / 29.5 MB / ISBN10 0809447738\n\nThis book gives many interesting details of the strategies of both sides which is fascinating. You come to admire the strength and courage of both armies regardless of your view of the war. This book shows that Atlanta was not given up without a fight. Johnston defensive strategy, and Sherman's flanking maneveurs all the way from Tennessee to Atlanta are detailed with maps, photos, and more. The sacking of Johnson for Hood before the battle of Atlanta is described along with the various opinions of generals and historians on the effect of this move. The author treats both Johnson and Hood fairly telling of their strengths, weaknesses and foul ups in battle. The book details many of the generals plans, and how they were not carried out correctly either resulting in disasters or unexpected miracles. This book gives you a real sense of what it took for Atlanta to be conquered and the valiant efforts of both sides in this struggle. Also the plight of African Americans and their role in the conflict detailed. At one point the confederates actually considered drafting African Americans into their army, and african americans helped both sides with fortifications and ditches. The Union african americans were paid for their help. The pictures of Atlanta showing old signs showing slaves for sale is shocking and reminds you that the right side won the war regardless of the atrocities commited by the North in Atlanta, or your pride in your ancestors who may have fought for the union or confederates. The book details the comradarie of the troops on both sides and how during the peaceful times that would trade tobacco for coffee and sing together. Then the next day they would be killing each other. Great book!","torrent":{"xt":"urn:btih:818123df5a970938e37648c9d41e2302172f1a97","amp;dn":"Battles+for+Atlanta-Sherman+moves+east+%28Time-Life+The+Civil+War%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"818123df5a970938e37648c9d41e2302172f1a97","infoHashBuffer":{"type":"Buffer","data":[129,129,35,223,90,151,9,56,227,118,72,201,212,30,35,2,23,47,26,151]},"announce":[],"urlList":[]}}