{"title":"Legends of the Fall (ENG GER)(MULTI SUBS 17) 2Lions-Team","uid":5145351,"size":4683396758,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:81e9f21940aecf5636dae2f9a0969f80d9f950ab&amp;dn=Legends+of+the+Fall+%28ENG+GER%29%28MULTI+SUBS+17%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Pioen","files":-1,"time":1257233735,"description":"Legends of the Fall (1994) \n\n\nVerenigde Staten\nDrama / Western\n132 minuten\n\ngeregisseerd door Edward Zwick\nmet Brad Pitt, Anthony Hopkins en Aidan Quinn\n\nNadat zijn vrouw hem in de steek gelaten heeft, blijft kolonel Ludlow, een oud cavalerieofficier, alleen achter in zijn afgelegen huis in Montana om zijn drie zonen op te voeden. Alfred, de oudste, is de meest redelijke. Hij heeft gevoel voor zaken en politiek. De omstuimige Samuel staat altijd klaar om zich te engageren voor onverdedigbare politieke zaken. De kolonel koestert een bijzondere affectie voor Tristan, die zijn sympathieÃƒÂ«n voor de indianen deelt. Na zijn universiteitsstudies keert Samuel terug met een verloofde, Susannah. Verrukt door de aanwezigheid van een vrouw onder hun dak sloven de vier mannen zich uit om haar te leren paardrijden en schieten. Al snel klikt het bijzonder goed tussen Susannah en Tristan. Dan breekt de Eerste Wereldoorlog uit en Samuel vertrekt om aan de zijde van de Canadezen te vechten...\n\nEnglish\n\nSet in the Rocky Mountains of Montana in the early 1900s, this is a tale of love, betrayal, and brotherhood. After being discharged, Colonel Ludlow decides to raise his three sons in the wilds of Montana, where they can grow up away from the government and society he has learned to dispise. The three brothers mature and seem to have an unbreakable bond, until Susanna enters their lives. When Samuel, the youngest of the three, returns from college he brings with him his beautiful fiance, Susanna. The eldest son, Alfred, soon finds himself in love with his brother's fiance, and things get worse when he discovers a growing passion between Susanna and Tristan. Colonel Ludlow's favorite son, Tristan is willful and as wild as the mountains. As the brothers set out to fight a war in Europe, suspicion and jelousy threatens to tear apart their once indestructable bond.\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail Pal\nAudio : 5.1 English, German, \nAudio : 3.2 English, German\nOndertitels : English, Germman, Dutch, Arabic, Bulgarian. Crech. Danish, Finnish, Greek, Hebrew, Hindi, Hungarian, Icelandic, Norwegian, Polish, Swedish, Turkish, (instelbaar)\n\n\n\nGenre : Drama\nWestern\n\nWeblink : http://www.moviemeter.nl/film/1349 \nWeblink : http://www.imdb.com/title/tt0110322\n\n***************************************** \n\nBrought to you by \nPioen \n2Lions Team \n\n\n\nmeer zien?? \nKom dan eens kijken op ons forum \n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding","torrent":{"xt":"urn:btih:81e9f21940aecf5636dae2f9a0969f80d9f950ab","amp;dn":"Legends+of+the+Fall+%28ENG+GER%29%28MULTI+SUBS+17%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81e9f21940aecf5636dae2f9a0969f80d9f950ab","infoHashBuffer":{"type":"Buffer","data":[129,233,242,25,64,174,207,86,54,218,226,249,160,150,159,128,217,249,80,171]},"announce":[],"urlList":[]}}