{"title":"Paul W. Taylor - Respect for Nature: A Theory of Environmental E","uid":10747918,"size":23297952,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:81f97bbcfbf5f658f5f9d24e1177cac80cd25915&amp;dn=Paul+W.+Taylor+-+Respect+for+Nature%3A+A+Theory+of+Environmental+E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":1,"time":1407841331,"description":"&quot;What rational justification is there for conceiving of all living things as possessing inherent worth? In Respect for Nature, Paul Taylor draws on biology, moral philosophy, and environmental science to defend a biocentric environmental ethic in which all life has value. Without making claims for the moral rights of plants and animals, he offers a reasoned alternative to the prevailing anthropocentric view--that the natural environment and its wildlife are valued only as objects for human use or enjoyment. Respect for Nature provides both a full account of the biological conditions for life--human or otherwise--and a comprehensive view of the complex relationship between human beings and the whole of nature.\n\nThis classic book remains a valuable resource for philosophers, biologists, and environmentalists alike--along with all those who care about the future of life on Earth. A new foreword by Dale Jamieson looks at how the original 1986 edition of Respect for Nature has shaped the study of environmental ethics, and shows why the work remains relevant to debates today.&quot; (from Princeton University Press website)","torrent":{"xt":"urn:btih:81f97bbcfbf5f658f5f9d24e1177cac80cd25915","amp;dn":"Paul+W.+Taylor+-+Respect+for+Nature%3A+A+Theory+of+Environmental+E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81f97bbcfbf5f658f5f9d24e1177cac80cd25915","infoHashBuffer":{"type":"Buffer","data":[129,249,123,188,251,245,246,88,245,249,210,78,17,119,202,200,12,210,89,21]},"announce":[],"urlList":[]}}