{"title":"Act of War: Lyndon Johnson, North... (2013) Jack Cheever (multi)","uid":9550299,"size":25529154,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:826deaf40455da96baf9b6de4a87395795565ca4&amp;dn=Act+of+War%3A+Lyndon+Johnson%2C+North...+%282013%29+Jack+Cheever+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"7","files":-1,"time":1391236901,"description":"Act of War: Lyndon Johnson, North Korea, and the Capture of the Spy Ship Pueblo by Jack Cheever\n\n\nFormat: mobi/epub/azw3\nLength: 449 pages\nGenre: Non-Fiction/History\nDate: 3 December 2013\n\nWith vivid clarity, Cheevers tells the amazing story of the capture of the Pueblo and its crew--one of many dangerous showdowns between North Korea and the US. A fascinating, well-rendered account of a little known episode in the ongoing conflict on the Korean peninsula.\n\nIn 1968, a small, dilapidated American spy ship set out on a dangerous mission: to pinpoint military radar stations along the coast of North Korea. Packed with advanced electronic-surveillance equipment and classified intelligence documents, the USS Pueblo was poorly armed and lacked backup by air or sea. Its crew, led by a charismatic, hard-drinking ex-submarine officer named Pete Bucher, was made up mostly of untested sailors in their teens and twenties.\n\nOn a frigid January morning while eavesdropping near the port of Wonsan, the Pueblo was challenged by a North Korean gunboat. When Bucher tried to escape, his ship was quickly surrounded by more patrol boats, shelled and machine-gunned, and forced to surrender. One American was killed and ten wounded, and Bucher and his young crew were taken prisoner by one of the world's most aggressive and erratic totalitarian regimes.\n\nLess than forty-eight hours before the Pueblo's capture, North Korean commandos had nearly succeeded in assassinating South Korea's president in downtown Seoul. Together, the two explosive incidents pushed Cold War tensions toward a flashpoint as both North and South Korea girded for war--with fifty thousand American soldiers caught between them. President Lyndon Johnson rushed U.S. combat ships and aircraft to reinforce South Korea, while secretly trying to negotiate a peaceful solution to the crisis.\n\nAuthor:\n\nJack Cheevers is a former Los Angeles Times reporter. He grew up in Massachusetts and New Hampshire and attended the University of California at Berkeley. For 27 years he was a newspaper reporter and editor in California. He began researching &quot;Act of War&quot; in 2000 by interviewing the Pueblo's charismatic ex-captain, Lloyd M. (Pete) Bucher.","torrent":{"xt":"urn:btih:826deaf40455da96baf9b6de4a87395795565ca4","amp;dn":"Act+of+War%3A+Lyndon+Johnson%2C+North...+%282013%29+Jack+Cheever+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"826deaf40455da96baf9b6de4a87395795565ca4","infoHashBuffer":{"type":"Buffer","data":[130,109,234,244,4,85,218,150,186,249,182,222,74,135,57,87,149,86,92,164]},"announce":[],"urlList":[]}}