{"title":"Airwolf Season 3","uid":5711305,"size":6660557284,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:82a01cf8aecd32923ae0382e28698da626b88a7e&amp;dn=Airwolf+Season+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"johnnyrep","files":17,"time":1279908625,"description":"Jan-Michael Vincent stars in Airwolf as Stringfellow Hawke, who, with trusty sidekick Dominic Santini (Ernest Borgnine), embarks on perilous missions for a top secret agency known as The Firm, which in turn allows him fairly free rein as he searches for his long lost brother. Vincent, then 40 years old, was still a year or two away from ruining his career with substance abuse problems, but his work here is hardly of Emmy-winning caliber; indeed, it's a lazy performance pretty much devoid of emotional resonance. Borgnine, on the other hand, is always reliable, but even the former Oscar winner (in 1955, for Marty) can't overcome Airwolf's procession of cardboard characters (especially the villains) and credulity-challenging scripts, which find our heroes traveling to a Laotian prison camp, battling nuclear terrorists in California, rescuing the president of a South American banana republic, investigating a religious cult, fending off jungle cats kept on a Texas hunting ranch, and saving a country singer from the nefarious machinations of her manager-husband, among other silliness. In fairness, creator-executive producer Donald Bellisario (who also brought us Magnum, P.I., Quantum Leap, and JAG) and his team make an effort to inject a human element; there's an episode in which Dominic is arrested for murdering his faithless wife, and a couple that find the guilt-ridden Hawke searching for his brother, Saint John (pronounced &quot;Sinjin&quot;), who was presumed lost during the Vietnam War when Stringfellow left him in the jungle. What's more, considering its relatively ancient pedigree, technology-wise, the effects work isn't bad, and there are some cool moments when the Airwolf helicopter does what it does best (i.e., blow stuff up). \n\n\nseason 1 here  &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5702824/Airwolf_Season_1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5702824/Airwolf_Season_1&lt;/a&gt;\t\n\n\nseason 2 here &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5706408/Airwolf_Season_2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5706408/Airwolf_Season_2&lt;/a&gt;\n\n\nmy uploads &lt;a href=&quot;\nhttp://thepiratebay.se/user/johnnyrep/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/johnnyrep/&lt;/a&gt;","torrent":{"xt":"urn:btih:82a01cf8aecd32923ae0382e28698da626b88a7e","amp;dn":"Airwolf+Season+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82a01cf8aecd32923ae0382e28698da626b88a7e","infoHashBuffer":{"type":"Buffer","data":[130,160,28,248,174,205,50,146,58,224,56,46,40,105,141,166,38,184,138,126]},"announce":[],"urlList":[]}}