{"title":"The Complete Obsidian Trilogy by Mercedes Lackey","uid":4219150,"size":4454637,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82b3cceaa935c8fd574eb92f4e7f5e09d5651148&amp;dn=The+Complete+Obsidian+Trilogy+by+Mercedes+Lackey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"The_Pink_Prince","files":4,"time":1212508733,"description":"The Obsidian Trilogy is a three-novel fantasy series, chronicling the journey of Kellen Tavadon in relation to the third war between the Light and the Endarkened, co-written by Mercedes Lackey and James Mallory. The series began with The Outstretched Shadow, released in 2002, continued in 2004 with To Light a Candle and reached its conclusion in 2006 with When Darkness Falls.\n[u]\nThe Outstretched Shadow [/u]\n\nSeventeen-year-old Kellen Tavadon has lived his whole life in the Mage City, Armathelieh. The son of High Mage Lycaelon Tavadon, Kellen is expected to become a stellar Mage by Armathelieh&amp;#039;s citizens. However, fate has different plans for him. Stumbling through the City&amp;#039;s Low Market, he comes upon three mysterious books ? the books of the Wild Magic ? an art forbidden by the High Mages. Kellen is accused and convicted for the practice of Wild Magic, after Lycaelon searches his room and finds the books. He is forced from the city by an Outlaw Hunt ? a rare event orchestrated by the mages of the Council to look like banishment ? but actually a cover-up for murder.\n\nKellen casts a Wild Magic spell asking for help in escaping the Outlaw Hunt. The Wild Magic grants him a unicorn named Shalkan who agrees to help Kellen on the condition that he remain chaste and celibate for one year. Seeing little choice, Kellen agrees. After he and Shalkan fight off the stone hounds of the Outlaw Hunt, both are badly injured and seek refuge at the home of a Wild Mage named Idalia.\n\n[u]To Light A Candle [/u]\n\nThe struggle Continues against the Demons and introduces new heroes and enemies along the way. As the Demons work to take control of the human city, Idalia pledges her love to Jermayan, and Kellen takes a seat among the elven war councils. Jarmayan forms a bond with a black dragon, Ancaladar, and becomes the first elven mage in a thousand years. After fighting what seems to be a down hill battle, the story ends with the discovery of the ultimate weapon against the endarkened; wild and high magic together.\n[u]\nWhen Darkness Falls [/u]\n\nDespite a great working of Wild Magic and High Magic that struck at the heart of the Demon Queen&amp;#039;s evil plots, Knight-Mage Kellen and his Elven allies are still seen as enemies by the human Mage Council. The Elves and their allies must find a way to shatter the Demons&amp;#039; hold on the human Mages, for without their High Magic, the forces of Light will be destroyed by the forces of Darkness. The Commander of the Armies of Light decides to turn an Elven mine into a refuge for those driven from their homes by the war. Kellen is put in command of the force of engineers and warriors who will fortify the mine and does not learn until it is nearly too late that the caverns are full of Shadowed Elves. Vestakia, the half-human, half-Demon healer, finds that she has begun to be able to read the mind of her Demon father, Crown Prince Zyperis. The Demon Queen, Savilla, is preparing a great sacrifice that will summon He Who Is back to the world and make her the ultimate ruler forever. When Wild Mage Idalia learns of Savilla&amp;#039;s plans, she knows there is only one way to prevent the coming of He Who Is. A very different sort of sacrifice must be made.\n\nThis is just a collection of all the books I found and decided to put them all together in one torrent as it seamed a bit silly having them all over the place. If you read these and decide you like them please think about buying them to support the authors.\n\n\nFile Size - 4.24mb ( 3 files ) ","torrent":{"xt":"urn:btih:82b3cceaa935c8fd574eb92f4e7f5e09d5651148","amp;dn":"The+Complete+Obsidian+Trilogy+by+Mercedes+Lackey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82b3cceaa935c8fd574eb92f4e7f5e09d5651148","infoHashBuffer":{"type":"Buffer","data":[130,179,204,234,169,53,200,253,87,78,185,47,78,127,94,9,213,101,17,72]},"announce":[],"urlList":[]}}