{"title":"Donald Ray Pollock - The Heavenly Table","uid":15514124,"size":397657362,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8315543c2b2afaf2c5fd30d6892f3ff15f09083e&amp;dn=Donald+Ray+Pollock+-+The+Heavenly+Table&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Laverna","files":1,"time":1470689387,"description":"From Donald Ray Pollock, author of the highly acclaimed The Devil All the Time and Knockemstiff, comes a dark, gritty, electrifying (and, disturbingly, weirdly funny) new novel that will solidify his place among the best contemporary American authors.\r\n\r\nIt is 1917, in that sliver of border land that divides Georgia from Alabama. Dispossessed farmer Pearl Jewett ekes out a hardscrabble existence with his three young sons: Cane (the eldest; handsome; intelligent); Cob (short; heavy set; a bit slow); and Chimney (the youngest; thin; ill-tempered). Several hundred miles away in southern Ohio, a farmer by the name of Ellsworth Fiddler lives with his son, Eddie, and his wife, Eula. After Ellsworth is swindled out of his family’s entire fortune, his life is put on a surprising, unforgettable, and violent trajectory that will directly lead him to cross paths with the Jewetts. No good can come of it. Or can it?\r\n\r\nIn the gothic tradition of Flannery O’Connor and Cormac McCarthy with a healthy dose of cinematic violence reminiscent of Sam Peckinpah, Quentin Tarantino and the Coen Brothers, the Jewetts and the Fiddlers will find their lives colliding in increasingly dark and horrific ways, placing Donald Ray Pollock firmly in the company of the genre’s literary masters. \r\n\r\nFormat: M4B\r\nBitrate: 64 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:8315543c2b2afaf2c5fd30d6892f3ff15f09083e","amp;dn":"Donald+Ray+Pollock+-+The+Heavenly+Table","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8315543c2b2afaf2c5fd30d6892f3ff15f09083e","infoHashBuffer":{"type":"Buffer","data":[131,21,84,60,43,42,250,242,197,253,48,214,137,47,63,241,95,9,8,62]},"announce":[],"urlList":[]}}