{"title":"Forensic Shakespeare[MyebookShelf]","uid":11631562,"size":1813048,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:833fa59460c0dd692564f4880b4cf5d1b8c284ff&amp;dn=Forensic+Shakespeare%5BMyebookShelf%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MyeBookShelf","files":-1,"time":1417679896,"description":"Forensic Shakespeare[MyebookShelf]\nEnglish | 2014 | ISBN: 0199558248 | 384 pages | PDF | 1,7 MB\nShakespeare and Judicial Rhetoric illustrates Shakespeare's creative processes by revealing some of the intellectual materials out of which some of his most famous works were composed. Focusing on the narrative poem Lucrece, on four of his late Elizabethan plays -- Romeo and Juliet, The Merchant of Venice, Julius Caesar and Hamlet -- and on three early Jacobean dramas, Othello, Measure for Measure and All's Well That Ends Well, Quentin Skinner argues that there are major speeches, and sometimes sequences of scenes, that are crafted according to a set of rhetorical precepts about how to develop a persuasive judicial case, either in accusation or defence. Some of these works have traditionally been grouped together as &quot;problem plays,&quot; but here Skinner offers a different explanation for their frequent similarities of tone. There have been many studies of Shakespeare's rhetoric, but they have generally concentrated on his wordplay and use of figures and tropes. By contrast, this study concentrates on Shakespeare's use of judicial rhetoric as a method of argument. By approaching the plays from this perspective, Skinner is able to account for some distinctive features of Shakespeare's vocabulary, and also help to explain why certain scenes follow a recurrent pattern and arrangement","torrent":{"xt":"urn:btih:833fa59460c0dd692564f4880b4cf5d1b8c284ff","amp;dn":"Forensic+Shakespeare%5BMyebookShelf%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"833fa59460c0dd692564f4880b4cf5d1b8c284ff","infoHashBuffer":{"type":"Buffer","data":[131,63,165,148,96,192,221,105,37,100,244,136,11,76,245,209,184,194,132,255]},"announce":[],"urlList":[]}}