{"title":"Microsoft Office Home and Student Edition 2013 All-in-One For Du","uid":9412348,"size":27906491,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83a12ee399b92569255455bebe9d183487813495&amp;dn=Microsoft+Office+Home+and+Student+Edition+2013+All-in-One+For+Du&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"prabhu_","files":2,"time":1388335885,"description":"Microsoft Office Home and Student Edition 2013 All-in-One For Dummies \n\nby Peter Weverka\n &lt;a href=&quot;\nhttp://img2.imagesbn.com/p/9781118516379_p0_v3_s260x420.JPG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img2.imagesbn.com/p/9781118516379_p0_v3_s260x420.JPG&lt;/a&gt;\n\nabout book :-\n\nThe go-to reference for the new Office Home &amp; Student 2013\n\nThe Home &amp; Student version of Microsoft Office targets the home and education markets, covering the four applications most used outside the workplace: Word, Excel, PowerPoint, and OneNote. The minibooks in this essential All-in-One guide include real-world examples and projects that cover the new features and capabilities of Office 2013. Straightforward advice and beneficial projects help you to learn the basics of creating a resume in Word, establishing a home budget in Excel, developing a dynamic school presentation with PowerPoint, and taking notes in OneNote.\n\nTargets home and school users of Office 2013, who primarily use Word, Excel, PowerPoint, and OneNote\nWalks you through how to use Office 2013 for everyday projects, such as creating a cover letter in Word or reusable templates in Excel\nDemonstrates how to jazz up a school presentation with PowerPoint\nProvides you with straightforward instructions for taking notes in OneNote\nShares common Office 2010 tools and details the basics of the Office ribbon\nOffice Home &amp; Student 2013 All-in-One For Dummies is an easy-to-understand guide to the essentials of Office 2013!\n\nAbout the Author :-\n\nPeter Weverka is a veteran For Dummies author who has written about a wide variety of applications. Along with two bestselling editions of Office All-in-One For Dummies, Peter has written PowerPoint All-in-One For Dummies and Microsoft Money For Dummies.\n\n\n\n`~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\t\n\n","torrent":{"xt":"urn:btih:83a12ee399b92569255455bebe9d183487813495","amp;dn":"Microsoft+Office+Home+and+Student+Edition+2013+All-in-One+For+Du","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83a12ee399b92569255455bebe9d183487813495","infoHashBuffer":{"type":"Buffer","data":[131,161,46,227,153,185,37,105,37,84,85,190,190,157,24,52,135,129,52,149]},"announce":[],"urlList":[]}}