{"title":"The Invisible History of the Human Race","uid":11355847,"size":3725845,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83ad0afd0e1f39f05333b61acb0b111dfa1eb546&amp;dn=The+Invisible+History+of+the+Human+Race&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1414940263,"description":"Christine Kenneally, &quot;The Invisible History of the Human Race: How DNA and History Shape Our Identities and Our Futures&quot;\nISBN: 0670025550 | 2014 | PDF, MOBI, EPUB | 368 pages | 3 MB\n\n\nHow biology, psychology, and history shape us as individuals\n\nWe are doomed to repeat history if we fail to learn from it, but how are we affected by the forces that are invisible to us? In The Invisible History of the Human Race\nChristine Kenneally draws on cutting-edge research to reveal how both historical artifacts and DNA tell us where we come from and where we may be going. While some\nbooks explore our genetic inheritance and popular television shows celebrate ancestry, this is the first book to explore how everything from DNA to emotions to names\nand the stories that form our lives are all part of our human legacy. Kenneally shows how trust is inherited in Africa, silence is passed down in Tasmania, and how the\nhistory of nations is written in our DNA. From fateful, ancient encounters to modern mass migrations and medical diagnoses, Kenneally explains how the forces that\nshaped the history of the world ultimately shape each human who inhabits it","torrent":{"xt":"urn:btih:83ad0afd0e1f39f05333b61acb0b111dfa1eb546","amp;dn":"The+Invisible+History+of+the+Human+Race","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83ad0afd0e1f39f05333b61acb0b111dfa1eb546","infoHashBuffer":{"type":"Buffer","data":[131,173,10,253,14,31,57,240,83,51,182,26,203,11,17,29,250,30,181,70]},"announce":[],"urlList":[]}}