{"title":"Neverwinter.Nights.2-RELOADED","uid":3550475,"size":6212711585,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:83e2d726bf412912eb6f414a7c802bdc129651c1&amp;dn=Neverwinter.Nights.2-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Ras_Putin","files":65,"time":1162536413,"description":"Neverwinter Nights 2 (c) Atari\n      \n        11/2006 :..... RELEASE.DATE .. PROTECTION .......: Securom\n              1 :.......... DISC(S) .. GAME.TYPE ........: RPG\n    \n                   ÃœÃŸÃŸ  ÃœÃŸÃŸÃœ ÃœÃŸÃœÃŸÃœ ÃœÃŸÃŸ  ÃŸ ÃœÃŸÃŸÃœ ÃœÃŸÃŸÃœ ÃœÃŸÃŸÃœ ÃœÃŸ\n  ÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸ Ã› ÃŸÂ² Ã›ÃŸÃŸÂ² Ã›   Â² Â²ÃŸ Ãœ Ã› Ã›  Â² Â²ÃŸ   Ã›  Â² ÃŸÃŸÃŸÃ› ÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸÃŸ\n                    ÃŸÃŸ  ÃŸ    ÃŸ   ÃŸ ÃŸÃŸÃŸÃŸ ÃŸ ÃŸ    ÃŸ     ÃŸÃŸ   ÃŸÃŸ\n \n  Neverwinter Nights 2 (NWN2) is a computer role-playing game set in the fantasy\n  world of the Forgotten Realms, one of the popular campaign settings of \n  Dungeons and Dragons. It takes the player from the tiniest of villages into a\n  sweeping tale of danger and war, chronicling their rise from a peasant to a \n  full-fledged hero of the Realms, defending it against one of the greatest \n  threats of the age.\n\n  Build a character that suits your style of play - good or evil, chaotic or \n  lawful, with any number of skills, feats and professions available at the \n  click of a button. Whether lobbing fireballs and researching forgotten spells \n  as a powerful Wizard, hacking a trail through legions of orcs as a Fighter \n  armed only with a battle axe and your courage, or taking on the role of a \n  Rogue that can slip into the shadows at a moment\\&amp;#039;s notice and take the purse \n  from even the most perceptive of guardsmen. Choose your alignment, your \n  allies, your companions, and how you want your character to develop... design \n  the character you want, role-play the way you want, and carry the battle to \n  the enemy.\n\n  The design aspects of Neverwinter Nights 2 don\\&amp;#039;t stop there, however. Past \n  the campaign included with the game itself, Neverwinter Nights 2 also gives \n  you all the tools you need to build your own modules, campaigns, and \n  adventures for your friends - move buildings, terrain, script encounters, \n  write dialogues, create quests and items - everything you need to create an\n  epic adventure of your own is included in the toolset for you and any other \n  worldbuilder to use.\n\n  So if you are interested in adventure - or building adventures of your own -\n  look no further. Neverwinter Nights 2 is on the horizon, and adventure awaits.","torrent":{"xt":"urn:btih:83e2d726bf412912eb6f414a7c802bdc129651c1","amp;dn":"Neverwinter.Nights.2-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83e2d726bf412912eb6f414a7c802bdc129651c1","infoHashBuffer":{"type":"Buffer","data":[131,226,215,38,191,65,41,18,235,111,65,74,124,128,43,220,18,150,81,193]},"announce":[],"urlList":[]}}