{"title":"War Of The Worlds Disc 1 of 30 Radio Broadcast","uid":9803750,"size":79291991,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8437d088540f5b17f49d28aa96f3e098f3aae927&amp;dn=War+Of+The+Worlds+Disc+1+of+30+Radio+Broadcast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1395424218,"description":"Greatest Old-Time Radio Shows of the 20th Century - War Of The Worlds Disc 1 of 30\n\n\n\n\nWikipedia\n\nThe War of the Worlds is an episode of the American radio drama anthology series The Mercury Theatre on the Air. It was performed as a Halloween episode of the series on October 30, 1938, and aired over the Columbia Broadcasting System radio network. Directed and narrated by actor and future filmmaker Orson Welles, the episode was an adaptation of H. G. Wells's novel The War of the Worlds (1898).\n\nThe first two thirds of the 62-minute broadcast were presented as a series of simulated news bulletins, which suggested to many listeners that an actual alien invasion by Martians was currently in progress. Compounding the issue was the fact that the Mercury Theatre on the Air was a sustaining show (it ran without commercial breaks), adding to the program's realism. Although there were sensationalist accounts in the press about a supposed panic in response to the broadcast, the precise extent of listener response has been debated, particularly since the show was not drawing a large share of the radio audience. Many more Americans were listening to Edgar Bergen; however, when Bergen's opening comedy routine ended and gave way to a musical interlude, many people may have started turning the radio dial to see what else was on. Those people found a radio show that sounded like a real account of an alien attack. The show did issue a disclaimer at the beginning of the show, but the people tuning in late did not hear that announcement and so a small panic did occur. [1]","torrent":{"xt":"urn:btih:8437d088540f5b17f49d28aa96f3e098f3aae927","amp;dn":"War+Of+The+Worlds+Disc+1+of+30+Radio+Broadcast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8437d088540f5b17f49d28aa96f3e098f3aae927","infoHashBuffer":{"type":"Buffer","data":[132,55,208,136,84,15,91,23,244,157,40,170,150,243,224,152,243,170,233,39]},"announce":[],"urlList":[]}}