{"title":"LICKS OF LOVE - John Updike. Read by Michael Prichard {FerraBit}","uid":5330681,"size":512436227,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:843988f4f91d536395f353472b31e565042da595&amp;dn=LICKS+OF+LOVE+-+John+Updike.+Read+by+Michael+Prichard+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"FerraBit","files":-1,"time":1265160472,"description":"LICKS OF LOVE by John Updike (2000)\nShort Stories and a Sequel, &quot;Rabbit Remembered&quot;\n\nRead by . . : Michael Prichard\nPublisher . : Books On Tape (2001) #5515-CD\nISBN . . . .: ISBN-10 0736662200 ISBN-13: 9780736662208\nFormat . . .: MP3.  63 tracks, 488 MB\nBitrate . . : ~85 kbps (iTunes 9, VBR, Mono, 44.1 kHz)\nSource . . .: 11 CDs (12.7 hours)\nGenre . . . : Fiction, Short stories\nUnabridged .: Unabridged\n\nNicely tagged and labeled, combined CD tracks, cover scan included.\n\nI have made torrents of the Rabbit series (read by Arthur Morey):\n\n- Rabbit, Run\t\t(1960)\n- Rabbit Redux\t\t(1971) \n- Rabbit Is Rich\t(1981) Pulitzer Prize\n- Rabbit at Rest\t(1990) Pulitzer Prize\n&gt; Rabbit Remembered\t(2001) (a novella)\n\nThanks for sharing &amp; caring.\nCheers, FerraBit\nJanuary 2010\n\n Links:\nhttp://en.wikipedia.org/wiki/John_Updike\n\nOriginally posted:            &lt;a href=&quot; https://thepiratebay.se/user/FerraBit&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/FerraBit&lt;/a&gt; (TPB) &amp; Demonoid\nPlease present your library card, and comment me some loving.\n______________________________________\n\nFrom the back cover:\n\nThe dozen short stories in Updike's new collection revisit many of the locales of his fiction: the small Pennsylvania town of Olinger, the lonely farm to which the hero moves as an adolescent, the exurban New England of adult camaraderie and sexual mischief, and the New York City of artistic ambition and taunting glamour. The title derives from a story in which an American banjo virtuoso demonstrates his licks to an enthralled Soviet audience in the heart of the Cold War, while being hounded by the epistolary aftermath of a one-night stand in Washington D.C. To these is added a novella-length sequel to Updike's quartet of novels about Harry &quot;Rabbit&quot; Angstrom in which several old strands come together at last.\n\n - - - - - - - - - -\n\nAmazon.com Review\n\nIf John Updike had never published anything but short stories--if the novels, essays, verse, and reams of occasional prose vanished into thin air--he would still be a presence to reckon with in American letters. Having said that, it's only fair to point out that his 13th collection, Licks of Love, is one of the master's patchier efforts. He has lost none of his notorious fluency, and even the duds are enlivened by lovely stabs of perception. But in several tales (&quot;The Women Who Got Away,&quot; &quot;New York Girl,&quot; &quot;Natural Color&quot;), Updike seems perversely bent on proving his detractors right, serving up familiar narratives of adultery and '60s-era swinging. There's no reason why lust and rage shouldn't dance attendance on this randy genius's old age. But he's already written about the art of extracurricular canoodling at such length that these entries are bound to seem like retreads.\n\nThat's the bad news. The good news is that the rest of the collection is a sheer delight. &quot;My Father on the Verge of Disgrace&quot; explores some fascinating Oedipal outskirts, even as the narrator's first cigarette takes on a theological accent: &quot;It was my way of becoming a human being, and part of being human is being on the verge of disgrace.&quot; In &quot;How Was It, Really?&quot; Updike unveils the real dirty secret of old age, which is not the persistence of erotic appetite but the inevitable, appalling failure of memory. Best of all, he returns to two of his longest-running franchises, with admirable results in both cases. &quot;His Oeuvre&quot; revives that Semitic doppelgÃƒÂ¤nger Henry Bech for one more lap around the track, and finds the author making intermittent fun of his own fancy prose style. Harry Angstrom is, needless to say, beyond hope of resurrection. But in a 182-page novella, &quot;Rabbit Remembered,&quot; Updike brings back his survivors for a superb, surprising curtain call. The author's present-tense notation of American life (whose paradoxical epicenter is, as always, Brewer, Pennsylvania) remains as mesmerizing as ever. And despite his death, the putative hero is everywhere, as his illegitimate daughter returns to the unwilling bosom of the Angstrom clan: &quot;A whiff of Harry, a pale glow, an unsettling drift comes off this girl, this thirty-nine-year-old piece of evidence.&quot; Wallowing in this unexpected bonus, Updike fans should steel themselves for a single pang of regret: this is likely to be the last Rabbit he will pull from his hat. --James Marcus --This text refers to the Hardcover edition.\n\n - - - - - - - - - -\n\nFrom Publishers Weekly\n\nHarry &quot;Rabbit&quot; Angstrom has been dead for a decade in Rabbit Remembered, the novella that closes this latest, richly evocative Updike collection. His widow, Janice, is married to Ronnie Harrison, the widower of Thelma, with whom Harry had a long-time liaison. His son Nelson's wife, Pru, whom Harry also briefly bedded, has left Nelson, who has kicked the coke habit and still lives in the old Springer house with Janice and Ronnie. The past surfaces unexpectedly when Annabelle Byers, Harry's illegitimate daughter, makes herself known to the family. The ramifications of Harry's legacy include a strained Thanksgiving dinner that degenerates into political argument and acrimonious insults, and a mordantly funny flashback to a scene in which Harry's cremated remains were inadvertently left on a closet shelf in a Comfort Inn. While Updike explores the dark territory of bitterness, resentment and guilt, he also includes his trademark ticker-tape of current events (Hillary's candidacy, etc.), a typically muddled millennium New Year's Eve and a surprisingly upbeat denouement. For Rabbit fans, this is a must-read. In addition, the 12 short stories collected here present a kaleidoscope of Updike settings and themes. One element is common to nearly all the tales: the protagonist is a libidinous married man, ever on the lookout for adulterous adventures. In all of them, nostalgia is pierced with insight and regret. This is a treasury of Updike's craft, each story a small gem.","torrent":{"xt":"urn:btih:843988f4f91d536395f353472b31e565042da595","amp;dn":"LICKS+OF+LOVE+-+John+Updike.+Read+by+Michael+Prichard+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"843988f4f91d536395f353472b31e565042da595","infoHashBuffer":{"type":"Buffer","data":[132,57,136,244,249,29,83,99,149,243,83,71,43,49,229,101,4,45,165,149]},"announce":[],"urlList":[]}}