{"title":"Army Of Lovers - Les Greatest Hits + [1995, 320 kbps]","uid":5008398,"size":378500774,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:846f0ab7452fab39fd98ef554c0e1f6492864471&amp;dn=Army+Of+Lovers+-+Les+Greatest+Hits+%2B+%5B1995%2C+320+kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"musicalibera","files":43,"time":1247862844,"description":"ARMY OF LOVERS  - Les Greatest Hits + (1995/1996)\n\nCodec: mp3.\nDescription: MPEG-1 Audio Layer 3.\nBit rate: 320 kbps.\nSample rate: 44100 Hz joint stereo.\nTags: ID3V1 &amp; ID3V2.\nSource format: CD.\nNumber of tracks 30.\n\nArmy Of Lovers' first greatest hits compilation, released in 1995. The band had then released two studio albums as a quartet with the formation Alexander Bard, Michaela de la Cour, Dominika Peczynski and Jean-Pierre Barda. La Camilla's departure from the band right at the very peak of their success in 1992 had been acrimonious, to say the least, and had even resulted in a public mud slinging contest in the media. Army Of Lovers with Michaela de la Cour shortly thereafter released the single &quot;Judgement Day&quot; which included lines like &quot;On judgment day I will get back on you, naked to the bone you will stand alone&quot; and La Camilla had fired back with &quot;Everytime You Lie&quot;; &quot;Everytime you lie to me, in everything you said, everytime you lie to me, I wish that you were dead&quot;...... Ouch. It therefore came as a major surprise that when the band reconvened for what they said was to be their final album, Michaela de la Cour had left the group - or been kicked out, depending on who you ask - and was to be replaced by..... you guessed it; La Camilla. As a sign of reconciliation &quot;Everytime You Lie&quot; was even included on &quot;Les Greatest Hits&quot;, side by side with &quot;Judgement Day&quot; no less. La Camilla was back on her throne, and there was no doubt whatsoever who was in charge this time around -  if the others didn't behave she quite literally cracked her whip! Jean-Pierre in turn wore an accessory which according to him was used by certain African tribes as a purse - but looked more like some sort of weapon too.... and left very little to imagination... if anything.... (see front cover).\n\nAs the band themselves explained, they had now come full circle and wanted to pursue other careers, Alexander Bard would in 1996 launch the new band Vacuum, La Camilla was to go solo, and Dominika and Jean-Pierre were soon to become some of Sweden's best-known TV personalities. But before that they felt that they needed to make a grandiose sortie from the music scene, they wanted to go out with a bang and more pomp and circumstance than ever before! And in their case that meant quite a lot! Glory, glamour and gold plated bananas! The result of this was the 18 track celebration &quot;Les Greatest Hits&quot; (no, not &quot;The Greatest Hits&quot; - &quot;LES Greatest Hits&quot;, naturellement), including all their classics like &quot;Crucified&quot;, &quot;Ride The Bullet&quot;, &quot;Obsession&quot;, &quot;Israelism&quot;, &quot;Lit De Parade&quot; etc. etc. and the album also featured three brand new recordings, two of which were also released as singles. The lead single &quot;Give My Life&quot;, with its soca and dancehall inspired arrangement, paradoxically became one of their biggest hits ever in Sweden and today counts as one of their signature tunes. If they wanted to end on a high, they had definitely succeeded. The follow-up was the ultra-fast techno track &quot;Venus And Mars&quot;, which also became a dancefloor favourite. As a contrast the third new track, which also closed the album, was the sombre and aptly titled &quot;Requiem&quot; and its lyrics with lines like &quot;it's time to drink adieu, a bitter coup de grÃƒÂ¢ce&quot; signalled that this was definitely &quot;the end of an era&quot;...........or was it? No, not quite, when &quot;Les Greatest Hits&quot; was released in the UK in early 1996 the band had recorded a fourth new track, &quot;King Midas&quot;, which replaced &quot;Stand Up For Myself&quot; on the U.K. edition, and which also was released as a single both in the UK, Continental Europe and Scandinavia. \n\nSo _that_ was the end then......? Again, not quite, or rather for the time being it was. The four members then went their separate ways but five years later they, to the joy of their legions of fans all over the world, returned with another greatest hits album; &quot;Le Grand Docu-Soap&quot; - and again with a few brand new over-the-top ultra-ethno-camp, larger-than-life disco extravaganzas.... Bless their little hearts.\n\n....simply.... \n\nSee also &quot;Le Grand-Docu-Soap&quot;/&quot;Le Remixed Docu-Soap&quot;: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5017521&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5017521&lt;/a&gt;\n\n\nTRACK LIST\n\nLes Greatest Hits\n=================\n\n01. Give My Life \n02. Venus And Mars \n03. My Army Of Lovers \n04. Ride The Bullet (1992 Remix) \n05. Supernatural (1991 Remix)\n06. Crucified \n07. Obsession \n08. Candyman Messiah (Single Remix) \n09. Judgment Day \n10. Everytime You Lie (La Camilla solo single) \n11. Israelism \n12. La Plage De Saint Tropez \n13. I Am \n14. Lit De Parade (Radio Edit)\n15. Sexual Revolution (Latin Radio Edit) \n16. Life Is Fantastic (The 1995 Remix) \n17. Stand Up For Myself (The 1995 Remix) \n18. Requiem\n19. Give My Life (Sound Factory Mix)\n20. Give My Life (Temple Of Doom Mix)\n21. Give My Life (Love Society Mix)\n22. Everytime You Lie (Killer Version)\n23. Everytime You Lie (Extended Version)\n24. Everytime You Lie (Duende)\n25. King Midas (Radio Edit)\n26. King Midas (Manhattan Massacre Mix)\n27. King Midas (Bass Nation's 4 Seasons Mix)\n28. Venus And Mars (Antiloop Club Mix)\n29. Crucified (Candygirls Remix)\n30. Megamix\n\nEnjoy - and thanks in advance for seeding.","torrent":{"xt":"urn:btih:846f0ab7452fab39fd98ef554c0e1f6492864471","amp;dn":"Army+Of+Lovers+-+Les+Greatest+Hits+%2B+%5B1995%2C+320+kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"846f0ab7452fab39fd98ef554c0e1f6492864471","infoHashBuffer":{"type":"Buffer","data":[132,111,10,183,69,47,171,57,253,152,239,85,76,14,31,100,146,134,68,113]},"announce":[],"urlList":[]}}