{"title":"Heaven Can Wait (1943) Gene Tierney,Don Ameche","uid":4778744,"size":738631750,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:84b6ea9a00f32591c319052beb3c24dd912e371e&amp;dn=Heaven+Can+Wait+%281943%29+Gene+Tierney%2CDon+Ameche&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"johnefp","files":-1,"time":1237308446,"description":"MULTI SUBS:Dutch,German,English,Italian,French,Swedish\n\n\nPlot Synopsis  \tby Hal Erickson\n\nOn the day of his death in 1943, the spirit of Henry Van Cleave (Don Ameche) obligingly heads for the place where so many people had previously told him to go. The immaculately dressed septuagenarian arrives at the outer offices of Hades, where he is greeted by His Excellency (Laird Cregar), the most courteous and gentlemanly Satan in screen history. His Excellency doubts that Van Cleave has sinned enough to qualify for entrance into Hades, but Henry insists that he's led the most wicked of lives, and proceeds to tell his story. Each milestone of Henry's life, it seems, has occurred on one of his birthdays. Upon reaching 15, Henry (played as a teenager by Dickie Moore) naively permits himself to get drunk with and be seduced by his family's French maid (Signe Hasso). At 21, Henry elopes with lovely Martha Strabel (Gene Tierney) stealing her away from her stuffy fiance Albert Van Cleve (Allyn Joslyn), Henry's cousin. At 31, Henry nearly loses Martha when, weary of his harmless extracurricular flirtations, she goes home to her boorish parents (Eugene Pallette and Marjorie Main). Henry's grandpa (Charles Coburn) orders the errant husband not to let so wonderful a girl as Martha get away from him. Henry once more declares his love to Martha, and she can't help but be touched by his boyish sincerity. Twenty years later, Henry, now a faithful and proper husband and father, attempts to charm a beautiful musical-comedy entertainer (Helen Walker) so that she'll forsake his young and impressionable son. But Henry's gay-90s romantic approach is out of touch with the Roaring 20s, and he ends up paying the entertainer a tidy sum to rescue his son--a fact that amuses Henry's understanding wife Martha, who now knows that her husband is hers and hers alone. Ten more years pass: Henry dances a last waltz with Martha, whose loving smile hides the fact that she knows she hasn't much longer to live. Five years later, it is &quot;foxy grandpa&quot; Henry who must be kept in check by his conservative son Jack (Michael Ames). Finally, it is 1943: as he quietly drinks in the loveliness of his night nurse (Doris Merrick), the bedridden Henry contentedly breathes his last. His story told, Henry once again asks to be permitted to enter Hades. But His Excellency, realizing that the only &quot;sin&quot; Henry has truly committed is attempting to live life to the fullest, quietly replies &quot;If you'll forgive me, Mr. Van Cleave, we just don't want your kind down here.&quot; While he allows that Henry may have some trouble getting past the Pearly Gates, the wait will be worth it, since his loving wife Martha will be waiting for him. His Excellency cordially escorts Henry to the elevator, giving the operator a one-word instruction: &quot;Up.&quot; A charming delight from first frame to last, Heaven Can Wait is another winner from director Ernst Lubitsch, and his first in Technicolor. Samson Raphaelson's screenplay was based on Birthdays, a play by Laslo Bus-Fekete. \n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0035979/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0035979/&lt;/a&gt;\n\n\nEXTRA SUBS:\n\n &lt;a href=&quot;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-22171&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-22171&lt;/a&gt;\n\n\nDirector:\nErnst Lubitsch\n\n\n        Don Ameche\t ... \tHenry Van Cleve\n\tTod Andrews\t... \tJack Van Cleve (as Michael Ames)\n\tSpring Byington\t... \tBertha Van Cleve\n\tLouis Calhern\t... \tRandolph Van Cleve\n\tCharles Coburn\t... \tHugo Van Cleve\n\tGene Tierney\t... \tMartha\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 01:48:02\nMovie complete : Yes\n\n[Video]\nResolution : 576x432\nCodec : XviD MPEG-4 codec\nFPS : 25,00\nBitRate : 813 Kbps\nQuality Factor : 0,13 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 96 Kbps\n","torrent":{"xt":"urn:btih:84b6ea9a00f32591c319052beb3c24dd912e371e","amp;dn":"Heaven+Can+Wait+%281943%29+Gene+Tierney%2CDon+Ameche","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84b6ea9a00f32591c319052beb3c24dd912e371e","infoHashBuffer":{"type":"Buffer","data":[132,182,234,154,0,243,37,145,195,25,5,43,235,60,36,221,145,46,55,30]},"announce":[],"urlList":[]}}