{"title":"The Philokalia (4 vols) (pdf)","uid":9250262,"size":18593006,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:851be1311340f4f42b3fd2a382f8433d014541a7&amp;dn=The+Philokalia+%284+vols%29+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1385451671,"description":"St Nikodimos of the Holy Mountain and St Makarios of Corinth (editors); G. E. H. Palmer, Philip Sherrard, and Kallistos Ware (translators) The Philokalia: The Complete Text (Volumes 1-4)(Faber and Faber, 1979-1995).\n\nNew scans. Searchable pdf files (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nMost of this text is available widely on the internet, including here on tpb, and very cheaply on the commercial sites. For some purposes those other versions might be preferable to this one. But the advantage of these new scans is that they present every page of the printed books exactly as they appear in print.\n\nThe volumes presented here are the four existing volumes of a planned five-volume set; whether the fifth volume will ever be published is anyone's guess.\n\n\ndescription from wikipedia:\n\nThe Philokalia is &quot;a collection of texts written between the 4th and 15th centuries by spiritual masters&quot; of the Eastern Orthodox hesychast tradition. They were originally written for the guidance and instruction of monks in &quot;the practise of the contemplative life&quot;. The collection was compiled in the eighteenth-century by St. Nikodemos of the Holy Mountain and St. Makarios of Corinth.\n\nAlthough these works were individually known in the monastic culture of Greek Orthodox Christianity before their inclusion in The Philokalia, their presence in this collection resulted in a much wider readership due to its translation into several languages. The earliest translations included a Church Slavonic translation of selected texts by Paisius Velichkovsky (Dobrotolublye) in 1793, a Russian translation by Ignatius Bryanchaninov in 1857, and a five-volume translation into Russian (Dobrotolyubie) by St. Theophan the Recluse in 1877. There were subsequent Romanian, Italian and French translations.\n\nThe book is a &quot;principal spiritual text&quot; for all the Eastern Orthodox Churches; the publishers of the current English translation state that &quot;The Philokalia has exercised an influence far greater than that of any book other than the Bible in the recent history of the Orthodox Church.&quot;\n\n----\n\nThe translation in this torrent is from the Greek edition. A selection of writings from the Russian version (which includes some writings not present in the books in this torrent) is available here:\n &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/8807669&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/8807669&lt;/a&gt;","torrent":{"xt":"urn:btih:851be1311340f4f42b3fd2a382f8433d014541a7","amp;dn":"The+Philokalia+%284+vols%29+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"851be1311340f4f42b3fd2a382f8433d014541a7","infoHashBuffer":{"type":"Buffer","data":[133,27,225,49,19,64,244,244,43,63,210,163,130,248,67,61,1,69,65,167]},"announce":[],"urlList":[]}}