{"title":"Lou Bond - Same (1974) MP3@320","uid":9633804,"size":98380705,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8521ef8cfa556f8640f2224fbcbbade4de2ee2f1&amp;dn=Lou+Bond+-+Same+%281974%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"AaronVincent","files":11,"time":1392821771,"description":"Lou Bond is one of the forgotten heroes of Stax Records. Before he cut this record, his one and only album, he'd made two singles -- &quot;Oh Cheater&quot; b/w &quot;What Have I Done,&quot; and &quot;You Shake Me Up&quot; b/w &quot;Don't Start Me Crying.&quot; England's Northern soul collectors now treasure both records, but the music on his self-titled album is its own animal. Black psychedelic crooners are few and far between, and, in fact, Bond may be the only one. Perhaps that's why Stax originally released this album on the We Produce subsidiary. Bond and his producer/arrangers -- Jo Bridges (Rufus Thomas, the Temprees), Lester Snell (Isaac Hayes), and Tom Nixon (Rufus Thomas) -- really went out on a limb here by presenting Bond's soulful, folk-influenced singer/songwriter protest songs with a blend of Memphis soul, orchestral strings, and jazzy horn charts. The tempos stay slow and dreamy, which may have made it a hard sell on its original release in 1974, but it's just as likely that the combination of soul and folk wasn't something people were ready for. Pity, because Bond's unique vocal style is nothing short of amazing. He has a passionate growl that can slide up easily to a spine-tingling falsetto, and a unique lyrical approach. He opens with Jimmy Webb's &quot;Lucky Me,&quot; a treacle-drenched tune that Bond turns into a wrenching lament. The soaring strings are almost a parody of pop, but Bond's bluesy delivery keeps everything down to earth. &quot;Why Must Our Eyes Always Be Turned Backwards&quot; is a Bond original with popping bass, acoustic piano, and understated strings. He slips into his falsetto for this meandering protest song that references Vietnam, Pakistan, Attica, school bussing, religion, and other hot button topics. When he drops a quote from &quot;American the Beautiful&quot; into the mix, it oozes with irony. &quot;To the Establishment&quot; is the album's masterwork, eleven minutes of protest music that ranks up there with Marvin Gaye's &quot;What's Goin'On.&quot; Bond uses his playful high register to ornament the melody, and finishes the tune with several minutes of gospel-esque improvisations full of sighs, cries, stuttered notes, growls, and wails. He also applies his falsetto to Carly Simon's cynical ode &quot;That's the Way I've Always Heard It Should Be&quot; and wrings every once of painful ambivalence out of the lyric. The glacial groove is full of subtle percussive touches. &quot;Come on Snob&quot; could just as easily be called &quot;Come on Whitey.&quot; It sports another kaleidoscopic, ever-shifting lyric that decries discrimination and materialism. The arrangement features flute, strings, and the bass strings of Bond's acoustic. His pleading refrain of &quot;Please, please, please, please, please&quot; references James Brown without overt imitation, and his moaned improvisations are superb. The set closes with a tune that wasn't on the original album, a cover of Al Green's &quot;I'm Still in Love with You&quot; played by Bond as a guitar and vocal showcase. Bond scats all over the lyric to open the tune, does a brief verse, then slips into the traditional &quot;Sometimes I Feel Like a Motherless Child,&quot; sustaining a stunning falsetto note for almost a minute. This reissue from Light in the Attic comes in a gatefold CD package with extensive liner notes and lyrics enclosed.","torrent":{"xt":"urn:btih:8521ef8cfa556f8640f2224fbcbbade4de2ee2f1","amp;dn":"Lou+Bond+-+Same+%281974%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8521ef8cfa556f8640f2224fbcbbade4de2ee2f1","infoHashBuffer":{"type":"Buffer","data":[133,33,239,140,250,85,111,134,64,242,34,79,188,187,173,228,222,46,226,241]},"announce":[],"urlList":[]}}