{"title":"MomsTeachSex - Ariella Ferrera, Maddy Rose (Mom Got Caught)","uid":12760839,"size":454081971,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:854a57e13fd4c1947c33f27d02775e7bb59fe08c&amp;dn=MomsTeachSex+-+Ariella+Ferrera%2C+Maddy+Rose+%28Mom+Got+Caught%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"EndYou","files":1,"time":1447530983,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/image/Zc2 \nhttp://imgpremium.com/image/Zc5\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nThe name of the actress: Ariella Ferrera, Maddy Rose\r\nName movie: Mom Got Caught\r\nNPP site and the site: MomsTeachSex.com / NubilesNetwork.com\r\n\r\nYear: 2015\r\nGenre: Small Boobs, Big Boobs, Blonde, Black Hair, Long hair, Hardcore, Lesbian, Latina, Petite, Milf, Girl-Girl-Boy, Blowjob, Pussy Licking\r\nDuration: 00:31:22\r\n\r\nMaddy Rose is coming upstairs to eat her lunch when she catches her stepmom Ariella Ferrera getting her creamy pussy pounded by Johnny Castle. The juicy milf calls her stepdaughter over for a heart to heart, and when Maddy admits that she's never given a blowjob or even played with her own twat before Ariella decides to show her the ropes.\r\n\r\nAriella starts by showing Maddy how to warm herself up by playing with her clit and pressing her fingers into her snatch. Soon, though, they graduate to a blowjob lesson that Johnny is happy to help out with. Although she is shy and tentative at first, Maddy soon gets into the spirit and begins to loosen up. She gets even more aroused when Johnny helps Ariella demonstrate what a proper pussy licking feels like by burying his tongue in her dripping slit.\r\n\r\nNow that Maddy is all warmed up, Ariella instructs Johnny to rise up on his knees and slide into her tight twat. He takes things slow at first, but when he finds Maddy receptive and eager he starts pounding harder and faster until her moans fill the room. Meanwhile, Ariella continues Maddy's feminine education by positioning her enhanced tits and soft twat right above her stepdaughter's mouth to be eaten out.\r\n\r\nThe trio changes things up so that Johnny can indulge himself in Ariella's horny fuck hole for a while, but they keep Maddy in the loop as Ariella works her mouth over her stepdaughter's soft bald snatch. Then it's time for Maddy to go for her very first stiffie ride with her stepmom making sure to show her just how it's done.\r\n\r\nWhen Ariella finally rides her way to the climax that her landing strip puss craves, she shows Maddy that there's one more lesson to learn: Making her man cum. Using her words to guide her stepdaughter, Ariella talks Maddy through giving a handjob that eventually works Johnny over the edge so that his cum spurts all over Ariella's fuzzy mound. The girls each take a sample, finishing their lovemaking by agreeing that jizz is a tasty treat.\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 960x540 23.976fps 1796kbps\r\nAudio: AAC 44100Hz stereo 127kbps","torrent":{"xt":"urn:btih:854a57e13fd4c1947c33f27d02775e7bb59fe08c","amp;dn":"MomsTeachSex+-+Ariella+Ferrera%2C+Maddy+Rose+%28Mom+Got+Caught%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"854a57e13fd4c1947c33f27d02775e7bb59fe08c","infoHashBuffer":{"type":"Buffer","data":[133,74,87,225,63,212,193,148,124,51,242,125,2,119,94,123,181,159,224,140]},"announce":[],"urlList":[]}}