{"title":"REM - The Best Of REM (1991) [LOSSLESS FLAC][Tntvillage]","uid":5311937,"size":402978494,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:85a8b259f4bb346a792470c5d3d3076e20153262&amp;dn=REM+-+The+Best+Of+REM+%281991%29+%5BLOSSLESS+FLAC%5D%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"RDaneel20","files":19,"time":1264593164,"description":"REM - The Best Of REM (1991) [LOSSLESS FLAC][Tntvillage.Scambioetico]\n\n\n\nR.E.M. - The Best Of R.E.M.\n\n\nby RDaneel\n\n\n\n\n\n\n\n\n\n[::Album Information::]\n\nTitle: The Best Of R.E.M.\nYears: 1991\nGenre: Alternative Rock\nProduction: I.R.S.\n\n\n\n[::Tracklist::]\n\n\n\n01. Carnival Of Sorts - 3:53\n02. Radio Free Europe - 4:05\n03. Perfect Circle - 3:28\n04. Talk About The Passion - 3:23\n05. So. Central Rain - 3:15\n06. (Don't Go Back To) Rockville - 4:32\n07. Pretty Persuasion - 3:50\n08. Green Grow The Rushes - 3:45\n09. Can't Get There From Here - 3:40\n10. Driver 8 - 3:25\n11. Fall On Me - 2:52\n12. I Believe - 3:47\n13. Cuyahoga - 4:20\n14. The One I Love - 3:17\n15. Finest Worksong - 3:49\n16. Its The End Of The World As We Know It (And I Feel Fine) - 4:04\n\n\n\n\n\n[::Review::]\n\nR.E.M. is an American rock band formed in Athens, Georgia, in 1980 by Michael Stipe (lead vocals), Peter Buck (guitar), Mike Mills (bass guitar), and Bill Berry (drums and percussion). R.E.M. was one of the first popular alternative rock bands, and gained early attention due to Buck's ringing, arpeggiated guitar style and Stipe's unclear vocals. R.E.M. released its first single, &quot;Radio Free Europe&quot;, in 1981 on the independent record label Hib-Tone. The single was followed by the Chronic Town EP in 1982, the band's first release on I.R.S. Records. In 1983, the band released its critically acclaimed debut album Murmur, and built its reputation over the next few years through subsequent releases, constant touring, and the support of college radio. Following years of underground success, R.E.M. achieved a mainstream hit in 1987 with the single &quot;The One I Love&quot;. The group signed to Warner Bros. Records in 1988, and began to espouse political and environmental concerns while playing large arenas worldwide.\nBy the early 1990s, when alternative rock began to experience broad mainstream success, R.E.M. was viewed as a pioneer of the genre and released its two most commercially successful albums, Out of Time (1991) and Automatic for the People (1992), which veered from the band's established sound. R.E.M.'s 1994 release Monster was a return to a more rock-oriented sound. The band began its first tour in six years to support the album; the tour was marred by medical emergencies suffered by three band members. In 1996, R.E.M. re-signed with Warner Bros. for a reported US$80 million, at the time the most expensive recording contract in history. The following year, Bill Berry left the band amicably, while Buck, Mills, and Stipe continued the group as a three-piece. Through some changes in musical style, the band continued its career into the next decade with mixed critical and commercial success. In 2007, the band was inducted into the Rock and Roll Hall of Fame.\n\nThe Best of R.E.M. was a greatest hits album by R.E.M. released in 1991, shortly after the success of the band's previous Warner Bros. album, Out of Time. The Best of R.E.M., however, was released by the band's previous record label, I.R.S. Records, as were a few more &quot;special edition&quot; versions of their other albums including bonus tracks.\nThis record was only issued in the United Kingdom, New Zealand and Australia, complete with liner notes from Remarks: The Story of R.E.M. by Tony Fletcher. It had no alternate mixes (unlike the other compilation album Eponymous), as all the songs were the versions found on the previous albums.\nThree songs were taken from each of the five studio albums and one song was taken from Chronic Town, the band's first EP. Thus there were sixteen songs on this album.\nBecause it was issued out-of-contract, this album is generally not considered to be part of R.E.M.'s official discography.\n","torrent":{"xt":"urn:btih:85a8b259f4bb346a792470c5d3d3076e20153262","amp;dn":"REM+-+The+Best+Of+REM+%281991%29+%5BLOSSLESS+FLAC%5D%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85a8b259f4bb346a792470c5d3d3076e20153262","infoHashBuffer":{"type":"Buffer","data":[133,168,178,89,244,187,52,106,121,36,112,197,211,211,7,110,32,21,50,98]},"announce":[],"urlList":[]}}