{"title":"Seven trails West (History Photography Ebook).pdf","uid":11220953,"size":25689573,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:861fe1b681bb28d490d2f26fd098122a6a7871a7&amp;dn=Seven+trails+West+%28History+Photography+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1413384208,"description":"Pdf / English / 1996 / 252 pages / 24.4 MB\n\nThis volume tells many stories in one: the epic tale of men and women (some of them famous trailbreakers, some little known); the lures that attracted these pragmatic dreamers to the West; and the ordeals and disappointments they overcame along the way. Illustrated with archival photographs, paintings, maps and documents, the book offers the general reader an overview of the western trail network that bound an immature nation together and provided an armature for later development.\n\n****\n\nFrom Publishers Weekly\nThe Lewis and Clark expedition blazed the way; nearly 65 years later, the first transcontinental railroad joined the &quot;old&quot; United States with the West. The intervening years had seen a half-million people heading west. Peters surveys the major migration routes: the Santa Fe Trail (commercial), the Oregon-California Trail (probably the best known), the Mormon Trail and the communication trails (Pony Express, Telegraph, Railroad). Peters (Cocteau and His Circle) draws on personal experiences of the emigrants, newspaper articles of the period and local history for a colorful account of the westward movement. His stories of the Mormon Trail and Pony Express are especially notable. This handsome book is illustrated with photographs, paintings, maps and documents-a treat for history and Western buffs. \nCopyright 1996 Reed Business Information, Inc.\n\n****\n\nFrom School Library Journal\nYA-A superbly researched, written, and organized account of the seven major trails that opened up the American continent between 1804 and 1869. Peters spent over eight years conceptualizing, researching, and finalizing this excellent account of Lewis and Clark's expedition, the Santa Fe Trail, the Oregon-California Trail, the Mormon Trail, the Pony Express, the Transcontinental Telegraph, and, finally, the Transcontinental Railroad. Numerous maps and abundant engravings and reproductions supplement the vast amount of information presented in a very readable format. These illustrations are strategically placed throughout the book, creating a visually delightful volume. The trails come alive with short descriptive biographies of the people involved in their origin and development as well as incidents that occurred along the way. Many tragic stories are included such as the Donner Party, the Taos Uprising, the Massacre at Mountain Meadows, and the Handcart Companies' ordeal. Primary sources are used throughout the text. A chronology, bibliography, list of notes, and detailed index add extensively to this valuable resource. Indispensable for a reference collection, and a model of what an excellent nonfiction book can be.\nKraft, formerly at Fairfax County Public Schools, VA\nCopyright 1996 Reed Business Information, Inc","torrent":{"xt":"urn:btih:861fe1b681bb28d490d2f26fd098122a6a7871a7","amp;dn":"Seven+trails+West+%28History+Photography+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"861fe1b681bb28d490d2f26fd098122a6a7871a7","infoHashBuffer":{"type":"Buffer","data":[134,31,225,182,129,187,40,212,144,210,242,111,208,152,18,42,106,120,113,167]},"announce":[],"urlList":[]}}