{"title":"The Witcher 3 Wild Hunt [GOG] V1.21","uid":14938855,"size":61981527734,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8695c4a9e06f6c310f343a897e46b505b5b182fe&amp;dn=The+Witcher+3+Wild+Hunt+%5BGOG%5D+V1.21&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"ojusko","files":51,"time":1466010657,"description":"Year of release: 19 May 2015 \r\nGenre: RPG , 3D , 3rd Person \r\nVersion: 1.21\r\nDeveloper: CD Projekt RED CD \r\nPublisher: Namco Bandai Games \r\nPublication Type: License (GOG) \r\nLanguage: Russian, English, Polish MULTi15 \r\nLanguage: Russian, English, Polish \r\nTablet: not required (DRM-Free) \r\n\r\nSystem requirements:\r\nOperating system: 64-bit Windows 7 or 64-bit Windows 8 (8.1) \r\nprocessor: Intel Core i5-2500K CPU 3.3 GHz or AMD CPU Phenom II X4 940 \r\nRAM: 6 GB \r\nVideo Card: Nvidia GPU GeForce GTX 660 / AMD GPU Radeon HD 7870 \r\nSound card: Sound device compatible with DirectX® 9.0c \r\nFree space on hard drive: 40 GB\r\n\r\nDescription:\r\nThe Witcher 3: Wild Hunt &quot;- the role of the new generation game that takes place in an amazing fantasy world, where you need to make difficult decisions and take responsibility for their consequences. \r\nThe world at war. Military Empire Nilfgaard erases everything in its path, trying to get to the heart of the Northern Kingdoms. Driven by a deep personal motives famous Witcher, Geralt of Rivia, will stop at nothing to find and protect the kind of lady, mentioned in ancient prophecy. Meanwhile behind him himself on the heels of the enemy, knows no fear and pity, the most unimaginable nightmare - The Wild Hunt, a cavalcade of ghostly riders, harbingers of fate and death, can not leave a trace of entire communities ... for one only night of \r\n&quot;The Witcher 3: Wild Hunting &quot;offers a non-linear, adult, rich history and unparalleled fighting system without using the QTE, which combines a wide range of tactical elements inherent in role-playing games, with a dynamic and spectacular battles, worthy of the best action games of the genre.\r\n\r\nFeatures:\r\nIn the role of Geralt of Rivia, the witcher, hunted monsters murder, take the legendary journey across a huge open world, living and fair as ever. Here, days are replaced by night, and sometimes treacherous weather can disrupt all the plans and force to act differently than you intended. \r\nYou will draw war-torn land, the windswept archipelago harsh Skellig and the thriving port city of Novigrad. Each area has its own unique atmosphere, inspired by the myths and legends of various cultures. For a complete study of this wonderful world it will take more than 100 hours of game play. \r\nThe script follows the decisions that you make during the game. In this way you will find a lot of unexpected events, and believable, memorable characters, each of whom -. Their motives and ambitions are \r\nunique combat system offers wide possibilities for choosing tactics in the most spectacular and saturated battles ever seen in the genre of games RPG. \r\nImprove and develop unique skills witch, adapting the game for themselves. Follow interesting job and collect the priceless artifacts. Engage hunt bloodthirsty monsters, using your own strategy. Use combat magic. Wanderings on foot, horseback and sailing, paving its own unique way through the endless world, bestower of limitless possibilities. \r\nBuilt on a modern graphics technology REDengine 3, the game &quot;The Witcher 3: Wild Hunt&quot; marks a new era in the field of visualization RPG and raises the bar on a hitherto unknown height, ensuring an incredibly powerful experience and a deep dive into the virtual world. \r\n&quot;the Witcher 3: Wild Hunt&quot; is equally likely to appeal to both longtime fans and those who first acquainted with Witcher Geralt of Rivia and amazing world, full of bloodthirsty beasts - and sometimes in human form.\r\n\r\nFeatures of release:\r\nThe image-based Jewel-case edition of the game\r\nThe release includes an update to version 1.21\r\nA set of free extras\r\nSupplement Stone Heart\r\nSupplement the Blood and Wine\r\nDigital bonuses GOG-Publishing\r\nModKit\r\nAll the content is relevant to 12/06/2016\r\n\r\nInstallation and startup:\r\nInstall, configure installation options in the installer.\r\nUpon completion of a successful installation, to update from the folder  The Witcher 3 Wild Hunt  Patches.\r\nInstall the language pack from the folder  The Witcher 3 Wild Hunt  Language Pack to choose Polish or Russian to start Russian or Polish localization ...\r\nOptionally install add-ons from the folder  The Witcher 3 Wild Hunt  DLC.\r\nInstall the language pack setup_blood_and_wine_lang_pack_2.0.0.44.exe folder  The Witcher 3 Wild Hunt  DLC  The Witcher 3 Wild Hunt - Blood and Wine DLC v.1.21 - GOG  DLC - Blood and Wine Language Pack for activation Russian localization .. .\r\nEverything is ready for launch, an enjoyable game!","torrent":{"xt":"urn:btih:8695c4a9e06f6c310f343a897e46b505b5b182fe","amp;dn":"The+Witcher+3+Wild+Hunt+%5BGOG%5D+V1.21","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8695c4a9e06f6c310f343a897e46b505b5b182fe","infoHashBuffer":{"type":"Buffer","data":[134,149,196,169,224,111,108,49,15,52,58,137,126,70,181,5,181,177,130,254]},"announce":[],"urlList":[]}}