{"title":"Led Zeppelin Live at the Royal Albert Hall","uid":7376054,"size":244075769,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:86a30aede7a4bbfca5c293b15eb22a1308102691&amp;dn=Led+Zeppelin+Live+at+the+Royal+Albert+Hall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"NCC86","files":12,"time":1340365414,"description":"You may have seen the movie from the Led Zeppelin Live at the Royal Albert Hall concert filmed in 1970, but you probably haven't seen/heard the album. I downloaded this album off of TPB years ago and I recently saw that it had been taken down, so I decided to put it back up myself. It is an AMAZING album. The audio quality is great for a live show. They played one of the best shows of their lives that night and definitely the best renditions of I Can't Quit You Baby and How Many More Times that they ever played. I searched for more information on the album, but it wasn't listed as part of their official discography on their Wikipedia page. The chances are this may be a bootleg, but if it is a bootleg it's the best one I've ever heard. It is also possible that someone ripped the audio from the concert DVD that has been on sale and in circulation for years, I just don't know. I have been unable to find a good high resolution album cover for this album so the cover on there is only 300x300 resolution. All the proper track names, release year, cover art, etc. have been embedded into the tracks themselves so, as with all of my torrents, this one is ready to be imported to iTunes as soon as you're done downloading. Below is a link I was able to dig up that shows the full video footage of the concert so you can have some idea of what this album is. Enjoy.\n\n\n1. We're Gonna Groove (3:14) \n2. I Can't Quit You Baby (6:56) \n3. Dazed &amp; Confused (15:34) \n4. White Summer (12:22) \n5. What Is and What Should Never Be (4:40)\n6. How Many More Times (20:18) \n7. Moby Dick (15:22) \n8. Whole Lotta Love (6:25) \n9. Communication Breakdown (4:16)\n10. C'mon Everybody (2:32) \n11. Something Else (2:11) \n12. Bring It On Home (7:43)\n\n\n*** ALL TRACKS 320KBPS MP3 *** \n\n*** CONCERT RECORDED JANUARY 9, 1970 ***\n\n\n\n","torrent":{"xt":"urn:btih:86a30aede7a4bbfca5c293b15eb22a1308102691","amp;dn":"Led+Zeppelin+Live+at+the+Royal+Albert+Hall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86a30aede7a4bbfca5c293b15eb22a1308102691","infoHashBuffer":{"type":"Buffer","data":[134,163,10,237,231,164,187,252,165,194,147,177,94,178,42,19,8,16,38,145]},"announce":[],"urlList":[]}}