{"title":"Psychiatric Drug Withdrawal - Dr. Peter Breggin","uid":7654401,"size":1265045,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:871f6a124f3f5ae821ad342a70cef5f3c7832005&amp;dn=Psychiatric+Drug+Withdrawal+-+Dr.+Peter+Breggin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":-1,"time":1348115035,"description":"Psychiatric Drug Withdrawal: A Guide for Prescribers, Therapists, Patients and their Families, by Dr. Peter Breggin\n\nThis is the first book to establish guidelines and to assist prescribers and therapists in withdrawing their patients from psychiatric drugs, including those patients with long-term exposure to antipsychotic drugs, benzodiazepines, stimulants, antidepressants, and mood stabilizers. It describes a method developed by the author throughout years of clinical experience, consultations with experienced colleagues, and scientific research. Based on a person-centered collaborative approach, with patients as partners, this method builds on a cooperative and empathic team effort involving prescribers, therapists, patients, and their families or support network.\n\nThe author, known for such books as Talking Back to Prozac, Toxic Psychiatry, and Medication Madness, is a lifelong reformer and scientist in mental health whose work has brought about significant change in psychiatric practice. This book provides critical information about when to consider psychiatric drug reduction or withdrawal, and how to accomplish it as safely, expeditiously, and comfortably as possible. It offers the theoretical framework underlying this approach along with extensive scientific information, practical advice, and illustrative case studies that will assist practitioners in multiple ways, including in how to:\n\n+ Recognize common and sometimes overlooked adverse drug effects that may require withdrawal\n+ Treat emergencies during drug therapy and during withdrawal\n+ Determine the first drugs to withdraw during multi-drug therapy\n+ Distinguish between withdrawal reactions, newly occurring emotional problems, and recurrence of premedication issues\n+ Estimate the length of withdrawal ","torrent":{"xt":"urn:btih:871f6a124f3f5ae821ad342a70cef5f3c7832005","amp;dn":"Psychiatric+Drug+Withdrawal+-+Dr.+Peter+Breggin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"871f6a124f3f5ae821ad342a70cef5f3c7832005","infoHashBuffer":{"type":"Buffer","data":[135,31,106,18,79,63,90,232,33,173,52,42,112,206,245,243,199,131,32,5]},"announce":[],"urlList":[]}}