{"title":"EMPiRE Selects - Green Lantern Rise of the Third Army Omnibus 01","uid":8282863,"size":188098996,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:87fede20603dee90735df707eb5b82c20ec59d7f&amp;dn=EMPiRE+Selects+-+Green+Lantern+Rise+of+the+Third+Army+Omnibus+01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1363880246,"description":"EMPiRE Selects - Green Lantern -- Rise of the Third Army Omnibus Vol. 001 (2013) 238p (digital) (EMPiRE) (Nahga).cbr\n\n------\n\nFrom Comic Vine:\n\nFeeling that the Green Lantern Corps are fundamentally flawed due to free will, the Guardians of the Universe aim to replace the Green Lanterns with their new universal solution, the Third Army, as well as wiping out all other Lantern Corps.\n\nRise of the Third Army is Green Lantern architect, Geoff Johns' latest crossover, taking place between Green Lantern, Green Lantern Corps, Green Lantern: New Guardians and Red Lanterns. Seeds of the storyline were planted in the fallout of War of the Green Lanterns after the Guardians of the Universe stripped Hal Jordan of his Green Lantern status, and Sinestro once again became a member of the Green Lantern Corps. Feeling that the Corps was flawed due to their emotion and free will, the Guardians aimed to decomission the Corps, much like their first failed peacekeeping initiative, The Manhunters, and replace them with a new force known as the Third Army. In doing so, the Guardians plan to completely obliterate all of the Green Lanterns, as well as any other colored Corps through out the universe. Rise of the Third Army also serves as an introduction to a mysterious new Green Lantern known as Baz, who had been seen at war with the Justice League, during the Trinity War event.\n","torrent":{"xt":"urn:btih:87fede20603dee90735df707eb5b82c20ec59d7f","amp;dn":"EMPiRE+Selects+-+Green+Lantern+Rise+of+the+Third+Army+Omnibus+01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87fede20603dee90735df707eb5b82c20ec59d7f","infoHashBuffer":{"type":"Buffer","data":[135,254,222,32,96,61,238,144,115,93,247,7,235,91,130,194,14,197,157,127]},"announce":[],"urlList":[]}}