{"title":"Ticket to Ride Days of Wonder v2.1.0-4087-a7b24027 full and data","uid":14502093,"size":233150942,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:8811b73a4581d29b7d4472f00daf094b7e0cd49e&amp;dn=Ticket+to+Ride+Days+of+Wonder+v2.1.0-4087-a7b24027+full+and+data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"tiropitaki","files":2,"time":1462194283,"description":"The official adaptation of Days of Wonder's best-selling train board game, Ticket to Ride, now on mobile version!\r\nIn addition to the exciting multiplayer mode, players will enjoy a new intuitive user interface, new social media capabilities to share exciting moments, and play against live opponents from all around the world on the various boards!\r\n\r\nWith over 48 million games played online and a new game starting every 4 seconds on average, Ticket to Ride offers a game experience unique amongst its peers.\r\n\r\n**Ars Technica – « Ticket to Ride is impressive right from the start. »\r\n**Pocket Gamer: 9/10 with Gold Award – &quot;A fantastic adaptation of an excellent board game, and a must-buy for strategy fans&quot;.\r\n\r\nTicket to Ride includes :\r\n• Alan R. Moon's official Ticket to Ride maps with original artwork in full high resolution.\r\n• Online Play (WiFi, 3G, 4G) against other tablets and smartphones (including Android and others), Linux, Mac and PC gamers.\r\n• An unparalleled online player community with tens of thousands of live opponents.\r\n• Solo play against up to 4 AI players.\r\n• Pass-and-Play with up to 4 live opponents (can include AI players too).\r\n• Additional maps of Europe, Switzerland, USA 1910 and Legendary Asia available as in-app purchases\r\n• Also discover the 2 most recent vertical maps, for games ever more intense: India available only recently, and the brand new Nordics map tracing the railway routes of Northern Europe.\r\n• Detailed, interactive turn-by-turn, in-game tutorial.\r\n• Contextual in-game Conductor's Notes to help you master all the maps.\r\n• True cross-platform: players can challenge on other platforms including Steam PC and Mac, Linux, Android, iPhone, and iPad.\r\n• Online and offline Hall of Fame.\r\n\r\nFor more information, please visit: http://www.daysofwonder.com/online/en/t2r/ and find all the latest news for Ticket to Ride Digital on FB and Twitter!\r\n\r\nWhat's new:\r\n• New content: the Nordic Countries board is now available as an in-app purchase. And it’s a vertical map. More maps to come in 2016!\r\n• New Achievements are available: be the first one to accomplish them!\r\n• the Chat bug is now fixed on all Android devices.\r\n• Bug fix: Achievements are now saved properly. Don’t hesitate to re-accomplish them!\r\n• Various other bug fixes and user interface enhancements.\r\n\r\nRequirements: Android OS 4.0.3+\r\nInstall APK. Place data folder in SDCard/Android/Obb/ and play","torrent":{"xt":"urn:btih:8811b73a4581d29b7d4472f00daf094b7e0cd49e","amp;dn":"Ticket+to+Ride+Days+of+Wonder+v2.1.0-4087-a7b24027+full+and+data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8811b73a4581d29b7d4472f00daf094b7e0cd49e","infoHashBuffer":{"type":"Buffer","data":[136,17,183,58,69,129,210,155,125,68,114,240,13,175,9,75,126,12,212,158]},"announce":[],"urlList":[]}}