{"title":"Pixies - EP2 (320CBR)","uid":9431248,"size":34485315,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:88452bb1afb08070d5f85fdb63258ede4fcdf2a4&amp;dn=Pixies+-+EP2+%28320CBR%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MentalZero","files":-1,"time":1388808122,"description":"EP2 is the second EP in an series of EP's released by American alternative rock band Pixies, released on January 3, 2014.\n \nThe band released this statement about the tracks:\n\n'Blue-Eyed Hexe'\nBlack Francis said: &quot;It's a tale from the northwestern part of the UK, and it's a witch-woman kind of a song. That's what a 'hexe' is, and ours is a blue-eyed hexe.&quot; Joey Santiago added: &quot;Gil wanted a swagger, he wanted the guitar solo to sound like you're going to have sex with this blue-eyed hexe.&quot;\n\n'Magdalena'\n&quot;This song is so atmospheric,&quot; says Santiago. &quot;We had these weird Moog pedals that sounded like water. It was a very mood-based, atmospheric sound, not based on any lyrics or anything.&quot; David Lovering added, &quot;One of my favorites, maybe tied with 'Indie Cindy.' It's cool the way it flows, and it's a very simplistic song, very pretty, cool and moving.&quot;\n\n'Greens and Blues'\nBlack Francis says, &quot;As with all my songs, I would prefer people add their own interpretation to it. But, in this case, let's just say that we had done 'Gigantic' as the closer for many years at our reunion shows and it worked really well. But I could see that we were going to grow weary of that and I felt like we basically needed a better 'Gigantic.' It was my attempt to come up with another song that would - musically, emotionally and psychologically - sit in the same place that 'Gigantic' has sat. Not that I could ever replace that song: you write songs and they come out the way they come out. So perhaps it can be said that this song fills the emotional niche that 'Gigantic' occupied, another show-closer. I think the lyric alludes to that, the fact that it's the end of the night, the end of something. And a separation if you will, between the band and the audience. So I guess it's kind of a goodbye song, or really more of a 'good night' song.&quot;\n\n'Snakes'\n&quot;I'm not a jammer,&quot; says Santiago, &quot;but Black Francis and I started jamming it out. I had this little idea and I did that sliding guitar just to emulate a snake.&quot; Black Francis adds, &quot;This one was totally written in the studio session. It proved to be a little bit difficult to play and a little bit difficult to record, sonically, but we stuck with it and I like the result.&quot;","torrent":{"xt":"urn:btih:88452bb1afb08070d5f85fdb63258ede4fcdf2a4","amp;dn":"Pixies+-+EP2+%28320CBR%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88452bb1afb08070d5f85fdb63258ede4fcdf2a4","infoHashBuffer":{"type":"Buffer","data":[136,69,43,177,175,176,128,112,213,248,95,219,99,37,142,222,79,205,242,164]},"announce":[],"urlList":[]}}