{"title":"Cereal Killers Don't Fear Fat!","uid":10283492,"size":275529040,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8913cc4e56366143234826a888023f55cea65a18&amp;dn=Cereal+Killers+Don%27t+Fear+Fat%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Boompie147","files":-1,"time":1401745637,"description":" &lt;a href=&quot;http://www.cerealkillersmovie.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.cerealkillersmovie.com/&lt;/a&gt;\n\n&quot;While the film didn't go into any great depth with scientific analysis and explanation, it certainly provides plenty of information to get the viewer open to the idea that perhaps what we've always been taught  is healthy actually isn't good for us at all, and that is a huge step in the right direction. It makes the information understandable to anyone, even people who aren't that interested in all the science. It was a very human take on food and health, chronicling this man's experiences with friends and strangers to whom he would talk. It manages to, in one short hour, make the viewer feel an overwhelming connection to Donal and his situation. The stories of his experience with his father's health are very touching. I think this movie takes an approach that many food documentaries lack-- the human side. The fact is, the health of our loved ones is important, and when we see them suffer, or suffer ourselves at the loss of loved ones due to diseases we know can be preventable, we want answers and the answers we've been given thus far aren't working. It was also surprisingly fun to watch! For such a small budget film, the quality is outstanding, and the overall tone was positive yet touching. The movie didn't end with you feeling guilty for all your food choices or hating &quot;the man.&quot; The movie left you feeling hopeful-- that change is possible not only on a larger social scale, but for your health personally.&quot; -\n\n\n\n","torrent":{"xt":"urn:btih:8913cc4e56366143234826a888023f55cea65a18","amp;dn":"Cereal+Killers+Don%27t+Fear+Fat%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8913cc4e56366143234826a888023f55cea65a18","infoHashBuffer":{"type":"Buffer","data":[137,19,204,78,86,54,97,67,35,72,38,168,136,2,63,85,206,166,90,24]},"announce":[],"urlList":[]}}