{"title":"Mosby's 2014 Nursing Drug Reference [PDF]~StormRG~","uid":9631422,"size":139698027,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:896c295c385d9eca156fb8860ef8f4b109126edb&amp;dn=Mosby%27s+2014+Nursing+Drug+Reference+%5BPDF%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":-1,"time":1392790178,"description":"Series: SKIDMORE NURSING DRUG REFERENCE\nPaperback: 1376 pages\nPublisher: Mosby; 27 edition (June 25, 2013)\nLanguage: English\nISBN-10: 0323170072\nISBN-13: 978-0323170079\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\nThere is a difference in drug handbooks. From the leading name in nursing, Mosby's 2014 Nursing Drug Reference makes it easy to find the latest and most vital information on the drugs you administer most frequently. More than 5,000 drugs are profiled - including 70 new entries on current drugs and drugs recently approved by the FDA. And no other drug handbook places a higher emphasis on patient safety. With a full-color design and an A to Z organization, this portable reference gives you the most complete information for each drug, including dosing, side effects, interactions, and administration. Updated by nursing pharmacology expert Linda Skidmore-Roth, Mosby's Nursing Drug Reference is a bestseller that has been relied upon by nurses for over 25 years.\n\nMore than 5,000 generic and trade-name drugs are profiled, covering almost every drug you will administer in practice or in clinicals.\nAttractive full-color design highlights important information for quick and easy access.\nBlack Box Warnings provide alerts to dangerous or life-threatening adverse reactions.\nSafety Alert icon identifies situations that require special attention.\nCommon and life-threatening side effects are organized by body system, showing signs to watch for during assessments.\nNursing Process steps are used as the framework for organizing all nursing care information.\nCoverage of IV drug administration highlights dosage and IV administration instructions, including special considerations and Y-site, syringe, and additive compatibilities.\nComprehensive drug monographs include generic names, Rx or OTC availability, pronunciations, U.S. and Canadian trade names, functional and chemical classification, controlled-substance schedule, do-not-confuse drugs, action, uses, unlabeled uses, dosages and routes, available forms, side effects, contraindications, precautions, pharmacokinetics, interactions (including drug/herb, drug/food and drug lab test), nursing considerations, and treatment of overdose.\nComplete pharmacokinetic information includes the mechanism and absorption of the drug as well as its action, duration, and excretion.\nFlexible, water-resistant cover provides durability in the clinical setting.\nA companion website includes updates with infrequently used or recently approved drugs, a full-color pill atlas, guidelines to safe handling of chemotherapeutic agents, combination products, drugs metabolized by known P450s, medications to be cautiously for geriatric patients, herbal products, a listing of high-alert Canadian medications and immunization schedules, patient teaching guides in English and Spanish, and more.\n70 NEW monographs provide up-to-date content on added or newly released drugs.","torrent":{"xt":"urn:btih:896c295c385d9eca156fb8860ef8f4b109126edb","amp;dn":"Mosby%27s+2014+Nursing+Drug+Reference+%5BPDF%5D%7EStormRG%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"896c295c385d9eca156fb8860ef8f4b109126edb","infoHashBuffer":{"type":"Buffer","data":[137,108,41,92,56,93,158,202,21,111,184,134,14,248,244,177,9,18,110,219]},"announce":[],"urlList":[]}}