{"title":"Catch me if you can DvD-Rip Dutch subs - NLT release","uid":4358109,"size":1358851951,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:898f7e98cc714d488a6ae065965846d7881cb9c1&amp;dn=Catch+me+if+you+can+DvD-Rip+Dutch+subs+-+NLT+release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"vlooiebaal","files":3,"time":1219507758,"description":"Frank Abagnale Jr. is een gewone jongen. Het verhaal begint in de jaren &amp;#039;50 en &amp;#039;60. Wanneer zijn vader en moeder gaan scheiden, besluit hij de wereld in te trekken. Hij doet net alsof hij een co-piloot is zodat hij makkelijker vervalste cheques kan verzilveren bij banken en hotels. Ook kan hij gratis reizen met het vliegtuig. Als ze hem op het spoor zijn naar aanleiding van die gratis vluchten, verlegt hij zijn terrein. Hij doet zich voor als dokter en zonder medische kennis wordt hij hoofd van een afdeling. In dat ziekenhuis komt hij een meisje tegen waarop hij verliefd wordt. Omdat haar vader advocaat is, besluit hij ook advocaat te worden. Wanneer hij echter met haar wil trouwen, komt de FBI de trouwerij binnenvallen. Abagnale ontsnapt, en zegt tegen zijn verloofde dat zij hem moet opwachten op het vliegveld. Daar ziet hij dat zijn verloofde de FBI heeft gewaarschuwd.\n\nAbagnale gaat er vandoor, weer als co-piloot en gaat verder met het verzilveren van valse cheques. De FBI vindt Abagnale in 1969. Hij wordt gestraft met 12 jaar gevangenisstraf. In totaal had hij in zijn leven 2,5 miljoen dollar aan valse cheques uitgeschreven.\n\nNa een tijd in de gevangenis te hebben gezeten, wordt hij na een voorstel van Carl Hanratty (een Special Agent bij de FBI), de man die hem al jaren achterna zat, aangenomen als specialist in fraudezaken bij de FBI.\n\n\nSpelers:\nLeonardo DiCaprio - Frank Abagnale Jr. \nTom Hanks - Carl Hanratty \nChristopher Walken - Frank Abagnale, Sr. \nMartin Sheen - Roger Strong \nNathalie Baye - Paula Abagnale \n\nPlease keep seeding \n\nVisit http://www.nlt.ons-forum.nl and http://www.allesgratis.org","torrent":{"xt":"urn:btih:898f7e98cc714d488a6ae065965846d7881cb9c1","amp;dn":"Catch+me+if+you+can+DvD-Rip+Dutch+subs+-+NLT+release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"898f7e98cc714d488a6ae065965846d7881cb9c1","infoHashBuffer":{"type":"Buffer","data":[137,143,126,152,204,113,77,72,138,106,224,101,150,88,70,215,136,28,185,193]},"announce":[],"urlList":[]}}