{"title":"Sid Meiers Civilization - Beyond Earth v1.0.0.574 (2014)(2-click","uid":11290315,"size":1874228811,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8a089ac26b8bafeb239a931fcd230b90893317b1&amp;dn=Sid+Meiers+Civilization+-+Beyond+Earth+v1.0.0.574+%282014%29%282-click&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1414321344,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a 'Easy Run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nSCREENSHOTS: &lt;a href=&quot;\nhttp://free-apps.friendsinwar.com/infusions/image_hosting/v.php?id=f27f583092a4bf8e75c1aff28c48ebe8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://free-apps.friendsinwar.com/infusions/image_hosting/v.php?id=f27f583092a4bf8e75c1aff28c48ebe8.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://free-apps.friendsinwar.com/infusions/image_hosting/v.php?id=82cef2d263636bf774c85cc1325b9f81.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://free-apps.friendsinwar.com/infusions/image_hosting/v.php?id=82cef2d263636bf774c85cc1325b9f81.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://free-apps.friendsinwar.com/infusions/image_hosting/v.php?id=c282aed1d6403c12f3422d05fabdb7c5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://free-apps.friendsinwar.com/infusions/image_hosting/v.php?id=c282aed1d6403c12f3422d05fabdb7c5.jpg&lt;/a&gt;\n\nDESCRIPTION:\nBeyond Earth is a turn-based strategy game played on a hexagonal-based grid, iterating on the ideas and building upon the engine of its predecessor, Civilization V. Co-lead designer David McDonough described the relationship between the two games by saying &quot;The bones of the experience are very much recognisably Civ. The idea of the cities, city-base progression, leaders, the passage of time, tile-based, turn-based, building improvements, technologies. A lot of them are very familiar themes to the Civ player.&quot;\nThere are a number of significant breaks from the Civilization model. In previous Civilization titles, players selected from historical empires led by historical figures, each with preset personalities. In Beyond Earth, players make choices at the beginning of the game, including what organization backed their expedition, what kind of vessel they used to reach the planet, and who and what they brought to the new world, allowing players to create a customized civilization of their own. Early decisions have a significant effect on the gameplay. While previous Civilization titles have had linear tech trees, Beyond Earth has a &quot;tech web&quot; which branches off in several directions, forcing players to choose only one. The game intentionally does not allow for technology trading between civilizations, and it is impossible to unlock all of the game's technologies in a single playthrough, as some technologies are exclusive to each affinity.\nThe &quot;affinities&quot; are overarching philosophies on human advancement that shape players' technological advancement and unlock affinity-unique units. The Harmony affinity aims to co-exist with the planet, utilizing genetic modification, and is able to domesticate the native species. The Supremacy affinity puts its trust in advanced technology, and utilizes highly specialized units that aid each other in the field. The Purity affinity is isolationist, building powerful defensive structures and attempting to make the new planet more Earth-like.\n\nInstallation instructions:\n1. Execute the .exe file.\n2. Follow the instructions.\n3. Enjoy the program","torrent":{"xt":"urn:btih:8a089ac26b8bafeb239a931fcd230b90893317b1","amp;dn":"Sid+Meiers+Civilization+-+Beyond+Earth+v1.0.0.574+%282014%29%282-click","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a089ac26b8bafeb239a931fcd230b90893317b1","infoHashBuffer":{"type":"Buffer","data":[138,8,154,194,107,139,175,235,35,154,147,31,205,35,11,144,137,51,23,177]},"announce":[],"urlList":[]}}