{"title":"The Holiday - O Amor NÃƒÂ£o Tira FÃƒÂ©rias (2006)","uid":4510684,"size":2344672823,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8a97fe716ba71a37b43bc7ab409acbaa1476aa7f&amp;dn=The+Holiday+-+O+Amor+N%C3%83%C2%A3o+Tira+F%C3%83%C2%A9rias+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ToppoGiggio","files":1,"time":1226766886,"description":"Please share and comment. \nThe continuity of peer-to-peer depends on you. \nVisit http://www.finalshare.net\n\nEnglish\n-------\nTwo beautiful women, Amanda Woods (Cameron Diaz) and Iris Simpkins (Kate Winslet) both find themselves at the end of failed relationships just before Christmas. Amanda decides to take a two week vacation and surfs the internet. She meets Iris online, and they agree to swap their homes for the holidays. Amanda lives in Los Angles and Iris lives in the countryside of Surrey, England. Even though they now have a change of scenery and want no contact with men, they are both still depressed and lonely. But things are about to change when Iris&amp;#039; brother Graham (Jude Law) drops by Iris&amp;#039; house and meets Amanda. On the other side of the world, Iris meets Miles (Jack Black) a film composer. Romance is in the air and sparks are about to fly. Douglas Young\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n\nPortuguÃƒÂªs\n---------\nIris Simpkins (Kate Winslet) escreve uma coluna sobre casamento bastante conhecida no Daily Telegraph, de Londres. Ela estÃƒÂ¡ apaixonada por Jasper (Rufus Sewell), mas logo descobre que ele estÃƒÂ¡ prestes a se casar com outra. Bem longe dali, em Los Angeles, estÃƒÂ¡ Amanda Woods (Cameron Diaz), dona de uma prÃƒÂ³spera agÃƒÂªncia de publicidade especializada na produÃƒÂ§ÃƒÂ£o de trailers de filmes. ApÃƒÂ³s descobrir que seu namorado Ethan (Edward Burns) nÃƒÂ£o tem sido fiel, Amanda encontra na internet um site especializado em intercÃƒÂ¢mbio de casas. Ela e Iris entram em contato e combinam a troca de suas casas, com Iris indo para a luxuosa casa de Amanda e esta indo para a cabana no interior da Inglaterra de Iris. Logo a mudanÃƒÂ§a trarÃƒÂ¡ reflexos na vida amorosa de ambas, com Iris conhecendo Miles (Jack Black), um compositor de cinema que trabalha com Ethan, e Amanda se envolvendo com Graham (Jude Law), irmÃƒÂ£o de Iris.\n","torrent":{"xt":"urn:btih:8a97fe716ba71a37b43bc7ab409acbaa1476aa7f","amp;dn":"The+Holiday+-+O+Amor+N%C3%83%C2%A3o+Tira+F%C3%83%C2%A9rias+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a97fe716ba71a37b43bc7ab409acbaa1476aa7f","infoHashBuffer":{"type":"Buffer","data":[138,151,254,113,107,167,26,55,180,59,199,171,64,154,203,170,20,118,170,127]},"announce":[],"urlList":[]}}