{"title":"Marcos Valle- (1971) Garra  Projeto Chernobyl","uid":8961294,"size":53495833,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8ae152df69e454314b2d923e5f79dbf5145c30a7&amp;dn=Marcos+Valle-+%281971%29+Garra++Projeto+Chernobyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"klinho","files":14,"time":1380123063,"description":"Tempering his funkier inclinations to create a Baroque masterpiece of easy listening Brazilian pop, Marcos Valle recorded the most entertaining album of his career, and perhaps the best Brazilian pop album of all time. Garra begins with the elegant &quot;Jesus Meu Rei,&quot; with a magisterial men's choir echoing Valle's sentiments while textured piano and organ complete the rich sonic palette. Second track &quot;Com Mais de 30,&quot; only the first of several ingenious transitions, offers a light, breezy alternative, bouncing back and forth from main melody to an excellent bridge. Indeed, nearly every song has a bridge as strong as -- or stronger than -- the main melody, and Valle proves himself a master at weaving together the various studio musicians at his disposal. Valle moves briskly and assuredly from piano lines to acoustic guitar and back for &quot;Com Mais de 30,&quot; combines flutes and a Mellotron for a tight bridge on the title track, and coaxes all manner of emotions from a symphonic orchestra -- hushed yet gradually building strings, bleating brass -- for the unabashed &quot;Black Is Beautiful.&quot; Every song is excellent, most in the easy-pop vein of Samba '68. &quot;Wanda Vidal,&quot; &quot;Vinte e Seis Anos de Vida Normal,&quot; and the perfectly done closer, &quot;O Cafona,&quot; are seamless blends of funk and easy listening; the last features a rangy bassline, organ, and wah-wah guitar working together with handclaps and separated men's and women's backing choruses while Valle breathily repeats words and phrases several times before climaxing at the end of nearly every line. Continually besting symphonic seducers from Esquivel to Brian Wilson, Marcos Valle recorded his masterpiece with Garra. \n\n01 Jesus Meu Rei [Jesus is My King] 3:12\t\n02 Com Mais De 30 [Over Thirty] 2:44\n03 Garra [Claw] 2:59\n04 Black is Beautiful (feat Marizinha) 4:18\t\n05 Ao Amigo Tom [To My Friend, Tom] 2:02\t\n06 Paz E Futebol [Peace &amp; Football] 2:34\t\n07 Que Bandeira [What a Flake] 3:04\t\n08 Wanda Vidal 2:10\t\n09 Minha Voz Vira Do Sol Da America [My Voice Will Emerge From the Sun of America] 4:23\t\n10 Vinte E Seis Anos De Vida Normal [Twenty Six Years of a Normal Life] 2:25\t\n11 O Cafona [The Man of Poor Taste] 3:28\n\n\nMore at:","torrent":{"xt":"urn:btih:8ae152df69e454314b2d923e5f79dbf5145c30a7","amp;dn":"Marcos+Valle-+%281971%29+Garra++Projeto+Chernobyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ae152df69e454314b2d923e5f79dbf5145c30a7","infoHashBuffer":{"type":"Buffer","data":[138,225,82,223,105,228,84,49,75,45,146,62,95,121,219,245,20,92,48,167]},"announce":[],"urlList":[]}}