{"title":"Richard Kadrey Sandman Slim Series 1-5 [Epub &amp; Mobi]","uid":8777408,"size":11072322,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b11517b138ad8e215b23bc169b7cd78729e370c&amp;dn=Richard+Kadrey+Sandman+Slim+Series+1-5+%5BEpub+%26amp%3B+Mobi%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"F1restorm","files":-1,"time":1375592151,"description":"Sandman Slim Series/ Richard Kadrey\n1. Sandman Slim\n2. Kill the Dead\n3. Aloha From Hell\n3.5. Devil in the Dollhouse\n4. Devil Said Bang\n5. Kill City Blues\nGenre: Urban Fantasy/ Paranormal\n\nDecription from Sandman Slim:\nSupernatural fantasy has a new antihero.\n\nLife sucks, and then you die. Or, if you're James Stark, you spend eleven years in Hell as a hitman before finally escaping, only to land back in the hell-on-earth that is Los Angeles. \nNow Stark's back, and ready for revenge. And absolution, and maybe even love. But when his first stop saddles him with an abusive talking head, Stark discovers that the road to absolution and revenge is much longer than you'd expect, and both Heaven and Hell have their own ideas for his future. \n\nResurrection sucks. Saving the world is worse. \n\nDarkly twisted, irreverent, and completely hilarious, Sandman Slim is the breakthrough novel by an acclaimed author.\n\nDescription from Kill City Blues:\nBestselling author Richard Kadrey continues his acclaimed Sandman Slim series with this high-octane fifth adventure that takes Stark into a dark and dangerous mirrorworld of LA.\n\nJames Stark, aka Sandman Slim, has managed to get out of Hell, renounce his title as the new Lucifer, and settle back into life in LA. But he's not out of trouble yet. Somewhere along the way he misplaced the Qomrama Om Ya, a weapon from the banished older gods who are also searching for their lost power.\nThe hunt leads Stark to an abandoned shopping mall-a multi-story copy of LA-infested with Lurkers and wretched bottomfeeding Sub Rosa families, squatters who have formed tight tribes to guard their tiny patches of this fake LA. Somewhere in the kill zone of the former mall is a dead man with the answers Stark needs. All Stark has to do is find the dead man, get back out alive, and outrun some angry old gods-and a few killers-on his tail.","torrent":{"xt":"urn:btih:8b11517b138ad8e215b23bc169b7cd78729e370c","amp;dn":"Richard+Kadrey+Sandman+Slim+Series+1-5+%5BEpub+%26amp%3B+Mobi%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b11517b138ad8e215b23bc169b7cd78729e370c","infoHashBuffer":{"type":"Buffer","data":[139,17,81,123,19,138,216,226,21,178,59,193,105,183,205,120,114,158,55,12]},"announce":[],"urlList":[]}}