{"title":"Angela Carter - Burning Your Boats: Collected Short Stories","uid":10800309,"size":4619843,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b15b89cb09e625176782b4e25bd65c75683a4c5&amp;dn=Angela+Carter+-+Burning+Your+Boats%3A+Collected+Short+Stories&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1408338458,"description":"Angela Carter - Burning Your Boats: Collected Short Stories (Henry Holt, 1995). 462 pages.\n\nImproved version of an older scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. Many thanks to the original scanner.\n\n\nShort fiction doesn't get any better than this!\n\n\ndescription:\n\nFrom early reflections on jazz and Japan, through vigorous refashionings of vampires and werewolves, to stunning snapshots of real life outcasts and the glorious but tainted world of &quot;the rich and famous,&quot; this complete collection of Angela Carter's short stories gathers together four published books -- Fireworks, The Bloody Chamber, Black Venus, American Ghosts and Old World Wonders -- with her early work and uncollected stories. Angela Carter's major preoccupations -- violence in the wild and at home; fairy stories, ancient and new; magic, fabulous and quotidian; the frailty and mystery of the flesh and the strength of the spirit -- are all examined in startling relief. Among the treasures of this masterly collection: a young Lizzie Borden visits the circus; a pianist makes a Faustian pact in a flyblown Southern brothel; an earnest student is taken on a gothic ride through the ambiguous residue of Hollywood's golden age; Alice is transmuted by a crazed fruit-grower in Prague; and Mary Magdalene steps out of Renaissance canvases, transfigured by wilderness and solitude.\n\nAcclaimed as &quot;the poet of the short story,&quot; ANGELA CARTER (1940-1992) lived in England, the United States (she taught widely on both coasts), Japan, and Australia. &quot;Her imagination was one of the most dazzling of this century,&quot; wrote Marina Warner when Angela Carter died at age fifty-one. And said Salman Rushdie: &quot;She died at the height of her powers. For writers, these are the cruelest deaths: in midsentence, so to speak. The stories in this volume are the measure of our loss. But they are also our treasure to savour and hoard.&quot;\n\nFrom Publishers Weekly\n\nThe late Angela Carter, better known as a novelist (Wise Children), wrote stories throughout her all-too-brief career, and they are all here, handsomely and perceptively introduced by Salman Rushdie, who was an old friend. These are not at all conventional stories that glimpse moments in contemporary life.They are tales, legends, variations on mythic themes, sparked by writing of great vitality, color and inventiveness, and a deeply macabre imagination. Carter's favorite themes mingle love and death. She cherishes dark forests, winter sunsets, wolves and werewolves, bloody murder, hunters, the cruel, rich husbands of maidens condemned to death. But she also has a ribald, extremely contemporary sense of humor that keeps glancing through the dark mists. Thus John Ford's Jacobean melodrama 'Tis a Pity She's a Whore resurfaces as the script for a movie directed by a 20th-century namesake; a Ph.D. candidate meets his subject's widow, someone very much like Norma Desmond in Sunset Boulevard; and Britain's immortal pantomime characters get a hilarious going-over for their psychosexual significance. There are variations on Lizzie Borden, on the childhood of Edgar Allan Poe and several on Little Red Riding Hood, who gets the better of the Big Bad Wolf in at least two of them (Carter was an ardent but scarcely PC feminist). This is not a collection to be read at a sitting; the stories' jolting intensity makes them indigestible in large doses. But for readers who respond to an antic fancy dressed in highly charged prose, they are a generous treat. ","torrent":{"xt":"urn:btih:8b15b89cb09e625176782b4e25bd65c75683a4c5","amp;dn":"Angela+Carter+-+Burning+Your+Boats%3A+Collected+Short+Stories","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b15b89cb09e625176782b4e25bd65c75683a4c5","infoHashBuffer":{"type":"Buffer","data":[139,21,184,156,176,158,98,81,118,120,43,78,37,189,101,199,86,131,164,197]},"announce":[],"urlList":[]}}