{"title":"Apuleius - The Golden Ass, or Metamorphoses (3 translations)","uid":11461126,"size":12109035,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8b7a2e65afd2888f7907cb3622a1a8fbf3377ca7&amp;dn=Apuleius+-+The+Golden+Ass%2C+or+Metamorphoses+%283+translations%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"workerbee","files":-1,"time":1415989818,"description":"\nAPULEIUS (c. 125 - c. 180 CE) was a Latin-language prose writer.  He was a Numidian Berber and lived under the Roman Empire.  He studied Platonist philosophy in Athens; travelled to Italy, Asia Minor and Egypt; and was an initiate in several cults or mysteries.\n\nHis most famous work is the bawdy picaresque novel METAMORPHOSES, which St. Augustine referred to as THE GOLDEN ASS (Asinus aureus).  It is the only Greco-Roman novel that has survived in its entirety and relates the ludicrous adventures of one Lucius, a virile young man and member of the Roman country aristocracy who is obsessed with magic and is accidentally transformed into a donkey.  In this guise, Lucius is forced to witness and share the miseries of slaves and destitute freemen who are reduced, like Lucius, to being little more than beasts of burden by their exploitation at the hands of wealthy landowners.  He finally finds salvation through the intervention of the goddess Isis, whose cult he joins.  \n\nDespite its serious subject matter, the novel remains imaginative, witty, and often sexually explicit.  Numerous amusing stories, many of which seem to be based on actual folk tales, with their ordinary themes of simple-minded husbands, adulterous wives, and clever lovers, as well as the magical transformations that characterize the entire novel, are included within the main narrative.  The longest of these inclusions is the tale of Cupid and Psyche, encountered here for the first but not the last time in Western literature.  The text is a precursor to the literary genre of the episodic picaresque novel, in which Quevedo, Rabelais, Boccaccio, Cervantes, Voltaire, Defoe and many others have followed.\n\n\nThe following books are in PDF format unless otherwise indicated:\n\n* THE GOLDEN ASS (Farrar, Straus &amp; Giroux, 1951).  Translated with an Introduction by Robert Graves.\n\n* THE GOLDEN ASS, or Metamorphoses (Penguin Classics, 2004).  Translated with an Introduction and Notes by E. J. Kenney. -- ePUB + MOBI\n\n* THE GOLDEN ASS, or, A Book of Changes (Hackett, 2007).  Translated with an Introduction by Joel C. Relihan.\n\n* THE LOGIC OF APULEIUS [Peri Hermeneias] (Brill, 1987).  With complete Latin text and English translation by David Londey and Carmen Johanson.\n\n_____________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                 &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!","torrent":{"xt":"urn:btih:8b7a2e65afd2888f7907cb3622a1a8fbf3377ca7","amp;dn":"Apuleius+-+The+Golden+Ass%2C+or+Metamorphoses+%283+translations%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b7a2e65afd2888f7907cb3622a1a8fbf3377ca7","infoHashBuffer":{"type":"Buffer","data":[139,122,46,101,175,210,136,143,121,7,203,54,34,161,168,251,243,55,124,167]},"announce":[],"urlList":[]}}