{"title":"Keely Smith - Swing, Swing, Swing (1999) [Jazz][flac][schon55]","uid":5905628,"size":377578689,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8c0c78fe475245230b2e177042410c5fdf336d05&amp;dn=Keely+Smith+-+Swing%2C+Swing%2C+Swing+%281999%29+%5BJazz%5D%5Bflac%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"schon55","files":25,"time":1287852219,"description":"Keely Smith - Swing, Swing, Swing \nOriginal Release Date: February 22, 2000 \nAudio CD:  February 22, 2000 \nLabel: Concord Records \nQuality: Flac + Cue\n\nRecorded at Capitol Studio A, Hollywood, California in April 1999.  Includes liner notes by Tony Bennett.\n\nNearing the age of 70, without a recording session in more than 15 years, Keely Smith returned on the heels of the '90s rejuvenation of swing music.  Recorded for the Concord label, Swing, Swing, Swing does just what the title promises. Smith rips through 16 songs with barely a pause for breath, including plenty of swing standards (&quot;Kansas City,&quot; &quot;Jump, Jive 'An Wail,&quot; &quot;On the Sunny Side of the Street,&quot; &quot;Yeah, Yeah, Yeah,&quot; and the title track) as well as a few obscure songs and at least one new one (&quot;Keely's Boogie&quot;).  The backing -- by the Frank Capp Orchestra with arrangements by Dennis Michaels and Don Menza -- is big, brassy, and more than enough to contend with Smith's surprisingly strong voice.  Walking a very fine line between nostalgia and real innovation, Swing, Swing, Swing throws enough chestnuts to the younger audience to qualify as generational crossover, but never compromises the high-class swing that Keely Smith has always championed. ~ John Bush\n\nEditorial Reviews - Amazon.com\nThe mid-'90s lounge music revival has come and gone, the music of Louis Prima has been used to sell khaki pants, but--strangely enough--vocalist and Prima ex-wife Keely Smith has remained relatively quiet.  Until now. With the appropriately titled Swing, Swing, Swing, Smith proves she still has the perfect timing, pitch, and vocals that she had on those classic collaborations with Prima.  Also, the late trumpeter-bandleader's spirit seems to permeate this infectious disc.  Smith starts with a lively medley of &quot;When You're Smiling&quot; and &quot;The Sheik of Araby,&quot; does Prima favorites &quot;Jump, Jive, An' Wail&quot; and &quot;Robin Hood,&quot; and includes plenty of unique numbers she can call her own (just check out &quot;Keely's Boogie&quot;).  &quot;Yeah, Yeah, Yeah,&quot; &quot;Yata Hei,&quot; and the album's title track are some highlights--upbeat numbers where the 17-piece Frankie Capp Orchestra provide all the jazzy energy of Smith's old bandleader, Billy May.  There are a few disappointing tunes--&quot;Let the Good Times Roll,&quot; a studio performance meant to sound like a live lounge recording--and &quot;Palm Springs Jump,&quot; but this is still a great comeback. ~Jason Verlinde \n\nThree simple words. This CD swings. From the first cut to the last, &quot;Swing, Swing, Swing&quot; will have you moving, if not dancing!  Backed by the Frankie Capp Orchestra, Keely still proves that she has the chops to sing these songs. Certainly, at 70 her voice is not the same as it was when she was 30, but it still remarkably strong, and quite honestly, her voice and talents clearly surpass many of today's so-called divas.  Some highlights of the CD are &quot;Jump, Jive, and Wail,&quot; &quot;When You're Smiling/The Shiek of Araby,&quot; and the extended version of &quot;Swing, Swing, Swing.&quot;  My only complaint, and it's minor, is the CD length. At about 47 minutes, I was hoping to hear more. But still, if you like swing, jazz, or music that moves, this CD is highly recommended. ~ R. Angeloni\n\nPersonnel:\nKeely Smith (vocals);\nPat Tuzzolino (guitar, background vocals);\nSal Lozano, Danny House (alto saxophone);\nDon Menza (tenor saxophone, clarinet);\nPete Christlieb, Joel Peskin (tenor saxophone);\nJack Nimitz (baritone saxophone);\nFrank Szabo, Pete Candoli, Rick Baptist, Carl Saunders (trumpet);\nJim Self (trombone, tuba);\nAndy Martin, Charlie Loper, Charlie Morillas (trombone);\nDennis Michaels (piano, background vocals);\nChuck Berghofer, Richard Simon (acoustic bass);\nKenny Wild (electric bass);\nFrankie Capp (drums);\nDon Williams (percussion);\nToni Prima, Luanne Prima (background vocals).\n\nKeely Smith - Swing, Swing, Swing Tracks:\n01  When You're Smiling / The Sheik Of Araby        \n02  Let the Good Times Roll        \n03  Oh Louie        \n04  Kansas City        \n05  Jump, Jive &amp; Wail          \n06  Keely's Boogie        \n07  Yeah Yeah Yeah        \n08  Swing, Swing, Swing (Sing, Sing, Sing)        \n09  Yata Hei        \n10  I Can't Believe That You're in Love With Me        \n11  Palm Springs Jump        \n12  House Party Tonight        \n13  On Sunny Side of the Street          \n14  Giddy up Ding Dong        \n15  Robin Hood / Oh Babe        \n16  Swing, Swing, Swing (Sing, Sing, Sing)  ","torrent":{"xt":"urn:btih:8c0c78fe475245230b2e177042410c5fdf336d05","amp;dn":"Keely+Smith+-+Swing%2C+Swing%2C+Swing+%281999%29+%5BJazz%5D%5Bflac%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c0c78fe475245230b2e177042410c5fdf336d05","infoHashBuffer":{"type":"Buffer","data":[140,12,120,254,71,82,69,35,11,46,23,112,66,65,12,95,223,51,109,5]},"announce":[],"urlList":[]}}