{"title":"Paramore - Riot! [24 bit FLAC] vinyl","uid":8178385,"size":919816148,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8c1896b5ac720b0953a3f328e9395948991a33ba&amp;dn=Paramore+-+Riot%21+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"24.96","files":-1,"time":1361574060,"description":"  Paramore - Riot! (2007) [24 bit FLAC] vinyl\n\n  Released: 2007\n  Duration: 38:47\n  Genre: Pop/Rock\n  Style: Alternative, Indie Rock\n  Codec: FLAC\n  Bit Rate: ~ 3,100 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz  \n\n  01. For A Pessimist, I'm Pretty Optimistic\n  02. That's What You Get\n  03. Hallelujah\n  04. Misery Business\n  05. When It Rains\n  06. Let the Flames Begin\n  07. Miracle\n  08. Crushcrushcrush\n  09. We Are Broken\n  10. Fences\n  11. Born for This\n\n  Move over, Avril; there's a new gun in town. And even though Paramore's lead singer Hayley Williams is a few years younger than her predecessor, she has a way bigger set of vocal pipes. Lavigne and Williams share a similar register, but Williams belts it out with way more control and authority. She may even be more of a respectable pop idol since her image isn't manufactured to be rebellious and angst-ridden; instead, Williams appears to be a genuinely sweet girl, bottling up a huge voice and a heart full of lost loves. On 2008's Riot!, she fills the majority of her punk-pop tales with emo angst and declarations of boy woes. Contrived as this may sound, her lyrics feel authentic and representative of actual teenage puppy love, where a breakup feels like the end of the world. Filled with crossover potential, the songs are consistant and zippy with catchy hooks in the vein of Boys Like Girls fronted by a young Shirley Manson. Meanwhile, the production is sparkling and heavily compressed due to the golden hands of David Bendeth, but these ultra-clean sonics also tend to cramp up the band -- clouding the dynamics and turning the listening experience into a relatively risk-free one. When the group breaks away from the chugging guitar Fall Out Boy formula, they're at their best. Mid-song breakdowns and cathartic power ballads (think &quot;Don't Speak&quot;) showcase the band's maturity as musicians. More importantly, Williams shines through in these openings. In the last track, &quot;Born for This,&quot; she takes a break from her love confessions and commands everyone to sing like it's the last song they will ever sing, making for a sentimental finale and a perfect closer for the live shows.","torrent":{"xt":"urn:btih:8c1896b5ac720b0953a3f328e9395948991a33ba","amp;dn":"Paramore+-+Riot%21+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c1896b5ac720b0953a3f328e9395948991a33ba","infoHashBuffer":{"type":"Buffer","data":[140,24,150,181,172,114,11,9,83,163,243,40,233,57,89,72,153,26,51,186]},"announce":[],"urlList":[]}}