{"title":"Phase Transformations in Metals and Alloys 3rd ed","uid":15552266,"size":49796186,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8c916ce55bdcdd403578f34b31a5ef82b6a20253&amp;dn=Phase+Transformations+in+Metals+and+Alloys+3rd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1471037171,"description":"Phase Transformations in Metals and Alloys 3rd ed - David A. Porter et al. (CRC, 2009).pdf\r\n\r\nExpanded and revised to cover developments in the field over the past 17 years, and now reprinted to correct errors in the prior printing, Phase Transformation in Metals and Alloys, Third Edition provides information and examples that better illustrate the engineering relevance of this topic. It supplies a comprehensive overview of specific types of phase transformations, supplemented by practical case studies of engineering alloys.\r\n\r\nNew in the Third Edition:\r\n\r\nComputer-aided calculation of phase diagrams\r\nRecent developments in metallic glasses\r\nThe Scheil method of calculating a CCT diagram from a TTT diagram\r\nExpanded treatment of the nucleation and growth of polygonal ferrite and bainite\r\nNew case studies covering copper precipitation hardening of very low carbon bainitic steel and very fine carbide-free bainite\r\nDetailed treatment of strain-induced martensite provides a theoretical background to transformation-induced plasticity (TRIP) steels\r\nUnique Presentation Links Theory to Application\r\nAdding new case studies, detailed examples, and exercises drawn from current applications, the third edition keeps the previous editions’ popular easy-to -follow style and excellent mix of basic and advanced information, making it ideal for those new to the field. The book’s unique presentation links basic understanding of theory with application in a gradually progressive yet exciting manner. Based on the author’s teaching notes, the book takes a pedagogical approach and provides examples for applications and problems that can be readily used for exercises","torrent":{"xt":"urn:btih:8c916ce55bdcdd403578f34b31a5ef82b6a20253","amp;dn":"Phase+Transformations+in+Metals+and+Alloys+3rd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c916ce55bdcdd403578f34b31a5ef82b6a20253","infoHashBuffer":{"type":"Buffer","data":[140,145,108,229,91,220,221,64,53,120,243,75,49,165,239,130,182,162,2,83]},"announce":[],"urlList":[]}}