{"title":"(PSX-PSP) Silent Hill converted properly (Kingdom-games by KloWn","uid":4495862,"size":367199159,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:8cfb42d6ccc10db56fe3f68a1202c6c4725b11c7&amp;dn=%28PSX-PSP%29+Silent+Hill+converted+properly+%28Kingdom-games+by+KloWn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"toxicjuggalo","files":3,"time":1226188800,"description":"Silent Hill is a survival horror video game, the first in the eponymous series. The game opens with protagonist Harry Mason taking his daughter, Cheryl, to the resort town of Silent Hill for a vacation. On the journey to the town, Harry crashes his car avoiding a figure on the road, and wakes to find his daughter missing, and the town deserted and enveloped in fog. The game then follows Harry&amp;#039;s journey through the town and his attempts to find and rescue his daughter, as well as his uncovering of the many secrets the town holds..\n\n\n\nI have also included the latest popsplugin and ALL sony prx which are required to play psx-psp conversions on custom firmware&amp;#039;s... To install the pops simply copy the seplugins folder to the root of your memory stick, turn off your psp, hold down the right trigger button while turning the psp back on to go into recovery mode..Select the plugins option and enable the pops...Everytime you start a new psx game it will ask you which pops you wish to use I recommend using 3.40 pops as I have personally have had no problems with ANY psx game so far.....Drag and drop the folder of the game you wish to play to the PSP--&gt;GAME folder on your memory stick and away you go..ENJOY and don&amp;#039;t forget to say thanx.....\n\n\n","torrent":{"xt":"urn:btih:8cfb42d6ccc10db56fe3f68a1202c6c4725b11c7","amp;dn":"%28PSX-PSP%29+Silent+Hill+converted+properly+%28Kingdom-games+by+KloWn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cfb42d6ccc10db56fe3f68a1202c6c4725b11c7","infoHashBuffer":{"type":"Buffer","data":[140,251,66,214,204,193,13,181,111,227,246,138,18,2,198,196,114,91,17,199]},"announce":[],"urlList":[]}}