{"title":"You Can Have an Amazing Memory - Dominic O'Brien","uid":6827540,"size":1220301,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d08d0ddabe4d720e1cb928f9a4ac4c5ba00299d&amp;dn=You+Can+Have+an+Amazing+Memory+-+Dominic+O%5C%27Brien+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"fgronzani","files":1,"time":1321633531,"description":"Dominic O\\'Brien is legendary for winning the World Memory Championship eight times and for outwitting the casinos of Las Vegas to win a fortune at blackjack. His success is based on brilliant techniques that he has developed and refined over the years - in particular, the Journey Method and the Dominic System. Here, for the first time, Dominic lets you right into the heart of his inner world of memory mastery. Learn how to build your memory at your own pace and take yourself to heights of attainment you never thought were possible. Follow his brain-boosting techniques as a warm-up and then move on to the advanced stuff - recalling dozens of digits with ease, wiping the floor with your opponents at cards, and driving the route from Land\\'s End to John O\\'Groats without the aid of a satnav or road atlas - that\\'s right, boys, you need never ask for directions again! The memory isn\\'t like a muscle - its capacity is infinite. Turn your brain into a portable super-powered computer with this life-changing self-help book. Use the power of improved memory to achieve new success in business, leisure, relationships, and all aspects of personal fulfilment.","torrent":{"xt":"urn:btih:8d08d0ddabe4d720e1cb928f9a4ac4c5ba00299d","amp;dn":"You+Can+Have+an+Amazing+Memory+-+Dominic+O%5C%27Brien+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d08d0ddabe4d720e1cb928f9a4ac4c5ba00299d","infoHashBuffer":{"type":"Buffer","data":[141,8,208,221,171,228,215,32,225,203,146,143,154,74,196,197,186,0,41,157]},"announce":[],"urlList":[]}}