{"title":"VA.-.Cool.Tributes.The.Chill.Out.Sessions.(2009).","uid":5081314,"size":180968307,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8da0533e13441c8fd437654fa1710a4a9f33da33&amp;dn=VA.-.Cool.Tributes.The.Chill.Out.Sessions.%282009%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"LDivx","files":39,"time":1252329366,"description":"Artist: VA\nTitle: Cool Tributes: The Chill-Out Sessions\nStyle: Easy Listening, Jazz, Nu-Jazz, Lo-Fi, Chill-Out\nRelease Date: 15-09-2009\nTracks: 32\nQuality: MP3 | VBR kbps\nPlaytime: 130:12 min\nSize: ~ 182 mb\n\n\nTracklist:\n\nCD1:\n\n01. Pete Kuzma feat. Bilal - High and Dry (Orig. by Radiohead)\n02. Tok Tok Tok - Walk On The Wild Side (Orig. by Lou Reed)\n03. Rosalia de Souza - Carolina Carol Bela (Orig. by Jorge Ben And Toqinho)\n04. Karen Aoki - Smooth Operator (Orig. by Sade)\n05. Juliet Topaz - Put Your Records On (Orig. by Corin Bailey Rae)\n06. Matthieu Bor? - Georgia On My Mind (Orig. by Ray Charles)\n07. Jamie Cullum - Devil May Care (Orig. by Frank Sinatra)\n08. Jill Scott feat. Al Jarreau and George Benson - God Bless The Child (Orig. by Billie Holiday)\n09. Jazzkantine - Highway To Hell (Orig. by AC_DC)\n10. Ginger Ale - Le Grand Sommeil (Orig. by Etienne Daaho) \n11. Kill The Young - Girls Just Want To Have Fun (Orig. by Cindy Lauper)\n12. Musica Nuda - Like A Virgin (Orig. by Madonna)\n13. Solal feat. Melanie Cannon - Dancing Queen (Orig. by Abba)\n14. Benny Berrigan - Caravan (Orig. by Duke Ellington)\n15. Waldeck - Bei mir bist du schoen (Orig. by The Andrew Sisters)\n16. The Field - Everybodys Got To Learn Sometime (Orig.by The Korgis) \n\nCD2:\n\n01. Baby Charles - I Bet You Look Good On The Dancefloor (Orig. by The Arctic Monkeys)\n02. Melissa Laveaux - Needle In The Hay (Orig. by Elliot Smith)\n03. Vandaveer - The Man In Me (Orig. by Bob Dylan)\n04. Rachelle Spring - Stayin Alive (Orig. by Bee Gees)\n05. Eldissa - Ring My Bell (Orig. by Anita Ward)\n06. Border Sound - Hot Stuff (Orig. by Donna Summer)\n07. Jazzkantine - I Was Made For Loving You (Orig. by Kiss)\n08. Eli Goulart and Banda Do Mato - Sunny (Orig. by Bobby Hebb)\n09. Naosol and The Waxx Blend - Clint Eastwood (Orig. by Gorillaz)\n10. Pat Kelly - A Whiter Shade Of Pale (Orig. by Procol Harum) \n11. Jimmy London - Its Now Or Never (Orig. by Elvis Presley) \n12. Norah Jones and Joel Harrison - I Walk The Line (Orig. by Johnny Cash)\n13. Rigmor Gustaffson and Nils Landgren - If You Go Away (Orig. by Jaques Brel) \n14. Annie Ducros - Leau de la bouche (Orig. by Serge Gainsbourg) \n15. Yaron Herman - Hallelujah (Orig. by Leonard Cohen) \n16. Michel Pertucciani - Besame Mucheo (Orig. by Consuelo Velaquez)","torrent":{"xt":"urn:btih:8da0533e13441c8fd437654fa1710a4a9f33da33","amp;dn":"VA.-.Cool.Tributes.The.Chill.Out.Sessions.%282009%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8da0533e13441c8fd437654fa1710a4a9f33da33","infoHashBuffer":{"type":"Buffer","data":[141,160,83,62,19,68,28,143,212,55,101,79,161,113,10,74,159,51,218,51]},"announce":[],"urlList":[]}}