{"title":"Nanotechnology Assessment and Perspectives - Schmid et al.","uid":15450827,"size":6255453,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e164ec3fcd062ac654654c696d01403a52567c8&amp;dn=Nanotechnology+Assessment+and+Perspectives+-+Schmid+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1469940045,"description":"Nanotechnology Assessment and Perspectives - Schmid et al. (Springer, 2006).pdf\r\n\r\nSince nanotechnology is considered a key for the 21st century, its promises have been assessed by various scientific communities. By meeting at the nanoscale, various disciplines, from physics via chemistry to biology, from engineering to medicine, contribute synergetically to the newly created knowledge base and the resulting technological advances. Considering that large societal sectors will be impacted, the unique aspect of this two-year study was to assess nanotechnology from various interrelated perspectives: scientific progress, industrial relevance, economic potential, educational needs, potential adverse health effects, and philosophical aspects.\r\n\r\nThe goal of this study was to derive integrated recommendations which consider the large range of societal implications reflecting the different views in an integrative manner. The study attempts to link previously isolated statements, bundling the various concepts and giving unified recommendations to decision makers in relevant society sectors such as politics, economy and research. Special attention was given to the European situation with respect to commercial consequences, an aspect that has not yet received the attention it deserves so far","torrent":{"xt":"urn:btih:8e164ec3fcd062ac654654c696d01403a52567c8","amp;dn":"Nanotechnology+Assessment+and+Perspectives+-+Schmid+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e164ec3fcd062ac654654c696d01403a52567c8","infoHashBuffer":{"type":"Buffer","data":[142,22,78,195,252,208,98,172,101,70,84,198,150,208,20,3,165,37,103,200]},"announce":[],"urlList":[]}}