{"title":"Karen Marie Moning - Dreamfever (Fever Series, Book 4)","uid":8670391,"size":704485796,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8e6b06f8f173cf1bb5ab111892d946631ef1d014&amp;dn=Karen+Marie+Moning+-+Dreamfever+%28Fever+Series%2C+Book+4%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"katelynor","files":2,"time":1373486097,"description":"He has stolen her past, but MacKayla will never allow her sister's murderer to take her future. Yet even the uniquely gifted sidhe-seer is no match for the Lord Master, who has unleashed an insatiable sexual craving that consumes Mac's every thought - and thrusts her into the seductive realm of two very dangerous men, both of whom she desires but dares not trust.\n\nAs the enigmatic Jericho Barrons and the sensual Fae prince V'lane vie for her body and soul, as cryptic entries from her sister's diary mysteriously appear and the power of the Dark Book weaves its annihilating path through the city, Mac's greatest enemy delivers a final challenge....\nIt's an invitation Mac cannot refuse, one that sends her racing home to Georgia, where an even darker threat awaits. With her parents missing and the lives of her loved ones under siege, Mac is about to come face-to-face with a soul-shattering truth - about herself and her sister, about Jericho Barrons...and about the world she thought she knew. \n\n\n\nFrom my first conversions from audible aa format to mp3 - \nConverted using SoundTaxi 128kbps - \nI checked the beginning and end of each file to make sure the conversion was complete - please let me know if there are any issues.\n","torrent":{"xt":"urn:btih:8e6b06f8f173cf1bb5ab111892d946631ef1d014","amp;dn":"Karen+Marie+Moning+-+Dreamfever+%28Fever+Series%2C+Book+4%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e6b06f8f173cf1bb5ab111892d946631ef1d014","infoHashBuffer":{"type":"Buffer","data":[142,107,6,248,241,115,207,27,181,171,17,24,146,217,70,99,30,241,208,20]},"announce":[],"urlList":[]}}