{"title":"The Kingdom Of The Occult - Walter Martin","uid":10339589,"size":5179094,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8e6c4705175dde6a0fd73acefc94810a916688c0&amp;dn=The+Kingdom+Of+The+Occult+-+Walter+Martin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1402524134,"description":"The Kingdom of the Occult delivers the timely followup to Dr. Martin's best-selling The Kingdom of the Cults.\nThis book takes Dr. Walter Martin's comprehensive knowledge and his dynamic teaching style and forges a strong weapon against the world of the Occult - a weapon of the same scope and power as his phenomenal thirty-five year bestseller, The Kingdom of the Cults (over 875,000 sold).\nProvides a non-alarmist view on the diverse occult teachings that permeate store and library bookshelves, philosophies, psychology and some churches.\nChapters include: Witchcraft and Wicca, Satanism, Pagan Religions, Tools of the Occult, Demon Possession and Exorcism, Spiritual Warfare, UFOs etc.\nEach chapter contains: Quick Facts; History; Case Studies; Theology; Resources.\n\nContents:\nAcknowledgments\nIntroduction\n1. The Kingdom of the Occult\n2. The Occult Revolution\n3. The Doctrine of the Demons\n4. Ancient Paganism\n5. Kabbalah\n6. Eastern Mysticism and the New Age\n7. Psychic Phenomena\n8. Astrology\n9. Tools of the Occult\n10. UFOs\n11. Satanism\n12. Goddess Worship, Witchcraft, and Wicca\n13. Traditional Religions\n14. Demon Possession and Exorcism\n15. The Jesus of the Occult\n16. Spiritual Warfare\n17. Christian Counseling and the Occult\n18. Evangelism: Reaching the Hearts of People\nAppendix A: Questions and Answers on the Occult\nAppendix B: Counseling Assessment Sheet\nBibliography\nIndex\n\nAbout the authors:\nDr. Walter Martin authored twelve books and was recognized as the &quot;father&quot; of the modern Christian counter-cult movement. Dr. Martin recorded more than 5,000 audio tapes on general biblical subjects, and pioneered the development of seminars dealing with cults and secularism in education. He was the founder and president of the Christian Research Institute and host of the nationally syndicated radio talk show The Bible Answer Man.\nJill Martin Rische is currently completing her Master's Degree in Humanities/History of Religion at California State University. She is Dr. Walter Martin's eldest daughter and the author of several books. Jill and her husband, Kevin, are the founders of Walter Martin Ministries (www.waltermartin.com) and the producers of the nationwide radio show Essential Christianity.\nKurt Van Gorden has contributed chapters on cults, the occult, and world religions to several books, including Dr. Walter Martin's Kingdom of the Cults (1985 edition). He is an ordained minister and directs two missions to the cults, Jude 3 Missions and the Utah Gospel Mission, the oldest existing mission to the cults.","torrent":{"xt":"urn:btih:8e6c4705175dde6a0fd73acefc94810a916688c0","amp;dn":"The+Kingdom+Of+The+Occult+-+Walter+Martin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e6c4705175dde6a0fd73acefc94810a916688c0","infoHashBuffer":{"type":"Buffer","data":[142,108,71,5,23,93,222,106,15,215,58,206,252,148,129,10,145,102,136,192]},"announce":[],"urlList":[]}}