{"title":"Wired for Love: How Understanding Your Partner's Brain and Atta","uid":7035369,"size":4498504,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8edfbad2a4ed513b2dc8cb1264882bd05fdc2cd0&amp;dn=Wired+for+Love%3A+How+Understanding+Your+Partner%5C%27s+Brain+and+Atta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MANTESH","files":5,"time":1329357362,"description":"[img]http://uploadpix.org/images/1608820580.jpg[/img]\n[b][quote][color=Green]\n\nWired for Love: How Understanding Your Partner's Brain and Attachment Style Can Help You Defuse Conflict and Build a Secure Relationship\n\n\nPublisher: N.w H..bi.ger Pu.lica.i.ns\nStan Tatkin PsyD MFT\nJanuary 2, 2012\nEnglish\nISBN: 1608820580 \nPDF,EPUB , MOBI \n83 Pages \n4.28 MB\n\n\n&quot;&quot;What the heck is my partner thinking?&quot;&quot; is a common refrain in romantic relationships, and with good reason. Every person is wired for love differently, with different habits, needs, and reactions to conflict. The good news is that most people's minds work in predictable ways and respond well to security, attachment, and rituals, making it possible to actually neurologically prime the brain for greater love and fewer conflicts.\n\nWired for Love is a complete insider's guide to understanding a partner's brain and promoting love and trust within a romantic relationship. Readers learn ten scientific principles they can use to avoid triggering fear and panic in their partners, manage their partners' emotional reactions when they do become upset, and recognize when the brain's threat response is hindering their ability to act in a loving way. By learning to use simple gestures and words, readers can learn to put out emotional fires and help their partners feel more safe and secure. The no-fault view of conflict in this book encourages readers to move past a &quot;&quot;warring brain&quot;&quot; mentality and toward a more cooperative &quot;&quot;loving brain&quot;&quot; understanding of the relationship. Based in the sound science of neurobiology, attachment theory, and emotion regulation research, this book is essential reading for couples and others interested in understanding the complex dynamics at work behind love and trust in intimate relationships.\n\n[/color][/quote][/b]\n\n\n\n\n\n","torrent":{"xt":"urn:btih:8edfbad2a4ed513b2dc8cb1264882bd05fdc2cd0","amp;dn":"Wired+for+Love%3A+How+Understanding+Your+Partner%5C%27s+Brain+and+Atta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8edfbad2a4ed513b2dc8cb1264882bd05fdc2cd0","infoHashBuffer":{"type":"Buffer","data":[142,223,186,210,164,237,81,59,45,200,203,18,100,136,43,208,95,220,44,208]},"announce":[],"urlList":[]}}