{"title":"What Color Is Your Parachute 2014 (2013) Richard N Bolles (multi","uid":9540558,"size":34796030,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f04b8004285e5b79855b44b13ac653a9a954c08&amp;dn=What+Color+Is+Your+Parachute+2014+%282013%29+Richard+N+Bolles+%28multi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"7","files":-1,"time":1391034549,"description":"\nWhat Color Is Your Parachute 2014 by Richard N Bolles\n\n\nFormat: mobi/epub/azw3\nLength: 368 pages\nGenre: Non-Fiction/Careers\nDate: 13 August 2013\n\nThe world's most popular job-search book is updated for 2014 with up-to-the-minute information and tips for how-to look for work and change careers.\n\nIn today's challenging job-market, the long-trusted guidance of What Color Is Your Parachute? is needed more than ever. Published in 22 languages and 26 countries, and with over 10 million copies sold, What Color is Your Parachute? has helped millions discover their unique gifts, skills, and interests and land a job--even in hard times.\n\nThis 2014 edition of &quot;One of the 100 best and most influential [nonfiction books] written in English since 1923&quot; according to TIME.com, is refreshed with up-to-the-minute statistics, job-field analyses, and advice on social media and search tactics (including Facebook, LinkedIn, Twitter, Skype, Yelp, and YouTube). However, Parachute's core message remains intact: WHAT, WHERE, and HOW.\n\n* What do you most love to do?\n* Where do you most love to do it?\n* How do you find such a job and persuade those employers to hire you?\n\nAuthor:\n\nCareer and business guru Richard N. Bolles, who coined the terms &quot;informational interview&quot; and &quot;transferable skills&quot; demystifies the entire job-search process, from resumes, interviewing, networking, salary negotiation, career coaches, how to start your own business, and more. He has led the job-search field for more than 40 years. A member of Mensa and the Society for Human Resource Management, he has been the keynote speaker at hundreds of conferences. ","torrent":{"xt":"urn:btih:8f04b8004285e5b79855b44b13ac653a9a954c08","amp;dn":"What+Color+Is+Your+Parachute+2014+%282013%29+Richard+N+Bolles+%28multi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f04b8004285e5b79855b44b13ac653a9a954c08","infoHashBuffer":{"type":"Buffer","data":[143,4,184,0,66,133,229,183,152,85,180,75,19,172,101,58,154,149,76,8]},"announce":[],"urlList":[]}}