{"title":"Superman - For All Seasons","uid":5092847,"size":136481405,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8f0a54b7b8dc4afcf8fa6bf3442598d9ea15795e&amp;dn=Superman+-+For+All+Seasons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"brodahisou","files":-1,"time":1253292112,"description":"Superman: For All Seasons was a 4-issue comic book limited series written by Jeph Loeb with art by Tim Sale, and was originally published by DC Comics in 1998. This was made hot off the heels from their previous success, Batman: The Long Halloween, and as that Batman-story dealt with holidays as the theme, this story's theme dealt with seasons. The artwork contains many influences from that of Norman Rockwell. The story also parallels the events from Superman's then-origin story John Byrne's The Man of Steel, though it can be read on its own.\n\nSuperman For All Seasons was conceived, like all of the Jeph Loeb/Tim Sale books from DC Comics and rival Marvel Comics, as a stand alone, self-contained story that gave a sense of the character of Superman and his supporting cast. Not an origin, but picking up on who the character is and how he came to be. The important part of the project, like many others, was to show the hero in a light so that the reader cared about him.  As explained by Loeb, one of the things that he wanted to capture was the grandeur that is Superman, and that was to have double-page spreads with big sky shots. With Sale and Bjarne Hansen on the art and colors, everyone was speechless once Loeb saw the pages, and those same pages came in the office of DC. One of the biggest examples was the end to the first issue, with Clark Kent and Pa Kent looking out at a sunset from their farm. The shot was two pages long.\n\nPerhaps the most important, and the key, to the series was the narration. Originally, Loeb never intended to have a narrator, but he knew he didn't want Superman to narrate from his point of view. As he explained; &quot;I didn't feel comfortable being inside the head of an icon.&quot; So it was decided to have others narrate and give their point of view on Superman, rather than Superman on himself. Pa Kent gave his life as a father to a super-powered son, while not knowing what lied ahead of Clark, had confidence that his son would be alright. This in turn, came from Loeb himself as the father to his son, Sam Loeb. Lois Lane was the impact of Superman's presence and on the idea of Superman in general, Lex Luthor was about how his rivalry with Superman was like a love story between him and Metropolis, and Lana Lang finally gave and explained the heroism of both Clark and Superman.\n\n\nSpring\nNarrated by Jonathan Kent, he makes a point that before he was &quot;Superman&quot; or &quot;the Man of Steel&quot;, among others, Clark Kent was a farmer's son.\n\n\nSummer\nNarrated by Lois Lane, she makes a point that the rules that made her a newspaperwoman went out the window the day Superman appeared. \n\n\nFall\nNarrated by Lex Luthor, he considers his story to be a love story, between a man and his city.\n\n\nWinter\nNarrated by Lana Lang, she reveals she wanted to marry the boy next door, and become Mrs. Lana Lang Kent. But it was when she found out what he could do, that it felt like her dreams crashed down.\n\n\nThe Clark Kent/Superman from For All Seasons has reappeared twice after the series ended. The first time was in a Tim Sale-focused issue of the short-lived Solo comic book series. The story titled &quot;Prom Night&quot;, which returned Sale with writer Jeph Loeb, focused on Clark picking up Lana Lang as his prom date. The second time, also with Loeb &amp; Sale, was in a short story found in the twenty-sixth issue of Superman/Batman titled &quot;Sam's Story&quot;, where Superman recounts his friend from high school who died of cancer when he was very young. The &quot;Sam&quot; character is based on Jeph Loeb's son, also named Sam, who died from the same illness.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:8f0a54b7b8dc4afcf8fa6bf3442598d9ea15795e","amp;dn":"Superman+-+For+All+Seasons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f0a54b7b8dc4afcf8fa6bf3442598d9ea15795e","infoHashBuffer":{"type":"Buffer","data":[143,10,84,183,184,220,74,252,248,250,107,243,68,37,152,217,234,21,121,94]},"announce":[],"urlList":[]}}