{"title":"Black Sabbath - Sabotage  320k   mp3   ak1975","uid":10550261,"size":104942937,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8f0a14a45440a3f0eb445fa6005a861c07a5a4fa&amp;dn=Black+Sabbath+-+Sabotage++320k+++mp3+++ak1975&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"analogkid6103","files":8,"time":1405332972,"description":"Black Sabbath - Sabotage  320k   mp3   ak1975  What we got Some Sabbath from the day more nfo Sabotage is a mix of heavy, powerful songs and softer experimental tunes, such as &quot;Supertzar&quot; and &quot;Am I Going Insane (Radio)&quot;. In 2013 Mojo observed, &quot;Opener 'Hole In The Sky' and the crunching 'Symptom Of The Universe' illustrate that, for all their problems, Sabbath's power remained undimmed on what was what many consider one of their finest offerings.&quot; In the article &quot;Thrash Metal - An Introduction&quot; in University Times Magazine, Vladimir Rakhmanin cites &quot;Symptom of the Universe&quot; as one of the earliest examples of thrash metal, a heavy metal sub-genre which emerged in the early 1980s. Tony Iommi describes the song's dynamics in his autobiography Iron Man: &quot;It starts with an acoustic bit. Then it goes into the up-tempo stuff to give it that dynamic, and it does have a lot of changes to it, including the jam at the end.&quot; The final part of &quot;Symptom of the Universe&quot; evolved from an in-studio improvisation, created very spontaneously in a single day and the decision was made to use it in that song. The London Philharmonic Choir was brought in to perform on the song &quot;Supertzar&quot;. When  Ozzy  arrived at the studio and saw them, he thought he was in the wrong studio and left. The title of the pop-leaning &quot;Am I Going Insane (Radio)&quot; caused some confusion due to the &quot;(Radio)&quot; part, which led people to believe the song was a radio cut or radio version. However, this is the only version of the song: the term &quot;radio-rental&quot; is rhyming slang for &quot;mental&quot;. AllMusic reviewers claimed that the song was unrecognizable for Black Sabbath and that it was a reckless attempt to change the band's identity.\n\n&quot;The Writ&quot; is one of only a handful of Black Sabbath songs to feature lyrics composed by Ozzy, who typically relied on bassist Geezer Butler for lyrics. The song was inspired by the frustrations Osbourne felt at the time, as Black Sabbath's former manager Patrick Meehan was suing the band after having been fired. The song viciously attacks the music business in general and is a savage diatribe directed towards Meehan specifically (Are you Satan? Are you a man?), with Osbourne revealing in his memoir, &quot;I wrote most of the lyrics myself, which felt a bit like seeing a shrink. All the anger I felt towards Meehan came pouring out.&quot; During this period, the band began to question if there was any point to recording albums and touring endlessly &quot;just to pay the lawyers&quot;. It's about depressing as it can be but then who listens to Sabbath to get happy? Sounds good to me so get it ...........","torrent":{"xt":"urn:btih:8f0a14a45440a3f0eb445fa6005a861c07a5a4fa","amp;dn":"Black+Sabbath+-+Sabotage++320k+++mp3+++ak1975","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f0a14a45440a3f0eb445fa6005a861c07a5a4fa","infoHashBuffer":{"type":"Buffer","data":[143,10,20,164,84,64,163,240,235,68,95,166,0,90,134,28,7,165,164,250]},"announce":[],"urlList":[]}}