{"title":"Packtpub CryENGINE 3 Cookbook","uid":6547450,"size":13674750,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f2d8721f0167c377f6b1a844388365c308e23b5&amp;dn=Packtpub+CryENGINE+3+Cookbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ToiletClown","files":2,"time":1310930087,"description":"[ Detailed Information [\nLanguage : English\nPaperback : 324 pages (235mm x 191mm)\nRelease Date : June 2011\nISBN : 1849691061\nISBN 13 : 978-1-84969-106-2\nAuthor(s) : Dan Tracy, Sean Tracy\n\n[ Approach ]\nWritten in a cookbook style, this book offers solutions using a recipe based approach. Each recipe contains step-by-step instructions followed by an analysis of what was done in each task and other useful information. The cookbook approach means you can dive into whatever recipes you want in no particular order. The CryENGINE3 Cookbook is written to be accessible to all developers currently using the CryENGINE3. It also explores the depth and power of the CryENGINE3 and is a useful guide to follow when becoming familiar with this award winning middle-ware game engine.\n\n[ What you will learn from this book ]\n - Navigate and interface within the CryENGINE Sandbox, the tool used to create AAA games like Crysis 2.\n - Create your own levels and even entire worlds using recipes for sculpting and molding terrain.\n - Model with the integrated tools available to designers and artists in the CryENGINE3 Sandbox.\n - Use the cutting edge real time lighting technology of the CryENGINE to bring light to your worlds and explore the use of atmospherics and effects used for today's newest games.\n - Create and animate AAA characters and other objects for use with the CryENGINE Sandbox.\n - Manipulate the advanced AI available to game designers in the CryENGINE3.\n - Create your own cut scenes and videos using the power of the CryENGINE3 engine to maximize the output.\n - Optimize your creations for optimal performance with maximum visual impact.\n - Have fun following interesting game changing physical simulation recipes that can add unique game play opportunities to your levels.\n - Use visual scripting to create amazingly complex events as seen in Crysis2.\n\n[ Written for ]\nThis book is written with the casual and professional developer in mind. Fundamental knowledge of some Digital Content Creation Tools, like Photoshop and 3d Studio Max is required. The Software Development Kit version of the CryENGINE is used for all examples, so the reader should have a version of the development kit to follow the recipes contained in this book.\n","torrent":{"xt":"urn:btih:8f2d8721f0167c377f6b1a844388365c308e23b5","amp;dn":"Packtpub+CryENGINE+3+Cookbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f2d8721f0167c377f6b1a844388365c308e23b5","infoHashBuffer":{"type":"Buffer","data":[143,45,135,33,240,22,124,55,127,107,26,132,67,136,54,92,48,142,35,181]},"announce":[],"urlList":[]}}