{"title":"Nature Field Guides #1 - ebooks","uid":5236186,"size":1396983219,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f7806f4964b32cb1deae25ba129519c1eef5d5e&amp;dn=Nature+Field+Guides+%231+-+ebooks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"naturefieldguides","files":365,"time":1261548980,"description":"Books mostly encoded in djvu format.  Download free viewers at: http://sourceforge.net/projects/djvu/files/\n\nIf you enjoy any of these resources, please support the authors by buying the publication (especially for the small publishers or self-publishing authors!)\n\n---------------------------\nBOOKS INCLUDED IN THIS TORRENT:\n\nbirds:\nbirdlifebehavior.djvu - The Sibley Guide to Bird Life and Behavior, by Chris Elphick, John B Dunning Jr, and David Allen Sibley; 2001\nhandbook.djvu - The Birder's Handbook, by Paul Ehrlich, David Dobkin, and Darryl Wheye\nnestseggsnestlings.djvu - Nests, Eggs, and Nestlings of North American Birds, second edition, by Paul Baicich and Colin Harrison; 2005\npetersonBirds.djvu - Peterson Field Guide to Birds of North America, by Roger Tory Peterson; 2008\nRaptors.djvu - Raptors of North America, by David Lukas; 2005\nsibley.djvu - The Sibley Guide to Birds, by David Allen Sibley; 2000\nstokesbb1.djvu - A Guide to Bird Behavior, Volume I, by Donald Stokes; 1979\nstokesbb2.djvu - A Guide to Bird Behavior, Volume II, In the Wild and at Your Feeder, by Donald &amp; Lillian Stokes\n\nfish:\nfishesCA.djvu - Inland Fishes of California, by Peter Moyle; 2002\nSchultzFresh.pdf - Ken Schultz's Guide to Freshwater Fish, by Ken Schultz\nSchultzSalt.pdf - Ken Schultz's Field Guide to Saltwater Fish, by Ken Schultz\n\nfungi:\nmacrolichens.djvu - Macrolichens of the Pacific Northwest, by Bruce McCune and Linda Geiser; 1997\nmush.djvu - Mushrooms Demystified by David Arora\n\nherps:\namphibs.djvu - Amphibians of the Pacific Northwest, by Lawrence Jones, William Leonard, &amp; Deanna Olson; 2005\namphibsrepsPNW.djvu - Amphibians and Reptiles of the Pacific Northwest, by Ronald Nussbaum, Edmund Brodie Jr, &amp; Robert Storm; 1983\nfrogstoadsNA.djvu - The Frogs and Toads of North America: A Comprehensive Guide to Their Identification,Behavior, and Calls, by Lang Elliott; 2009 (the CD accompanying this book is in Nature Field Guides #2)\nreptiles.djvu - Reptiles of the Northwest, by Alan St. John; 2002\nstokesAmphibsReps.djvu - A Guide to Amphibians and Reptiles, by Thomas Tyning; 1990\nwesternherps.djvu - A Field Guide to Western Reptiles and Amphibians, Third Edition, by Robert Stebbins; 2003\n\ninsects:\namericaninsects.djvu - American Insects: A Handbook of the Insects of America North of Mexico, Second Edition, by Ross Arnett Jr; 2000\nants.djvu - Ants of North America: A Guide to the Genera, by Brian Fisher &amp; Stefan Cover; 2007\nbeetlesCA.djvu - Field Guide to Beetles of California, by Arthur Evans &amp; James Hogue\nbutterfliescascadia.djvu - The Butterflies of Cascadia, by Robert Michael Pyle; 2003\nbutterflies.djvu - Butterflies Through Binoculars, by Jeffrey Glassberg, 2001\ncaterpillars.djvu - Caterpillars in the Field and Garden, by Thomas Allen, Jim Brock, &amp; Jeffrey Glassberg; 2005\ndragonflies.djvu - Dragonflies Through Binoculars, by Sidney Dunkle; 2000\nfoodinsects.djvu - The Food Insects Newsletter (Volume 5, #2 through Volume 11, #2.  Doesn't include every issue between those.)\ngallsPNW.djvu - Common Insect and Mite Galls of the Pacific Northwest, by Hiriam Larew &amp; Joseph Capizzi; 1983\ngrasshoppers.djvu - Field Guide to Grasshoppers, Katydids, and Crickets of the United States, by John Capinera, Ralph Scott, &amp; Thomas Walker\ninsectlives.djvu - A Guide to Observing Insect Lives, by Donald Stokes; 1983\ninsectsNA.djvu - Kaufman Field Guide to Insects of North America, by Eric Eaton &amp; Kenn Kaufmann; 2007\ninsectsPNW.djvu - Insects of the Pacific Northwest, by Peter &amp; Judy Haggard; 2006\nsongsinsects.djvu - The Songs of Insects, by Lang Elliott &amp; Wil Hershberger; 2007 (the CD accompanying this book is in Nature Field Guides #2)\ntigerbeetles.djvu - A Field Guide to the Tiger Beetles of the United States &amp; Canada, by David Pearson, C. Barry Knisley, &amp; Charles Kazilek; 2006\n\nmammals:\nmammalogists - American Society of Mammalogists publications\nmammalsNA.djvu - A Field Guide to Mammals of North America North of Mexico, Fourth Edition (Peterson Field Guide), by Fiona Reid; 2006\nmammalsORcoast.djvu - Natural History of Oregon Coast Mammals, by Chris Maser, Bruce Mate, Jerry Franklin, &amp; C. T. Dyrness; 1981\nmammalspnw.djvu - Mammals of the Pacific Northwest: From the Coast to the High Cascades, by Chris Maser \nmammalsWAOR.djvu - Mammals of Washington and Oregon, by Tamara Eder; 2002\n\nmisc:\nbacteria.djvu - A Field Guide to Bacteria, by Betsy Dexter Dyer; 2003\nrocksminerals.djvu - Rocks and Minerals (Smithsonian Handbooks), by Chris Pellant; 2002\nstars.djvu - The Stars: A New Way to See Them, by H. A. Rey; 1980\nvenompoison.djvu - A Field Guide to Venomous Animals and Poisonous Plants (Peterson Field Guide), by Steven Foster &amp; Roger Caras; 1994\n\nplants:\nberries.djvu - Wild Berries of the West, by Betty Derig &amp; Margaret Fuller; 2001\nbotany.djvu - Botany in a Day, 5th edition, by Thomas Elpel\ncanadafruitsnuts.djvu - Edible Wild Fruits &amp; Nuts of Canada, by Nancy Turner &amp; Adam Szczawinski; 1981\ncanadatea.djvu - Wild Coffee and Tea Substitutes of Canada, by Nancy Turner &amp; Adam Szczawinski; 1978\ncanadaveg.djvu - Wild Green Vegetables of Canada, by Nancy Turner &amp; Adam Szczawinski; 1980\ncanadaweeds.djvu - Edible Garden Weeds of Canada,  by Nancy Turner &amp; Adam Szczawinski; 1978\ncech.djvu - Growing At-Risk Medicinal Herbs, by Richo Cech\ncherokee.djvu - Plants of the Cherokee, by William Banks Jr; 2004\nfeastingfree.djvu - Feasting Free on Wild Edibles, by Bradford Angier; 1972 (includes two books - Free for the Eating, and More Free-for-the-Eating Wild Foods)\nflavors.djvu - The Flavors of Home, by Margit Roos-Collins; 1990\nforage.djvu - The Forager's Harvest, by Samuel Thayer; 2006\ngitksan.djvu - Ethnobotany of the Gitksan Indians of British Columbia, by Harlan Smith; 1997\ngitksangathering.djvu - Gathering What the Great Nature Provided: Food Traditions of the Gitksans, by The People of 'Ksan; 1980\nhandbookNW.djvu - Handbook of Northwestern Plants, revised edition, by Helen Gilkey &amp; La Rea J. Dennis; 2001\nharrington.djvu - Edible Native Plants of the Rocky Mountains, by H. D. Harrington \nherbmanual.djvu - Therapeutic Herb Manual: The Therapeutic Administration of Medicinal Herb Compounds, revised &amp; enlarged September 1983 edition, by Ed Smith\nliveforever.djvu - It Will Live Forever: Traditional Yosemite Indian Acorn Preparation, by Beverly Ortiz as told by Julia Parker; 1991\nmontana.djvu - Montana Native Plants &amp; Early Peoples, by Jeff Hart; 1996\nmoore.djvu - Medicinal Plants of the Pacific West, by Michael Moore; 1993\nNAethnobotany.djvu - Native American Ethnobotany, by Daniel Moerman; 1988 \nnwftrees.djvu - National Wildlife Federation Field Guide to Trees of North America; 2008\nnwtrees.djvu - Northwest Trees: Identifying and Understanding the Region's Native Trees, by Stephen Arno &amp; Ramona Hammerly; 2007\nnyerges.djvu - Guide to Wild Foods and Useful Plants, by Christopher Nyerges\nOakInsectsDiseases.pdf - A Field Guide to Insects &amp; Diseases of California Oaks, by Tedmund Swiecki &amp; Elizabeth Bernhardt; 2006\npacwf.djvu - A Field Guide to Pacific State Wildflowers, by Theodore Niehaus; 1976\nplantsWAORBC.djvu - Plants of Western Washington, Oregon, &amp; British Columbia, by Eugene Kozloff; 2005\npojar.djvu - Plants of the Pacific Northwest Coast, by Jim Pojar &amp; Andy MacKinnon; 2004\nprairie.djvu - Edible Wild Plants of the Prairie: An Ethnobotanical Guide, by Kelly Kindscher\nschofield.djvu - Discovering Wild Plants: Alaska, Western Canada, the Northwest, by Janice Schofield; 2000\nstalkingHealthfulHerbs.djvu - Stalking the Healthful Herbs, by Euell Gibbons\nstalkingWildAsparagus.djvu - Stalking the Wild Asparagus, by Euell Gibbons\nSturtevants_Edible_Plants.pdf - Sturtevants Edible Plants of the World, edited by U. P. Hedrick\ntasteofheritage.djvu - A Taste of Heritage: Crow Indian Recipes &amp; Herbal Medicines, by Alma Hogan Snell; 2006\ntilford.djvu - Edible and Medicinal Plants of the West, by Gregory Tilford\ntozer.djvu - The Uses of Wild Plants, by Frank Tozer; 2007\ntreesshrubsCA.djvu - Trees and Shrubs of California, by John Stuart &amp; John Sawyer\nwesterntrees.djvu - A Field Guide to Western Trees: Western United States &amp; Canada (Peterson Field Guide), by George Petrides\nwildflowersPNW.djvu - Wildflowers of the Pacific Northwest, by Mark Turner &amp; Phyllis Gustafson; 2006\nwildfoodadventurer.djvu - Wild Food Adventurer newsletter, by John Kallas\nwildfoodsforum.djvu - The Wild Foods Forum newsletter (Volume 1, #3 to Volume 18, #3.  Doesn't include all issues in that range.)\nwildman.djvu - Identifying and Harvesting Edible and Medicinal Plants: In Wild (and Not So Wild) Places, by &quot;Wildman&quot; Steve Brill with Evelyn Dean\nwintertwigs.djvu - Winter Twigs, revised edition, by Helen Gilkey &amp; Patricia Packard; 2001\n\ntracking:\nartoftracking.djvu - The Art of Tracking: The Origin of Science, by Louis Liebenberg; 1990\nbirdtracks.djvu - Bird Tracks &amp; Sign: A Guide to North American Species, by Mark Elbroch &amp; Eleanor Marks; 2001\nelbroch.djvu - Mammals Tracks &amp; Sign: A Guide to North American Species, by Mark Elbroch; 2003","torrent":{"xt":"urn:btih:8f7806f4964b32cb1deae25ba129519c1eef5d5e","amp;dn":"Nature+Field+Guides+%231+-+ebooks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f7806f4964b32cb1deae25ba129519c1eef5d5e","infoHashBuffer":{"type":"Buffer","data":[143,120,6,244,150,75,50,203,29,234,226,91,161,41,81,156,30,239,93,94]},"announce":[],"urlList":[]}}