{"title":"Roman Republican Legionary 298-105 BC","uid":11816965,"size":8659856,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f950596e39922375afd080c40564a57cfb5123c&amp;dn=Roman+Republican+Legionary+298-105+BC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429131304,"description":"Soon after the Caudine Forks fiasco, where Roman citizens had suffered the humiliation of being forced to pass under the yoke, an act symbolising their loss of warrior status, the tactical formation adopted by the Roman army underwent a radical change. Introduced as part of the Servian reforms, the legion had originally operated as a Greek-style phalanx, a densely packed block of citizens wealthy enough to outfit themselves with the full panoply of an armoured spearman or hoplite. The function of a hoplite had been the privilege only of those who owned a certain amount of property, poorer citizens serving either as auxiliaries or as servants. Now, however, the Romans adopted the manipular system, whereby the legion was split into distinct battle lines, each consisting of tactical subunits, the maniples. In contrast to the one solid block of the phalanx, the legion was now divided into several small blocks, with spaces between them. The Romans, in other words, gave the phalanx 'joints' in order to secure flexibility, and what is more, each soldier, or legionary, had twice as much elbow room for individual action, which now involved swordplay instead of spear work.\nEven though still a citizen militia recruited from property owners supplying their own war gear, it was the manipular legion that faced Pyrrhus and his elephants, the Gauls and their long swords, Hannibal and his tactical genius, the Macedonians and their pikes, to name but a few of its formidable opponents. This book, therefore, will look at the recruitment (now based on age and experience as well as on wealth and status), training (now the responsibility of the state as opposed to the individual), weapons (new types being introduced, both native and foreign), equipment (ditto) and experiences (which included submission to a draconian regime of military discipline) of the legionary at the epoch of the middle Republic. The middle Republican era opens with the last great war with the Samnites (Third Samnite War, 298-290 BC) and closes with the Republic at the height of its imperial glory after the victory in North Africa (Iugurthine War 112-105 BC). The provisional legion in which the legionary served now exhibited many of the institutions and customs of the later professional legions, perhaps best reflected in one of its most notable practices, the construction of a temporary camp at the end of each day's march. Lest we forget, however, for our legionary, military service was not a career, but an obligation he owed to the state, and it was this militia army that conquered the peninsula of Italy, defeated the magnificent Hellenistic kingdoms and the mercantile empire of Carthage. All of the Mediterranean basin was now within the imperium of Rome, some of it organized into provinces governed by Roman magistrates, the rest reduced to client status. Romans were acquiring a sense that they possessed a world empire","torrent":{"xt":"urn:btih:8f950596e39922375afd080c40564a57cfb5123c","amp;dn":"Roman+Republican+Legionary+298-105+BC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f950596e39922375afd080c40564a57cfb5123c","infoHashBuffer":{"type":"Buffer","data":[143,149,5,150,227,153,34,55,90,253,8,12,64,86,74,87,207,181,18,60]},"announce":[],"urlList":[]}}