{"title":"OS X 10.10 Yosemite VMware Image","uid":11674048,"size":5950055385,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:9111e43655fdda7149f5d1b6432eeba8060d6a1f&amp;dn=OS+X+10.10+Yosemite+VMware+Image&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"toptorrenter","files":30,"time":1422783198,"description":"OS X 10.10 Yosemite VMware Image.\n\n\nHey guys.\n\nThis is a quick how-to on how to get this VMware Workstation image working on your system.\n\n\nI am running the Windows 10 Technical Preview with VMware Workstation 10.\n\nStep 1: Shut down all your VMs and close VMware.\nStep 2: Go to the Mac OS X Guest folder, select your VMware series (I hope you have at least 10.x)\nStep 3: Open the Unlocker folder for your version of your VMware product. I will explain the Windows unlocker for VMware Workstation in this guide.\nStep 4: Run install.cmd (for Windows, install.sh for Linux)\nStep 5: Wait and check if everything went okay!\nStep 6 (only run this if your VM doesn't work complaining about hardware virtualization): Go back to the folder where this README is located and go to the Hardware Virt Bypasser folder and run the Hardware Virtualization bypasser.\nStep 7: Extract the .7z file by running the 7z-extracter.cmd\nStep 8: Open the &quot;OS X 10.10 Yosemite Image&quot; folder and double click on the .vmx file.\nStep 9: Edit your settings to your likings. With the CD drive select the darwin.iso file located in the Tools folder. You can find these where you also found the OS X Guest unlocker for your VMware product. Also go to the monitor tab and edit the resolution to your monitors' resolution.\nStep 10: Turn on the Virtual Machine and select I copied it if VMware asks you. Wait for it to boot and go through the setup process. Your VM may respond very slow. Install VMware tools to fix.\nStep 11: Once you're done you can install VMware Tools. This CD should be mounted if you selected it in the settings above.\nStep 12: ???\nStep 13: PROFIT.\n\nI hope this iamge saved you some effort!","torrent":{"xt":"urn:btih:9111e43655fdda7149f5d1b6432eeba8060d6a1f","amp;dn":"OS+X+10.10+Yosemite+VMware+Image","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9111e43655fdda7149f5d1b6432eeba8060d6a1f","infoHashBuffer":{"type":"Buffer","data":[145,17,228,54,85,253,218,113,73,245,209,182,67,46,235,168,6,13,106,31]},"announce":[],"urlList":[]}}