{"title":"Metal Church - The Dark (1986) WMA320","uid":6253070,"size":104792777,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9125a3eed9cf1249c7f97bbe09714cdb4324c139&amp;dn=Metal+Church+-+The+Dark+%281986%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1300469964,"description":"Metal Church stand as one of the most innovated- and unfortunately, one of the most underappreciated - heavy metal artists of the 1980's. And &quot;The Dark&quot; is, without a doubt, the masterpiece of their hard-driven air-guitar assault.\nThe drums are intense, seemingly keeping up a savage beat that only enhances an already ferocious metal effort. The guitars are well-worked out, and the vocals are beatifully unstable, showing melody as well as unbelievable range and power. Most importantly, the beat and melody are interlocked, not separated like oil and water (like Metallica were in their true metal days). This makes the album almost like punk -in the sense that it's free-flowing and not ridden with ponderous guitar solos (again, like Metallica).\n\nProving themselves totally unlike Bon Govi and Def Leppard, Metal Church offers only true heavy metal tracks on &quot;The Dark&quot;. Songs on pure agression (Ton of Bricks, Start the Fire), mutiny and rebellion (Line of Death), an occult-oriented number (We Watch the Children Pray), war (Method to Your Madness), Hitler's impending war for conquest (Western Alliance).\n\nIn the sense of sub-genre, Metal Church lies between blues-rootled power metal like Judas Priest and Manowar and &quot;straight&quot; thrash like Exodus. &quot;The Dark&quot; is, in my opinion, the best Metal Church album and the tracks illustrate my above point. Final say: &quot;The Dark&quot; is somewhat similar to Anthrax's &quot;Fistful of Metal&quot; in terms of it's contribution to classic metal and it's genre-label defying type of music.\n\nby Craig R. Whitney\n\nTRACKLIST:\n\n01 - Ton Of Bricks.wma                                 \n02 - Start The Fire.wma                                \n03 - Method To Your Madness.wma                        \n04 - Watch The Children Pray.wma                       \n05 - Over My Dead Body.wma                             \n06 - The Dark.wma                                      \n07 - Psycho.wma                                        \n08 - Line Of Death.wma                                 \n09 - Burial At Sea.wma                                 \n10 - Western Alliance.wma  \n\nWMA 320Kbps 44100Hz STEREO\n\nFollow Me On Facebook Pages: MarcelodrgzTPB","torrent":{"xt":"urn:btih:9125a3eed9cf1249c7f97bbe09714cdb4324c139","amp;dn":"Metal+Church+-+The+Dark+%281986%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9125a3eed9cf1249c7f97bbe09714cdb4324c139","infoHashBuffer":{"type":"Buffer","data":[145,37,163,238,217,207,18,73,199,249,123,190,9,113,76,219,67,36,193,57]},"announce":[],"urlList":[]}}