{"title":"Big Sister Is Watching You - Texe Marrs","uid":11712970,"size":8591039,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91e2720b508deaf425256e0849284ccd647de87d&amp;dn=Big+Sister+Is+Watching+You+-+Texe+Marrs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":2,"time":1424405187,"description":"\nThey are unlike anything the world has ever experienced. They're ruthless, shrewd, and calculating--and they've got a stranglehold on the White House. Recruited and empowered by their boss, Hillary, these are the women who tell Bill Clinton what to do. Get ready, America, for the rise of the FemiNazis!\nBig Sister Is Watching You unmasks the coven of brutally correct women who now rule over us. Hillary's regiment of hardened, militant feminists include lesbians, sex perverts, child molester advocates, Christian haters, and the most doctrinaire of communists. They possess awesome Gestapo powers. One heads the FBI, another the IRS. Five are members of the Trilateral Commission and the Council on Foreign Relations--subversive organizations whose goal is to end American sovereignty and bring about a global Marxist paradise.\n\nThen there's Hillary Rodham Clinton. What dark power does she exercise over her husband, Bill? What's her real goal? Is she plotting behind the scenes to become President of the United States of America? Will she then go on to usher in a frightening New Millennium?\n\nGeorge Orwell's prophetic novel, 1984, warned us about Big Brother. Now, in the bizarre 1990s, it's time to &quot;Move over Big Brother...your meaner Big Sister is moving in!&quot;\n\n\nAbout the author:\n Texe Marrs is author of 46 books, including The Personal Robot Book; Careers with Robots; The Great Robot Book; and Codex Magica: Secret Signs, Mysterious Symbols, and Hidden Codes of the Illuminati. A retired United States Air Force officer, he graduated Summa Cum Laude from Park University and earned his Masters Degree at North Carolina State University. Mr. Marrs is founder and president of powerofprophecy.com in Austin, Texas and is host of a popular radio program heard around the world","torrent":{"xt":"urn:btih:91e2720b508deaf425256e0849284ccd647de87d","amp;dn":"Big+Sister+Is+Watching+You+-+Texe+Marrs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91e2720b508deaf425256e0849284ccd647de87d","infoHashBuffer":{"type":"Buffer","data":[145,226,114,11,80,141,234,244,37,37,110,8,73,40,76,205,100,125,232,125]},"announce":[],"urlList":[]}}