{"title":"Modeling Groundwater Flow and Contaminant Transport","uid":6512890,"size":11711801,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:931cdcc2d20c89e98b1dbf7459c0cb93462e30e5&amp;dn=Modeling+Groundwater+Flow+and+Contaminant+Transport&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"_F1_","files":-1,"time":1309705612,"description":"Jacob Bear, Alexander H.-D. Cheng, &quot;Modeling Groundwater Flow and Contaminant Transport&quot; \n Publisher: Springer | ISBN: 1402066813 | edition 2010 | PDF | 834 pages | 11.2 mb\n\n In many parts of the world, groundwater resources are under increasing threat from growing demands, wasteful use, and contamination. To face the challenge, good planning and management practices are needed. A key to the management of groundwater is the ability to model the movement of fluids and contaminants in the subsurface. The purpose of this book is to construct conceptual and mathematical models that can provide the information required for making decisions associated with the management of groundwater resources, and the remediation of contaminated aquifers.\n\n The basic approach of this book is to accurately describe the underlying physics of groundwater flow and solute transport in heterogeneous porous media, starting at the microscopic level, and to rigorously derive their mathematical representation at the macroscopic levels. The well-posed, macroscopic mathematical models are formulated for saturated, single phase flow, as well as for unsaturated and multiphase flow, and for the transport of single and multiple chemical species. Numerical models are presented and computer codes are reviewed, as tools for solving the models. The problem of seawater intrusion into coastal aquifers is examined and modeled. The issues of uncertainty in model input data and output are addressed. The book concludes with a chapter on the management of groundwater resources. Although one of the main objectives of this book is to construct mathematical models, the amount of mathematics required is kept minimal.","torrent":{"xt":"urn:btih:931cdcc2d20c89e98b1dbf7459c0cb93462e30e5","amp;dn":"Modeling+Groundwater+Flow+and+Contaminant+Transport","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"931cdcc2d20c89e98b1dbf7459c0cb93462e30e5","infoHashBuffer":{"type":"Buffer","data":[147,28,220,194,210,12,137,233,139,29,191,116,89,192,203,147,70,46,48,229]},"announce":[],"urlList":[]}}