{"title":"Whisperers: Private Life in Stalin's Russia","uid":11809719,"size":7810465,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9324a72fab22ff736f6254938c55f32dfa5a5ac1&amp;dn=Whisperers%3A+Private+Life+in+Stalin%27s+Russia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1428725246,"description":"Orlando Figes' &quot;The Whisperers&quot; is a groundbreaking account of daily life in the chaotic and paranoid atmosphere of Stalinist Russia. Exploring the inner life of a Russia where everyone was afraid to talk and society spoke in whispers, whether to protect friends and family - or to betray them - Orlando Figes tells the story of how Russians tried to endure life under Stalin's Terror. Where a junior worker might inform on their superior to get their job; a husband to get rid of a lover; a neighbour out of petty jealousy. Where living a double life became the norm and yet, somehow, a few defied the state. Those who shaped the political system became, very frequently, its victims. Those who were its victims were frequently quite blameless. Drawing on hundreds of family archives from across the whole spectrum of Russian society, The Whisperers recreates the sort of maze in which Russians found themselves, where an unwitting wrong turn could either destroy a family or, perversely, later save it: a society in which everyone spoke in whispers - whether to protect themselves, their families, neighbours or friends - or to inform on them. &quot;Wonderful ...an amazing panoramic view ...I 've rarely read anything like it&quot;. (Claire Tomalin). &quot;Awesome ...one of the most unforgettable books I have ever read. I defy anyone to read it without weeping at its human suffering, cruelty and courage&quot;. (Simon Sebag Montefiore, &quot;Mail on Sunday&quot;). &quot;This is a heart-rending book ...its importance cannot be overestimated...This book should be made compulsory reading in Russia today&quot;. (Antony Beevor, author Of &quot;Stalingrad&quot;). &quot;A masterful account of lost and stolen lives&quot;. (&quot;Sunday Times&quot;). Orlando Figes is Professor of History at Birkbeck College, University of London. He is the author of &quot;Peasant Russia&quot;, &quot;Civil War&quot;, &quot;A Peoples Tragedy&quot;, &quot;Natasha's Dance&quot; and &quot;The Whisperers&quot;. He lives in Cambridge and London. His books have been translated into over twenty languages","torrent":{"xt":"urn:btih:9324a72fab22ff736f6254938c55f32dfa5a5ac1","amp;dn":"Whisperers%3A+Private+Life+in+Stalin%27s+Russia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9324a72fab22ff736f6254938c55f32dfa5a5ac1","infoHashBuffer":{"type":"Buffer","data":[147,36,167,47,171,34,255,115,111,98,84,147,140,85,243,45,250,90,90,193]},"announce":[],"urlList":[]}}