{"title":"It Sticks Out Half A Mile - S01 - Dad's Army - Audio Comedy -","uid":5565945,"size":351802522,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:94e38771a0c88e23ae4f8383a85fc6a894f3a7cb&amp;dn=It+Sticks+Out+Half+A+Mile+-+S01+-+Dad%5C%27s+Army+-+Audio+Comedy+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"_Slimoo_","files":14,"time":1273979898,"description":"It Sticks Out Half A Mile - Series 01 - [ Dad's Army Spin Off ] - Audio Comedy - BBC7 via DVB-T \n14 x 30 Minute Episode - 128Kbps - Mp3 - Slimoo\n\nIt Sticks Out Half a Mile was a BBC Radio sitcom created as a sequel to the television sitcom Dad's Army.\n\n\n[b]The pilot[/b]\nThe original pilot episode, set in 1948, involved former bank manager and Home Guard Captain George Mainwaring  deciding to renovate a decrepit seaside pier in the fictional town of Frambourne-on-Sea, only to find when applying for a bank loan that the manager of the local branch is his former chief cashier and Home Guard Sergeant Arthur Wilson.\n\nThe pilot, recorded in 1981, was not used and Lowe died in April 1982, ending production. But Lowe's widow had enjoyed the show and persuaded the writers to start again with a new cast. The original pilot was eventually broadcast on BBC 7.\n\n\n\n[b]The series[/b]\nThe new version involved William Hodges,former ARP warden and nemesis of Mainwaring's Home Guard unit, approaching &quot;stupid boy&quot; and former Home Guard Private Frank Pike with a proposal to renovate the pier at Frambourne. \n\nIn order to finance this plan Pike has to approach bank manager Wilson, who just happens to be his &quot;uncle&quot; (publicly a friend of his mother's, but strongly hinted to the audience to be Pike's father), for a loan. Wilson suspects the only reason Hodges approached Pike was to get to the bank's money through him. Nevertheless, Pike and Wilson put aside their wartime quarrel with Hodges - more or less - and the renovation begins.\n\n\n\n\n\nCast:\nCaptain Mainwaring - Arthur Lowe (Pilot Only)\nBert Hodges - Bill Pertwee\nFrank Pike - Ian Lavender\nArthur Wilson - John Le Mesurier (born John Charles Elton Le Mesurier De Somerys Halliley)\nRosemary Perkins - Vivienne Martin\nMrs Fox - Mollie Sugden\n\n\n\n\n1. The Business Proposition\nBill Hodges suggests a business deal to Frank Pike.  The deal involves the refurbishment of a dilapidated pier in Frambourne-On-Sea. \n\n2. The Bank Loan\nHodges and Pike approach Arthur Wilson with a view to obtaining a bank loan to finance the renovating of the Pier.\n\n3. Who Owned The Pier?\nHodges, Pike and Wilson carry out research at the library to find any information on the previous owners of the Pier. \n\n4. Inspecting The Piles\nHodges, Pike and Wilson take to a dinghy to carry out a night inspection of the Pier's foundations.\n\n5. Pike In Love\nPike is in love and his mother asks Wilson to teach him about the birds and the bees.\n\n6. The Friends Of Frambourne Pier\nPike and Hodges launch a campaign to recruit volunteers to help save the Pier.  This leads to the formation of the Friends Of Frambourne Pier Association.\n\n7. The First Meeting\nThe First Meeting of the Friends Of Frambourne Pier Association is held.\n\n8. Marooned\nHaving been transferred to the Pier Theatre by boson's chair, Arthur Wilson and Miss Perkins are marooned together.\n\n9. The Fancy Dress Night\nThe Friends Of Frambourne Pier Association hold a fancy dress night to raise money for the restoration of the Pier.  Unfortunately Miss Perkins and Mrs Pike both turn up wearing the same costumes.\n\n10. The Builder\nA builder is enlisted to repair the Pier.  Unfortunately old wounds are opened when Hodges and Pike discover his nationality. \n\n11. War Damage\nWilson, Hodges and Pike try to claim War Damage Compensation for the Pier.\n\n12. The Pin Up Girl\nIt is decided to update the pictures in the What The Butler Saw machine on the Pier.  Pike and Hodges persuade Miss Perkins to pose as their pin-up girl.\n\n13. Hidden Treasure\nMadame Zara is enlisted to help find some hidden treasure that is believed to be hidden on the Pier. \n\n\n\n\n\nIt Sticks Out Half A Mile - Pilot\n\nIt Sticks Out Half A Mile - S01 - E01 - The Business Proposition \nIt Sticks Out Half A Mile - S01 - E02 - The Bank Loan\nIt Sticks Out Half A Mile - S01 - E03 - Who Owned The Pier\nIt Sticks Out Half A Mile - S01 - E04 - Inspecting The Piles\nIt Sticks Out Half A Mile - S01 - E05 - Pike In Love\nIt Sticks Out Half A Mile - S01 - E06 - The Friends Of Frambourne Pier\nIt Sticks Out Half A Mile - S01 - E07 - The First Meeting\nIt Sticks Out Half A Mile - S01 - E08 - Marooned\nIt Sticks Out Half A Mile - S01 - E09 - The Fancy Dress Night\nIt Sticks Out Half A Mile - S01 - E10 - The Builder\nIt Sticks Out Half A Mile - S01 - E11 - War Damage\nIt Sticks Out Half A Mile - S01 - E12 - The Pin Up Girl\nIt Sticks Out Half A Mile - S01 - E13 - Hidden Treasure\n\n\n\nAudio Format    : MP3\nDuration Approx : 28mn 54s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n \n\n\n[","torrent":{"xt":"urn:btih:94e38771a0c88e23ae4f8383a85fc6a894f3a7cb","amp;dn":"It+Sticks+Out+Half+A+Mile+-+S01+-+Dad%5C%27s+Army+-+Audio+Comedy+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94e38771a0c88e23ae4f8383a85fc6a894f3a7cb","infoHashBuffer":{"type":"Buffer","data":[148,227,135,113,160,200,142,35,174,79,131,131,168,95,198,168,148,243,167,203]},"announce":[],"urlList":[]}}