{"title":"Mighty.Med.S02E04.The.Claw.Prank.Redemption.1080p.WEB.DL.DD5.1.H","uid":11459842,"size":931168516,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:95e022d05745ab502c74d5dc2dbcd0b751b25389&amp;dn=Mighty.Med.S02E04.The.Claw.Prank.Redemption.1080p.WEB.DL.DD5.1.H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"QQQQQ1","files":1,"time":1415974369,"description":"Kaz and Oliver worry about what Skylar has planned for them now that they know she's evil. While they try to keep it under wraps, things get significantly more complicated when Skylar invites Oliver to the school dance. Oliver begins to believe Skylar isn't really evil, but Kaz, still not convinced, dresses up like a villain, No-Name, and feebly attempts to &quot;take over&quot; Mighty Med so he'll get thrown in Mighty Max prison. In Mighty Max, Kaz's cellmates are none other than Wallace and Clyde. The twins inform him that Skylar is indeed evil, and the Annihilator and Skylar want to kill Oliver and destroy Philadelphia. The way Oliver might be able to lift Skylar from her evil spell is with a kiss, but when Kaz hangs up, the twins realize they got the spell mixed up with Sleeping Beauty, and Oliver will die if he kisses Skylar. Kaz then tells new guard Philip to release him so he can save Oliver. Meanwhile, Alan decides to delve further into his Normo roots and begins going to Logan High. Alan tries to control his anger problem, but he is caught in the crossfire when Gus and Jordan have a prank war, in which he is drenched in hot popcorn and lifted and dropped from a huge metal claw. But Jordan crosses the line and snags his sweater vest, causing Alan to lose control and morph into a pig in a sweater vest. However, Gus and Jordan think he pranked the rival school by stealing their mascot and putting it in a sweater vest. Alan is declared King of Pranks as a result. Elsewhere, Skylar doesn't want Oliver to die, but the Annihilator orders it, so Skylar is forced to kiss Oliver and kill him, but is stopped when Alan in pig form runs between them. Skylar lies for Oliver by telling the Annihilator he is dead","torrent":{"xt":"urn:btih:95e022d05745ab502c74d5dc2dbcd0b751b25389","amp;dn":"Mighty.Med.S02E04.The.Claw.Prank.Redemption.1080p.WEB.DL.DD5.1.H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95e022d05745ab502c74d5dc2dbcd0b751b25389","infoHashBuffer":{"type":"Buffer","data":[149,224,34,208,87,69,171,80,44,116,213,220,45,188,208,183,81,178,83,137]},"announce":[],"urlList":[]}}