{"title":"Love Wins (Rob Bell) - MOBI and EPUB, eBook plus Reviews.zip","uid":6316471,"size":2535458,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:968378b3b62fdb5b55b5b99097356bffec3fc4b1&amp;dn=Love+Wins+%28Rob+Bell%29+-+MOBI+and+EPUB%2C+eBook+plus+Reviews.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"edge777","files":1,"time":1302721735,"description":"This is the latest book by Rob Bell, Love Wins.  From the promotional video, and from the reviews, many believe this book to be dangerous in that it distorts the truth and buys into a popular, palatable, comfortable gospel instead of the truth of Scripture.  I personally believe this book to distort the truth, but we should read it so that we can properly comment.\n\nMy prayer and desire is that rather than taking any one author's take on Scripture (this include Rob Bell, any author, and any pastor) we must always go back to the Bible, the Word of God.  Just because Rob Bell says the Bible says something, we need to go ourselves and read it.  The Bible is not that hard to understand and interpret.\n\nI've included the eBook in EPUB and MOBI (Kindle) formats, as well as some incredibly well written, and in my mind, unbiased, reviews.  I urge you to look at these after reading the book.\n\nIf you're scared to read the Bible for yourself, or to read these reviews, I would urge you to pass on reading this book.","torrent":{"xt":"urn:btih:968378b3b62fdb5b55b5b99097356bffec3fc4b1","amp;dn":"Love+Wins+%28Rob+Bell%29+-+MOBI+and+EPUB%2C+eBook+plus+Reviews.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"968378b3b62fdb5b55b5b99097356bffec3fc4b1","infoHashBuffer":{"type":"Buffer","data":[150,131,120,179,182,47,219,91,85,181,185,144,151,53,107,255,236,63,196,177]},"announce":[],"urlList":[]}}