{"title":"Eat Fat And Grow Slim by Richard Mackarness (PDF)","uid":10472386,"size":27640690,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:96bd2ed7b7e3da7d967dce3fa826acc6f6521890&amp;dn=Eat+Fat+And+Grow+Slim+by+Richard+Mackarness+%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"huck53","files":1,"time":1404267109,"description":"Paperback\nPublisher: Harvill Press (1958)\nASIN: B007T2TF3U\n\nThis is one of the earliest (of the 20th century) books published on the low-carb, high fat way of eating. It is an easy, pleasant and informative read. It predates Atkins, but it is based on pretty much the same idea, that you can lose weight more easily, and more healthfully by increasing your healthy fats (avoid processed vegetable oils) like olive oil, coconut oil, lard and tallow from healthy animals, and by decreasing your carbohydrates. The science is finally catching up with the observations of some physicians, that carbs and high glycemic foods contribute to weight gain, diabetes, heart disease, some cancers, and possibly alzheimers and autism spectrum disorders. I don't think this author made this point, but another early book written by a digestive specialist makes the point that humans have the digestive system of a carnivore. We, along with the wolves, are unable to process plants without the help of cooking or fermenting or otherwise processing. And there is no absolute nutritional need for carbohydrates, but there is a need for fat. We can live without carbs, we will die without fat. At any rate, the book is enjoyable and quick to read and it provides some suggestions on how to follow the higher fat way of eating.\n","torrent":{"xt":"urn:btih:96bd2ed7b7e3da7d967dce3fa826acc6f6521890","amp;dn":"Eat+Fat+And+Grow+Slim+by+Richard+Mackarness+%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96bd2ed7b7e3da7d967dce3fa826acc6f6521890","infoHashBuffer":{"type":"Buffer","data":[150,189,46,215,183,227,218,125,150,125,206,63,168,38,172,198,246,82,24,144]},"announce":[],"urlList":[]}}