{"title":"Badass - Making Users Awesome - 1st Edition (2015).pdf Gooner","uid":14040565,"size":36008551,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:970ad20fd616d3db142cbc3e5d51f1a03069b1eb&amp;dn=Badass+-+Making+Users+Awesome+-+1st+Edition+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1459016849,"description":"Badass - Making Users Awesome - 1st Edition (2015).pdf Gooner\r\n\r\nPublisher: O'Reilly Media; 1 edition (February 23, 2015)\r\nLanguage: English\r\nISBN-10: 1491919019\r\nISBN-13: 978-1491919019\r\n\r\nNote for ebook customers: The design and layout of this book play a key role in conveying the author's message. When creating the ebooks, we've tried to keep the look and feel of the print edition, but this means that not all e-reading devices will support the files. The EPUB format is optimized for iPad. The Mobi files are optimized for Kindle Fire tablets and phones and for Kindle reading apps.\r\n\r\nImagine you’re in a game with one objective: a bestselling product or service. The rules? No marketing budget, no PR stunts, and it must be sustainability successful. No short-term fads.\r\n\r\nThis is not a game of chance. It is a game of skill and strategy.\r\n\r\nAnd it begins with a single question: given competing products of equal pricing, promotion, and perceived quality, why does one outsell the others?\r\n\r\nThe answer doesn’t live in the sustainability successful products or services. The answer lives in those who use them.\r\n\r\nOur goal is to craft a strategy for creating successful users. And that strategy is full of surprising, counter-intuitive, and astonishingly simple techniques that don’t depend on a massive marketing or development budget. Techniques typically overlooked by even the most well-funded, well-staffed product teams.\r\n\r\nEvery role is a key player in this game. Product development, engineering, marketing, user experience, support—everyone on the team. Even if that team is a start-up of one. Armed with a surprisingly overlooked science and a unique POV, we can can reduce the role of luck. We can build sustainability successful products and services that rely not on unethical persuasive marketing tricks but on helping our users have deeper, richer experiences. Not just in the moments while they’re using our product but, more importantly, in the moments when they aren’t","torrent":{"xt":"urn:btih:970ad20fd616d3db142cbc3e5d51f1a03069b1eb","amp;dn":"Badass+-+Making+Users+Awesome+-+1st+Edition+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"970ad20fd616d3db142cbc3e5d51f1a03069b1eb","infoHashBuffer":{"type":"Buffer","data":[151,10,210,15,214,22,211,219,20,44,188,62,93,81,241,160,48,105,177,235]},"announce":[],"urlList":[]}}