{"title":"Irish History and Politics (Kindle Books)","uid":10165722,"size":127962653,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97558805d05ff9bccd0d813160b3abd5654ad3e0&amp;dn=Irish+History+and+Politics+%28Kindle+Books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Ulysses31","files":53,"time":1400343067,"description":"My collection of books on Irish history, politics and current affairs. All are in mobi format unless stated otherwise.  The collection is listed below:\n\nA History of Ireland in 250 Episodes - Jonathon Bardon\n\nA Secret History of the IRA - Ed Moloney (maps included in supplementary pdf file)\n\nA Very British Jihad - Paul Larkin\n\nAfterlives - Richard O'Rawe\n\nArmed Struggle - Richard English\n\nThe Battle for Cork (July-August 1922) - John Borgonovo \n\nBertie Ahern and the Drumcondra Mafia - Michael Clifford, Shane Coleman\n\nBertie Ahern: Power and Money - Colm Keena\n\nBig Fellow, Long Fellow - Ryle T. Dwyer\n\nCrisis and Decline: The Fate of Southern Unionists - R.B. McDowell\n\nCruel Britannia: A Secret History of Torture - Ian Cobain\n\nEaster 1916: The Irish Rebellion - Charles Townshend\n\nEnigma: A New Life of Charles Stewart Parnell - Paul Bew\n\nExodus: The Emigration of Southern Irish Protestants During the Irish War of Independence and the Civil War (PDF) - Andy Bielenberg\n\nFatal Path - Ronan Fanning\n\nThe Flame and the Candle: War in Mayo 1919-1924 - Dominic Price\n\nThe Frontman: Bono (In the Name of Power) - Harry Browne\n\nThe Green Flag: A History of Irish Nationalism - Robert Kee\n\nInto the Dark - Johnston Brown\n\nIrish Freedom - Richard English\n\nThe Irish Revolution  - Marie Coleman\n\nThe Irish Revolution in Sligo, 1912-23 - Michael Farry\n\nIs Ireland Really the Role Model for Austerity? (PDF) - Stephen Kinsella\n\nThe Isles - Norman Davies\n\nThe Lost Revolution - Brian Hanley, Scott Millar\n\nJames Connolly (16 Lives) - Lorcan Collins\n\nLethal Allies: British Collusion in Ireland - Anne Cadwallader\n\nMaking Sense of the Troubles - David McKittrick\n\nMassacre in West Cork: The Dunmanway and Ballygroman Killings - Barry Keane\n\nMichael Collins and the Civil War - Ryle T. Dwyer\n\nMichael Collins: The Man Who Won The War - Ryle T. Dwyer\n\nMyth and the Irish State - John Regan\n\nNorthern Ireland: A Very Short Introduction - Marc Mulholland\nOccasions of Sin: Sex and Society in Modern Ireland -Diarmaid Ferriter\n\nPeace After The Final Battle: The Story of the Irish Revolution, 1912-24 - John Dorney\n\nPolicing Twentieth Century Ireland: A History of An Garda Siochana - Vicky Conway\n\nPolitical corruption in Ireland - ELAINE A. BYRNE\n\nThe Propaganda of Peace - Greg McLaughlin, Stephen Baker\n\nRebels: Voices from the Easter Rising - Fearghal McGarry\n\nThe Republic: The Fight for Irish Independence - Charles Townshend\n\nThe Resurrection of Ireland: The Sinn Fein Party, 1916-23 - Michael Laffan\n\nShip of Fools - Fintan O'Toole\n\nSins of the Father - Conor McCabe\n\nStakeknife: Britain's Secret Agents in Ireland - Martin Ingram, Greg Harkin\n\nThe Story Of The Tudor Conquest of Ireland, 1541-1603 - John Dorney\n\nTerror in Ireland, 1916-1923 - David Fitzpatrick et al.\n\nThe Transformation Of Ireland, 1900-2000 - Diarmaid Ferriter\n\nThe Year of Disappearances - Gerard Murphy\n\nUnderstanding Ireland's Economic Crisis - Stephen Kinsella, Anthony Leddin et al.\n\nUp the Republic! (Towards a New Ireland) - Fintan O'Toole et al.\n\nVoices from the Grave - Ed Moloney\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:97558805d05ff9bccd0d813160b3abd5654ad3e0","amp;dn":"Irish+History+and+Politics+%28Kindle+Books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97558805d05ff9bccd0d813160b3abd5654ad3e0","infoHashBuffer":{"type":"Buffer","data":[151,85,136,5,208,95,249,188,205,13,129,49,96,179,171,213,101,74,211,224]},"announce":[],"urlList":[]}}