{"title":"Pigeons and Doves - A Guide to the Pigeons and Doves of the Worl","uid":11576057,"size":51334636,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97b19cc072b081804a3103f030693a3391be727b&amp;dn=Pigeons+and+Doves+-+A+Guide+to+the+Pigeons+and+Doves+of+the+Worl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gnv65","files":-1,"time":1417077286,"description":"Pigeons and Doves - A Guide to the Pigeons and Doves of the World\nby David Gibbs and Eustace Barnes\nChristopher Helm | June 2010 | ISBN: 978-1-4081-3555-6 | True PDF | 615 pages | 48.9 mb\n\nThis volume is dedicated to the field identification of pigeons and doves, and it incorporates much recent information on the family.\nPigeons and doves are a large family of birds occurring throughout the world. This book-the first to be dedicated to the field identification of these birds and to be fully illustrated in color-incorporates much recent information about them.Many species of pigeons and doves are specialist frugivores, say the authors, while others feed on seeds. Most are arboreal, and the tropical species in particular are often brightly colored. The family includes gregarious migratory species as well as shy, ground- dwelling forms such as the exotic crowned pigeons of New Guinea. The comprehensive text is accompanied by 76 exquisite color plates that capture the essence of these varied birds and illustrate all species and subspecies.David Gibbs is a freelance ecologist and naturalist. He has recently worked as a field assistant in the production of wildlife films.\n\nAbout the Author\nEustace Barnes is a wildlife artist and tour leader specializing in South America where he has travelled extensively. John Cox is one of Britain's foremost bird artists. His work has been included in a number of books; this is his first major book","torrent":{"xt":"urn:btih:97b19cc072b081804a3103f030693a3391be727b","amp;dn":"Pigeons+and+Doves+-+A+Guide+to+the+Pigeons+and+Doves+of+the+Worl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97b19cc072b081804a3103f030693a3391be727b","infoHashBuffer":{"type":"Buffer","data":[151,177,156,192,114,176,129,128,74,49,3,240,48,105,58,51,145,190,114,123]},"announce":[],"urlList":[]}}