{"title":"Lucio.2007.DVDRip.XviD-CNT","uid":4810703,"size":1881971387,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:97c8eae701557ce60d32f1b20cd1c1d45f462aca&amp;dn=Lucio.2007.DVDRip.XviD-CNT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Toba","files":-1,"time":1238362695,"description":"\n\n\nSynopsis:\n\nThere are plenty of anarchists in the world. Many have committed robbery or smuggling for their cause. Fewer have discussed strategies with Che Guevara or saved the skin of Eldridge Cleaver, the lea...( read more  read more... )der of the Black Panthers. There is only one who has done all that, and also brought to its knees the most powerful bank on the planet by forging travellers cheques, without missing a single day of work in his construction job. He is Lucio Urtubia, from a tiny village in Navarra in North of Spain. Lucio, 75, now lives in Paris, still raising anarchist hell. Lucio has been protagonist and witness to many of the historic events of the second half of the 20th century. His family was persecuted by Franco's regime, he was on the streets of Paris for the phenomenon of May of '68, he actively supported Castro's revolution, he helped thousands of exiled people by providing false documents to them. But without a doubt, his greatest triumph came in the second half of the seventies. The press called him &quot;the good bandit&quot;, or the Basque Zorro. He managed to swindle 25 million dollars from the First National Bank (now Citibank), to later invest the money in causes he believed in. Miraculously, he spent no more than a few months in jail throughout his career. \n\nWritten by Aitor Arregi and JosÃƒÂ© MarÃƒÂ­a Goenaga.\n\n\nUse utorrent to get it.\nUse VLC to view it.\nUse your head to act.","torrent":{"xt":"urn:btih:97c8eae701557ce60d32f1b20cd1c1d45f462aca","amp;dn":"Lucio.2007.DVDRip.XviD-CNT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97c8eae701557ce60d32f1b20cd1c1d45f462aca","infoHashBuffer":{"type":"Buffer","data":[151,200,234,231,1,85,124,230,13,50,241,178,12,209,193,212,95,70,42,202]},"announce":[],"urlList":[]}}