{"title":"G.S. Jennsen - Transcendence (Aurora Rising #3)","uid":12682503,"size":441255967,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:97e1309b05c204f1649215317e2347f60b244b7e&amp;dn=G.S.+Jennsen+-+Transcendence+%28Aurora+Rising+%233%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cybotage","files":63,"time":1446569688,"description":"What does it mean to be human? What if the price of saving humanity is giving up your own?\r\n\r\nThe year is 2322, and we stand upon the precipice of extinction.\r\n\r\nThe invading Metigen armada has decimated the eastern third of settled space in a matter of days, leaving tens of millions dead. Determined to save the heart of human civilization, Earth and Seneca at last put aside their differences to face the threat together. But even this may not be enough to stop the fleet of colossal dreadnoughts inhabited by advanced AIs.\r\n\r\nAlex Solovy and Caleb Marano hold the key to defeating the invaders, for they know the secrets the aliens wage war to protect. Now they face a deadly gauntlet of relentless alien hunters and assassins sent to kill them before they can unleash a potent new weapon. They will risk everything in a bid to save their families, their loved ones, the entire human race—even if it means they can’t save each other.\r\n\r\nThe lines blur between man and machine, ally and enemy, and soldier and civilian. In a final stand against an ancient, powerful foe intent on eradicating it from the universe, humanity comes face to face with its destiny.\r\n\r\nWhen faced with its greatest challenge, will humanity rise to triumph or fall to ruin?\r\n\r\nAurora Rising is an epic tale of galaxy-spanning adventure, of the thrill of discovery and the unquenchable desire to reach ever farther into the unknown. It's a tale of humanity at its best and worst, of love and loss, of fear and heroism. It's the story of a woman who sought the stars and found more than anyone imagined possible.\r\n\r\n\r\nRead by Pyper Down\r\nFormat: MP3\r\nBitrate: 64 Kbps","torrent":{"xt":"urn:btih:97e1309b05c204f1649215317e2347f60b244b7e","amp;dn":"G.S.+Jennsen+-+Transcendence+%28Aurora+Rising+%233%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97e1309b05c204f1649215317e2347f60b244b7e","infoHashBuffer":{"type":"Buffer","data":[151,225,48,155,5,194,4,241,100,146,21,49,126,35,71,246,11,36,75,126]},"announce":[],"urlList":[]}}