{"title":"The Early November - Discography (2002-2006) [FLAC]","uid":7837197,"size":1447720140,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:97fb073f7b5305422290055a8eea6999a4104da1&amp;dn=The+Early+November+-+Discography+%282002-2006%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1353232833,"description":"\n  The Early November - Discography (2002-2006) [FLAC]\n\n  Released: 2002, 2003, 2006\n  Genre: Pop/Rock\n  Style: Alternative\n  Codec: FLAC\n  Bit Rates: ~ 1,000 kpbs\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  \n  Albums: \n\n  2002 For All of This\n  2003 The Room's Too Cold\n  2006 The Mother, the Mechanic, and the Path\n  \n  Bio:\n\n  The members of the Early November were young enough to have grown up with the Drive-Thru Records sound, a formula that incorporated sensitive emo, pop, and punk revivalist amalgams with a bit of post-hardcore grit. The band first emerged in 2000, fighting to secure shows in their busy South Jersey scene while hoping to land a deal with Drive-Thru. One way or another, their wish came true. Label figureheads Richard and Stefanie Reines signed vocalist/guitarist &quot;Ace&quot; (Arthur) Enders, bassist Sergio Anello, drummer Jeff Kummer, and guitarist Joseph Marro in early 2002 on the strengths of their demo and a solid MP3.com buzz, and by November 2002 the band had made its label debut with the For All of This EP. Promising appearances on the Warped Tour's Drive-Thru stage that summer spread the word, and by 2003, anticipation for an Early November full-length was brimming.\n\n  Room's Too Cold dropped in October 2003. It was a particularly lush take on the Drive-Thru sound, with strings and ballads and a focus on the rich vocal presence of Enders. The band toured extensively behind the record. Writing began that summer for their follow-up sophomore release. Recording commenced in February 2005 with a fifth member on board, guitarist Bill Lugg. The resulting The Mother, the Mechanic, and the Path was eventually issued in July 2006 as an ambitious triple album. Boasting a rock-oriented disc (&quot;The Mechanic&quot;), a more mellow, stripped-down disc (&quot;The Mother&quot;), and a third character-based soundtrack with dialogue to intermingle among the first two (&quot;The Path&quot;), the album was conceptually based around a troubled father-son relationship and the subsequent imperfect relationship between the then-adult son and his own child.","torrent":{"xt":"urn:btih:97fb073f7b5305422290055a8eea6999a4104da1","amp;dn":"The+Early+November+-+Discography+%282002-2006%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97fb073f7b5305422290055a8eea6999a4104da1","infoHashBuffer":{"type":"Buffer","data":[151,251,7,63,123,83,5,66,34,144,5,90,142,234,105,153,164,16,77,161]},"announce":[],"urlList":[]}}