{"title":"Os trapalhÃƒÂµes - Full DVD_AVI - BRASIL","uid":5212851,"size":4395407360,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:983901b4986c4ec947872451bb3d6080c464f391&amp;dn=Os+trapalh%C3%83%C2%B5es+-+Full+DVD_AVI+-+BRASIL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Valdo__PT","files":-1,"time":1260666586,"description":"Os trapalhÃƒÂµes melhor serie de comÃƒÂ©dia jÃƒÂ¡ exibida no Brasil, trouxe muitas alegrias para a juventude das dÃƒÂ©cadas de 80 e 90, mas que infelizmente comeÃƒÂ§ou a ser interrompida pela morte de um de seus integrantes, conhecido como Zacarias em (1990) e mesmo assim diante de uma imensa tristeza seguiram com seu maravilhoso trabalho, atÃƒÂ© que em 1994 foram surpreendidos pela morte de um dos seus mais engraÃƒÂ§ados integrantes, conhecido como Mussum, um negro sambista que vivia na boemia, bebendo seu bom mÃƒÂ© (lÃƒÂª se cachaÃƒÂ§a). Depois dessas duas grandes perdas com 50% de um time que como uma engrenagem funciona efetivamente com 100%, ficou insustentavel seguir com o projeto, eles suspenderam as atividades e daÃƒÂ­ em diante a TV Brasileira (Globo)Ã‚Â¹ passou a exibir toda a serie do grupo presenteando toda uma geraÃƒÂ§ÃƒÂ£o que nÃƒÂ£o teria a oportunidade de ver, com esse DVD Box maravilhoso.\n\nParticularmente acho que a geraÃƒÂ§ÃƒÂ£o que cresceu vendo este tipo de programa de comÃƒÂ©dia se formou mais alegre, sem contato com a violencia mostrada por certos program atuais de Tv. \n\nBaixem e mostrem seus filhos, eles vÃƒÂ£o gostar de assistir!\nUm abraÃƒÂ§o, e muita paz no seu coraÃƒÂ§ÃƒÂ£o! Seja alegre!\n\nÃ‚Â¹ a controladora de mentes - Veja o documentÃƒÂ¡rio ( Beyond Citizen Kane at IMDB http://www.imdb.com/title/tt1356393/ )\n\n=============== E N G L I S H    W O R D S    B Y    G O O G L E =================\n\nThe bungling best comedy series now appears in Brazil, has brought much joy to the youth of the '80s and '90s, but unfortunately began to be interrupted by the death of one of its members, known as in Zechariah (1990) and still face an immense sadness followed with his wonderful work, until 1994 were surprised by the death of one of its funniest members, known as Mussum, a black samba living in bohemian drinking his good mÃƒÂ© (read the rum). After those two big losses with 50% of a team that as a gear works effectively with 100% was unsustainable forward with the project, they have suspended their activities and then on the TV Brasileira (Globo) Ã‚Â¹ now display the whole series of group presenting a whole generation that does not have the opportunity to see, with this wonderful DVD Box.\n\nParticularly I think the generation that grew up watching this type of comedy program graduated more cheerful, without contact with the violence shown by some of today's program Tv\n\nGet down and show their children, they will like to watch!\nA hug, and peace in your heart! Be happy!\n\nÃ‚Â¹ controller of minds - see the documentary (Beyond Citizen Kane at IMDB http://www.imdb.com/title/tt1356393/)","torrent":{"xt":"urn:btih:983901b4986c4ec947872451bb3d6080c464f391","amp;dn":"Os+trapalh%C3%83%C2%B5es+-+Full+DVD_AVI+-+BRASIL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"983901b4986c4ec947872451bb3d6080c464f391","infoHashBuffer":{"type":"Buffer","data":[152,57,1,180,152,108,78,201,71,135,36,81,187,61,96,128,196,100,243,145]},"announce":[],"urlList":[]}}