{"title":"Combs - Tolerance - Jewry's War on Whites","uid":4746970,"size":567750,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:986fd8c314a269dd0dfe46f6237ad4eadd2ed46c&amp;dn=Combs+-+Tolerance+-+Jewry%5C%27s+War+on+Whites&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"red_gonzo","files":1,"time":1235932776,"description":"This is James Combs's revealing booklet Tolerance - Jewry's War on Whites which exposes the politics of tolerance as means of enslaving one group of people by another one. Can you imagine a world where everyone of one group is carrying a chain around their necks while the other group is telling them to tolerate such a state of affairs? According to this banned booklet such a situation exists between the whites and jews in America. Traditional Americans are christian whites as these people of European heritage created and developed America. To the present surprise of many, America was not originated by its founding fathers with racial and religious integration in mind as it was designed purely in the interests of whites and christians. Tolerance attempts to analyse the effects of the arrival of non-whites and non-christians to the health of a whole nation. Today Americans are being indoctrinated to tolerate all incoming aliens from all over the world but as more arrive the situation worsens. It is an irony that the very same thing happened to Indians with the arrival of European immigrants before America was founded. But is there some group that actually profits from such a state of affairs, that gains power as more and more racial divisions are created? As the author concludes, it is the jewish cabal that uses tolerance as a devastating weapon to forcefully integrate people from all kinds of races and cultures around the world, resulting in endless conflicts and unhappines all across the nation. As more divisions are created, people are killing amongst themselves, not realizing they are the victims of a cleverly crafted strategy. Whites have been slaves at times in the past. All that will prevent their slavery in the future is an awakening to the identity and tactics of their mortal enemy. 80 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:986fd8c314a269dd0dfe46f6237ad4eadd2ed46c","amp;dn":"Combs+-+Tolerance+-+Jewry%5C%27s+War+on+Whites","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"986fd8c314a269dd0dfe46f6237ad4eadd2ed46c","infoHashBuffer":{"type":"Buffer","data":[152,111,216,195,20,162,105,221,13,254,70,246,35,122,212,234,221,46,212,108]},"announce":[],"urlList":[]}}