{"title":"A Cultural History of Syphilis  (BBC 2013)","uid":8552669,"size":43252525,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:98792bea3a1d8d3967c403cf9ffcf90c3663e5e9&amp;dn=A+Cultural+History+of+Syphilis++%28BBC+2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Robin1966","files":2,"time":1370688195,"description":"Sunday Feature - A Cultural History of Syphilis\n\n\n\nIn the 1490s an apparently new and terrifying disease struck Naples in Southern Italy and swept fire-like across Europe, reaping a dreadful human cost.\n\nIt must have been as though hell had come early to earth: pustules spread across the genitals and the faces of its many sufferers, unbearable gastrointestinal pain followed upon fevers, screamingly severe headaches and other symptoms. Finally, flesh fell from bones. Syphilis had arrived in Europe, where it would stay, misunderstood, lacking any form of cure, for nearly 500 years.\n\nIn its reign (before penicillin all but stopped the scourge in its tracks) syphilis held up a mirror to civilisation and radically influenced social and cultural outlooks as well as the histories of medicine and welfare. Syphilis also spread to the arts where the communities of writers, musicians and painters bore the full force of its impact. When, in the 1980s, AIDS struck, it evoked panic and prejudice bearing striking resemblance to the dawn of syphilis in the early sixteenth century.\n\nIn this BBC Radio 3 Sunday Feature, the writer Sarah Dunant examines the impact &quot;The Great Pox&quot; made in the arts and the wider world in key European cities Florence, Ferrara, Paris and finally central London, where a chance discovery by Alexander Fleming ended half a millennium of suffering.\n\nWith contributions from Dr. Jonathan Sawday, author of The Body Emblazoned: Dissection and the Human Body in Renaissance Culture; Dr. Kevin Siena, author of Sins of the Flesh: Responding to Sexual Disease in Early Modern Europe; Kevin Brown, author of &quot;The Pox: The Life and Near Death of a Very Social Disease&quot; and curator of the Fleming Museum in London, and cultural historian Dr. Jann Matlock, senior lecturer in French at University College London.\n\n------------------------------------------------------------------------------File Information---------------------------------------------------------------------------\nFirst broadcast: BBC R3 Sunday Feature, 26 May 2013\nType: MPEG 1.0 Layer 3 - 128 kbps mp3 ï¿½ 44 khz - Joint Stereo\nDuration: 45 minutes\nCaptured with Radio Downloader, edited with mp3DirectCut\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:98792bea3a1d8d3967c403cf9ffcf90c3663e5e9","amp;dn":"A+Cultural+History+of+Syphilis++%28BBC+2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98792bea3a1d8d3967c403cf9ffcf90c3663e5e9","infoHashBuffer":{"type":"Buffer","data":[152,121,43,234,58,29,141,57,103,196,3,207,159,252,249,12,54,99,229,233]},"announce":[],"urlList":[]}}