{"title":"Stan Getz - Sweet Rain - 1967 - 320Kbps # DrBn - Jazz","uid":9381616,"size":90361028,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:98f5a1d57cc70cbb3493fa8c25698099728eb5e2&amp;dn=Stan+Getz+-+Sweet+Rain+-+1967+-+320Kbps+%23+DrBn+-+Jazz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Drebben","files":6,"time":1387724003,"description":"One of Stan Getz's all-time greatest albums, Sweet Rain was his first major artistic coup after he closed the book on his bossa nova period, featuring an adventurous young group that pushed him to new heights in his solo statements. Pianist Chick Corea, bassist Ron Carter, and drummer Grady Tate were all schooled in '60s concepts of rhythm-section freedom, and their continually stimulating interplay helps open things up for Getz to embark on some long, soulful explorations (four of the five tracks are over seven minutes). The neat trick of Sweet Rain is that the advanced rhythm section work remains balanced with Getz's customary loveliness and lyricism. Indeed, Getz plays with a searching, aching passion throughout the date, which undoubtedly helped Mike Gibbs' title track become a standard after Getz's tender treatment here. Technical perfectionists will hear a few squeaks on the LP's second half (Getz's drug problems were reputedly affecting his articulation somewhat), but Getz was such a master of mood, tone, and pacing that his ideas and emotions are communicated far too clearly to nit-pick. Corea's spare, understated work leaves plenty of room for Getz's lines and the busily shifting rhythms of the bass and drums, heard to best effect in Corea's challenging opener &quot;Litha.&quot; Aside from that and the title track, the repertoire features another Corea original (&quot;Windows&quot;), the typically lovely Jobim tune &quot;O Grande Amor,&quot; and Dizzy Gillespie's Latin-flavored &quot;Con Alma.&quot; The quartet's level of musicianship remains high on every selection, and the marvelously consistent atmosphere the album evokes places it among Getz's very best. A surefire classic.\n\n\nSTAN GETZ\n\nSWEET RAIN     1967\n\nStan Getz with Chick Corea, Ron Carter and Grady Tate\n\n- CD\n- 320Kbps\n\nRecorded at Englewood Cliffs, NJ on March 21st and 30th, 1967\n\n \n","torrent":{"xt":"urn:btih:98f5a1d57cc70cbb3493fa8c25698099728eb5e2","amp;dn":"Stan+Getz+-+Sweet+Rain+-+1967+-+320Kbps+%23+DrBn+-+Jazz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98f5a1d57cc70cbb3493fa8c25698099728eb5e2","infoHashBuffer":{"type":"Buffer","data":[152,245,161,213,124,199,12,187,52,147,250,140,37,105,128,153,114,142,181,226]},"announce":[],"urlList":[]}}