{"title":"The Eerie Adventures of the Lycanthrope Robinson Crusoe","uid":9522956,"size":700206,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99107b0a7ad5e0fd23a698df79e76290a87ef0c2&amp;dn=The+Eerie+Adventures+of+the+Lycanthrope+Robinson+Crusoe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1390677393,"description":"ROBINSON CRUSOE is one of the most enduring adventures of the past four centuries and one of the most well-known works in the English language. Or is it? Recently discovered amidst the papers of the 20th century writer and historian H. P. Lovecraft is what claims to be the true story of Robinson Crusoe. Taken from the castaway's own journals and memoirs, and fact-checked by Lovecraft himself, it is free from many of Defoe's edits and alterations. From Lovecraft's work a much smoother, simpler tale emerges--but also a far more disturbing one. Here Crusoe is revealed as a man bearing the terrible curse of the werewolf and the guilt that comes with it--a man with no real incentive to leave his island prison. The cannibals who terrorized Crusoe are revealed to be less human than ever before hinted-- worshippers of a malevolent octopus-headed god. And the island itself is a place of ancient, evil mysteries that threaten Crusoe's sanity and his very soul. This version of the classic tale, assembled by two legends of English literature and abridged by Peter Clines, is the terrifying supernatural true story of Robinson Crusoe as it has never been seen before.","torrent":{"xt":"urn:btih:99107b0a7ad5e0fd23a698df79e76290a87ef0c2","amp;dn":"The+Eerie+Adventures+of+the+Lycanthrope+Robinson+Crusoe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99107b0a7ad5e0fd23a698df79e76290a87ef0c2","infoHashBuffer":{"type":"Buffer","data":[153,16,123,10,122,213,224,253,35,166,152,223,121,231,98,144,168,126,240,194]},"announce":[],"urlList":[]}}