{"title":"Sexually Broken--Veruca James shackled, chained, facefucked with","uid":9618885,"size":1086089376,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:998f8942cc5b2bc443454298953c9c01e239fafb&amp;dn=Sexually+Broken--Veruca+James+shackled%2C+chained%2C+facefucked+with&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"merzedes","files":-1,"time":1392470053,"description":"\nVeruca James shackled &amp; chained, facefucked with brutal deep throating, roughly fucked and breeded! | Veruca James | Matt Williams\n\nFebruary 14, 2014\n\n\nMP4 only.\n\n\nVeruca James only LOOKS fresh faced and innocent. Behind those girl next door looks is a ravenous sexual animal that wants to explore the darker corners. She quit a well paying accounting job so that she could do porn instead. Here at Sexuallybroken we love that level of commitment to being a perverse sexual freak, and aim to help her explore it thoroughly. Veruca loves to deep throat, it is what she was put on this planet to do. We are doing to throat fuck her into next week.\n\nUsing our legendary and often copied wooden walls, we shackle and bolt her in place. Tight breast bondage keeps her perfect perky tits jutting out. Leather belts bind her down on her knees, a leather blindfold keeps her in darkness. To complete the package, a neck rope tied off provides just the right amount of tension and prevents her from running away from the dick. Let the games begin. We start off with some nipple clamps on those tied up tits. A touch of pain keeps her focused. Then we introduce the dick to the back of the throat.\n\nVeruca is able to meet the challenge. She goes balls deep. Deep, back of the throat drool flows out of her well trained face hole. Her eyes glaze over and her face goes slack. This is a sexual submissive in their element. We use her face pussy for a while, but this is just the warm up. We want the other pussy as well. Veruca is unshackled and bolted up against the wall in a classic fuck me position. Her pale legs are spread wide, displaying that perfect pussy. Just to remind her of her place, we apply the cane on her helpless exposed soles. A ballgag shoved deep in her mouth hole keeps her shrieks muffled.\n\nThen we use our trusty vibrator, ripping a few orgasms out of that pussy to warm it up. Once she is limp and wet, as eager as she could ever be, we make full use of that perfect pussy. Veruca's eyes roll back into her head as waves of pleasure roll over her bound body. That cunt is custom fitted and does the job it was designed to do in short order. We cum and walk away, leaving Veruca chained up and dripping, leaking out of every well used hole. This one was as much fun for her as it was for us. \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/02_14vjames5/SexuallyBroken-Veruca-James-Matt-Williams-Veruca-James-shackled--chained-facefucked-with-brutal-deep-throating-roughly-fucked-and-breeded.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/02_14vjames5/SexuallyBroken-Veruca-James-Matt-Williams-Veruca-James-shackled--chained-facefucked-with-brutal-deep-throating-roughly-fucked-and-breeded.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n\n","torrent":{"xt":"urn:btih:998f8942cc5b2bc443454298953c9c01e239fafb","amp;dn":"Sexually+Broken--Veruca+James+shackled%2C+chained%2C+facefucked+with","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"998f8942cc5b2bc443454298953c9c01e239fafb","infoHashBuffer":{"type":"Buffer","data":[153,143,137,66,204,91,43,196,67,69,66,152,149,60,156,1,226,57,250,251]},"announce":[],"urlList":[]}}