{"title":"Mike Oldfield - Amarok TQMP","uid":4827838,"size":346996036,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:99dea452f36811584721f6f14abf6ec919cc87fc&amp;dn=Mike+Oldfield+-+Amarok+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"zootallure","files":14,"time":1239018100,"description":"Amarok is the 13th record album by Mike Oldfield, released in 1990. It is considered by fans to be his most distinctive work: a single sixty-minute track of continuous, uninterrupted but constantly-changing music\n\nVirgin Records\nhad been trying to convince Oldfield to release a sequel to Tubular Bells, though probably more for the name recognition than anything else, particularly as Oldfield's contract was due to expire. Instead, he created an album that seems to have been designed to be as much a delight to his fans as it was a frustration to Virgin.\n\nIt is next to impossible to isolate any one short, radio-friendly section of Amarok without it seeming out of place, and thus no single could be cut and released separately, nor could the album ever be played on popular radio. Similarly, Amarok has never been performed live in its entirety, though Oldfield has played excerpts from time to time. Oldfield had expressed many times his displeasure at Virgin's lack of promotion of his works, and Amarok might have been his revenge: a completely unmarketable album that still showcased his talent as a composer and performer. Oldfield did attempt to circumvent Virgin and create publicity for the album by offering a prize of Ã‚Â£1000 of his own money to the first person to find the &quot;secret message&quot; hidden within it, although the competition received little coverage and consequently its impact on sales was negligible. The message was actually a piece of Morse code found 48 minutes into the piece and spelling out &quot;FUCK OFF RB&quot;, a direct statement to Virgin chief Richard Branson.\n\nBoth Amarok, along with Heaven's Open (Oldfield's final album for Virgin) can be seen as a definite &quot;farewell&quot; to the company, and not an overly polite one, either. Along with the aforementioned Morse code message, the album's back cover reads: &quot; HEALTH WARNING - This record could be hazardous to the health of cloth-eared nincompoops. If you suffer from this condition, consult your Doctor immediately &quot;.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:99dea452f36811584721f6f14abf6ec919cc87fc","amp;dn":"Mike+Oldfield+-+Amarok+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99dea452f36811584721f6f14abf6ec919cc87fc","infoHashBuffer":{"type":"Buffer","data":[153,222,164,82,243,104,17,88,71,33,246,241,74,191,110,201,25,204,135,252]},"announce":[],"urlList":[]}}