{"title":"No Such Thing 2001 DVDRip Sonata Premiere","uid":9197247,"size":733324615,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:99e7ec44da58c6c1c1288de40ad0b4fd8721e110&amp;dn=No+Such+Thing+2001+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"klinho","files":2,"time":1384513254,"description":"Beauty meets the Beast, and neither is sure just what to make of the other, in a modern-dress comic variation on the ancient folk tale, written and directed by the eternally offbeat Hal Hartley. Beatrice (Sarah Polley) works with the office staff of a sleazy tabloid TV news show, run by a harridan producer (Helen Mirren) eager for something other than the usual spate of violent crimes and natural disasters that are her show's bread and butter. The producer sends her camera crew to Iceland in search of something new and unusual, and they certainly find it when they run across a village that has its own monster (Robert John Burke), a large part-mammal and part-lizard with a short temper and habit of killing people who get on his nerves. The show's camera crew (including Beatrice's boyfriend) doesn't survive their first encounter with the monster, and Beatrice is sent to find out what happened to them. En route to Iceland, Beatrice's plane crashes into the waters off the coast, and while she survives the accident, a group of unsympathetic locals decide (after a few drinks too many) to take her to the monster's lair, where a grim fate doubtless awaits her. Except that the monster is a bit depressed and Beatrice isn't in the mood to take any guff from anyone; after the monster wonders aloud why folks aren't as frightened of him as they once were, he asks Beatrice to help him find Dr. Artaud (Baltasar Kormakur), a mad scientist who might be able to cure him of the curse of eternal life. No Such Thing received its world premiere at the 2001 Cannes Film Festival, where it was screened as part of the Un Certain Regard series.","torrent":{"xt":"urn:btih:99e7ec44da58c6c1c1288de40ad0b4fd8721e110","amp;dn":"No+Such+Thing+2001+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99e7ec44da58c6c1c1288de40ad0b4fd8721e110","infoHashBuffer":{"type":"Buffer","data":[153,231,236,68,218,88,198,193,193,40,141,228,10,208,180,253,135,33,225,16]},"announce":[],"urlList":[]}}