{"title":"The Zeitgeist Movement Defined book pdf","uid":9539590,"size":4460040,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99f0abc6234753c253e73d70de8bcdb9e02ace97&amp;dn=The+Zeitgeist+Movement+Defined+book+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"colcaboom","files":-1,"time":1391014947,"description":"The Zeitgeist Movement Defined:\nRealizing a New Train of Thought\nTZM Defined\n\nThe Zeitgeist Movement Defined is the official, representative text of the global, non-profit sustainability advocacy organization known as The Zeitgeist Movement (TZM).\n\nThis tediously sourced and highly detailed work argues for a large-scale change in human culture, specifically in the context of economic practice. The dominant theme is that the current socioeconomic system governing the world at this time has severe structural flaws, born out of primitive economic and sociological assumptions originating in our early history, where the inherent severity of these flaws went largely unnoticed.\n\nHowever, in the early 21st century, these problems have risen prominently, taking the consequential form of increasing social destabilization and ongoing environmental collapse. Yet, this text is not simply about explaining such problems and their root causality - It is also about posing concrete solutions, coupled with a new perspective on social/environmental sustainability and efficiency which, in concert with the tremendous possibility of modern technology and a phenomenon known as ephemeralization, reveals humanity's current capacity to create an abundant, post-scarcity reality.\n\nWhile largely misunderstood as being &quot;utopian&quot; or fantasy, this text walks through, step by step, the train of thought and technical industrial reordering needed to update our global society (and its values) to enable these profound new possibilities. While this text can be read strictly from a passive perspective, it was created also to be used as an awareness or activist tool. The Zeitgeist Movement, which has hundreds of chapters across dozens of countries and is perhaps the largest activist organization of its kind, hopes those interested in this direction will join the movement in global solidarity and assist in the culmination of this new social model, for the benefit of the whole of humanity.\n\nNote: This text is produced for sale in paperback and proprietary ebook form only at the exact cost of publishing and nothing more. It is a non-profit text which is also available for open, non-commercial distribution in whatever form, as protected by its associated Creative Commons License (Attribution-NonCommercial-ShareAlike 4.0 International). This work may also be viewed online for free at TZM's global website.\n\nIf you find a Typo, please email &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;0c616968656d4c786469766965786b69657f7861637a6961696278226f6361&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n\n &lt;a href=&quot; http://thezeitgeistmovement.com/orientation&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thezeitgeistmovement.com/orientation&lt;/a&gt;","torrent":{"xt":"urn:btih:99f0abc6234753c253e73d70de8bcdb9e02ace97","amp;dn":"The+Zeitgeist+Movement+Defined+book+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99f0abc6234753c253e73d70de8bcdb9e02ace97","infoHashBuffer":{"type":"Buffer","data":[153,240,171,198,35,71,83,194,83,231,61,112,222,139,205,185,224,42,206,151]},"announce":[],"urlList":[]}}