{"title":"PublicAgent - Big tits brunette fucks for cash in public (p1321)","uid":12287705,"size":195780255,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:99fa94744bdb339317f1cd193c0ef145661db462&amp;dn=PublicAgent+-+Big+tits+brunette+fucks+for+cash+in+public+%28p1321%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1440498923,"description":"I was walking around with my camera looking for models on the street. Much easier way to find girls than through advertising (and cheaper!). So, I see this babe, a smokin' hot long haired brunette! I stopped her and introduced myself, she was very approachable, probably used to guys coming up to her I guess! I asked her about her work, apparently she's a model at the moment, earning okay money. But just okay. I knew I could make her a better offer. I offered her a wad of cash just for a quick casting. All I needed was to get a good shot of her figure and that was it. She thought about it but then decided she really couldn't turn down the opportunity! So we found this place at the bottom of a stairwell, not the best looking place but I needed to see this girls body! And boy was I right! She had a perfect body with amazing big tits! I knew I had to try it on with her. I offered her a LOAD more cash for 'some fun'. She knew what I meant straightaway and seconds after I handed her the money her lips were wrapped firmly around my cock! She was working it like a pro! Licking it up and down and staring straight up at me! I set the camera up on the side, pulled down her panties and started fucking her! It felt so good! We had a close call of getting caught, we were in a public place after all! But we had just enough time for me to empty my load all over her massive tits!\nTags: Big Tits, Amateur, POV, Outdoor, Hardcore\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=49273634143808117643.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=49273634143808117643.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=48188606612982072787.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=48188606612982072787.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:99fa94744bdb339317f1cd193c0ef145661db462","amp;dn":"PublicAgent+-+Big+tits+brunette+fucks+for+cash+in+public+%28p1321%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99fa94744bdb339317f1cd193c0ef145661db462","infoHashBuffer":{"type":"Buffer","data":[153,250,148,116,75,219,51,147,23,241,205,25,60,14,241,69,102,29,180,98]},"announce":[],"urlList":[]}}