{"title":"The sims  ps2","uid":4494001,"size":507248640,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:9a28d3ea55982ce6b962c4f69917d22311668a64&amp;dn=The+sims++ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"lime22","files":-1,"time":1226099149,"description":"The PS2 game makes solid additions and a few improvements to The Sims&amp;#039; basic gameplay--but that gameplay has aged. If you&amp;#039;ve never played The Sims before, you may find your sims&amp;#039; social interactions and independent behavior interesting, just as you may find their shortcomings frustrating. If you have played The Sims before, you&amp;#039;ll probably find some challenge in the new single-player &quot;get a life&quot; mode, and you may enjoy the multiplayer modes for a while, but you&amp;#039;ll ultimately find that The Sims for the PS2 plays a lot like the same game that&amp;#039;s been around for three years and counting.\n\nThe first time you put The Sims into your PlayStation 2, you&amp;#039;ll have access to only one play mode: the new mission-based &quot;get a life&quot; single-player mode. This mode both serves as a decent tutorial and offers a fairly challenging set of seven different missions that will take several hours to complete. In it, you&amp;#039;ll become acquainted with the game&amp;#039;s control setup, your sims&amp;#039; independent behavior, and their need to eat, sleep, and use the bathroom (also known as &quot;motives&quot;). Basically, you&amp;#039;ll need to complete several goals, such as using the buy and build modes to improve your current home or making new friends. However, you&amp;#039;re prevented from completing these interesting objectives immediately by the fact that your sim is required to spend a great deal of time performing mandatory activities like going to work or refilling its motives. While the &quot;get a life&quot; mode provides an interesting, structured way in which to play The Sims, you&amp;#039;ll probably find that having to constantly drop everything to let your sim take a bathroom break or a long nap is disruptive and ultimately frustrating. ","torrent":{"xt":"urn:btih:9a28d3ea55982ce6b962c4f69917d22311668a64","amp;dn":"The+sims++ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a28d3ea55982ce6b962c4f69917d22311668a64","infoHashBuffer":{"type":"Buffer","data":[154,40,211,234,85,152,44,230,185,98,196,246,153,23,210,35,17,102,138,100]},"announce":[],"urlList":[]}}