{"title":"Stephen T Asma - On Monsters_An Unnatural History of Our Worst F","uid":11513015,"size":1553007,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a6847d46b9fcef9849aac0ff364f31b87de25bf&amp;dn=Stephen+T+Asma+-+On+Monsters_An+Unnatural+History+of+Our+Worst+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Papushi","files":-1,"time":1416415878,"description":"Hailed as &quot;a feast&quot; (Washington Post) and &quot;a modern-day bestiary&quot; (The New Yorker), Stephen Asma's On Monsters is a wide-ranging cultural and conceptual history of monsters--how they have evolved over time, what functions they have served for us, and what shapes they are likely to take in the future. Beginning at the time of Alexander the Great, the monsters come fast and furious--Behemoth and Leviathan, Gog and Magog, Satan and his demons, Grendel and Frankenstein, circus freaks and headless children, right up to the serial killers and terrorists of today and the post-human cyborgs of tomorrow. Monsters embody our deepest anxieties and vulnerabilities, Asma argues, but they also symbolize the mysterious and incoherent territory beyond the safe enclosures of rational thought. Exploring sources as diverse as philosophical treatises, scientific notebooks, and novels, Asma unravels traditional monster stories for the clues they offer about the inner logic of an era's fears and fascinations. In doing so, he illuminates the many ways monsters have become repositories for those human qualities that must be repudiated, externalized, and defeated","torrent":{"xt":"urn:btih:9a6847d46b9fcef9849aac0ff364f31b87de25bf","amp;dn":"Stephen+T+Asma+-+On+Monsters_An+Unnatural+History+of+Our+Worst+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a6847d46b9fcef9849aac0ff364f31b87de25bf","infoHashBuffer":{"type":"Buffer","data":[154,104,71,212,107,159,206,249,132,154,172,15,243,100,243,27,135,222,37,191]},"announce":[],"urlList":[]}}