{"title":"X-Men - The Complete Fatal Attractions (1993, Dgtl, Meganubis-Em","uid":9510096,"size":1587305013,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9a93688d8716e63f8808c0098107ca399c8971a7&amp;dn=X-Men+-+The+Complete+Fatal+Attractions+%281993%2C+Dgtl%2C+Meganubis-Em&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1390389288,"description":"For more information on this major X-Men event, please check out this wiki page:\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Fatal_Attractions_(comics)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Fatal_Attractions_(comics)&lt;/a&gt;\n\nThis crossover was one of the defining comic book experiences of my youth and a big reason why I love the X-Men so much today. The battles, the tension, and most importantly the consequences of the confrontation with Magneto were too massive for my young brain to handle (in a good way). This event was preceded by X-Cutioner's Song and followed directly by Blood Ties in the X-Men event chronology. I will try to post both of those in digital or hig-res TPB soon as well.\n\nMore or less, the story revolves around a battle that has been brewing for some time involving Magneto and the Acolytes and the various teams of X-Men. I have divided this torrent into 3 parts, the sum total of which is also contained in the massive Fatal Attractions hardcover:\n\n01 Prologue - transitions from X-Cutioner's Song leading up into the events of Fatal Attractions. Material includes - Uncanny X-Men 298-303m X-Factor 87-92, and X-Men Unlimited 01-02. I have not numbered these and they can be read in any order but it's probably best to alternated between Uncanny and X-Factor if you want to be most precise. The XMU stories are one-offs that help give atmosphere, as well as a snapshot of the leaders of the X-Men and Magneto just prior to the event.\n\n02 Fatal Attractions - a battle at least two years in the making, with dire consequences for some main X-Men members as well as Magneto himself! Numbered in the correct order, this sections contains - X-Factor 92, X-Force 25, Uncanny X-Men 304, X-Men 25, Wolverine 75, and Excalibur 71.\n\n03 Epilogue - The fallout from the crossover has tremendous outcomes for nearly all involved; though some of those threads would haunt the X-Men for years, these three issues help to serve as a coda to the story in the immediate aftermath of the devastation. Material includes Uncanny X-Men 305 and 315, and the Uncanny X-Men Annual 17 (1993).\n\nMASSIVE thanks to Meganubis-Empire for providing ALL DIGITAL editions of these issues, you dudes are seriously amazing. Please seed and I really hope you enjoy these X-Men torrents, surely there are more to come, eh? ;-)\n","torrent":{"xt":"urn:btih:9a93688d8716e63f8808c0098107ca399c8971a7","amp;dn":"X-Men+-+The+Complete+Fatal+Attractions+%281993%2C+Dgtl%2C+Meganubis-Em","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a93688d8716e63f8808c0098107ca399c8971a7","infoHashBuffer":{"type":"Buffer","data":[154,147,104,141,135,22,230,63,136,8,192,9,129,7,202,57,156,137,113,167]},"announce":[],"urlList":[]}}