{"title":"[DVDRip-XVID-ITA]Kalifornia[CR-Bt]","uid":4675597,"size":733938578,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9afe82bcf7f2e4115c698193d601b030f96d4d58&amp;dn=%5BDVDRip-XVID-ITA%5DKalifornia%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"CR-Bt","files":1,"time":1232891816,"description":"Minacciato di sfratto dal proprietario della terra dove tiene la propria roulotte e tormentato dall'ufficiale addetto alla sua sorveglianza, che per favorire il suo reinserimento nella societÃƒÂ  lo spedisce continuamente in giro a sostenere colloqui di lavoro che non promettono nulla di buono, l'ex detenuto Early Grayce ÃƒÂ¨ alla ricerca di un'alternativa. Un giorno, presentandosi all'UniversitÃƒÂ  per un posto di usciere, la sua attenzione viene catturata da un annuncio che gli offre la via d'uscita ideale: &quot;Cerchiamo qualcuno disposto ad alternarsi alla guida e dividere con noi le spese di viaggio, in cambio offriamo una settimana indimenticabile in giro per le strade d'America alla ricerca dei luoghi che sono stati scenario di delitti celebri&quot;. Si tratta di Brian, impegnato nelle ricerche per una tesi di dottorato sui serial killer, e Carrie, fotografa professionista e anticonvenzionale che realizza immagini di esplosiva sensualitÃƒÂ  del tutto inadatte al pubblico delle mostre. I due, benchÃƒÂ© appagati e soddisfatti della propria vita, hanno deciso entrambi di abbandonare la routine quotidiana per collaborare alla realizzazione di un libro sugli omicidi piÃƒÂ¹ celebri d'America. Durante un viaggio attraverso il Tennessee, l'Arkansas e il Texas, Brian e Carrie visiteranno i luoghi di alcuni delitti passati alla storia fino alla meta finale: la California.\n","torrent":{"xt":"urn:btih:9afe82bcf7f2e4115c698193d601b030f96d4d58","amp;dn":"%5BDVDRip-XVID-ITA%5DKalifornia%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9afe82bcf7f2e4115c698193d601b030f96d4d58","infoHashBuffer":{"type":"Buffer","data":[154,254,130,188,247,242,228,17,92,105,129,147,214,1,176,48,249,109,77,88]},"announce":[],"urlList":[]}}