{"title":"The Great Train Robbery - Michael Crichton  (Unabridged)","uid":6059015,"size":122758096,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9c6e94a1f351c7a9dac813e06b2d69b205085d2e&amp;dn=The+Great+Train+Robbery+-+Michael+Crichton++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Lucy1948","files":10,"time":1293034003,"description":"Unabridged and read by Simon Prebble. 8 hours 31 mins duration. 8 CD's. (Fraunhofer CBR 32 kbit/s 22050 Hz Mono, jetAudio 6.2+).\n\n\n[A small tribute to a famous author]\n\nIn Victorian London, where lavish wealth and appalling poverty exist side by side, one man navigates both worlds with ease, the rich, handsome and ingenious Edward Pierce. Who would suspect that a gentleman of breeding could mastermind the theft of the century? The Great Train Robbery is a bestselling 1975 historical fiction novel written by Michael Crichton. It is the story of the Great Gold Robbery of 1855, a massive gold heist, which takes place on a train traveling through Victorian era England. The great bulk of the book takes place in London. The story is a mild representation of the historical events that happened, although the setting can be considered quite accurate. The character names are mixed up in the novel, for example the main protagonists William Pierce is changed to Edward Pierce and Edward Agar to Robert Agar. The novel was later made into a 1979 film directed by Crichton starring Sean Connery and Donald Sutherland.\n\n(The sound quality although ripped from CD in my usual way is not as smooth as I normally get, and I am not exactly sure why. It is quite listenable though.)","torrent":{"xt":"urn:btih:9c6e94a1f351c7a9dac813e06b2d69b205085d2e","amp;dn":"The+Great+Train+Robbery+-+Michael+Crichton++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c6e94a1f351c7a9dac813e06b2d69b205085d2e","infoHashBuffer":{"type":"Buffer","data":[156,110,148,161,243,81,199,169,218,200,19,224,107,45,105,178,5,8,93,46]},"announce":[],"urlList":[]}}