{"title":"Meat Loaf - Bat Out of Hell 320cbr (Big Papi)","uid":9484990,"size":149915690,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9ca3cdfb6934a6ed0da4b61602213be8ab86a1ba&amp;dn=Meat+Loaf+-+Bat+Out+of+Hell+320cbr+%28Big+Papi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1389870892,"description":"By Mike\n \nThose who dismiss this undeniably popular album due to puerile lyrics (generally leveled at this album's sequel), over-the-top production, and Meat Loaf singing so passionately about such adolescent themes as a badly written farce totally miss the point. This is an album that pokes fun at all the rock and roll pretensions that had crept into rock music over the years (Townshend can you hear me?), and it succeeds wonderfully.\n\nThere's no doubt about it. BAT OUT OF HELL takes all these adolescent themes, mostly raging hormones, and builds, with operatic flair and lots of kitsch, this preposterously silly album which never-the-less struck a chord with a great many people. BAT OUT OF HELL is a concept album, but it doesn't carry all the serious connotations that such a label implies. This is Steinman taking all these broad-way musical conventions and hiring Meat Loaf, who could belt out vocals like no one else, and giving these teen-age angst-ridden years such a ridiculous setting that you can't help but laughing at the idiocy of what people thought were so important in their youth.\n\nSteinman's and Meat Loaf's chief critics generally site the bombast and blowing up teen-age angst with such an operatic flair. They miss the point. I will always stand behind Steinman's position as an artist because he uses all these so called &quot;weaknesses&quot; for effect. It's a very silly album, but then, it's supposed to be. Even the cover-art is ridiculous. It's all about that bad boy/girl image that's so laughably fake that no one takes them as any real threat. Most call it &quot;Just a phase they're going through.\nSteinman shows how the youth, when they begin taking themselves seriously as adults, are so concerned with issues that as people grow up realise, while important, aren't so damned dramatic as they made it out to be. [The album cover]. I'm sure most people remember wanting to do something out of the norm just so they can appear to be so tough and independent, and looking back are glad they outgrew it. This could be music or fashion or whatever. The whole album describes that state of young people wanting &quot;bad boy&quot; image which is really, really hooky.\n\nWhat makes this such a good album is even though it's all about that awkward transition phase between childhood and adulthood, Steinman deals with real issues, and surprisingly well at that. It's the very clear craftsmanship and the obvious &quot;weaknesses&quot; that are actually the strengths that makes this such a strong album. Although I've never though BAT had a straight-forward narrative, the title track (my personal favorite of both albums) introduces the type of characters we'll be seeing. The very last track tells of an individual who did make it past this phase and into maturity.\n\nOne of the more interesting things about BAT OUT OF HELL is its position on sex. Steinman's lyrics have a very perceptive view of what sex is, and shockingly it's much more along the lines of what Christianity teaches. Although you cannot conclusively say BAT OUT OF HELL promotes sex only in marriage, it gives several portraits, with very distinct imagery, that suggests that the youth get so tied up in sex that they don't care at all about each other. The sexual urges has destroyed or drastically hurt most of the relationships depicted on BAT OUT OF HELL with the single exception of the last track.\n\nTo me, &quot;For Crying Out Loud&quot; has always been the key track to BAT OUT OF HELL. The six songs that go before depict these youth, so bound up in folly they don't know or show real love, continually broken and hurt in their relationships. In &quot;For Crying Out Loud,&quot; however, an individual, ravaged with age, has finally found some one to love at last. They're no longer concerned with sex just for pleasure but they've found actually found a love.\n\nThere's such a jump in the age of Steinman's characters between the first six tracks and &quot;For Crying Out Loud&quot; that it BAT OUT OF HELL actually serves as a warning that if you don't grow up then you'll miss so much of what life has to offer. The first six tracks describe all the misadventures and stupid, malicious acts that these kids do, and then &quot;Paradise By the Dashboard Light&quot; transitions the characters from that song into old age, still without love. &quot;For Crying Out Loud&quot; then begins and is the only song dealing with an old person, and do to the transition provided in the previous song, it's reasonable to believe that Steinman wants to show what a lifetime of immaturity and bad boy posturing will get you. Steinman moves to the very heart and moral core of the record. This is where they discover that they don't have all the time in the world like they thought (in &quot;Heaven Can Wait&quot;). In the end, they also discover healthy sexuality as well, and are mature enough to raise their own children.\n\nIt's all these different facets that make BAT OUT OF HELL such a fascinating listen and an amazing artistic triumph. Most of this album's critics are so far off base they look positively asinine.\n\nThose who are looking for a surprisingly deep and moral record that has a great sense of dramatic flair, this is for you.\n\nP. S. While I enjoy listening to BAT II moreso, from the artistic standpoint this is the better record because its such a cohesive and well-sequenced record. BAT II has some great songs but doesn't present such a perceptive and far-reaching statement as this record does.","torrent":{"xt":"urn:btih:9ca3cdfb6934a6ed0da4b61602213be8ab86a1ba","amp;dn":"Meat+Loaf+-+Bat+Out+of+Hell+320cbr+%28Big+Papi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ca3cdfb6934a6ed0da4b61602213be8ab86a1ba","infoHashBuffer":{"type":"Buffer","data":[156,163,205,251,105,52,166,237,13,164,182,22,2,33,59,232,171,134,161,186]},"announce":[],"urlList":[]}}