{"title":"Contemporary Quantitative Finance: Essays in Honour of Eckhard P","uid":10425323,"size":6127244,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9cb78e1fd969a9a8247077ce661dbfa58d2c4f70&amp;dn=Contemporary+Quantitative+Finance%3A+Essays+in+Honour+of+Eckhard+P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"moneymakestheworldgoround","files":-1,"time":1403694360,"description":"ABOUT THIS BOOK\n-Outlines contemporary advances in a number of key areas of mathematical finance\n-Authors are major contributors to these various areas\n-Dedicated to Professor Eckhard Platen to celebrate his 60th birthday, that occurred in 2009\nThe contributors to this volume write a series of articles outlining contemporary advances in a number of key areas of mathematical finance such as, optimal control theory applied to finance, interest rate models, credit risk and credit derivatives, use of alternative stochastic processes, numerical solution of equations of mathematical finance, estimation of stochastic processes in finance. The list of authors includes many of the researchers who have made the major contributions to these various areas of mathematical finance.\n\nThis volume addresses both researchers and professionals in financial institutions, as well as regulators working in the above mentioned fields.\n\n\nABOUT THE AUTHORS\nCarl Chiarella is currently Professor of Quantitative Finance at the University of Technology, Sydney. He holds doctorates in both applied mathematics and economics. He is the author of over 150 research articles in international journals and edited volumes and the author/coauthor of 5 books. Carl is a Co-Editor of the Journal of Economic Dynamics and Control and Associate Editor of Quantitative Finance, Studies in Nonlinear Dynamics and Econometrics, Computational Economics and European Journal of Finance.\n\nAlexander Novikov is Professor of Mathematics (Chair in Probability) at the Department of Mathematical Sciences, the University of Technology, Sydney. He received the Doctor of Science degree in mathematics from Steklov Mathematical Institute, Moscow. He has edited several proceedings and published more than 80 research papers in different areas of statistics of random processes, sequential analysis, random fields and mathematical finance. Alexander has been member of the Editorial Board of Statistics and Probability Letters, Bernoulli and Methods of Mathematical Statistics.","torrent":{"xt":"urn:btih:9cb78e1fd969a9a8247077ce661dbfa58d2c4f70","amp;dn":"Contemporary+Quantitative+Finance%3A+Essays+in+Honour+of+Eckhard+P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cb78e1fd969a9a8247077ce661dbfa58d2c4f70","infoHashBuffer":{"type":"Buffer","data":[156,183,142,31,217,105,169,168,36,112,119,206,102,29,191,165,141,44,79,112]},"announce":[],"urlList":[]}}