{"title":"[SoM]Gli arancini di Montalbano[DvdRip-DivX-Ita-Mp3]","uid":4597520,"size":735778816,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9dc7e85cdbbec51b1585874301ad9dac6ccf2b50&amp;dn=%5BSoM%5DGli+arancini+di+Montalbano%5BDvdRip-DivX-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mitimex","files":1,"time":1230062820,"description":"I corpi del commendatore Pagnozzi e della sua giovane moglie vengono trovati senza vita nella loro auto finita in una scarpata. Tutto lascia pensare ad un normale incidente. Ma ci sono dei particolari che non tornano.Per esempio: perchÃƒÂ© la donna ha le unghie delle mani spezzate? \nStefania ÃƒÂ¨ la seconda moglie del commendatore Pagnozzi, costruttore edile colluso con la mafia. La donna, molto piÃƒÂ¹ giovane e assai attraente, lo ha sposato per i soldi. Erede delle fortune di Pagnozzi ÃƒÂ¨ il figlio Giacomo, un giovane nullafacente, gracile e pieno di odio per il padre, grande donnaiolo. La villa dei Pagnozzi ÃƒÂ¨ stata svaligiata la sera stessa dell'incidente. I sospetti si dirigono subito sugli operai albanesi che lavorano nei cantieri di Pagnozzi e che stanno ristrutturando la villa. In casa di uno di loro, Ilir, viene trovato con un pezzo della refurtiva. \nPer il questore Bonetti Alderighi il caso ÃƒÂ¨ risolto. Gli albanesi hanno svaligiato la villa e poi hanno ucciso i coniugi Pagnozzi simulando l'incidente. Ma Montalbano ha capito che le cose non sono andate cosÃƒÂ¬. Su un'audiocassetta recapitata a Montalbano ÃƒÂ¨ incisa una telefonata nella quale Stefania si rivolge al figlio di Pagnozzi, dicendo che l'indomani, liberatisi del padre saranno finalmente liberi di amarsi. \nMa Pasquale, il figlio della donna delle pulizie di Montalbano, vero autore del furto nella villa, non riconosce in Giacomino l'uomo che ha visto trafficare con l'auto la sera dell'incidente. Se Giacomo non ÃƒÂ¨ colpevole, a chi si rivolgeva Stefania nella telefonata? Montalbano, sapendo dei legami di Pagnozzi con la cosca dei Sinagra, va a parlare con il vecchio don Balduccio. CosÃƒÂ¬ viene a sapere che trent'anni prima una cameriera dei Pagnozzi, una donna bellissima, era stata allontanata dalla moglie dell'ingegnere. La donna, incinta, aveva trovato lavoro presso un avvocato di Montelusa. Montalbano ricostruisce il corso degli eventi.\n","torrent":{"xt":"urn:btih:9dc7e85cdbbec51b1585874301ad9dac6ccf2b50","amp;dn":"%5BSoM%5DGli+arancini+di+Montalbano%5BDvdRip-DivX-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dc7e85cdbbec51b1585874301ad9dac6ccf2b50","infoHashBuffer":{"type":"Buffer","data":[157,199,232,92,219,190,197,27,21,133,135,67,1,173,157,172,108,207,43,80]},"announce":[],"urlList":[]}}