{"title":"One.Step.Beyond.1959-1961.H264.for.Chromecast.MP4","uid":9811979,"size":4490623240,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9df9270951a6d3f1bdf2a3c9fe36e452536737a9&amp;dn=One.Step.Beyond.1959-1961.H264.for.Chromecast.MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"usbmboot","files":50,"time":1395552735,"description":"This is a best 50 episodes (of 97) collection of the 1959-1961 black-and-white TV series &quot;One Step Beyond&quot; in compatible MP4 format for Google Chromecast.\n\nThe original source quality of the 30 minute episodes is, frankly, awful, so you must be tolerant of the poor archiving of some TV series from that era. This 4GB collection was optimzed (without notable quality loss) from a 10GB collection of AVI files.\n\n-- Video: H264 ( 720 x 480 ) -- Audio: AAC (m4a) 44.1kHz\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0052442/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0052442/&lt;/a&gt;\n\nIMDB:\n\nProduced at the same time as the more well-known Twilight Zone, this series fed the nation's growing interest in paranormal suspense in a different way. Rather than creating fictional stories with supernatural twists and turns, this program sought out 'real' stories of the supernatural, including ghosts, disappearances, monsters, etc., and re-creating them for each episode. No solutions to these mysteries were ever found, and viewers could only scratch their heads and wonder, &quot;what if it's real?&quot;\n\nAlthough I personally consider the Twilight Zone series far superior, here is an IMDB reviewer's enthusiastic endorsement of &quot;One Step Beyond&quot;:\n\nI am a connoisseur of &quot;horror&quot; movies/series, and have seen them all since the 1950s, but One Step Beyond remains the scariest of all the series. The only one that came close was Boris Karloffs'-Thriller! John Newlands' beginning monologue reels you in, to have you gripping the arms of your chair during the story, too scared out of your wits to even move, then having the story ending to Mr.Newlands epilogue to further heighten your anxiety of being too fearful to go to sleep!! Unlike..Twilight Zone, Hitchcock, Night Gallery,Tales from the Crypt, Outer Limits and X-Files which ALL have humorous episodes which discount their &quot;scare-quotient&quot;, and leaves you disappointed....however &quot;O.S.B.&quot;satisfies the most discriminating of &quot;scary-movie&quot; tastes !!! O.S.B never had one &quot;hokey&quot; episode that would tickle your funny bone and that is what makes for excellent scare tactics. I wish they had this series on DVD !!!","torrent":{"xt":"urn:btih:9df9270951a6d3f1bdf2a3c9fe36e452536737a9","amp;dn":"One.Step.Beyond.1959-1961.H264.for.Chromecast.MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9df9270951a6d3f1bdf2a3c9fe36e452536737a9","infoHashBuffer":{"type":"Buffer","data":[157,249,39,9,81,166,211,241,189,242,163,201,254,54,228,82,83,103,55,169]},"announce":[],"urlList":[]}}