{"title":"The Undisputed Truth - Milestones; The Best Of The Undisputed Tr","uid":6283025,"size":509811701,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9e17158c160eaf92a9fcd12df968bbddd4c5d45d&amp;dn=The+Undisputed+Truth+-+Milestones%3B+The+Best+Of+The+Undisputed+Tr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Ritxard","files":27,"time":1301511070,"description":"Kaixo, Hello, Sali ZÃƒÂ¤mÃƒÂ¤ !!!\n\nAnother release from my mother's CD collection. Today it's a best of album from The Undisputed Truth which was released by Motown in 1995. My mother says that she loves them because of the sexual appetite that awakes in her when she is listening to Wah-Wah Watson's guitar.....so biggie up and respect to my mother, Wah-Wah Watson and the allmighty Jah for having created the Undisputed Truth!\n\nFrom Wikipedia:\nThe Undisputed Truth was a 1970s Motown recording act, assembled by record producer Norman Whitfield as a means for being able to experiment with his psychedelic soul production techniques. Joe Harris served as main lead singer, with Billie Rae Calvin and Brenda Joyce, formerly of The Delicates, on additional leads and background vocals.The group's music and unusual costuming (large Afros and white makeup) typified the then-popular trend of &quot;psychedelic soul&quot; which producer Norman Whitfield had inaugurated. A number of their singles became minor hits, and many of them were also songs for Whitfield's main act, The Temptations, among them &quot;You Make Your Own Heaven and Hell Right Here on Earth&quot; and &quot;Papa Was A Rollin' Stone.&quot; Their single Top 40 hit in the United States was the ominous &quot;Smiling Faces Sometimes,&quot; originally recorded by The Temptations, which hit #3 on the US pop charts in 1971.\n\nThe Undisputed Truth, along with Rose Royce and Willie Hutch, followed Whitfield during his exodus from Motown to set up Whitfield Records in 1975. At this time, Calvin and Joyce left the group, and Harris was joined by new members Virginia &quot;V&quot; McDonald, Tyrone &quot;Big Ty&quot; Douglas, Tyrone &quot;Lil Ty&quot; Barkley, and Calvin &quot;Dhaak&quot; Stephenson. The group's costuming and style changed as well, becoming even more unusual and Funkadelic-influenced.\nHowever, the group had little success at the new label, and faded into obscurity after two more albums, although they charted in the UK Singles Chart in January 1977 (#43) with the disco single &quot;You + Me = Love&quot; from the album Method to the Madness.[1] The lead singer on the single &quot;You + Me = Love&quot; was Taka Boom, who is Chaka Khan's younger sister.\n\nAnd here is some REAL IMPORTANT INFORMATION:\nThis is the one and only way how to prepare the real Marianito preparao as it has to be on sunday morning after church:\nGive about five or six ice cubes into a jar\nnow a litlle hint of Angostura over the ice (0,5 cl)\nadd some fine quality gin and Red CuraÃƒÂ§ao (1cl of each)\nnow add Martini Rosso (10cl)\nstir it , NEVER AND IN NO WAY THINK ABOUT SHAKING HIM !!!!!!\npour it with filtering the ice into two cocktailglasses\nadd a piece of orange skin lightly pressed over each of the Marianitos preparaos.\nEnjoy with some Olives or caracoliÃƒÂ±os. And thank the lord that you are so lucky to live in Bilbao, the center of the universe where they make the best of them. AMEN\n\nSEED OR YOU WILL GET ANAL PUNISHMENT FROM ROCCO SIFFREDDI!!!","torrent":{"xt":"urn:btih:9e17158c160eaf92a9fcd12df968bbddd4c5d45d","amp;dn":"The+Undisputed+Truth+-+Milestones%3B+The+Best+Of+The+Undisputed+Tr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e17158c160eaf92a9fcd12df968bbddd4c5d45d","infoHashBuffer":{"type":"Buffer","data":[158,23,21,140,22,14,175,146,169,252,209,45,249,104,187,221,212,197,212,93]},"announce":[],"urlList":[]}}