{"title":"Meatballs Collection 1 2 3 4","uid":5594132,"size":3603669461,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9e2c0b60b293f00eb191176aa99df9eede1a91ea&amp;dn=Meatballs+Collection+1+2+3+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"thelad53","files":-1,"time":1274972288,"description":"Description:\nMeatballs\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0079540/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0079540/&lt;/a&gt;\n\nMr. Depressingly Unpopular Rudy goes to summer camp full of rowdy teenagers. The head counselor\nis Tripper Harrison, the prank pulling, girl seducing, fun lover, teasing both his boss and the\ncounselors at the nearby rich kids camp. He and everyone else are sick and tired of always losing\nthe Camp Olympics every year, Tripper must encourage all campers to try their hardest, and even\nconvince young Rudy that this may be his chance to feel better about himself.\n\n\nMeatballs Part II\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0087700/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0087700/&lt;/a&gt;\n\n&quot;The second in-name-only sequel to the first Meatballs summer camp movie sets us at Camp Sasquash\nwhere the owner Giddy tries to keep his camp open after it's threatened with foreclosure after Hershey,\nthe militant owner of Camp Patton located just across the lake, wants to buy the entire lake area to expand\nCamp Patton. Giddy suggests settling the issue with the traditional end-of-the-summer boxing match over\nrights to the lake. Meanwhile, a tough, inner city punk, nicknamed Flash, is at Camp Sasquash for\ncommunity service as a counselor-in-training where he sets his sights on the naive and intellectual\nCheryl, while Flash's young charges befriend an alien, whom they name Meathead, also staying at the\ncamp for the summer.&quot; - IMDB.\n\nRecorded off Universal-HD ( has a small logo for a short period of time )\nEnjoy\n\n\nMeatballs Part III\n &lt;a href=&quot;\nhttp://imdb.com/title/tt0093516/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0093516/&lt;/a&gt;\n\nA 14-year-old boy named Rudy is trying desperately to lose his virginity.\nWhen he spends the night with his friend Wendy (whom secretly loves him and he doesn't realize she's\nthe one for him) and they watch a porno film called &quot;E.A.T. M.E.: The Sextra-Terestrial&quot; starring\nRoxanne Du Jour. When the movie is turned off, they discover on the news that the famous porn star\nhas died. Meanwhile in Heaven, Roxanne must become an angel by committing one good deed. She decides\nto help young Rudy lose his virginity. It just so happens that Rudy has a crush on the &quot;Love Goddess&quot;\nwho just happens to be the sister of the town bully, Mean Gene.\n\nVideo: Divx 29.97 352X264 Fullscreen\n\n\nMeatballs Part IV\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0104837/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0104837/&lt;/a&gt;\n\nSynopsis:\nRicky is the hottest water-ski instructor around and he has just be rehired by his former employer/camp\nto whip up attendance. But the camp is in serious financial trouble and the owner of a rival, more popular,\ncamp wants to buy them out. Therefore they will have to engage in a mean, winner-takes-all competition\nthat will settle the row once and for all.\nAudio: MPGA 44.1KHz @ 192k","torrent":{"xt":"urn:btih:9e2c0b60b293f00eb191176aa99df9eede1a91ea","amp;dn":"Meatballs+Collection+1+2+3+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e2c0b60b293f00eb191176aa99df9eede1a91ea","infoHashBuffer":{"type":"Buffer","data":[158,44,11,96,178,147,240,14,177,145,23,106,169,157,249,238,222,26,145,234]},"announce":[],"urlList":[]}}