{"title":"Sabik_1986(bomba era)_TOPSDER","uid":7453660,"size":829172050,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9e496ac352c02d3449d8f14baa787a309ff9a14c&amp;dn=Sabik_1986%28bomba+era%29_TOPSDER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"topsiderMK","files":1,"time":1342604930,"description":"greetz to all Filipino...\n\nmabuhay ang mga bayaning OFW...\n\nSabik_1986_pinoy porn\n\nSCREENSHOTS:\n &lt;a href=&quot;\nhttp://img1.imagebanana.com/img/y2sp0nn3/sabik_thumbs.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img1.imagebanana.com/img/y2sp0nn3/sabik_thumbs.jpg&lt;/a&gt;\n\n\nClearly then, most, if not all, the penekula or pene movies megged from the mid 80's are nothing but pure undiluted pornography. Consider the most controversial penekula of all, ... Sabik. Kasalanan Ba? (RJR Films International / Fantasy Films, International). This Lito de Guzman movie tells the story of Celia (Joy Sumilang), a young woman whose thirst was quenched by her stepfather, Miguel (George Estregan). She marries Mario (Tani Cinco), a workaholic who has been neglecting his wife's sexual needs. She then has an affair with her husband's best friend Edgar (Gino Antonio) until he mysteriously dies of food poisoning. In this, as in other porno films that followed, the screenplay failed to give the moviegoer any insight into the human situation, but merely provides a framework, an excuse for the several protracted episodes of torrid lovemaking, between Celia and her husband, and later her lover. Characterization is not taken seriously. In fact, only one aspect of Celia's character is given, without any explanation, she is obsessed with sex, sex and more sex. Mario and Edgar, on the other hand are nothing but studs, who alternate in feeding this insatiable Venus fly-trap. Lighting merely provides ample illumination for the love scenes, while the camera is perennially angled to highlight the acrobatics of fornication. Editing prolongs love scenes beyond logic and human endurance, while the moans and shrieks of orgasm are magnified to decibels fit for the deaf and dumb. Pornography and art are mutually exclusive of each other, and what is often called erotic art is really just well-made, or artistically executed pornography. Penekula openly pretends to be art and does not seem to succeed in whole or in part as an art film.\n\n\nDirected By: Lito J. de Guzman\nScreenplay: Armando de Guzman, Jr.\nDirector Of Photography: Joe Tutanes\nMusic By: Jennylee\nFilm Editor: Rene Tala\nProduced By: RJR Films International And Fantasy Films International\nRelease Date: May 1, 1986\n\n\npls. seed after U dwnload... enjoy...","torrent":{"xt":"urn:btih:9e496ac352c02d3449d8f14baa787a309ff9a14c","amp;dn":"Sabik_1986%28bomba+era%29_TOPSDER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e496ac352c02d3449d8f14baa787a309ff9a14c","infoHashBuffer":{"type":"Buffer","data":[158,73,106,195,82,192,45,52,73,216,241,75,170,120,122,48,159,249,161,76]},"announce":[],"urlList":[]}}