{"title":"The Dr. Patrick Grant Mystery Collection - Margaret Yorke","uid":11023629,"size":443329698,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9e59c4aa79b028991b7f7bb6c092c478f1b0c38a&amp;dn=The+Dr.+Patrick+Grant+Mystery+Collection+-+Margaret+Yorke&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"davieboy1966","files":56,"time":1410635311,"description":"Audio Books : Mystery and Suspense : Other quality : English\nAll from cassette tapes (except #1, CD) and unabridged. 32 kbps / 22 kHz Mono Fraunhofer CBR MP3 (except #1 , 48 kbps).\n\n\n\nDr. Patrick Grant is a professor in Oxford, England. This tweedy professor with the peculiar hobby of solving murder mysteries, combines his specialisation in Shakespeare with an uncanny instinct for crime.\n\n#1. Dead In The Morning [1970], 5 hours 55 mins, CD read by Carole Hayman\nNo one would have been surprised if old Mrs. Ludlow was murdered, but when her housekeeper is the one who turns up dead, everyone assumes that the lethal drugs were intended for Mrs. Ludlow, but Dr. Patrick Grant thinks he can prove everyone wrong...\n\n#2. Silent Witness [1972], 5 hours 37 mins, read by Christopher Kay\nThe atmosphere among the guests in the Austrian hotel is amicable until a group of holiday-makers bring rivalries and distrust. The tension mounts when the weather worsens and the town is cut off from the outside world. Relationships are strained by the boredom of inactivity as the blizzards curtail skiing. One of the party disappears and is later found murdered. Dr Patrick Grant investigates...(Note: The first few minutes of part 4 is of variable quality.)\n\n#3. Grave Matters [1973], 5 hours 2 mins, read by Alex Scott\nA sudden flurry of movement in the Athenian twilight. A half stifled scream. The full impact of a fatal fall. Dr Patrick Grant had seen the whole thing - but even he could not be sure that he had witnessed a murder. Then came a second accident, in almost identical circumstances. And Grant`s suspicion turned to certainty. Who would want to murder two harmless old ladies, and why? The answer lay in a quiet Hampshire village - where a ruthless killer was already preparing to claim another victim....\n\n#4. Mortal Remains [1974] , 5 hours 52 mins, read by Alexander John\nThe swimmer lay unmoving, face down in the water, arm floating outstretched. There was something very wrong about him, for the figure was fully dressed. Then Dr Patrick Grant realises that this disfigured corpse on a lonely beach in Crete, is that of his Oxford colleague, Felix Lomax, supposedly lecturing on the cruise liner Persephone many miles away. Determined to unravel the mystery, he follows a sinister trail to the tombs of Mycenae. Here, among the ancient ruins, he must risk his life in order to discover the truth...\n\n#5. Cast for Death [1976], 5 hours 13 mins, read by Alexander John\nWhen his actor friend Sam Irwin ends up in the Thames instead of treading the boards in a new production of Macbeth, Dr Patrick Grant is soon embroiled in a mystery to test his literary and detective skills. Grant finds a chain of circumstances linking two suicides, the accidental death of a dog and a series of art robberies...\n\nNote that these rare recordings are from cassette tapes (except the first) that are in some cases quite old, thus the sound quality may not be pristine, but they are reasonably hiss free and clear.\nNo CD or Electronic Download versions are available to my knowledge,except for the first title here.\n(This is a well written cozy British murder mystery series.)\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:9e59c4aa79b028991b7f7bb6c092c478f1b0c38a","amp;dn":"The+Dr.+Patrick+Grant+Mystery+Collection+-+Margaret+Yorke","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e59c4aa79b028991b7f7bb6c092c478f1b0c38a","infoHashBuffer":{"type":"Buffer","data":[158,89,196,170,121,176,40,153,27,127,123,182,192,146,196,120,241,176,195,138]},"announce":[],"urlList":[]}}