{"title":"Essential ENT, 2E [PDF] [StormRG]","uid":10423808,"size":8671665,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9e699eea22e38a81f10aa5e4a3cc9edb5909f6c5&amp;dn=Essential+ENT%2C+2E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":3,"time":1403674991,"description":"Author: Rogan J. Corbridge\nPaperback: 208 pages\nPublisher: CRC Press; 2 edition (September 30, 2011)\nLanguage: English\nISBN-10: 1444117955\nISBN-13: 978-1444117950\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n_________________________________________________________________________________\n\n\nThis innovative and accessible guide to ear, nose and throat medicine delivers everything you need to know to develop a thorough grounding in the subject, acting as an essential course companion and an ideal revision aid.\n\nWritten in a lively and accessible manner reflecting the author's popular lecturing style, the content has been carefully matched to meet the demands of both the undergraduate curriculum and the core competencies for foundation study. Topics are approached in a problem-oriented manner, with basic science and clinical information integrated throughout in line with current teaching practice.\n\nEssential ENT, praised in the first edition for its brevity, style and illustrations, remains an essential text for undergraduate medical students and foundation doctors, an excellent aide memoire for those embarking upon a career in ENT and studying for the Diploma in Laryngology and Otology, and a reliable companion in clinical practice for general practitioners and staff in the emergency department.","torrent":{"xt":"urn:btih:9e699eea22e38a81f10aa5e4a3cc9edb5909f6c5","amp;dn":"Essential+ENT%2C+2E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e699eea22e38a81f10aa5e4a3cc9edb5909f6c5","infoHashBuffer":{"type":"Buffer","data":[158,105,158,234,34,227,138,129,241,10,165,228,163,204,158,219,89,9,246,197]},"announce":[],"urlList":[]}}