{"title":"The Rainbow Comes and Goes - Anderson Cooper","uid":14376206,"size":2482386,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ed6f1792bb1dc781636a834accdb589a6e4508e&amp;dn=The+Rainbow+Comes+and+Goes+-+Anderson+Cooper&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1461197002,"description":"#1 New York Times Bestseller\r\n\r\nA touching and intimate correspondence between Anderson Cooper and his mother, Gloria Vanderbilt, offering timeless wisdom and a revealing glimpse into their lives\r\n\r\nThough Anderson Cooper has always considered himself close to his mother, his intensely busy career as a journalist for CNN and CBS affords him little time to spend with her. After she suffers a brief but serious illness at the age of ninety-one, they resolve to change their relationship by beginning a year-long conversation unlike any they had ever had before. The result is a correspondence of surprising honesty and depth in which they discuss their lives, the things that matter to them, and what they still want to learn about each other.\r\n\r\nBoth a son’s love letter to his mother and an unconventional mom’s life lessons for her grown son, The Rainbow Comes and Goes offers a rare window into their close relationship and fascinating life stories, including their tragedies and triumphs. In these often humorous and moving exchanges, they share their most private thoughts and the hard-earned truths they’ve learned along the way. In their words their distinctive personalities shine through—Anderson’s journalistic outlook on the world is a sharp contrast to his mother’s idealism and unwavering optimism.\r\n\r\nAn appealing memoir with inspirational advice, The Rainbow Comes and Goes is a beautiful and affectionate celebration of the universal bond between a parent and a child, and a thoughtful reflection on life, reminding us of the precious insight that remains to be shared, no matter our age","torrent":{"xt":"urn:btih:9ed6f1792bb1dc781636a834accdb589a6e4508e","amp;dn":"The+Rainbow+Comes+and+Goes+-+Anderson+Cooper","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ed6f1792bb1dc781636a834accdb589a6e4508e","infoHashBuffer":{"type":"Buffer","data":[158,214,241,121,43,177,220,120,22,54,168,52,172,205,181,137,166,228,80,142]},"announce":[],"urlList":[]}}