{"title":"Escape Goat 2 (GOG)","uid":9940926,"size":129826974,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9f54cabbba3a7a2486997c27c65516332c5631de&amp;dn=Escape+Goat+2+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Sarah116","files":-1,"time":1397239362,"description":"Hey guys, here escape goat 2. It the gog version of the game. It includes all of the bonus content that was including in the gog version. Hope you guys enjoy and plz help seed.\n\n\n &lt;a href=&quot;\nhttp://www.gog.com/game/escape_goat_2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/game/escape_goat_2&lt;/a&gt;\n\n\n\nWhat's cool about it:\n\nOver 100 rooms of puzzles, traps, and sheeply lore.\nWith destructible and movable walls, the rooms take on many forms as you manipulate hidden machinery to reach the exit.\nFull hand-drawn, hi-def art and animation, brought to life with a custom lighting engine.\nEpic 90's Redbook Audio soundtrack, featuring guest track by Disasterpeace (composer, FEZ).\n\n\nOverview:\nNone have overcome the Stronghold of Toragos... will you be the first goat to do so? Escape Goat 2 is the follow-up to the critically-acclaimed 2011 indie game, featuring more than double the content: larger rooms, HD graphics, dynamic lighting, and a host of devilish new traps.\n\n\nPick your path through the massive Stronghold, divided into ten unique zones. Worry not, brave Goat, for you have a friend on this mission: Your immortal mouse familiar can crawl to otherwise unreachable areas, to hit switches and distract enemies. Use your wits, reason, reflexes and courage to overcome each room, and save your friends from an eternal slumber...\n\n\nController support: Escape Goat 2 fully supports the Xbox 360 and other XInput-capable controllers.","torrent":{"xt":"urn:btih:9f54cabbba3a7a2486997c27c65516332c5631de","amp;dn":"Escape+Goat+2+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f54cabbba3a7a2486997c27c65516332c5631de","infoHashBuffer":{"type":"Buffer","data":[159,84,202,187,186,58,122,36,134,153,124,39,198,85,22,51,44,86,49,222]},"announce":[],"urlList":[]}}