{"title":"La quadrilogie &quot;Fast &amp; Furious&quot;..French DVDRiP.avi","uid":5571526,"size":2919632896,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9f5e5bac37698e335c2f51640227fa070bc3fe98&amp;dn=La+quadrilogie+%5C%22Fast+%26+Furious%5C%22..French+DVDRiP.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"les-stefs79","files":4,"time":1274264467,"description":" &lt;a href=&quot;http://static.letsbuyit.com/filer/images/fr/products/original/79/6/fast-and-furious-la-quadrilogie-7906522.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://static.letsbuyit.com/filer/images/fr/products/original/79/6/fast-and-furious-la-quadrilogie-7906522.jpeg&lt;/a&gt;\n\n\nThe Fast &amp; Furious:  \nDans le premier Fast &amp; Furious, le hÃƒÂ©ros, Bryan O'CONNER (Paul WALKER), est un jeune policier en civil qui aime beaucoup les courses de voiture tuner. Il travaille comme vendeur dans un magasin de piÃƒÂ¨ces dÃƒÂ©tachÃƒÂ©es pour ces voitures. Un soir, il fait une course et perd mais de trÃƒÂ¨s peu. Il va alors s'associer au groupe du vainqueur pour pouvoir mieux courir avec des voitures plus puissantes et ÃƒÂªtre protÃƒÂ©gÃƒÂ© par le groupe. On apprend par la suite qu'il s'est infiltrÃƒÂ© dans le groupe pour pouvoir les arrÃƒÂªter car ils font partie d'un rÃƒÂ©seau de vol de materiel Hi-tech dans des camions qu'ils braquent tout en roulant avec trois &quot;honda civic&quot; noires au nÃƒÂ©on vert. A la fin du film, le hÃƒÂ©ros Bryan rÃƒÂ©ussit ÃƒÂ  les sauver car durant le dernier braquage le conducteur du camion ÃƒÂ©tait armÃƒÂ© d'un fusil ÃƒÂ  pompe. Mais il laissera le chef du gang filer sans qu'il ne se fasse arrÃƒÂªter car ils ÃƒÂ©taient devenus amis.\nMeilleur cascade de ce premier film de la sÃƒÂ©rie: passage sous le camion lancÃƒÂ© ÃƒÂ  pleine vitesse.\n\n2 fast 2 furious:\nce second film de la sÃƒÂ©rie n'est pas totalement une suite car on y retrouve seulement Bryan et non les autres. Ce film commence par un avant-goÃƒÂ»t de la conduite de Bryan, amÃƒÂ©liorÃƒÂ©e par rapport ÃƒÂ  ses savoirs-faire du premier film. Donc une course de quatre pilotes est organisÃƒÂ©e mais n'ÃƒÂ©tant que trois, l'organisateur propose d'appeler Bryan qui vient en moins de trois minutes. Donc la course commence, Bryan part dernier, les trois autres concurrents envoie leur nitro avant Bryan mais sa voiture est tellement puissante (NISSAN Skyline gtr tuner) qu'il arrive ÃƒÂ  rester derriÃƒÂ¨re eux. Sur le dernier virage Bryan passe premier :\n&lt;&lt;A toi la rage!&gt;&gt; s'exclame-t-il. Mais son concurrent, n'ayant pas utilisÃƒÂ© la totalitÃƒÂ© de son nitro envoie la fin sans avoir vu qu'ÃƒÂ  l'arrivÃƒÂ©e se trouve un pont levis, il lui faut donc de la vitesse pour ne pas tomber en piquet. Il saute et Bryan astucieusemeent envoie son nitro quelques mÃƒÂ¨tres avant le pont ce qui lui permet de passer au-dessus de son adversaire en plein vol. Mais une fois la course finie, la police dÃƒÂ©barque et tout le monde s'enfuit. Bryan, s'ÃƒÂ©tant fait renvoyer pour la faute commise dans le 1Ã‚Â° film, est arrÃƒÂªtÃƒÂ© par la police qui lui propose une mission. Mission proposÃƒÂ©e : infiltrer le rÃƒÂ©seau d'un trafiquant qui recherche de bons conducteurs, mais il doit faire ÃƒÂ©quipe avec un agent de police pas du tout compÃƒÂ©tent dans le domaine automobile. Alors il va proposer son ami d'enfance (qui ÃƒÂ©tait allÃƒÂ© en prison pour vol de voiture et croyait que c'ÃƒÂ©tait la faute de Bryan). Son ami, Roman PEARCE, accepte cette mission car il porte ÃƒÂ  la jambe un bracelet magnÃƒÂ©tique qui l'empÃƒÂ¨che de s'ÃƒÂ©loigner de plus de 100m de son logement, une caravane garÃƒÂ©e ÃƒÂ  cotÃƒÂ© d'une arÃƒÂ¨ne de CRASH-CAR (jeu de voiture qui consiste ÃƒÂ  dÃƒÂ©truire les autres voitures), de plus, s'il accepte cette mission son casier sera effacÃƒÂ©. Ils vont donc se lancer dans l'aventure et vont rÃƒÂ©ussir la premiÃƒÂ¨re ÃƒÂ©tape (test) et vont piÃƒÂ©ger le trafiquant sur la deuxieme ÃƒÂ©tape. Ils repartiront avec tous les sous et un casier judiciaire vide.\nMeilleur cascade du film : saut de Bryan par dessus son adversaire durant la premiÃƒÂ¨re course.\n\nFast &amp; Furious Tokyo Drift :\nCe troisiÃƒÂ¨me film n'a aucun rapport avec les deux premiers car on a un nouvel hÃƒÂ©ros et cela se passe ÃƒÂ  Tokyo. Ce film parle d'un jeune amÃƒÂ©ricain vivant avec sa mÃƒÂ¨re aimant les courses automobiles mais ne sachant pas drifter (dÃƒÂ©raper dans les virages en maÃƒÂ®trisant sa trajectoire) ; il part vivre chez son pÃƒÂ¨re ÃƒÂ  Tokyo. A l'ÃƒÂ©cole il rencontre un jeune homme trÃƒÂ¨s riche possÃƒÂ©dant une centaine de voitures tuner, qui va lui en offrir une car il a essayÃƒÂ© de faire une course mais il rentrait dans chaque mur. Ce jeune garÃƒÂ§on va donc s'entraÃƒÂ®ner ÃƒÂ  drifter, il va devenir un vrai professionel et faire beaucoup de courses. Durant une course son ami qui lui a tout appris dÃƒÂ©cÃƒÂ¨de dans un accident de voiture. Il va se venger en faisant une course contre celui qui a poussÃƒÂ© son ami contre le mur. Cette derniÃƒÂ¨re course se passe dans la montagne et, enfin, alors qu'il est premier, ralentit et lorsque son adversaire passe ÃƒÂ  cotÃƒÂ© de lui, il braque le volant et le pousse dans le ravin. voilÃƒÂ  pour ce troisiÃƒÂ¨me film un peu dÃƒÂ©cevant aprÃƒÂ¨s les 2 premiers car on regrette un peu Bryan et sa Skyline.  \nMeilleur cascade du film : saut traversant un immeuble en construction durant la toute premiÃƒÂ¨re course en AmÃƒÂ©rique.\n\nFast and Furious 4\nUn meurtre oblige Don Toretto, un ancien taulard en cavale, et l'agent Brian O'Conner ÃƒÂ  revenir ÃƒÂ  L.A. oÃƒÂ¹ leur querelle se rallume. Mais confrontÃƒÂ©s ÃƒÂ  un ennemi commun, ils sont contraints ÃƒÂ  former une alliance incertaine s'ils espÃƒÂ¨rent parvenir ÃƒÂ  dÃƒÂ©jouer ses plans. De l'attaque de convoi aux glissades de prÃƒÂ©cision qui les mÃƒÂ¨neront hors de leurs propres frontiÃƒÂ¨res, les deux hommes trouveront le meilleur moyen de prendre leur revanche : en poussant les limites de ce qui est faisable au volant d'un bolide.","torrent":{"xt":"urn:btih:9f5e5bac37698e335c2f51640227fa070bc3fe98","amp;dn":"La+quadrilogie+%5C%22Fast+%26+Furious%5C%22..French+DVDRiP.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f5e5bac37698e335c2f51640227fa070bc3fe98","infoHashBuffer":{"type":"Buffer","data":[159,94,91,172,55,105,142,51,92,47,81,100,2,39,250,7,11,195,254,152]},"announce":[],"urlList":[]}}