{"title":"Karl Polanyi - The Great Transformation.pdf","uid":5241552,"size":2599324,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9fc6da302d64e470950d7c68461923f9cffc535f&amp;dn=Karl+Polanyi+-+The+Great+Transformation.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"komprezor","files":1,"time":1261782213,"description":"The reviews I found don't do justice to this great book.  So the following samples from Polanyi himself will provide description.  There was no electronic copy for download so I made a slightly distorted one with digital camera.  Please overlook the OCR glitches.\n---\n\np. 237:\nThe fascist solution of the impasse reached by liberal capitalism can be described as a reform of market economy achieved at the price of the extirpation of all democratic institutions, both in the industrial and in the political realm.\n\np. 249:\nAfter a century of blind &quot;improvement&quot; man is restoring his &quot;habitation.&quot; If industrialism is not to extinguish the race, it must be subordinated to the requirements of man's nature. The true criticism of market society is not that it was based on economics--in a sense, every and any society must be based on it--but that its economy was based on self-interest. Such an organization of economic life is entirely unnatural, in the strictly empirical sense of exceptional.\n\np. 255:\nThe true answer to the threat of bureaucracy as a source of abuse of power is to create spheres of arbitrary freedom protected by unbreakable rules.\n\np. 164:\nNow, what the white man may still occasionally practice in remote regions today, namely, the smashing up of social structures in order to extract the element of labor from them, was done in the eighteenth century to white populations by white men for similar purposes.  Hobbes' grotesque vision of the State--a human Leviathan whose vast body was made up of an infinite number of human bodies--was dwarfed by the Ricardian construct of the labor market: a flow of human lives the supply of which was regulated by the amount of food put at their disposal. Although it was acknowledged that there existed a customary standard below which no laborer's wages could sink, this limitation also was thought to become effective only if the laborer was reduced to the choice of being left without food or of offering his labor in the market for the price it would fetch. This explains, incidentally, an otherwise inexplicable omission of the classical economists, namely, why only the penalty of starvation, not also the allurement of high wages, was deemed capable of creating a functioning labor market.  Here also colonial experience has confirmed theirs. For the higher the wages the smaller the inducement to exertion on the part of the native, who unlike the white man was not compelled by his cultural standards to make as much money as he possibly could.\n","torrent":{"xt":"urn:btih:9fc6da302d64e470950d7c68461923f9cffc535f","amp;dn":"Karl+Polanyi+-+The+Great+Transformation.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fc6da302d64e470950d7c68461923f9cffc535f","infoHashBuffer":{"type":"Buffer","data":[159,198,218,48,45,100,228,112,149,13,124,104,70,25,35,249,207,252,83,95]},"announce":[],"urlList":[]}}