{"title":"[Knit] Fair Isle Sweaters Simplified","uid":10719946,"size":56162976,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a008df74c00964bef65dadb7e06d3eabbde7414c&amp;dn=%5BKnit%5D+Fair+Isle+Sweaters+Simplified&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"KnitLady","files":-1,"time":1407466823,"description":"Fair Isle Sweaters Simplified by Ann and Eugene Bourgeois The Easiest Way to Knit in the Fair Isle Style! Get ready to make your next knitting project an exhilarating journey with the spectacular designs featured in Fair Isle Sweaters Simplified. Drenched in color and shaped for the utmost comfort, these rich, multihued sweaters use a remarkably simple two-handed method that takes just a few minutes to learn and a few evenings to master. A dazzling array of colors, from traditional heathers and bright, bold tones to calm-and-cool hues, will make your knitting an exciting new adventure. ï¿½ Knit beautiful, sumptuous sweaters featuring stunning stars, stained glass, garden patches, and fractured diamonds, plus the popular &quot;Color Your Own&quot; pattern ï¿½ Learn the history of the husband-and-wife team behind Philosopher's Wool who built their traditional-style farmhouse, raised their own sheep, dyed their own wool, and designed these dynamic Fair Isle patterns ï¿½ Try simple, quick methods for making sweaters larger or smaller, longer or shorter--even after your sweaters are finished ï¿½ PLUS--Discover Philosopher's Wool's signature technique for transforming pullovers into cardigans with a few simple snips Whether you want to start knitting right away or enjoy perusing each page in anticipation of your next project, you'll be inspired to unleash your own artistry with these 16 gloriously simple Fair Isle patterns.","torrent":{"xt":"urn:btih:a008df74c00964bef65dadb7e06d3eabbde7414c","amp;dn":"%5BKnit%5D+Fair+Isle+Sweaters+Simplified","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a008df74c00964bef65dadb7e06d3eabbde7414c","infoHashBuffer":{"type":"Buffer","data":[160,8,223,116,192,9,100,190,246,93,173,183,224,109,62,171,189,231,65,76]},"announce":[],"urlList":[]}}