{"title":"FSI Language Course - German - 1977 - Public Domain","uid":5528590,"size":1678032414,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a0385ab49c5059cbc5af7222a01d987986684f55&amp;dn=FSI+Language+Course+-+German+-+1977+-+Public+Domain&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Vern666","files":169,"time":1272861591,"description":"This is the German language course that was used at the US Foreign Service Institute (where US diplomats, etc. learned foreign languages) during the late 1970's and 1980's. It was paid for by US tax dollars and is in the US public domain, so you can download and share it freely and legally. Some nice person ripped the cassettes to mp3 and scanned the books to pdf. A web site put these up and got too much traffic. BitTorrent is the perfect solution -- the more people that download and share it, the better! This is downloaded from the site that was highlighted by LifeHacker in its article: http://lifehacker.com/5523114/foreign-service-institutes-extensive-language-courses-are-available-free-online I downloaded these files from: http://fsi-language-courses.org/Content.php This course includes the manuals from the ERIC site. I renamed them from the hex numbers so that the names make sense. This course includes pdf's ripped (figuratively speaking) from the manuals for the students and teacher and also mp3's ripped from audio tape. The quality is a little rough, but it is quite legible / audible. There are three sub-courses: Intro - For people with no German language experience Basic - The &quot;meat&quot; of the course Headstart - this has lessons on e.g. how to mail a letter and German culture Enjoy! Please seed to a ratio of 1.0. ","torrent":{"xt":"urn:btih:a0385ab49c5059cbc5af7222a01d987986684f55","amp;dn":"FSI+Language+Course+-+German+-+1977+-+Public+Domain","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0385ab49c5059cbc5af7222a01d987986684f55","infoHashBuffer":{"type":"Buffer","data":[160,56,90,180,156,80,89,203,197,175,114,34,160,29,152,121,134,104,79,85]},"announce":[],"urlList":[]}}