{"title":"The Know-it-All_ One Man's Humble Quest - Jacobs, A.J [Non-Ficti","uid":8615944,"size":4261502,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a05320c4180ee5f0a3cae8685c490d5bc1def859&amp;dn=The+Know-it-All_+One+Man%27s+Humble+Quest+-+Jacobs%2C+A.J+%5BNon-Ficti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"K-Slender","files":5,"time":1372207849,"description":"33,000 PAGES\n\n44 MILLION WORDS\n\n10 BILLION YEARS OF HISTORY\n\n1 OBSESSED MAN\n\nPart memoir and part education (or lack thereof), The Know-It-All chronicles NPR contributor A.J. Jacobs's hilarious, enlightening, and seemingly impossible quest to read the Encyclopaedia Britannica from A to Z.\n\nTo fill the ever-widening gaps in his Ivy League education, A.J. Jacobs sets for himself the daunting task of reading all thirty-two volumes of the Encyclopaedia Britannica. His wife, Julie, tells him it's a waste of time, his friends believe he is losing his mind, and his father, a brilliant attorney who had once attempted the same feat and quit somewhere around Borneo, is encouraging but unconvinced.\n\nWith self-deprecating wit and a disarming frankness, The Know-It-All recounts the unexpected and comically disruptive effects Operation Encyclopedia has on every part of Jacobs's life -- from his newly minted marriage to his complicated relationship with his father and the rest of his charmingly eccentric New York family to his day job as an editor at Esquire. Jacobs's project tests the outer limits of his stamina and forces him to explore the real meaning of intelligence as he endeavors to join Mensa, win a spot on Jeopardy!, and absorb 33,000 pages of learning. On his journey he stumbles upon some of the strangest, funniest, and most profound facts about every topic under the sun, all while battling fatigue, ridicule, and the paralyzing fear that attends his first real-life responsibility -- the impending birth of his first child.\n\nThe Know-It-All is an ingenious, mightily entertaining memoir of one man's intellect, neuroses, and obsessions, and a struggle between the all-consuming quest for factual knowledge and the undeniable gift of hard-won wisdom. ","torrent":{"xt":"urn:btih:a05320c4180ee5f0a3cae8685c490d5bc1def859","amp;dn":"The+Know-it-All_+One+Man%27s+Humble+Quest+-+Jacobs%2C+A.J+%5BNon-Ficti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a05320c4180ee5f0a3cae8685c490d5bc1def859","infoHashBuffer":{"type":"Buffer","data":[160,83,32,196,24,14,229,240,163,202,232,104,92,73,13,91,193,222,248,89]},"announce":[],"urlList":[]}}