{"title":"Liberalism is a Mental Disorder - Michael Savage","uid":11707136,"size":449620,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a14a89694c5242fffc37fa29cfddb1026451a714&amp;dn=Liberalism+is+a+Mental+Disorder+-+Michael+Savage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1424131357,"description":"\nDr. Savage, sage prophet of the airwaves, has been diagnosing liberal mental illness for more than a decade. Now, in his third and most insightful book, he strikes at the root of today's most desperate issues, providing a hefty dose of his unique conservative medicine, including:\n\n*Homeland security: &quot;We need more Patton and less patent leather. . .Real homeland security begins when we arrest, interrogate, jail, or deport known operatives within our own borders. . .One dirty bomb can ruin your whole day.&quot;\n*The ACLU, National Lawyers Guild, and MoveOn.org: &quot;I believe it's time for the heads of . . . left-wing agitation groups who are using the courts to impose their will on the sheeple to be prosecuted under the federal RICO statutes.&quot;\n*Illegal immigration: &quot;I envision an Oil for Illegals program. . .The president should demand one barrel of oil from Mexico for every illegal alien that sneaks into our country.&quot;\n\nThe Doctor is in and the diagnosis is clear. Read Liberalism is a Mental Disorder and find out what you can do to treat it.\n\n\nAbout the Author:\nMichael Savage continues to soar as the No. 1 New York Times author of the The Savage Nation, The Enemy Within, and Liberalism Is a Mental Disorder. His program, The Michael Savage Show, airs on four hundred radio stations coast to coast (including WOR in New York and KNEW in San Francisco) and enjoys ten million weekly listeners, the nation's third largest talk radio audience. A man of the people, Savage has labored as a factory worker, teacher, social worker, medicinal plant explorer, and biologist, earning master's degrees in both medical botany and medical anthropology and a Ph.D. in epidemiology and nutrition science from the University of California at Berkeley. He is the founder and director of the Paul Revere Society, which supports our nation's right to defend and protect its borders, language, and culture","torrent":{"xt":"urn:btih:a14a89694c5242fffc37fa29cfddb1026451a714","amp;dn":"Liberalism+is+a+Mental+Disorder+-+Michael+Savage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a14a89694c5242fffc37fa29cfddb1026451a714","infoHashBuffer":{"type":"Buffer","data":[161,74,137,105,76,82,66,255,252,55,250,41,207,221,177,2,100,81,167,20]},"announce":[],"urlList":[]}}