{"title":"Dark Horse The (Bette Davis) [1932] {Alien} @!^^ .avi","uid":4725209,"size":489127332,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a164faf248dd5e4e5f5d435311d9f4b592403bd9&amp;dn=Dark+Horse+The+%28Bette+Davis%29+%5B1932%5D+%7BAlien%7D+%40%21%5E%5E+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"alien99","files":1,"time":1234716427,"description":" \tWarren William\t ... \tHal Samson Blake\n\n\tBette Davis\t... \tKay Russell\n\tGuy Kibbee\t... \tZachary Hicks\n\tVivienne Osborne\tMaybelle Blake, Hal's ex-wife\n\tFrank McHugh\t... \tJoe\n\nI do see what my forebears saw in the youthful Bette Davis. She's splendid throughout this almost-madcap political comedy which actually stars Warren Williams as the political operative constantly behind on his alimony. Vivienne Osborne is brilliant as his ex, and I found myself rooting for her throughout. The Williams character is not at all sympathetic, and he's not even a decent op.\n\nGuy Kibbee is one of the best at what he does. As a candidate dragged out of his sleep at a political convention and nominated to be governor in order to prevent a rival candidate from being nominated, so this whole mess is borne of internecine political warfare in a party called the &quot;Progressive Party.&quot; If you're of a political mind, you will probably see a party other than the one with which you are affiliated reflected in the fictional &quot;Progressive Party&quot; of Williams and Kibbee. I could draw exact parallels, but we're not here for that.\nGuy Kibbee gives the viewer a lot of laughs. Like most candidates, he knows almost nothing. Warren William, a very, under rated actor, is superb in giving instructions to Kibbee; that is, he teaches him to say something which means nothing to the voting public. A campaign based on no comment, &quot;I'll take it under advisement,&quot; and &quot;Maybe yes, but then again, maybe no,&quot; is the nearly perfect way to win an election. Succinctly, the dumber the candidate, the greater the chance he or she will win. After all, the public can identify with such a person. With respect to the movie, it makes for a lot of comedy. ","torrent":{"xt":"urn:btih:a164faf248dd5e4e5f5d435311d9f4b592403bd9","amp;dn":"Dark+Horse+The+%28Bette+Davis%29+%5B1932%5D+%7BAlien%7D+%40%21%5E%5E+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a164faf248dd5e4e5f5d435311d9f4b592403bd9","infoHashBuffer":{"type":"Buffer","data":[161,100,250,242,72,221,94,78,95,93,67,83,17,217,244,181,146,64,59,217]},"announce":[],"urlList":[]}}