{"title":"A Rabbi Looks at Jesus of Nazareth - Jonathan Bernis","uid":11729923,"size":349853,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1a7feea240ed52d6d3009bed1fcc62b70cc0eef&amp;dn=A+Rabbi+Looks+at+Jesus+of+Nazareth+-+Jonathan+Bernis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1425253899,"description":"\n Raised in a traditional Jewish family, international television host Jonathan Bernis was taught from a young age that &quot;Jews don't-and can't!-believe in Jesus.&quot; Yet in his study of the Bible, including the Torah, he found overwhelming evidence that Jesus of Nazareth really was the Jewish Messiah. With warmth and transparency, Bernis talks about discovering Jesus in history, too, and how it was that the Jewish Yeshua became the Gentile Jesus. By presenting historic evidence that Jesus is Messiah and refuting common Jewish objections, Bernis gives Christians the knowledge and tools they need to share their Lord with their Jewish friends in a loving, effective way.\n\nAbout the author:\n Jonathan Bernis, president and CEO of Jewish Voice Ministries International, is the author of a number of popular books. He has been a leader in the Messianic Jewish Movement for over 30 years, serving as founding rabbi of congregations in Rochester, New York, and St. Petersburg, Russia. His weekly television show, Jewish Voice with Jonathan Bernis, is seen throughout the United States, Canada, Israel, the United Kingdom, Europe, and Asia. Jonathan has been interviewed on numerous media outlets, including Moody's In the Market with Janet Parshall and Chris Fabry Live! He and his family live in Phoenix, Arizona","torrent":{"xt":"urn:btih:a1a7feea240ed52d6d3009bed1fcc62b70cc0eef","amp;dn":"A+Rabbi+Looks+at+Jesus+of+Nazareth+-+Jonathan+Bernis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1a7feea240ed52d6d3009bed1fcc62b70cc0eef","infoHashBuffer":{"type":"Buffer","data":[161,167,254,234,36,14,213,45,109,48,9,190,209,252,198,43,112,204,14,239]},"announce":[],"urlList":[]}}