{"title":"The Beatles - Penny Lane [HQ original promo].VOB","uid":11538950,"size":191373312,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a1add7a227e5a46a28cae792056c83b3b80b4ac7&amp;dn=The+Beatles+-+Penny+Lane+%5BHQ+original+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1416655728,"description":"The Beatles - Penny Lane [HQ original promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Penny Lane&quot; is a song by the Beatles, written primarily by Paul McCartney. It was credited to Lennon-McCartney. \n\nRecorded during the Sgt. Pepper sessions, &quot;Penny Lane&quot; was released in February 1967 as one side of a double A-sided single, along with &quot;Strawberry Fields Forever&quot;. Both songs were later included on the Magical Mystery Tour LP (1967). The single was the result of the record company wanting a new release after several months of no new Beatles releases. \n\nThe song's title is derived from the name of a street near Lennon's childhood home for his first 5 years (Newcastle Road, just off Church Road), in the band's hometown, Liverpool. McCartney and Lennon would meet at Penny Lane junction in the Wavertree area to catch a bus into the centre of the city. At the time, in the 1960s, this was a significant bus terminus for several routes, and buses with &quot;Penny Lane&quot; displayed were common throughout Liverpool. The name Penny Lane is also used for the area that surrounds its junction with Smithdown Road, Smithdown Place (where the terminus was located) and Allerton Road, including a busy shopping area. Penny Lane is named after James Penny, an 18th century slave trader. \n\nThe promotional film for &quot;Penny Lane&quot; was, together with the video for &quot;Strawberry Fields Forever&quot;, one of the first examples of what later became known as a music video. The music video for the song was not filmed at Penny Lane, as the Beatles were reluctant to travel to Liverpool. Street scenes were filmed in and around Angel Lane in London's East End. The broken sequence of Lennon walking alone was filmed on the King's Road (at Markham Square) in Chelsea. The outdoor scenes were filmed at Knole Park in Sevenoaks on 30 January 1967.\n\nIn 2004, Rolling Stone ranked &quot;Penny Lane&quot; at #456 on its list of the 500 Greatest Songs of All Time.\n\n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Penny_Lane&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Penny_Lane&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/BaGbPaaGA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/BaGbPaaGA&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 7000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bits]\n   Duration: 00:03:01\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.7\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:a1add7a227e5a46a28cae792056c83b3b80b4ac7","amp;dn":"The+Beatles+-+Penny+Lane+%5BHQ+original+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1add7a227e5a46a28cae792056c83b3b80b4ac7","infoHashBuffer":{"type":"Buffer","data":[161,173,215,162,39,229,164,106,40,202,231,146,5,108,131,179,184,11,74,199]},"announce":[],"urlList":[]}}