{"title":"Fergie -- The Dutchess - Deluxe","uid":5854217,"size":541235685,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a235d0e3e6c771fb4348092441834284fe47ce51&amp;dn=Fergie+--+The+Dutchess+-+Deluxe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"ddawg","files":-1,"time":1285536143,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51oApblfdJL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51oApblfdJL._SS500_.jpg&lt;/a&gt;\n\n\nTitle: The Dutchess - Deluxe\nArtist: Fergie\nAudio CD (May 27, 2008) \nOriginal Release Date: 2008 \nNumber of Discs: 1 \nGenre: R&amp;B\nQuality: Lossless\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Fergalicious\n02. Clumsy\n03. All That I Got\n04. London Bridge\n05. Pedestal\n06. Voodoo Doll\n07. Glamorous\n08. Here I Come\n09. Velvet\n10. Big Girls Don't Cry\n11. Mary Jane Shoes\n12. Losing My Ground\n13. Finally\n14. Barracuda\n15. Party People\n16. Clumsy (Collinpark Remix)\n17. Labels or Love\n\n\nVideo Included:\n\nLondon Bridge.mpg\n\nAmazon Review:\nIf you thought Black Eyed Pea-sized bites of Fergie might be all you could handle -- that a full plate of Fergie is possibly too much for any discerning musical palate -- The Dutchess might change your mind. For here the lumpen lady throws caution to the wind and threads her pop needle with an ambitious ribbon of yet-to-be-conquered genres: reggae and ska on &quot;Mary Jane Shoes,&quot; with Rita Marley; vintage soul on &quot;Here I Come&quot;; '80s hip-hop on &quot;Fergalicious&quot;; and sophisticated R&amp;B on the John Legend-assisted &quot;Finally.&quot; It's a tremendous and unpredictable expenditure of effort that mostly pays off -- echoes of more talented vocalists like Pink, BeyoncÃƒÂ©, and Christina Aguilera poke through in places. But while unbridled messing about can pay handsome artistic dividends (here, the guitar-propelled rock-like track &quot;Big Girls Don't Cry&quot; coughs them up), ultimately it's when Fergie's at her Peas-iest that she's most lovable; cases in point are the raunchily irresistible &quot;London Bridge,&quot; which earned every week of its chart-topping success, and the will.i.am-assisted &quot;Clumsy,&quot; a girl-group-styled bump-a-thon that showcases Fergie's coolest and most distinctive asset--her personality -- to winning effect. \n\nAllmusic Review:\nThrough all the twists and turns taken by Stacy &quot;Fergie&quot; Ferguson during her 20-year career as an entertainer -- including a stint on Kids Incorporated, background vocals for Martika, two albums with adult contemporary/dance-pop group Wild Orchid, and superstardom with Black Eyed Peas -- she has always sounded as if she is trying really, really hard. That has been the lone consistent characteristic of her output, and it remains in effect throughout The Dutchess. An endurance test like few other pop albums issued during the early 2000s, The Dutchess has all the characteristics of a release fronted by someone who has been itching to go solo and prove herself, once and for all, as a versatile force all her own. Fergie does cartwheels and handstands, juggles three objects at once, balances books on her head, hangs upside down, rides a unicycle with her hands in the air -- all these things while wearing different outfits. The whole process, produced mostly by fellow Pea will.i.am, is mildly entertaining but tremendously taxing. There's throwback hip-hop (&quot;Fergalicious,&quot; done to the tune of J.J. Fad's &quot;Supersonic&quot;), throwback soul (&quot;Here I Come,&quot; done to the tune of the Temptations' &quot;Get Ready&quot;), reggae (&quot;Mary Jane Shoes&quot;), ska-punk (&quot;Mary Jane Shoes&quot;), scat (&quot;Mary Jane Shoes&quot;), vaguely torchy midtempo fluff (&quot;Velvet&quot;), and a classy string-drenched ballad (the appropriately titled &quot;Finally&quot;), among several other passable switch-ups, but none of them has any lasting (or even immediate) value, with the possible exception of the inexplicably asinine &quot;London Bridge&quot; -- which is terrific, provided you can block out the lyrics or prevent yourself from trying to decipher its meaning. Somewhat ironically, one of the more convincing songs on the album, &quot;Big Girls Don't Cry,&quot; sounds exactly like a 2006 version of Wild Orchid, with Fergie's Taylor Dayne kid-sister act in full effect. [The &quot;Deluxe&quot; version of the album, released in 2008, adds four bonus tracks.] \n \n","torrent":{"xt":"urn:btih:a235d0e3e6c771fb4348092441834284fe47ce51","amp;dn":"Fergie+--+The+Dutchess+-+Deluxe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a235d0e3e6c771fb4348092441834284fe47ce51","infoHashBuffer":{"type":"Buffer","data":[162,53,208,227,230,199,113,251,67,72,9,36,65,131,66,132,254,71,206,81]},"announce":[],"urlList":[]}}