{"title":"Blondie 24 Bit Vinyl Pack","uid":9035537,"size":7982024180,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a3517da3a5c85e90d1a720c99a69b15df8ac24ec&amp;dn=Blondie+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"politux","files":-1,"time":1381497837,"description":"\n  Blondie 24 Bit Vinyl Pack\n\n  Genres: Pop/Rock, Electronic\n  Styles: New Wave, Punk, Dance-Rock\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 5,600 kbps\n  Bit Depth: 24\n  Sampling Rates: 192,000 Hz\n\n  1978 Parallel Lines (Germany)\n  1979 Eat to the Beat (Japan)\n  1980 AutoAmerican (Japan)\n  1988 Atomic '98 (Promo)\n  2011 Panic of Girls (UK)\n\n  Blondie was the most commercially successful band to emerge from the much-vaunted punk/new wave movement of the late '70s. The group was formed in New York City in August 1974 by singer Deborah Harry (b. July 1, 1945, Miami, Florida), formerly of Wind in the Willows, and guitarist Chris Stein (b. January 5, 1950, Brooklyn, New York) out of the remnants of Harry's previous group, the Stilettos. The lineup fluctuated over the next year. Drummer Clement Burke (b. November 24, 1955, New York) joined in May 1975. Bassist Gary Valentine joined in August. In October, keyboard player James Destri (b. April 13, 1954) joined, completing the initial permanent lineup. They released their first album, Blondie, on Private Stock Records in December 1976. In July 1977, Valentine was replaced by Frank Infante.\n\n  In August, Chrysalis Records bought their contract from Private Stock and in October reissued Blondie and released the second album, Plastic Letters. Blondie expanded to a sextet in November with the addition of bassist Nigel Harrison (born in Princes Risborough, Buckinghamshire, England), as Infante switched to guitar. Blondie broke commercially in the U.K. in March 1978, when their cover of Randy and the Rainbows' 1963 hit &quot;Denise,&quot; renamed &quot;Denis,&quot; became a Top Ten hit, as did Plastic Letters, followed by a second U.K. Top Ten, &quot;(I'm Always Touched by Your) Presence, Dear.&quot; Blondie turned to U.K. producer/songwriter Mike Chapman for their third album, Parallel Lines, which was released in September 1978 and eventually broke them worldwide. &quot;Picture This&quot; became a U.K. Top 40 hit, and &quot;Hanging on the Telephone&quot; made the U.K. Top Ten, but it was the album's third single, the disco-influenced &quot;Heart of Glass,&quot; that took Blondie to number one in both the U.K. and the U.S. &quot;Sunday Girl&quot; hit number one in the U.K. in May, and &quot;One Way or Another&quot; hit the U.S. Top 40 in August. Blondie followed with their fourth album, Eat to the Beat, in October. Its first single, &quot;Dreaming,&quot; went Top Ten in the U.K., Top 40 in the U.S. The second U.K. single, &quot;Union City Blue,&quot; went Top 40. In March 1980, the third U.K. single from Eat to the Beat, &quot;Atomic,&quot; became the group's third British number one. (It later made the U.S. Top 40.)\n\n  Meanwhile, Harry was collaborating with German disco producer Giorgio Moroder on &quot;Call Me,&quot; the theme from the movie American Gigolo. It became Blondie's second transatlantic chart-topper. Blondie's fifth album, Autoamerican, was released in November 1980, and its first single was the reggae-ish tune &quot;The Tide Is High,&quot; which went to number one in the U.S. and U.K. The second single was the rap-oriented &quot;Rapture,&quot; which topped the U.S. pop charts and went Top Ten in the U.K. But the band's eclectic style reflected a diminished participation by its members: Infante sued, charging that he wasn't being used on the records, though he settled and stayed in the lineup. But in 1981, the members of Blondie worked on individual projects, notably Harry's gold-selling solo album, KooKoo. The Best of Blondie was released in the fall of the year. The Hunter, Blondie's sixth album, was released in May 1982, preceded by the single &quot;Island of Lost Souls,&quot; a Top 40 hit in the U.S. and U.K. &quot;War Child&quot; also became a Top 40 hit in the U.K., but The Hunter was a commercial disappointment.\n\n  At the same time, Stein became seriously ill with the genetic disease pemphigus. As a result, Blondie broke up in October 1982, with Deborah Harry launching a part-time solo career while caring for Stein, who eventually recovered. In 1998, the original lineup of Harry, Stein, Destri, and Burke reunited to tour Europe, their first series of dates in 16 years; a new LP, No Exit, followed early the next year. After more touring, this was followed by another studio set, The Curse of Blondie, in 2003, and a DVD of the Live by Request program from A&amp;E was released in 2004. In 2006, Blondie celebrated their 30th anniversary with their induction into the Rock &amp; Roll Hall of Fame and the release of Greatest Hits: Sound &amp; Vision, a best-of collection that contained all their classic videos as well. They also got back to work on original material, decamping to upstate New York in October 2009 to start recording a new studio album. Additional sessions were held in Hoboken, and the resulting Panic of Girls was released in July 2011.","torrent":{"xt":"urn:btih:a3517da3a5c85e90d1a720c99a69b15df8ac24ec","amp;dn":"Blondie+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3517da3a5c85e90d1a720c99a69b15df8ac24ec","infoHashBuffer":{"type":"Buffer","data":[163,81,125,163,165,200,94,144,209,167,32,201,154,105,177,93,248,172,36,236]},"announce":[],"urlList":[]}}