{"title":"The New Fly Fishing Basics","uid":5251005,"size":715481520,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a37798747b597e2e4d660cb597966a8c58255029&amp;dn=The+New+Fly+Fishing+Basics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"tmandorfer","files":-1,"time":1262356044,"description":"Detailed instruction is provided by ESPN's Jim and Kelly Watt who hosted their Fly Fishing Video Magazine TV show for almost a decade. From casting for freshwater trout in small mountain streams to saltwater fly fishing for Sailfish and Marlin, this instructional program is the product of over 50 years experience gained from fly fishing every conceivable location and situation possible. Segments of the program cover the essentials of fly fishing equipment and setup such as choosing the right rod, line choices for every situation, knots and fly styles. Lessons and examples include basic casting techniques, expert casts for difficult situations and the proper way to fish lakes, streams and rivers. The program also provides step-by-step lessons for basic fly tying. Easy to understand instructions on tying a streamer, basic dry fly and Nymph are presented. Subject details include: Basic Fishing Techniques - Lakes, Streams, Rivers and Entomology; Basic Casting Techniques - Roll Cast, Simple Pick/Set Down, False Casting, Shooting Line Cast; Knots - Nail Knot, Leader to Leader Knot, Double Overhand/Surgeon\u001as Knot, Leader to Fly Knot, Improved Clinch Knot; Equipment - Rods, Reels, Fly Lines, Leaders, Flies, Stuff, Waders, Vest, Tools, and more; Basic Fly Tying - Fly tying tools, vises, hooks, learn to tie a Nymph, Woolley Bugger Streamer and a Basic Dry Fly; Advanced Techniques - Double Haul, Open Loop Cast for Nymphing, Sink Tip Lines, Reach Cast, Slack Line Cast, \u001aS\u001a Cast, Jump Roll Cast, Mending, Downstream Drift, Wind Casts from the Front, Rod Side, Behind, Roll Cast and Backhand; Choosing the right rod; Line choice for every situation; Knots.\n\nIf you are interested in getting into fly fishing or have just started, this will give you a better understanding of the sport. Enjoy!\n\nThis is a DVD rip I got off of mega upload, quality is V/10, audio A/10.\n\nFile Format is .RAR","torrent":{"xt":"urn:btih:a37798747b597e2e4d660cb597966a8c58255029","amp;dn":"The+New+Fly+Fishing+Basics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a37798747b597e2e4d660cb597966a8c58255029","infoHashBuffer":{"type":"Buffer","data":[163,119,152,116,123,89,126,46,77,102,12,181,151,150,106,140,88,37,80,41]},"announce":[],"urlList":[]}}