{"title":"The Looming Tower (Vingate) eBook MOBI and OPF","uid":8631732,"size":2647328,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a39397b455356a9cc6fca605823caa3ae9a539d9&amp;dn=The+Looming+Tower+%28Vingate%29+eBook+MOBI+and+OPF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"LUHDriver","files":3,"time":1372642246,"description":"Included in this torrent are the OPF and MOBI versions of &quot;The Looming Tower&quot; by Lawrence Wright.  I have stripped the DRM from both files.  If you, like many Americans, wonder how our world has gotten to where it is today with the constant fear of terrorism is an everyday reality, then this book is a MUST READ.  \n\n\nThe Looming Tower: Al-Qaeda and the Road to 9/11 is a historical look at the way in which Al-Qaeda came into being, the background for various terrorist attacks and how they were investigated, and the events that led to the September 11 attacks. The book was written by Lawrence Wright, and he received a Pulitzer Prize for General Non-Fiction for it.\n\n\nOVERVIEW:\n\nThe Looming Tower is largely focused on the people involved; what they were like, why they did what they did, and how they interacted. The book starts with Sayyid Qutb, an Egyptian religious scholar who visited the United States in the late 1940s and returned to his home to become an anti-West Islamist and eventually a martyr for his beliefs. There is also a portrait of Ayman al-Zawahiri, from his childhood in Egypt to his participation in and later leadership of Egyptian Islamic Jihad to his merging of his organization with Al Qaeda.\n\nOsama bin Laden is the person described the most, from his childhood in Saudi Arabia in a rich family, his participation in the jihad against the Soviet Union in Afghanistan, his role as a financier of terrorist groups, his stay in Sudan, his return to Afghanistan and his interactions with the Taliban. The 1998 United States embassy bombings in Dar es Salaam, Tanzania and Nairobi, Kenya are described, as is the bombing of the USS Cole in 2000.\n\nLawrence Wright also describes in detail some of the Americans involved, in particular Richard A. Clarke, chief counter-terrorism adviser on the U.S. National Security Council, and John P. O'Neill, an Assistant Deputy Director of Investigation for the FBI who served as America's top bin Laden hunter until his retirement from the FBI in August 2001, after which he got a job as head of security at the World Trade Center, where he died in the 9/11 attacks.\n\nThe book also describes some of the problems with lack of cooperation between the FBI and the CIA and other American government organizations that prevented them from uncovering the 9/11 plot in time.\n\nBecause The Looming Tower is to a large extent focused on telling the story of the people involved it does not describe the 9/11 plot and its execution in much detail. It focuses more on the background and the conditions that produced the people who planned and staged the attack, and information about those who were combating terror against the USA.","torrent":{"xt":"urn:btih:a39397b455356a9cc6fca605823caa3ae9a539d9","amp;dn":"The+Looming+Tower+%28Vingate%29+eBook+MOBI+and+OPF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a39397b455356a9cc6fca605823caa3ae9a539d9","infoHashBuffer":{"type":"Buffer","data":[163,147,151,180,85,53,106,156,198,252,166,5,130,60,170,58,233,165,57,217]},"announce":[],"urlList":[]}}