{"title":"Christianity Is Not Great: How Faith Fails (2014) epub","uid":11190744,"size":1797737,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a3ea35325f17ae9b051387d6c80fdd6b6eca6a15&amp;dn=Christianity+Is+Not+Great%3A+How+Faith+Fails+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1412990278,"description":"\n In this new anthology critiquing Christianity, John Loftus--a former minister and now a leading atheist--has brought together an outstanding group of respected scholars who focus on the harms caused by the world's leading religion. \n\n The contributors begin by dissecting the many problematic aspects of religious faith generally. They repeatedly demonstrate that, with faith as a foundation, almost anything can be believed or denied. And almost any horrific deed can be committed. The authors then take a good hard look at many of the most important political, institutional, scientific, social, and moral harms committed in the name of Christianity. These range from the historical persecutions of the Inquisition and witch hunts to the current health hazards of faith healing.\n\n Finally, the authors answer three common Christian retorts to criticisms from nonbelievers: (1) that atheists cannot judge a harmful action without an objective moral standard; (2) that atheists need faith to solve the world's problems; and (3) that atheists cannot live a good life without faith.\n\n Loftus and the contributors generally conclude that, given both the well-documented historical record and ongoing problems raised by the faith, Christianity decisively fails empirical tests of its usefulness to humanity.\n","torrent":{"xt":"urn:btih:a3ea35325f17ae9b051387d6c80fdd6b6eca6a15","amp;dn":"Christianity+Is+Not+Great%3A+How+Faith+Fails+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3ea35325f17ae9b051387d6c80fdd6b6eca6a15","infoHashBuffer":{"type":"Buffer","data":[163,234,53,50,95,23,174,155,5,19,135,214,200,15,221,107,110,202,106,21]},"announce":[],"urlList":[]}}