{"title":"The Romanov Sisters - Helen Rappaport - Audiobook MP3","uid":10561286,"size":387926597,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a3f59264fdfea3acf40a7aa5702921b20d7d557e&amp;dn=The+Romanov+Sisters+-+Helen+Rappaport+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Squiddy82","files":-1,"time":1405459352,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Romanov Sisters: The Lost Lives of the Daughters of Nicholas and Alexandra\n\nWritten by: Helen Rappaport\nNarrated by: Xe Sands\nLength: 13 hrs and 25 mins\nFormat: Unabridged\nRelease Date:07-09-14\n\nThey were the Princess Dianas of their day - perhaps the most photographed and talked about young royals of the early 20th century. The four captivating Russian Grand Duchesses - Olga, Tatiana, Maria, and Anastasia Romanov - were much admired for their happy dispositions, their looks, the clothes they wore, and their privileged lifestyle. Over the years, the story of the four Romanov sisters and their tragic end in a basement at Ekaterinburg in 1918 has clouded our view of them, leading to a mass of sentimental and idealized hagiography. With this treasure trove of diaries and letters from the grand duchesses to their friends and family, we learn that they were intelligent, sensitive, and perceptive witnesses to the dark turmoil within their immediate family and the ominous approach of the Russian Revolution - the nightmare that would sweep their world away and them along with it.\n\nThe Romanov Sisters sets out to capture the joy as well as the insecurities and poignancy of those young lives against the backdrop of the dying days of late Imperial Russia, World War I, and the Russian Revolution. Helen Rappaport aims to present a new and challenging take on the story, drawing extensively on previously unseen or unpublished letters, diaries, and archival sources, as well as private collections. It is a book that will surprise people, even aficionados. ","torrent":{"xt":"urn:btih:a3f59264fdfea3acf40a7aa5702921b20d7d557e","amp;dn":"The+Romanov+Sisters+-+Helen+Rappaport+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3f59264fdfea3acf40a7aa5702921b20d7d557e","infoHashBuffer":{"type":"Buffer","data":[163,245,146,100,253,254,163,172,244,10,122,165,112,41,33,178,13,125,85,126]},"announce":[],"urlList":[]}}