{"title":"Allen Toussaint - 2009 - The Bright Mississippi FLAC","uid":8953612,"size":278793625,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a3f6c7aa783ff4d59e37688d1314427c06a72ab9&amp;dn=Allen+Toussaint+-+2009+-+The+Bright+Mississippi+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"eika256","files":-1,"time":1379952339,"description":"Allen Toussaint - 2009 - The Bright Mississippi\n\nThe Bright Mississippi stands alone among Allen Toussaint albums. Technically, it is not his first jazz album, for in 2005 he released Going Places on the small CD Baby-distributed Captivating Recording Technologies, a label run by his son Reginald, but for most intents and purposes -- and for most listeners -- The Bright Mississippi might as well be his first foray into jazz, since it's the first to get a major-label production and release as it's a de facto sequel to Toussaint's successful, high-profile, 2006 duet album with Elvis Costello, The River in Reverse. Like that record, The Bright Mississippi is produced by Joe Henry, who has a knack for a sound that's clean yet soulful, one that lets the music breathe but still has heft to it. Henry teams Toussaint with a cast of heavy hitters -- including clarinetist Don Byron, trumpeter Nicholas Payton, guitarist Marc Ribot and, on a track a piece, pianist Brad Mehldau and saxophonist Joshua Redman -- to support the pianist on a run through jazz standards ranging from Duke Ellington and Django Reinhardt to Louis Armstrong and Thelonious Monk, whose 1963 classic provides the album its title. Everybody has a little bit where they shine, but this is thoroughly Toussaint's showcase, a place where he can ease back and string together New Orleans jazz and R&amp;B in his own elegant fashion. And what impresses most about Bright Mississippi is that although straight-out jazz is uncommon in Toussaint's work, this neither feels unfamiliar or like a stretch. His signature runs and smooth grooves can be heard throughout the album, but the relaxed nature of the sessions makes it easier than ever to hear what an idiosyncratic, inventive instrumentalist he is, and that is a quality that's more evident upon repeated plays. Upon the first listen, The Bright Mississippi merely seems like a joyous good time, but subsequent spins focus attention on just how rich and multi-layered this wonderful music is. (AllMusic)\n\nTrack list:\n01 - Egyptian Fantasy\n02 - A Dear Old Southland\n03 - St. James Infirmary\n04 - Singin' The Blues\n05 - Winin' Boy Blues\n06 - West End Blues\n07 - Blue Drag\n08 - Just A Closer Walk With Thee\n09 - The Bright Mississippi\n10 - Day Dream\n11 - Long Long Journey\n12 - Solitude\n\nPersonnel:\nAllen Toussaint: piano, vocals\nDon Byron: clarinet\nNicholas Payton: trumpet\nMarc Ribot: acoustic guitar\nDavid Piltch: bass\nJay Bellerose: drums and percussion\nBrad Mehldau: piano\nJoshua Redman: tenor saxophone.\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:a3f6c7aa783ff4d59e37688d1314427c06a72ab9","amp;dn":"Allen+Toussaint+-+2009+-+The+Bright+Mississippi+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3f6c7aa783ff4d59e37688d1314427c06a72ab9","infoHashBuffer":{"type":"Buffer","data":[163,246,199,170,120,63,244,213,158,55,104,141,19,20,66,124,6,167,42,185]},"announce":[],"urlList":[]}}