{"title":"The Sarah Jane Adventures - Season 04 (2010) - 12 Episodes","uid":10817531,"size":2599183475,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a4717b887b12af3cde7d7c8000598aa7e5a1b6c0&amp;dn=The+Sarah+Jane+Adventures+-+Season+04+%282010%29+-+12+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"bnaron","files":-1,"time":1408481787,"description":"The Sarah Jane Adventures - Season 04 (2010) - 12 Episodes\n\n\nSeries Description Courtesy Of:\n\nWikipedia, the free encyclopedia &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Sarah_Jane_Adventures&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Sarah_Jane_Adventures&lt;/a&gt;\n\n\nNOTE: Possible Episode Spoilers Below.  Do not read the synopses if it might ruin your viewing experience. You HAVE been warned!\n\n\nThe Sarah Jane Adventures is a British science fiction television program, produced by BBC Cymru Wales for CBBC, created by Russell T Davies and starred Elisabeth Sladen. The program is a spin-off of the long-running BBC science fiction program Doctor Who and focuses on the adventures of Sarah Jane Smith, a middle-aged investigative journalist who, in her youth, had numerous adventures across time and space. The series debuted on BBC One with a 60-minute special, &quot;Invasion of the Bane&quot;, on 1 January 2007, and broadcast through to 2011. It was nominated for a British Academy Children's Award in 2008 in the Drama category, and for a BAFTA Cymru in 2009 in the Children's Drama category. The program won a Royal Television Society 2010 award for Best Children's Drama\n\nPhil Ford, Rupert Laight and Joseph Lidster return as writers for the series, as does Gareth Roberts, writing two stories, one on his own and another with Clayton Hickman (former editor of Doctor Who Magazine).\n\nMatt Smith guest stars as the Eleventh Doctor in episodes 5 and 6, the story entitled 'Death of The Doctor', along with Katy Manning, who reprises her role as the Third Doctor's companion Jo Grant. The story was written by former Doctor Who showrunner and Sarah Jane Adventures creator Russell T Davies, the first time he has written for the Eleventh Doctor. It also includes the series' first (and last) visit to an alien planet.\n\nAt the end of the second episode of this series, Luke Smith goes to Oxford University, and K-9 accompanies him.\n\nJocelyn Jee Esien reprises her role as Clyde's mum Carla, having only previously appeared in 2008's 'The Mark of the Berserker.'\n\n\nEpisode Synopses Courtesy Of:\n\nThe On-line TV Database\nAn Open Database for Television Fans\nwww.thetvdb.com\n\n\n2010-10-11 - The Nightmare Man (1) (Video:H.264, 624x352, 981kbps, 25fps - Audio:AAC, 44.1kHz, 105kbps)\n\nWhen Luke has his first nightmare, he's haunted by a dark figure from his dreams. A strange entity is reaching out to our world, with terrible consequences for the whole human race. Luke faces life-changing events, and Bannerman Road will never be the same again. \n\n\n2010-10-12 - The Nightmare Man (2) (Video:H.264, 624x352, 984kbps, 25fps - Audio:AAC, 44.1kHz, 106kbps)\n\nWith Luke, Clyde and Rani trapped in a bizarre dreamscape, Sarah Jane must fight alone. As the Nightmare Man grows stronger, only K-9 might hold the key. But can Luke summon the courage to face his adult life before the whole world is trapped in an endless nightmare?\n\n\n2010-10-18 - The Vault of Secrets (1) (Video:H.264, 624x352, 989kbps, 25fps - Audio:AAC, 44.1kHz, 103kbps)\n\nAndrovax the Veil returns to Earth and asks for the gangs help, but how can they trust him? Or is the threat posed by the Vault of Secrets great enough to overcome old enmities. And when the android guardians threaten destruction, is there really any other choice?\n\n\n2010-10-19 - The Vault of Secrets (2) (Video:H.264, 624x352, 988kbps, 25fps - Audio:AAC, 44.1kHz, 104kbps)\n\nWhen an old enemy, Androvax the Veil, returns to Earth asking for help, the gang face a dilemma, should they trust him? Or does the legendary Vault hold an even greater terror? But a second threat arises, when android guardians threaten to destroy anyone who uncovers their secrets. As the battle between Sarah Jane, Androvax and the androids reaches its climax, Rani has to save her own mother from being caught in the crossfire. But as the Vault opens the destiny of the entire Veil  species is at stake. Is it too late to save them? \n\n\n2010-10-25 - Death of the Doctor (1) (Video:H.264, 624x352, 988kbps, 25fps - Audio:AAC, 44.1kHz, 105kbps)\n\nOld Companions Sarah Jane Smith and Jo Grant meet for the first time to discover the truth when the Doctor is declared dead. An interstellar conspiracy gathers around UNIT Head Quarters as Clyde finds that he holds the fate of the Time Lord in his hand.\n\n\n2010-10-26 - Death of the Doctor (2) (Video:H.264, 624x352, 989kbps, 25fps - Audio:AAC, 44.1kHz, 107kbps)\n\nOld friends fight together - but is it too late to stop the sinister Shansheeth? \n\n\n2010-11-01 - The Empty Planet (1) (Video:H.264, 624x352, 990kbps, 25fps - Audio:AAC, 44.1kHz, 102kbps)\n\nClyde and Rani awake to find they are the only humans on Earth, even Sarah Jane Smith has vanished. But the Earth is not deserted, stalking the streets of London, strange forces gather.\n\n\n2010-11-02 - The Empty Planet (2) (Video:H.264, 624x352, 989kbps, 25fps - Audio:AAC, 44.1kHz, 105kbps)\n\nClyde and Rani only just manage to escape from the robots. Regrouping with Gavin in a cafe, Clyde deduces that he and Rani were left behind after the robots abducted everyone else because of the two of them having been 'grounded' by the Judoon, although this fails to explain Gavin's continued presence. When Gavin runs off again, Rani and Clyde are confronted by the robots, who explain that they want the 'son and heir' (Although Clyde initially assumes that they want Earth's sun and air); Gavin's father - who he mentioned left his mother when he was young - was an alien prince, and with his father's recent death Gavin is the only viable heir to the throne. Tracking Gavin down, Clyde and Rani explain the situation to him, convincing him to remove a ring that his father gave his mother to give to him; the ring acted as a bio-damper that prevented anyone from detecting his alien heritage. With the ring removed, the robots can sense him, and he agrees to accompany them back to his father's world, his last actions on Earth being to name Clyde and Rani a Lord and Lady of his people. With Earth's population returned - having been sent to a 'warp shunt' while the robots searched - Sarah and Mr Smith create the necessary records to state that Gavin has moved to Australia, Sarah praising Clyde and Rani's accomplishments even when they were alone.arah Jane claims to still remain dubious about the existence of the spirit world. \n\n\n2010-11-08 - Lost in Time (1) (Video:H.264, 624x352, 990kbps, 25fps - Audio:AAC, 44.1kHz, 101kbps)\n\nA harmless investigation turns into an epic quest across time and space. \n\n\n2010-11-09 - Lost in Time (2) (Video:H.264, 624x352, 990kbps, 25fps - Audio:AAC, 44.1kHz, 104kbps)\n\nSarah Jane, Clyde and Rani fight across the centuries to be reunited.\n\n\n2010-11-15 - Goodbye, Sarah Jane Smith (1) (Video:H.264, 624x352, 991kbps, 25fps - Audio:AAC, 44.1kHz, 103kbps)\n\nNo one can defend the earth forever, but who could ever replace Sarah Jane? \n\n\n2010-11-16 - Goodbye, Sarah Jane Smith (2) (Video:H.264, 608x342, 991kbps, 25fps - Audio:AAC, 44.1kHz, 105kbps)\n\nSarah Jane has gone for good, and a new regime begins at Bannerman Road!\n\n\n\n\n","torrent":{"xt":"urn:btih:a4717b887b12af3cde7d7c8000598aa7e5a1b6c0","amp;dn":"The+Sarah+Jane+Adventures+-+Season+04+%282010%29+-+12+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4717b887b12af3cde7d7c8000598aa7e5a1b6c0","infoHashBuffer":{"type":"Buffer","data":[164,113,123,136,123,18,175,60,222,125,124,128,0,89,138,167,229,161,182,192]},"announce":[],"urlList":[]}}