{"title":"THE TIME TRAVELER'S WIFE (2009) WITH GR SUBS","uid":9697540,"size":732594392,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a49131592fa571999ea6804cf5af33a6a25a1f87&amp;dn=THE+TIME+TRAVELER%27S+WIFE+%282009%29+WITH+GR+SUBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dgk1961","files":2,"time":1393956372,"description":"The Time Traveler's Wife (2009)\n107 min  -  Drama | Fantasy | Romance  -  14 August 2009 (USA)\n\nA romantic drama about a Chicago librarian with a gene that causes him to involuntarily time travel, and the complications it creates for his marriage.\n\nDirector: Robert Schwentke\nWriters: Bruce Joel Rubin (screenplay), Audrey Niffenegger (novel)\nStars: Eric Bana, Rachel McAdams, Ron Livingston\n\n\nThe Time Traveler's Wife is the debut novel of American author Audrey Niffenegger, published in 2003. It is a love story about a man with a genetic disorder that causes him to time travel unpredictably, and about his wife, an artist, who has to cope with his frequent absences and dangerous experiences. Niffenegger, frustrated in love when she began the work, wrote the story as a metaphor for her failed relationships. The tale's central relationship came to her suddenly and subsequently supplied the novel's title. The novel, which has been classified as both science fiction and romance, examines issues of love, loss, and free will. In particular, it uses time travel to explore miscommunication and distance in relationships, while also investigating deeper existential questions.\n\nAs a first-time novelist, Niffenegger had trouble finding a literary agent. She eventually sent the novel to MacAdam/Cage unsolicited and, after an auction took place for the rights, Niffenegger selected them as her publishers. The book became a bestseller after an endorsement from author and family friend Scott Turow on The Today Show, and as of March 2009 had sold nearly 2.5 million copies in the United States and the United Kingdom. Many reviewers were impressed with Niffenegger's unique perspectives on time travel. Some praised her characterization of the couple, applauding their emotional depth; others criticized her writing style as melodramatic and the plot as emotionally trite. The novel won the Exclusive Books Boeke Prize and a British Book Award. A film version was released in August 2009.","torrent":{"xt":"urn:btih:a49131592fa571999ea6804cf5af33a6a25a1f87","amp;dn":"THE+TIME+TRAVELER%27S+WIFE+%282009%29+WITH+GR+SUBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a49131592fa571999ea6804cf5af33a6a25a1f87","infoHashBuffer":{"type":"Buffer","data":[164,145,49,89,47,165,113,153,158,166,128,76,245,175,51,166,162,90,31,135]},"announce":[],"urlList":[]}}