{"title":"Hydra Pro","uid":8513547,"size":8826649,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:a5c19fc57dc21380cd5c1800199669377d2e3885&amp;dn=Hydra+Pro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":1,"time":1369645901,"description":"Hydra Pro is the ideal application for easily creating artistic or realistic HDR images from up to 7 shots with different exposures.\n\nAre your photographs different from what your eyes actually see?\nThis is because a single photograph cannot represent the full gamut of light due to the physical limitations in the sensor. It's not your fault!\n\nâ˜… Hydra is the solution\nHydra provides human eye-like perception to your photographs by allowing you to create High Dynamic Range (HDR) images from a series of regular photographs (up to 7), either from DSLRs or traditional point-and-shoot cameras. The output produced by Hydra is much closer to what your eyes actually see.\n\nâ˜… How does it work?\n1. Take several pictures of the same scene, changing the exposure value between the shots.\n2. Import your pictures into Hydra.\n3. Prepare the Photo: check if the images are correctly aligned, crop the image, and remove the ghost effect that could be visible on the image.\n4. Develop the Photo: Select a preset, or adjust the output image (brightness, saturation, hue...).\n5. Render the HDR image, and share with the world through Twitter,Flickr, Mail...\n\nâ˜… Which Features?\n- Processing Pipeline &amp; Real-time Preview: Hydra first aligns the imported images, and then merges them in a smart way to preserve the interesting inputs of each image. This allows you to tune parameters in real time while observing the changing result until you are satisfied, and then render the full resolution image in less than one minute. Resolutions above 20 Mega Pixels supported.\n- No tripod required: Unlike most HDR software, Hydra does not require pictures taken with a tripod. Thanks to this unique feature, you can take photos anywhere to later merge them in Hydra.\n- HDR from a single RAW image: You can also import a single RAW photograph into Hydra, apply tone mapping, and render an HDR image.\n- Ghost handling: if an object moves across the different exposures, you'll get a ghost effect on the HDR image. Hydra enables you to select areas where you don't want to use all images for composition.\n\nâ˜… Main Differences with the Express Version\nFollowing features are only available in Hydra Pro:\n- Import up to 7 shots to create an HDR image (only 3 in the Express version)\n- Batch Processing\n- Probe-based adjustments: probes are used to select areas based on distance/color/brightness tolerance\n\nUser Guide available on the iBookstore: http://itunes.apple.com/be/book/user-guide-for-hydra-3/id540751427?l=fr&amp;mt=11\n\nApp Store Link: https://itunes.apple.com/app/id467371061\n\n__Thanks to AJhacks for the crack!__\n\nEnjoy!","torrent":{"xt":"urn:btih:a5c19fc57dc21380cd5c1800199669377d2e3885","amp;dn":"Hydra+Pro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5c19fc57dc21380cd5c1800199669377d2e3885","infoHashBuffer":{"type":"Buffer","data":[165,193,159,197,125,194,19,128,205,92,24,0,25,150,105,55,125,46,56,133]},"announce":[],"urlList":[]}}