{"title":"Art as design, design as art - a contemporary guide (Art Ebook).","uid":11228887,"size":10073977,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a5e9cdab9dd93050f85efce32df8524e5572d2a0&amp;dn=Art+as+design%2C+design+as+art+-+a+contemporary+guide+%28Art+Ebook%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1413495476,"description":"Pdf / English / 1970 / 155 pages / 9.6 MB\n\nArt and design today are as varied, fascinating, and Introduction sometimes confusing as the world we live in. Never before in man's long history have so many people created and designed such a vast array of objects. More paintings and sculptures are made today than were created during the Renaissance.\n\nIn one field of modern creativity every one of us is involved in a revolution more powerful and far reaching than any other taking place today. This field, the media of communication, including films, all graphic art, and, most importantly, television, is the most powerful force in the changes that are daily taking place and that directly affect the lives of everyone, educated or uneducated, young or old. The average adult will pass from ten to fifteen years watching television.\n\nArt and serious design are not just static bodies of material preserved intact and taught without reference to the rest of reality. Students often know more about\nwhat is happening than teachers do. By high school many young people talk easily about psychedelic art, multimedia, and happenings, Ideas that are foreign to many adults, including educators. One fact is clear: art is important as it never has been before. We cannot think of art as merely a good thing to know about, a refined adjunct to the real problems of living. Art is no longer to be found only in galleries and museums. The art developing today, much of it in the hands of young people, is a central life style","torrent":{"xt":"urn:btih:a5e9cdab9dd93050f85efce32df8524e5572d2a0","amp;dn":"Art+as+design%2C+design+as+art+-+a+contemporary+guide+%28Art+Ebook%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5e9cdab9dd93050f85efce32df8524e5572d2a0","infoHashBuffer":{"type":"Buffer","data":[165,233,205,171,157,217,48,80,248,94,252,227,45,248,82,78,85,114,210,160]},"announce":[],"urlList":[]}}