{"title":"A.J. Jacobs - The Year of Living Biblically","uid":4781843,"size":282247168,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a63c209d38400737edebf9e2d6b61ca0a2e8c442&amp;dn=A.J.+Jacobs+-+The+Year+of+Living+Biblically&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"eqisow","files":1,"time":1237409288,"description":"From Publishers Weekly\n\nWhat would it require for a person to live all the commandments of the Bible for an entire year? That is the question that animates this hilarious, quixotic, thought-provoking memoir from Jacobs (The Know-It-All). He didn't just keep the Bible's better-known moral laws (being honest, tithing to charity and trying to curb his lust), but also the obscure and unfathomable ones: not mixing wool with linen in his clothing; calling the days of the week by their ordinal numbers to avoid voicing the names of pagan gods; trying his hand at a 10-string harp; growing a ZZ Top beard; eating crickets; and paying the babysitter in cash at the end of each work day. (He considered some rules, such as killing magicians, too legally questionable to uphold.) In his attempts at living the Bible to the letter, Jacobs hits the road in highly entertaining fashion to meet other literalists, including Samaritans in Israel, snake handlers in Appalachia, Amish in Lancaster County, Pa., and biblical creationists in Kentucky. Throughout his journey, Jacobs comes across as a generous and thoughtful (and, yes, slightly neurotic) participant observer, lacing his story with absurdly funny cultural commentary as well as nuanced insights into the impossible task of biblical literalism.\n\nRecorded with Audacity from Audible.com high quality &quot;Enhanced&quot; audio book. Transcoded to V6 mp3 with dBpoweramp.","torrent":{"xt":"urn:btih:a63c209d38400737edebf9e2d6b61ca0a2e8c442","amp;dn":"A.J.+Jacobs+-+The+Year+of+Living+Biblically","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a63c209d38400737edebf9e2d6b61ca0a2e8c442","infoHashBuffer":{"type":"Buffer","data":[166,60,32,157,56,64,7,55,237,235,249,226,214,182,28,160,162,232,196,66]},"announce":[],"urlList":[]}}