{"title":"My Secret Life - Banned Victorian Erotica in 11 Volumes","uid":3702498,"size":22217471,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a6c82165fa1cc5d1e07381d065f2c64fa9b69272&amp;dn=My+Secret+Life+-+Banned+Victorian+Erotica+in+11+Volumes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"sohcha","files":24,"time":1180658886,"description":"My Secret Life was first published between 1888-1894 in 11 volumes in Amsterdam by the Belgian-born bookseller/publisher Auguste Brancart. For the next 100 years, it remained banned and considered obscene and pornographic.\n\nThe British Library has a set that it believes was published in about 1880, but &quot;The imprint is probably false; printed in Belgium?&quot;.\n\nNo-one really knows the true identity of &quot;Walter&quot;. But biographer Ian Gibson claims it is the pen name of one Henry Spencer Ashbee, pictured left.\n\nOnly 20-25 sets of My Secret Life were originally printed, and sold at Ã‚Â£60 per set, an enormous sum for the times, equivalent to over Ã‚Â£4000 ($6000) at today's prices. \n\nFamous People who owned My Secret Life\n\n    * Aleister Crowley (1875?7)\n      English occult writer and 'magician'\n    * Harold Lloyd (1893?1)\n      American silent film comedian and producer\n    * Josef von Sternberg (1894?9)\n      Austrian film director and Svengali to Marlene Dietrich\n    * George Mountbatten, 2nd Marquess of Milford Haven\n      great-grandson of Queen Victoria, brother of 1st Earl Mountbatten of Burma \n\nKey Dates in History\n?\t1834\tHenry Spencer Ashbee born 21 Apr 1834 in Southwark, London to Robert and Frances Elizabeth Spencer\n?\t1859\tWalter mentions the Battle of Solferino at the start of Chapter 7. Henry would be 25 years old.\n?\t1862\tHenry Ashbee marries Elizabeth Jenny Lavi in Hamburg, Germany\n?\t1863\tHenry and Elizabeth Ashbee's son, Charles Robert Ashbee, born 17 May 1863 in Isleworth, London\n?\t1888\tMy Secret Life first published\n?\t1900\tHenry Spencer Ashbee dies on 29 Jul in Hawkhurst, Kent\n?\t1932\tNew York publisher issue 3 volumes of My Secret Life before being arrested\n?\t1964\tIn his book The Other Victorians (New York, 1964), Steven Marcus makes a case that Ashbee was not the author.\n?\t1966\tNew York publisher Grove Press successfully publishes My Secret Life, 78 years after original publication in two books. The introduction by Gershon Legman suggest that Ashbee is the author.\n?\t1967\tPendulum Press of Atlanta Georgia publishes a facsimile of all 11 volumes of the 1888 edition of My Secret Life\n?\t1967\tDrs. Eberhard and Phyllis Kronhausen write Walter. The English Casanova. A presentation of his unique memoirs. 'My secret life' (London, Polybooks)\n?\t1969\tUK Bradford printer Arthur Dobson sentenced to two years as a &quot;professional purveyor of filth&quot;\n?\t1995\tUK publisher successfully issues &quot;Wordsworth Editions&quot; (not in print), 107 years after original publication\n?\t2000\tUK's Channel 4 broadcasts &quot;Walter: The secret life of a Victorian pornographer&quot; (10.30pm, Tuesday, 9 May 2000)\n?\t2001\tThe Erotomaniac: The Secret Life of Henry Spencer Ashbee by Ian Gibson published by Faber and Faber; ISBN: 0571196195\n?\t2003\tAn extract of My Secret Life appears on the Web.\n?\t2004\tThe full eleven volumes of My Secret Life appears on the Web for the first time in 116 years. It is fully searchable too.\n\n\nThe material presented here is in PDF and DOC formats which is available from the site http://www.my-secret-life.com/ in html format. The DOC format is optional for those who wish to make a proper ebook.\n\nEnjoy!!","torrent":{"xt":"urn:btih:a6c82165fa1cc5d1e07381d065f2c64fa9b69272","amp;dn":"My+Secret+Life+-+Banned+Victorian+Erotica+in+11+Volumes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6c82165fa1cc5d1e07381d065f2c64fa9b69272","infoHashBuffer":{"type":"Buffer","data":[166,200,33,101,250,28,197,209,224,115,129,208,101,242,198,79,169,182,146,114]},"announce":[],"urlList":[]}}