{"title":"Tuscan Country - A Photographers Journey (Photo Travel Ebook).pd","uid":9056959,"size":107395884,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a6dd0bed3e57f0e93c8d25677e56ca9171eae855&amp;dn=Tuscan+Country+-+A+Photographers+Journey+%28Photo+Travel+Ebook%29.pd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1381970008,"description":"Tuscan Country: A Photographer's Journey by Wes Walker\nWelcome Books | 2007 | HQ PDF | ISBN: 1599620227 | 162 pages | 102 Mb\n\nTravel with landscape photographer Wes Walker through the Tuscan countryside and discover the unique rural culture of the entire region, from the hill towns of western Siena to the Chianti wine country. Walker's stunning photographs uncover the lesser-known splendors of the region--fields of sunflowers in bloom, intimate country cafes, ornate village churches, and the majestic vineyards and ancient wine cellars that produce the varied and unique wines found throughout Tuscany. These vivid scenes are captured through the seasons in all their rich texture and natural vibrancy and set side-by-side with quotes, poetry, and literature. Walker's own observations about his journey can be found in each photo caption, offering tidbits, practical information, and an insider's guide to some of the most magical destinations off the beaten path.\n\nText to accompany the photographs is excerpted from the works of Italian writers and literary greats from around the world: Italo Calvino, Lawrence Ferlinghetti, Henry James, Heinrich Heine, Charles Dickens, Giuseppe Verdi, Virginia Woolf, D. H. Lawrence, Elizabeth Barrett Browning, Dylan Thoomas, Frances Mayes, and more.\n\nThe stunning artistry of the photographs and literature take the reader on an intimiate journey through the centuries-old wineries, rolling hills, lush landscapes, tidy villages, and hidden wonders of Tuscany. For those interested in truly experiencing the region, Tuscan Country also offers a resource section packed with the most delicious culinary destinations, coziest country villas, wineries, shops, and other places not to be missed along the way.","torrent":{"xt":"urn:btih:a6dd0bed3e57f0e93c8d25677e56ca9171eae855","amp;dn":"Tuscan+Country+-+A+Photographers+Journey+%28Photo+Travel+Ebook%29.pd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6dd0bed3e57f0e93c8d25677e56ca9171eae855","infoHashBuffer":{"type":"Buffer","data":[166,221,11,237,62,87,240,233,60,141,37,103,126,86,202,145,113,234,232,85]},"announce":[],"urlList":[]}}