{"title":"National Lampoon's Vacation-The Entire 5 Movie Series","uid":4511746,"size":3664472064,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a74096c3d37e773a7ece6dbf4a7de04d54be50a8&amp;dn=National+Lampoon%5C%27s+Vacation-The+Entire+5+Movie+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"SCash","files":-1,"time":1226801016,"description":"\nVacation (1983) \n\nThe Griswold family are on a quest. A quest to a Walley World theme park for a family vacation, but things aren't going to go exactly as planned, especially when Clark Griswold is losing all thought towards a mysterious blonde in a red Ferrari. Written by FilmFanUK\n\nThe Griswold family, father Clark W., wife Ellen, daughter Audrey and son Rusty, set out in high spirit to spend their vacation driving cross-country from Chicago to a glorious climax in Walley World on the West Coast. The trip which Clark planned down to the minute, slowly loses its smoothness from the moment the first grain of sand gets in. A meeting with constantly-in-debt, simple-minded cousin Eddie results in the Griswold family giving cantankerous aunt Edna a lift to Phoenix. Of course, the Griswolds receive one strike of bad luck after another, and when they finally arrive at Walley World, they have to find out that the park is closed for maintenance. But Clark promised his beloved family the best vacation ever... Written by Julian Reischl {&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;6c061900050d021e09051f0f04002c010d0f420f0301&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;}\n\nChicago resident Clark Wilhelm Griswold Jr., his wife Ellen Griswold, his son Russell &quot;Rusty&quot; Griswold, and his daughter Audrey Griswold have prepared to go on vacation to Wally World, a Disney-like amusement park located in Los Angeles. Clark has planned this trip right down to every last single solitary detail, but on the way to Los Angeles, things get complicated. First, they get lost in East St. Louis, Illinois, where Clark asks a belligerent pimp for directions as the pimp's henchmen are secretly stealing the car's hubcaps, then they stop in Dodge City, Kansas to see what the old west was like. After this, they head to Coolidge, Kansas to spend a night with Ellen's cousin Catherine and Catherine's sloppy husband Eddie, and they pick up Ellen's annoying Aunt Edna and her vicious dog Dinky from Eddie and Catherine's house so they can take Edna and Dinky to Phoenix, Arizona, where Edna's son Normy lives. During the visit at Eddie's, Eddie's son Dale shows Rusty some porno magazines, and Eddie's daughter Vicki shows Audrey a shoebox full of pot. After leaving Eddie and Catherine's house, the Griswolds head to a picnic area, where they discover that Dinky has urinated on the picnic basket. Later, when the Griswolds get to South Fork, Colorado, they spend a night at a Kamp Komfort, a campsite that has smelly tents. When they leave on the next day, they accidentally drag Dinky to his death behind the car. When they reach a desert region of Arizona, the Griswolds narrowly skirt death after crashing through a roadblock sign and messing up the car, and after Clark treks through the desert to find a gas station, the car is repaired by a pair of greedy mechanics who want all of Clark's money for doing the repairs, which are very shoddy. When the Griswolds run out of money, Clark is forced to swipe some money from a hotel where he tried to get a check cashed, this being while Ellen, Rusty, and Audrey look at the Grand Canyon just outside the hotel. After the Griswolds leave this hotel, Edna dies in the car. That night, the Griswolds head into Phoenix, Arizona, and leave Edna's body at Normy's house. After a makeshift funeral service, they leave Normy's house. Clark starts going crazy because things haven't gone right on this vacation, and the way Clark scheduled it, they should have already been at Wally World. Will they ever get to Wally World, and will they get to enjoy it? Written by Todd Baldridge\n\nFollows the Griswold family, Clark and Ellen along with their two children Rusty and Audrey, as they venture westward from the suburbs of Chicago to the Disneyland-like theme park, Walley World. Clark has planned the trip down the last detail, including seeing the world's largest ball of twine. However, Clark's pursuit of adventure is matched by his dimwitted bumbling, leading to a vacation his family will not soon forget. Written by Rick Gregory {&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;374556501956475677525a565e5b1956475619584550&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;}\n\nChicago native Clark Griswold has decided to take his wife ,Ellen, kids 14 year-old Rusty and 12 year-old Audrey to a Los Angles theme park called Walley World. But when Audrey takes up pot smoking and Rusty reads porno magazines, annoying Cousin Eddie sends spiteful Aunt Edna to join them on their trip, the Griswolds get stuck in the ghetto, Aunt Edna dies, Clark drives off the road, hillbillies take all their money, and Clark is shot at in a Dodge City bar, will their vacation be all it was cracked up to be? Written by DancingChicken2005 \n\n\n\nEuropean Vacation (1985)\n\nThe Griswalds win a vacation to Europe on a game show, and thus pack their bags for the continent. They do their best to catch the flavor of Europe, but they just don't know how to be be good tourists. Besides, they have trouble taking holidays in countries where they CAN speak the language...  Written by Murray Chapman {&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;731e0609091f163310005d06025d1c095d1206&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;}\n\nIn a game show called &quot;Pig In A Poke,&quot; the Griswold family -- Clark, Ellen, Rusty, and Audrey -- accidentally wins a trip to Europe, winning against a family that had previously never been defeated on this game show, which is hosted by Kent Winkdale. Just before the trip, Clark makes an erotic videotape of Ellen, promising to erase the tape later. Clark likes the game show's itinerary of what they are scheduled to do in Europe, but Ellen and the kids don't feel the same way. They begin their trip to Europe in London, England, where they stay in a ratty hotel. Clark has problems learning how to drive European cars, which have the steering wheel on the right side instead of the left side. In England, the Griswolds see things like Big Ben, Parliement, and Buckingham Palace. Audrey misses her boyfriend Jack so much that she wants to go back to Chicago. Clark is oblivious to how his family feels as he takes the family to see places such as Stonehenge, which Clark accidentally knocks down by backing a rented car into it. The trip to Europe then moves from London to Paris, France, where Clark has a French man use the camcorder to tape the Griswolds near a water fountain, but the French man steals the camera, with a videotape inside of it. In Paris, the Griswolds visit the Eiffel tower. The hotel room they check into in Paris is better than the one they had in London. The Griswolds visit the Musee De Louvre, then Audrey gets a letter from Jack, saying that Jack has been seeing Audrey's best friend Debbie while Audrey is in Europe. The next stop for the Griswolds is Germany, to visit their long lost relatives Fritz and Helga, but they end up at the wrong house and mistake this house's residents as their relatives. Nevertheless, they have a nice visit. Next, the Griswolds visit a festival where Clark joins in on some German dancing that he has no idea how to do. Not surprisingly, the dancing ends with a fistfight. The Griswolds get on a train to Rome, Italy, but on the way there, they get off the train to go to the travelers check place, but they are greeted by a pair of men that they don't know are robbing the place. After getting $3,000 from the place, the Griswolds get a car from the same two men, who have placed the clerk in the trunk of the car, and the Griswolds make their way into Rome, where they buy new clothes and Ellen sees a picture of herself on a billboard -- the thief who stole their video camera has been selling copies of the erotic tape of Ellen, which Clark forgot to erase, and Ellen is livid. The two thieves, the ones who robbed the place where the Griswolds got the $3000, show up in Rome, and one of them, who has fallen for Ellen, kidnaps Ellen. Audrey sees the guy leaving with Ellen, and Audrey and Clark set off to rescue Ellen. Written by Todd Baldridge\n\nIn a game show family Griswald wins a trip to Europe. They set out for Britain, France, Germany and Italy, ignorant to the damage they do to other people: In Britain Clark has slight problems to adapt to driving on the left side, runs several people over and accidentally lays down Stone Henge in reverse gear. In Germany they visit the wrong relatives and are chased by angry 'Schuhplattl' dancers. Finally in Rome they unknowingly help robbers in a hold-up and then Ellen gets kidnapped... simple jokes, always following the same scheme. Written by Tom Zoerner {&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;7a2e15175420151f08141f083a13141c1508171b0e1311540f1413571f08161b141d1f14541e1f&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;}\n\nWhen the Griswolds accidentally win the grand prize on the &quot;Pig in a poke&quot; TV show, a trip to Europe for all of them, they happily decide to go. But the family's name would not be Griswold if everything went without complication. In London, they see Big Ben and Parliament extensively, but only after Clark learned to drive on the left side by not doing so; in Paris, Rusty's hormones disastrously spring to live; in Germany, the Griswolds visit the wrong relatives and in Italy, the family gets in touch with crime and a videotape that was in the camera that was stolen back in Paris. In addition, Audrey, who is in love with less-caring beau Jack, keeps ringing up the phone bill, Rusty keeps hitting on girls and Ellen keeps keeping them all together when times are bad. Written by Julian Reischl {&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;204a554c49414e5245495343484c604d41430e434f4d&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;} \n\n\n\nChristmas Vacation (1989) \n\nIt's Christmas time and the Griswolds are preparing for a family seasonal celebration, but things never run smoothly for Clark, his wife Ellen and their two kids. Clark's continual bad luck is worsened by his obnoxious family guests, but he manages to keep going knowing that his Christmas bonus is due soon.  Written by Rob Hartill\n\nChicago resident Clark Wilhelm Griswold Jr has REALLY got the Christmas spirit this year, and his wife Ellen, son Rusty, and daughter Audrey have noticed it. Clark has invited Ellen's parents Arthur Smith and Francis Smith, his own parents Clark Wilhelm Griswold Sr and Nora Griswold, and his Aunt Bethany and Uncle Lewis to spend the holidays at the Griswold house in Chicago. Clark is obsessed with making everything go perfectly during the holiday season, but as soon as everyone arrives, things start going haywire, especially when the Griswolds receive some uninvited surprise guests from Kansas -- cousin Catherine, her sloppy husband Eddie, and two of their kids, Rocky and Ruby Sue. Clark decorates the outside of the house with 250 strands of lights with 100 bulbs on each strand for a total of 25,000 light bulbs, enough to make the power company turn on their auxiliary nuclear generator. Clark also annoys his snobby next door neighbors -- Todd Chester and his wife Margo. Even with his bumbling ways, Clark manages to keep things going as he waits for his Christmas bonus from work so he'll have enough money to have a swimming pool put in the back yard. But it turns out that Clark's boss, a scrooge whose name is Frank Shirley, does not intend to give out any Christmas bonuses this year, and this causes Clark to snap and act crazy. This situation gives Eddie the idea for the perfect Christmas gift for Clark after Clark offers to help Eddie treat Rocky and Ruby Sue to a good Christmas. Can Eddie help Clark and the family have a great Christmas? Written by Todd Baldridge\n\nAll Clark wanted to do is make Christmas nice with his family at their big home in Chicago. Instead of having an &quot;Old Fashioned Family Christmas,&quot; Clark and the rest of the Griswold's got an evening of hell! Written by Jason Allentoff\n\nIt's Christmas time - Clark decided to invite all the family to have 'the most fun-filled old-fashioned family Christmas', which nobody shall ever forget. When the first relatives arrive, Clark soon flees on the roof to rig the lighting. The one thing the loving father wants to surprise the whole family with is the installation of a pool, which he already ordered. Unfortunately, the bonus check Clark expects any minute is overdue - and tempers rise, but not only because of the check. A big event is the arrival of uninvited cousin Eddie with his family in their mobile home, as well as a little sledding afternoon with a new lubricant from Clark's company, or his shifting relationship with the very hip and clean neighbours. Cousin Eddie chooses to top off all presents with his very own special creation, only intending to deliver a real reason to be jolly. Written by Julian Reischl {&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;08627d646169667a6d617b6b60644865696b266b6765&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;}\n\nThis year, Clark Griswold is really into Christmas, and promises his family the best Christmas ever. However, instead of the best Christmas ever, Clark turns Christmas evening completely around, causing a domino effect of disasters that eventually seems to drive everyone crazy. Written by Chris Wang \n\n\n\n\nVegas Vacation (1997)\n\nThe Griswolds head off for Las Vegas, as Clark got an extra bonus for developing a food preservative. In the city of fortune, the family ties are once again tested by forces of nature: Ellen finds herself tempted by Wayne Newton, Clark manages to lose all the money the Griswolds own, Rusty, not being 21 years of age yet, hits a lucky streak as Mr. Pappagiorgio and Audrey teams up with Cousin Eddie's daughter Vickie to dance at very interesting night clubs. Also, the Griswolds nearly cause the breaking of Hoover Dam, Clark meets some of Siegfried and Roy's white tigers up close and Cousin Eddie, who now owns some land right out of Las Vegas, gladly offers his helping hand. But the feeling of love and family will bring them all back together again, be it richer or poorer than before - what does money matter anyway?  Written by Julian Reischl {&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;84eef1e8ede5eaf6e1edf7e7ece8c4e9e5e7aae7ebe9&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;}\n\nThanks to the money brought in at work by one of Clark Griswold's inventions, a long life food preservative, Clark has enough money to take his wife Ellen, his son Rusty, and his daughter Audrey on a trip to Las Vegas -- the land of sand, slot machines, and the Hoover Dam. In Las Vegas, Clark crosses paths with Eddie, the sloppy husband of Ellen's cousin Catherine. Eddie and his family now live in the desert north of Las Vegas on what used to be an H-bomb test site. During the vacation in Las Vegas, Ellen becomes addicted to Wayne Newton, Rusty gets a fake ID and becomes a winning high roller, Audrey starts hanging out with Eddie's stripper daughter Vickie, and Clark becomes addicted to gambling and starts gambling away the family's bank account, which amounts to $22,600. Ellen's obsession with Wayne Newton is making Clark jealous, and Clark keeps losing money at the casino. After losing so much money, can Clark find a way to get the money back and save the family's vacation? Written by Todd Baldridge\n\nThe Griswold clan is back and this time Clark (Chevy Chase) makes another one of his spirited attempts to plan the perfect family vacation, this time to the glittering casinos and glitzy attractions of Las Vegas. Written by David Cohen {&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;ec888d9a85888f83848982ac8d8380c28f8381&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;}\n\nClark W. Griswold and his family decide to go to the one place where they can REALLY have a great vacation, to the glitzy city of Las Vegas. There, they encounter various people including, country cousins Eddie and Catherine, a smart-aleck blackjack dealer, cage-dancing cousin Vickie, Wayne Newton and a familiar mystery blond in a red Ferrari. Written by Keith W. Howley {&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;5239253a3d253e372b12223e333c37262a7c303e3d3d3f277c373627&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;} \n\n\n\n\nChristmas Vacation 2: Cousin Eddie's Island Adventure (2003)\n\nThough Eddie's fired right at Christmastime, his boss sends him and his family on a South Pacific vacation, hoping Eddie won't sue him after being bitten by a lab monkey. When the Tuttle family winds up trapped on a tropical island, however, Eddie manages to provide for everyone and prove himself a real man.  Written by samjjones \n\n\n","torrent":{"xt":"urn:btih:a74096c3d37e773a7ece6dbf4a7de04d54be50a8","amp;dn":"National+Lampoon%5C%27s+Vacation-The+Entire+5+Movie+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a74096c3d37e773a7ece6dbf4a7de04d54be50a8","infoHashBuffer":{"type":"Buffer","data":[167,64,150,195,211,126,119,58,126,206,109,191,74,125,224,77,84,190,80,168]},"announce":[],"urlList":[]}}