{"title":"Dr. David Duke - Audio Book - Jewish Supremacism (Full Version)","uid":4647633,"size":244577026,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a83d4e466bde98f0029c7584adaee78ec5d29592&amp;dn=Dr.+David+Duke+-+Audio+Book+-+Jewish+Supremacism+%28Full+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"picoli","files":54,"time":1231939928,"description":"[Extended edition], [Free Distribute]\n\nThis is David Duke's shocking book Jewish Supremacism - My Awakening to the Jewish Question (2003) which exposes the plans of the elite of International Jewry. Covering many topics and historical periods, the book is well researched and documented and serves as an outline for one interested in this fascinating subject to go check it out for one's self.\n\nStudying Dr. Duke's book will lead the reader into an honest look at the way the world is run and will ultimately be much more satisfying than the lies and bunk one finds in the politically correct, communist university classrooms of today.\n\nHeavily footnoted and referenced the fascinating and arcane information he's amassed (primarily from Jewish sources) on the Zionist connection to many of the woes currently facing America is an amazing achievement. As the United States continues it's descent into tyranny, more and more people will start to ask &quot;WHY&quot;? There are certainly many gentiles guilty of greed, corruption and treason who assist the New World Order agenda, but the origins of the most influential movements, which masquerade as &quot;liberty&quot;, &quot;freedom&quot; or &quot;equal rights&quot; are Jewish supremacist ideologies.\n\nDuke covers the whole history of Zionist manipulation and oppression. Did you know the civil rights movement was Jewish controlled? Did you know that we are at war in Iraq and Afghanistan because Zionist neoconservatives in government called for it long before 9/11 occurred? Did you ever wonder why Israel is almost always a &quot;victim&quot; acting in self-defence even though they are ILLEGALLY occupying Palestine and ignoring U.N. resolutions?\n\nSome will defame this book by calling it anti-Semitic. Yet, it is not considered anti-American to examine historical mistreatment of Indians. No one calls it anti-Christian to talk about the excesses of the Inquisition. No one says that it is anti-Muslim to examine extreme elements within Muslim fundamentalism. This book is not anti-Semitic; it simply examines and documents elements of ethnic supremacism that have existed in the Jewish community from historical to modern times. Specifically, Jewish Supremacism examines a long record of Jewish supremacist ideology and history that have had a powerful and damaging effect on both the Jewish and Gentile world. Highly recommended to those who think outside the box, and who can deal with truth.","torrent":{"xt":"urn:btih:a83d4e466bde98f0029c7584adaee78ec5d29592","amp;dn":"Dr.+David+Duke+-+Audio+Book+-+Jewish+Supremacism+%28Full+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a83d4e466bde98f0029c7584adaee78ec5d29592","infoHashBuffer":{"type":"Buffer","data":[168,61,78,70,107,222,152,240,2,156,117,132,173,174,231,142,197,210,149,146]},"announce":[],"urlList":[]}}