{"title":"Robert Alter - The Pleasures of Reading in an Ideological Age","uid":10457522,"size":2438296,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8a2b69fa5a6f5d7cbb57e000f0a02fff418359d&amp;dn=Robert+Alter+-+The+Pleasures+of+Reading+in+an+Ideological+Age&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"workerbee","files":-1,"time":1404089622,"description":"\nRobert Alter - The Pleasures of Reading in an Ideological Age (Simon &amp; Schuster, 1989)\n\nISBN: 9780671706272 | 250 pages | PDF\n\n\nOne of America's premier literary scholars here provides a learned and witty introduction to the &quot;sheer vitality of literature and the satisfactions of a close, informed engagement with it&quot; (New York Times).\n\nRobert Alter's illumination of the unique power of reading literature is especially valuable at a time when we are surrounded by electronic texts that distract more than engage and when the special claims of literature are disparaged by the high priests of literary theory.  Alter explores the strategies that distinguish literature -- the resources of style, the dynamics of allusion, the formal design of structure, the play of perspective in narrative.  He draws on copious examples from the great works of literary art -- from the Book of Genesis to Shakespeare, Conrad, and Nabokov -- to illustrate his analysis of what makes reading a source of complex pleasure and insight.\n\n* For more literary criticism and translations of the Hebrew Bible by Robert Alter, see &lt;a href=&quot; http://thepiratebay.se/torrent/9462334/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/9462334/&lt;/a&gt;  \n\n\nReviews\n\n&quot;A book that ought to be placed in the hands of any person who shows the slightest interest in serious reading or in hearing a good, practical defense of high culture.&quot; -- Wall Street Journal\n\n&quot;Alter offers this slim volume as a semi-polemical corrective to the trend in recent literary studies toward theory and a resulting 'distancing -- in the more extreme cases, an actual estrangement -- from the experience of reading literature.'  In his defense of reading, the author examines basic components of literature -- character, perspective, style, allusion, structure -- and draws on the Bible, poetry and, above all, novels to illustrate how these varied elements, 'engaged in constant, shifting interplay,' provide readers with pleasure in part because they resist inclusion within the grand schemes of now-popular theoretical models.  With few exceptions, Alter avoids point-by-point attacks on specific critics, thereby averting, by his own example, the critical heaviness he decries in others.  His enthusiasm for the works of Stendhal, Conrad, Faulkner Nabokov and Wallace Stevens, to name just a few, will indeed send readers looking for the pleasures promised.&quot; -- Publishers Weekly\n\n&quot;Alter wastes little time in polemics.  Instead, he explains and applies those resources ready at hand to analyze a literary work.  And therein lies the pleasure of reading his readings.  No crabbed and repellent hieroglyphs of contemporary criticism here.  Instead, there are fresh explanations of familiar terms (character, structure, allusion, perspective) and analyses that plunge boldly and incisively to the heart of the literary matter.  Alter has read everything, and he illumines each text (dozens of them, fiction and poetry -- from the Bible to Lolita ) to the advantage and delight of all readers who still believe in the uniqueness and stability of great literature.&quot; -- Arthur Waldhorn, Library Journal\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                     &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:a8a2b69fa5a6f5d7cbb57e000f0a02fff418359d","amp;dn":"Robert+Alter+-+The+Pleasures+of+Reading+in+an+Ideological+Age","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8a2b69fa5a6f5d7cbb57e000f0a02fff418359d","infoHashBuffer":{"type":"Buffer","data":[168,162,182,159,165,166,245,215,203,181,126,0,15,10,2,255,244,24,53,157]},"announce":[],"urlList":[]}}