{"title":"Paula Cole...This Fire(1996)[FLAC]","uid":5897424,"size":335808411,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a91064965e3dfd09932ea4968a2010333e273e69&amp;dn=Paula+Cole...This+Fire%281996%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":24,"time":1287549126,"description":"1996 This Fire    CD  Warner Bros. 9 46424-2 \n\n1 Tiger   4:18 \n2 Where Have All the Cowboys Gone?   4:26 \n3 Throwing Stones   3:46 \n4 Carmen   3:45 \n5 Mississippi   5:06 \n6 Nietzsche's Eyes   5:32 \n7 Road to Dead   3:41 \n8 Me   5:02 \n9 Feelin' Love   5:37 \n10 Hush, Hush, Hush   4:22 \n11 I Don't Want to Wait   5:19 \n\nTHIS FIRE was nominated for 1998 Grammy Awards for Album Of The Year and Best Pop Album. &quot;Where Have All The Cowboys Gone&quot; was nominated for 1998 Grammys for Record Of The Year, Song Of The Year, and Best Female Pop Vocal Performance. Paula Cole won the 1998 Grammy Award for Best New Artist.\n\nSinger-songwriter Paula Cole bares her soul on her self-produced second album, displaying even more self-confidence than on HARBINGER. There is a sense of breaking with the past, especially on tracks like &quot;Tiger,&quot; where Cole revisits the symbolic &quot;Bethlehem&quot; of her first album, singing, &quot;I've left Bethlehem and I feel free/I've left the girl I was supposed to be.&quot; Lyrically, THIS FIRE is ferocious and unrestrained, and Cole's limber voice is suitably raw and versatile, veering from whispery-soft to edgy and emotional, delivering a fearlessly personal message.\n\nWhen she sings, &quot;You call me a bitch in heat/And I call you a liar&quot; (on &quot;Throwing Stones&quot;), the word &quot;liar&quot; emerges as a furious scream. The next track, &quot;Carmen,&quot; in contrast, is gently nostalgic. Cole's songs are emotionally complex and open to interpretation, but they are never deliberately vague, and her subtle wit saves THIS FIRE from self-absorption.\n\nRecorded at Bearsville Studio, Bearsville, New York; The Magic Shop, Paula's apartment and Shelter Island Studio, New York, New York.\n\nPersonnel: Paula Cole (vocals, didjeridu, clarinet, tuba, piano, harmonium, organ, Wurlitzer organ, xylophone); Peter Gabriel (vocals); SÃƒÂ©amus Egan (whistling, Uilleann pipe); Greg Leisz (guitar, lap steel guitar); Gerry Leonard (guitar, strings); Wenyi Shih, Liz Knowles (violin); Judith Insell (viola); Chase Morrison (cello); Tony Levin (Chapman stick); Jay Bellerose (drums, percussion).\n\nAudio Mixers: Gerry Leonard ; Roger Moutenot.\n\nRecording information: Bearsville Studio, Bearsvill, NY; Paula's Apartment, New York, NY; Shelter Island Studio, New York, NY; The Magic Shop, New York, NY.\n\nPhotographers: Jodie Olson; D. Schiefelbein; W.S. Edwards; P.E. Penn; David Skernick.\n\nUnknown Contributor Role: Kevin Killen.\n\nPersonnel: Paula Cole (vocals, piano, Juno synthesizer, Wurlitzer electric piano, harmonium, beat box, toy xylophone, didjeridoo, clarinet); Peter Gabriel (vocals); Gerry Leonard (guitar); Greg Leisz (guitar, pedal &amp; lap steel guitars); Wenyi Shih, Elizabeth Knowles (violin); Judith Insell (viola); Chase Morrison (cello); Seamus Egan (Uilleann pipes, whistle); Tony Levin (bass, Chapman stick); Jay Bellerose (drums, percussion); Kevin Killen.\n\nEngineers: Roger Moutenot, Kevin Killen, Gerry Leonard.\n\nEntertainment Weekly (12/13/96, p.83) - &quot;...A feisty poet with a soaring voice and a funky groove, Cole seems to be nipping at Tori Amos' heels.&quot;\n- Rating: A-\n\ncd ripped by dBpoweramp\n\nplease seed","torrent":{"xt":"urn:btih:a91064965e3dfd09932ea4968a2010333e273e69","amp;dn":"Paula+Cole...This+Fire%281996%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a91064965e3dfd09932ea4968a2010333e273e69","infoHashBuffer":{"type":"Buffer","data":[169,16,100,150,94,61,253,9,147,46,164,150,138,32,16,51,62,39,62,105]},"announce":[],"urlList":[]}}