{"title":"Sardu  MultiBoot USB Creator  linux windows","uid":7322855,"size":11588033,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a915f53d953370e1c0b4bb5e34d9a925c7151820&amp;dn=Sardu++MultiBoot+USB+Creator++linux+windows+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"TrettioSju","files":-1,"time":1338669430,"description":" &lt;a href=&quot;http://www.sarducd.it/USB&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.sarducd.it/USB&lt;/a&gt;\n\nMake a Multi Boot USB is very easy, after conneting the media (pen drive or all removable are supported), you have to press the button &quot;Search USB&quot;. Will look for all devices with FAT32. Default this combo is disabled (gray), is activated only when it finds one (or more) device/s. In tab sheet 'Report' you can be found all about the selected USB: Type (Removable or Hard Disk), Serial, Label, Space used and free.\n\nUnit USB drive selection can be done by going into ComboBox 'USB'. When change the unit, the table report change in real time the values of support. SARDU don't format anything but write/overwrite data. Pressing the button with the USB icon, asks us if we are sure to copy SARDU on USB, the software extract an ISO image at time the needed files, copy file fo file in USB support, after a careful examination builds the menu and make a multibootable media.\nAll this in one step only with all with all your ISOs previously selected, without questions or any intervention and knowledge of the user.\nSARDU on USB is incremental, later you can add other or manually delete old software. The menu creation is done by checking the USB support.\nThe incremental function can be activated either by going to the icon button USB to USB -&gt; Update USB. If the menu of SARDU is damaged or if the media is not bootable going to USB --&gt; Update only SARDU's menu.\nWARNING: The copy from a ISO (CD/DVD) to a media USB can not work because the behavior of the software is different between CD and USB.","torrent":{"xt":"urn:btih:a915f53d953370e1c0b4bb5e34d9a925c7151820","amp;dn":"Sardu++MultiBoot+USB+Creator++linux+windows+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a915f53d953370e1c0b4bb5e34d9a925c7151820","infoHashBuffer":{"type":"Buffer","data":[169,21,245,61,149,51,112,225,192,180,187,94,52,217,169,37,199,21,24,32]},"announce":[],"urlList":[]}}