{"title":"Dark History of Hollywood - Keiron Connolly","uid":11244539,"size":9869831,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a974f1d553ff7904fa2739406f60e45d19f04d70&amp;dn=Dark+History+of+Hollywood+-+Keiron+Connolly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1413677052,"description":"&quot;Hollywood is a place where they'll pay you a thousand dollars for a kiss and fifty cents for your soul.&quot; - Marilyn Monroe In 2015, it'll be 100 years since Hollywood became the centre of American cinema and, while it has always presented itself as a place of glamour and home to the beautiful and talented, from its very creation there was a darker side to Tinseltown. Film-makers didn't just move to southern California for its sunny weather, they went West to evade the patent laws restricting the use of movie cameras. From its earliest days, Hollywood, the home of fantasy, created a hothouse of excess - too much money, too much adulation, too much expectation and too much ego. Some actors would trade sex in the, often vain, hope of career advancement, mobsters muscled in on the unions and extorted the studios, while the accountants appear to be among Hollywood's most creative people, managing to ensure that even the Star Wars films haven't yet shown a profit. But while stars have always been indulged, once their moment in the limelight has passed, their fall can be cruel. From the setting up of the studios by the movie moguls to the corporations that run them today, from drug addictions to McCarthy-era witch-hunts to the Mob, Dark History of Hollywood is the story of sex and excess, murder and suicide, ambition and betrayal, and how money can make almost everyone compromise. Intensively researched and superbly entertaining, Dark History of Hollywood reveals that the stories behind the silver screen are at least as gripping as many of those on it","torrent":{"xt":"urn:btih:a974f1d553ff7904fa2739406f60e45d19f04d70","amp;dn":"Dark+History+of+Hollywood+-+Keiron+Connolly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a974f1d553ff7904fa2739406f60e45d19f04d70","infoHashBuffer":{"type":"Buffer","data":[169,116,241,213,83,255,121,4,250,39,57,64,111,96,228,93,25,240,77,112]},"announce":[],"urlList":[]}}