{"title":"Money The Unauthorized Biography.epub","uid":9707491,"size":4060291,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a97c1e565f704d2cacc207c75e298e4acb5c345b&amp;dn=Money+The+Unauthorized+Biography.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"sidmal","files":-1,"time":1394072034,"description":"Epub can be either read via an e-book reader or through firefox plugin(incl.  piratebrowser)\n\nFelix Martin, &quot;Money: The Unauthorized Biography&quot;\n ISBN: 0307962431 | 2014 | EPUB | 336 pages | 4 MB\n\n From ancient currency to Adam Smith, from the gold standard to shadow banking and the Great Recession: a sweeping historical epic that traces the development and evolution of one of humankind's greatest inventions.\n\n What is money, and how does it work? In this tour de force of political, cultural and economic history, Felix Martin challenges nothing less than our conventional understanding of money. He describes how the Western idea of money emerged from interactions between Mesopotamia and ancient Greece and was shaped over the centuries by tensions between sovereigns and the emerging middle classes. He explores the extraordinary diversity of the world's monetary systems, from the Pacific island of Yap, where value was once measured by immovable stones, to the currency of today that exists solely on globally connected computer screens. Martin shows that money has always been a deeply political instrument, and that it is our failure to remember this that led to the crisis in our financial system and so to the Great Recession. He concludes with practical solutions to our current pressing, money-based problems. \n\n Money skips nimbly among such far-ranging topics as John Locke's disastrous excursion into economic policy, Montesquieu's faith in finance to discipline the power of kings, the social organization of ancient Sparta and the Soviet Union's ill-fated attempt to abolish money and banking altogether. Throughout, Martin makes vivid sense of a chaotic and sometimes incoherent system--the everyday currency that we all share--in the clearest and most stimulating terms. This is a magisterial work of history and economics, with profound implications for the world today.\n\n","torrent":{"xt":"urn:btih:a97c1e565f704d2cacc207c75e298e4acb5c345b","amp;dn":"Money+The+Unauthorized+Biography.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a97c1e565f704d2cacc207c75e298e4acb5c345b","infoHashBuffer":{"type":"Buffer","data":[169,124,30,86,95,112,77,44,172,194,7,199,94,41,142,74,203,92,52,91]},"announce":[],"urlList":[]}}