{"title":"MFSL UDCD 731 - 760 24KT GOLD PACK #8 ALAC","uid":10737938,"size":8633284832,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a9a726b10260f19ef52808ec599c14db343fba28&amp;dn=MFSL+UDCD+731+-+760+24KT+GOLD+PACK+%238+ALAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"DigiTizeU","files":368,"time":1407712090,"description":"This is the Eighth pack with 1 more to come. \n\nWould like this and the other one like it if anyone has it please UL:\n\nUDCDS1  Mobile Fidelity Collection - Volume 1\n\n\nIt includes 741, 746, 750, and 752 from Nubintoit only because I made the pack up before removing those. They have been reworked to match the rest. \n\nThey have already been upped by another poster. So grab them from there. You should be complete up to 730 at this point. If not they are in the fill packs or singly posted recently.\n\nI want to thank all those who helped complete this great collection. Many have put in a lot of time to make this happen. Some rips are mine but many are from others. Thanks to the original uploaders. \n\nThank you to quietcove, Arsventure, nubbintoit, aberki, Bil6969, and Anonymous. All of you have done a great job making this happen. Many of these are rare and hard to find.\n\nI have tried to make the artwork naming and all other aspects of these as best as possible. The collection deserved it in my opinion. I hope you all enjoy it and realize that this was a large undertaking with countless people involved. You are reaping the rewards with only a few clicks and no searching or manipulating of files.\n\n\n Enjoy!!!\n\n\nLook for the next great collection to begin in the future. The MFCD Collection! Will probably start that next month...","torrent":{"xt":"urn:btih:a9a726b10260f19ef52808ec599c14db343fba28","amp;dn":"MFSL+UDCD+731+-+760+24KT+GOLD+PACK+%238+ALAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9a726b10260f19ef52808ec599c14db343fba28","infoHashBuffer":{"type":"Buffer","data":[169,167,38,177,2,96,241,158,245,40,8,236,89,156,20,219,52,63,186,40]},"announce":[],"urlList":[]}}