{"title":"Francois Rabelais - Gargantua and Pantagruel (Penguin)(epub, mob","uid":8790791,"size":3459630,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a9ed46164336cbec6e61b453ccedea5b23885879&amp;dn=Francois+Rabelais+-+Gargantua+and+Pantagruel+%28Penguin%29%28epub%2C+mob&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pharmakate","files":-1,"time":1375940103,"description":"Francois Rabelais (M. A. Screech, trans.) - Gargantua and Pantagruel (Penguin Classics, 2006). \n\nEpub and mobi files from a retail source.\n\n\nRecent translation of the bawdy, satirical Renaissance classic.\n\ndescription:\n\nThe dazzling and exuberant moral stories of Rabelais (c.1471-1553) expose human follies with their mischievous and often obscene humour, while intertwining the realistic with carnivalesque fantasy to make us look afresh at the world.\n\nGargantua depicts a young giant, reduced to laughable insanity by an education at the hands of paternal ignorance, old crones and syphilitic professors, who is rescued and turned into a cultured Christian knight. And in Pantagruel and its three sequels, Rabelais parodied tall tales of chivalry and satirized the law, theology and academia to portray the bookish son of Gargantua who becomes a Renaissance Socrates, divinely guided in his wisdom, and his idiotic, self-loving companion Panurge.\n\nabout the author:\n\nFrancois Rabelais born in the 1480s, is very much a Renaissance man. As a Franciscan turned Benedictine he studied Law; he graduated as a doctor at Montpellier in 1530. Living irregularly, he published in 1532 the first of his comic 'Chronicles', Pantagruel; it revealed his genius as a storyteller and creator of comic characters and situations. By early 1535 he had published Gargantua, outrageously mocking old-fashioned education and rash imperialism. Against monastic ideals it opposes an Abbey where noblemen and ladies live in evangelicalism freedom and Renaissance splendor. In January 1535 Rabelais fled from his post as physician in Lyons. His profound and audacious Third Book was published in 1546. He was then a secular priest. He fled to Metz. His Fourth Book, published in January 1552 not long before he died, contains some of his deepest, boldest and funniest pages. It enjoyed the public support of the King and two Cardinals. (It outlived the Index of Prohibited Books on which it was eventually placed.) A Fifth Book appeared under his name in 1564. His genius was acknowledged in his own day: his world-wide influence remains enormous.","torrent":{"xt":"urn:btih:a9ed46164336cbec6e61b453ccedea5b23885879","amp;dn":"Francois+Rabelais+-+Gargantua+and+Pantagruel+%28Penguin%29%28epub%2C+mob","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9ed46164336cbec6e61b453ccedea5b23885879","infoHashBuffer":{"type":"Buffer","data":[169,237,70,22,67,54,203,236,110,97,180,83,204,237,234,91,35,136,88,121]},"announce":[],"urlList":[]}}