{"title":"Milt Jackson Wizard of the Vibes(jazz)(flac)[rogercc]","uid":6188308,"size":254726530,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:aa8473fee3278ab4fd19bf9f5756aaf39d685773&amp;dn=Milt+Jackson+Wizard+of+the+Vibes%28jazz%29%28flac%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rogercc1","files":19,"time":1298197245,"description":"MILT JACKSON WIZARD OF THE VIBES\nReleased:2001 [This version]\nLabel: Blue Note\nFormat:Flac]\n\n\n\nWizard of the Vibes is a Blue Note Records compilation of performances by jazz vibraphonist Milt Jackson. The sessions were the work of The Thelonious Monk Quintet (the July 2 1948 and July 23 1951 sessions) and The Modern Jazz Quartet plus Lou Donaldson (a 1952 session). The album has been recompiled and expanded three additional times, with various tracks from these sessions added and deleted.\nThe original 1952 10&quot; LP was expanded to a 12&quot; LP in 1956, and retitled Milt Jackson and the Thelonious Monk Quintet. In 1989, the cover and title of the 1956 version were used for a CD featuring the complete 1948 and 1952 sessions, but the 1951 Monk Session was moved to Monk's Genius of Modern Music: Volume 2. The 2001 album Milt Jackson: Wizard of the Vibes used the cover art and title of the original 1952 album, but contained a re-ordered and remastered version of the contents of the 1989 CD.\nIn each formulation, the album contained Blue Note Thelonious Monk -led performances unavailable on the parallel editions of &quot;Genius of Modern Music.&quot;\n\nThe music on Wizard of the Vibes features Milt Jackson with the Thelonious Monk Quartet in a 1948 session combined with a 1952 date with his bandmates from the Modern Jazz Quartet (at that time including John Lewis, Percy Heath, and Kenny Clarke) along with alto saxophonist Lou Donaldson, who was oddly credited as the leader of the date on the original release, though it clearly seems to be Jackson in charge. The chemistry between Jackson and Monk on classics like &quot;Misterioso,&quot; &quot;Evidence,&quot; &quot;I Mean You,&quot; and &quot;Epistrophy&quot; is immediately apparent, although Kenny &quot;Pancho&quot; Hagood's vocals on the standards &quot;All the Things You Are&quot; and &quot;I Should Care&quot; remain an acquired taste. Jackson introduces three originals on the latter session, including the debut of his highly acclaimed &quot;Bag's Groove,&quot; which has long since become one of the most celebrated and popular jazz compositions. Lewis' uncanny musical ESP is evident throughout the session, as he feeds Jackson imaginative lines for his improvisations. Donaldson is enjoyable at times but doesn't always play at a level equal to the rhythm section, resorting to rather run-of-the-mill ideas in some of his improvisations. Milt Jackson's inventive playing throughout both dates makes this an important CD in his considerable discography, so it should be a part of any bop fan's collection. ~ Ken Dryden\n\nThis is part of Blue NoteRecords Rudy Van Gelder Series.[/b]\n[color=deepskyblue]Recorded at Apex Studios and WOR Studios, New York, New York between July 2, 1948 and April 7, 1952..\n\n\n\nTracklist\n1.Tahiti\n2.Lillie \n3.Bags' Groove\n4.What's New?\n 5.Don't Get Around Much Anymore \n6.On the Scene \n7.Lillie - (alternate take)\n 8.What's New? - (alternate take) \n9.Don't Get Around Much Anymore - (alternate take) \n10.Evidence \n11.Misterioso \n12.Epistrophy \n13.I Mean You \n14.Misterioso - (alternate take) \n15.All the Things You Are \n16.I Should Care \n17.I Should Care - (alternate take)\n\nPersonnel: Milt Jackson (vibraphone); Kenny &quot;Pancho&quot; Hagood (vocals); Lou Donaldson (alto saxophone); John Richard Lewis, Thelonious Monk (piano); Kenny Clarke, Shadow Wilson (drums).\n","torrent":{"xt":"urn:btih:aa8473fee3278ab4fd19bf9f5756aaf39d685773","amp;dn":"Milt+Jackson+Wizard+of+the+Vibes%28jazz%29%28flac%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa8473fee3278ab4fd19bf9f5756aaf39d685773","infoHashBuffer":{"type":"Buffer","data":[170,132,115,254,227,39,138,180,253,25,191,159,87,86,170,243,157,104,87,115]},"announce":[],"urlList":[]}}