{"title":"The One (Jet Li) (DivX)","uid":3247627,"size":733519363,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aa930ed0e6e426417ec3c878c1687045bde980a0&amp;dn=The+One+%28Jet+Li%29+%28DivX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"jonez","files":2,"time":1097695085,"description":"There is not one universe, but there are many, which is a multiverse. \nSupposing you are just one person, there are many other versions of \nyou in the other universes, there are ways to travel, but only a \npolice agency,MVA, can travel only for police procedures. Gabriel \nYulaw (Jet Li)is a former MVA agent, who killed another version of \nhimself in self-defense. It made the other versions of him stronger. \nWhen Yulaw found out about this, he became power-hungry killing the \n122 other versions for two years. After killing Lawless (also played \nby Jet)and getting captured by his former partner Roedecker (Delroy \nLindo) and a new MVA agent Funsch (Jason Statham) Yulaw managed to \nescape the prison and is trying to kill his last target, Gabe Law \n(also played by Jet) who is a police officer. He is also at Yulaw's \nstrength. Roedecker and Funsch now have to arrest Yulaw before he \ncan kill Gabe. There is a possibility that the universe could die \nor make Yulaw invincible. After encountering Yulaw for the first time, \nGabe thought that it was his split personality, but it wasn't. Will \nGabe be able to confront Yulaw before or after Yulaw ruins his life?\n\n\nhttp://www.imdb.com/title/tt0267804/\n\n\nA great martial arts movie starring Jet Li.\n\n\nQuality: 576x240 DivX DVDrip\n# of CD's: 1 CD in english, no subs\n\nNOTE: I had the choice between a rip that was full screen, or this \none, which is wide screen. I chose this one because it has better \nquality, especially during scenes with lots of motion.","torrent":{"xt":"urn:btih:aa930ed0e6e426417ec3c878c1687045bde980a0","amp;dn":"The+One+%28Jet+Li%29+%28DivX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa930ed0e6e426417ec3c878c1687045bde980a0","infoHashBuffer":{"type":"Buffer","data":[170,147,14,208,230,228,38,65,126,195,200,120,193,104,112,69,189,233,128,160]},"announce":[],"urlList":[]}}