{"title":"CDisplay 1.8.5.1","uid":4094988,"size":1783187,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:aae239aa4823779687547e527ed1f46ae7e8f76f&amp;dn=CDisplay+1.8.5.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"DELAHODGE","files":1,"time":1206270607,"description":"CDisplay is a free sequential image viewer utility for Microsoft Windows used to view images one at a time, or two at a time just like Comic books pages. CDisplay was written to easily view JPEG, PNG and static GIF format images sequentially. The program&amp;#039;s inspiration and implementation was partly because the existing programs currently available were too general purpose and thus were awkward to use when simply viewing images sequentially.\nLoads JPEG, PNG and static GIF images which are automatically ordered alphabetically and presented for viewing one at a time or two at a time.\nThe images may be viewed from a folder, or zipped in a .zip, .rar, .ace or .tar archive file - CDisplay is able to view images without decompressing the archive.\nPage through the images sequentially and scroll around pages with single key presses.\nMany automatic page sizing options including choices to display one or two pages at one time. Image resizing uses the Lanczos approximation for the best picture quality.\nNo bloat caused by non-essential general purpose image processing features\n\n\nCDisplay uses Comic Book Archive files, which have the extension .cbr or .cbz and are simply RAR or ZIP files, respectively. The files are archives of individual page images with a new extension for convenience. The standard icon for cbr and cbz extension is a comic balloon. The format was made popular by CDisplay but is now used by many other programs designed for reading comics.\nCDisplay supports the display of JPEG, PNG, GIF, BMP and TXT and also SFV files to confirm that the file is not corrupt, either &quot;loose&quot; or contained within RAR or ZIP files, as above.\nIf a .txt file is within a folder or .CBR file, it displays the comic&amp;#039;s contents on file opening.\nIf a .sfv file is within a folder or .CBR file, it verifies the SFV data to confirm that the rest of the content is not corrupted.\nAutomatic colour balance and yellow reduction if desired\n","torrent":{"xt":"urn:btih:aae239aa4823779687547e527ed1f46ae7e8f76f","amp;dn":"CDisplay+1.8.5.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aae239aa4823779687547e527ed1f46ae7e8f76f","infoHashBuffer":{"type":"Buffer","data":[170,226,57,170,72,35,119,150,135,84,126,82,126,209,244,106,231,232,247,111]},"announce":[],"urlList":[]}}