{"title":"The Audacity of Hops - The History of America's Craft Beer Revol","uid":9434338,"size":4947618,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aaeb3127192ba3794aaa07d80e5cd0a5b587a4b3&amp;dn=The+Audacity+of+Hops+-+The+History+of+America%27s+Craft+Beer+Revol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"hheyyouguys","files":-1,"time":1388868727,"description":"The Audacity of Hops - The History of America's Craft Beer Revolution\n\nIn 1975, there was one craft brewery in the United States; today, there are more than 2,300. Powered by millions of savvy, devoted consumers and raking in hundreds of millions annually for producers and retailers, the American craft beer movement has changed the brewing industry and the international reputation of American beer. It has upended the Big Beer giants that once seemed untouchable and forever altered the culinary habits of not only millions of Americans but millions more worldwide. \n\nThis delicious story of plucky triumph has never been chronicled in one volume--until now.\n \nBased on thorough research as well as interviews with all of the most influential names in craft brewing since the 1960s, The Audacity of Hops brims with charming, remarkable tales, which together weave a very American business story, one of formidable odds and refreshing success.\n \nThe Audacity of Hops will be the holiday and birthday gift for every craft-beer lover--indeed, for anyone who loves fine food and drink, and the people behind them. Entertaining and accessible, this book is the first of its kind: the definitive, highly praised history of the other American revolution.\n\n\n\n--------------------------------------------------------------\n--------------------------------------------------------------\n\nCheck out my other Brewing Books, Zymurgy and BYO torrents\n                           &lt;a href=&quot;\nhttp://thepiratebay.se/user/hheyyouguys&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/hheyyouguys&lt;/a&gt;\t(NOTE: If TPB keeps changing domains (ie... .org to .sx to .se), you will have to change it yourselves to see my other torrents)\t \n\n\t\t\t\t\t\t","torrent":{"xt":"urn:btih:aaeb3127192ba3794aaa07d80e5cd0a5b587a4b3","amp;dn":"The+Audacity+of+Hops+-+The+History+of+America%27s+Craft+Beer+Revol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaeb3127192ba3794aaa07d80e5cd0a5b587a4b3","infoHashBuffer":{"type":"Buffer","data":[170,235,49,39,25,43,163,121,74,170,7,216,14,92,208,165,181,135,164,179]},"announce":[],"urlList":[]}}