{"title":"Practical Theology: Spiritual Direction from St. Thomas Aquinas","uid":15617001,"size":4450037,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aaf384bc6e2fc9e15c611146e9a540c4886e6a54&amp;dn=Practical+Theology%3A+Spiritual+Direction+from+St.+Thomas+Aquinas&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"catholicstuff","files":4,"time":1471836885,"description":"Dr. Peter Kreeft - Practical Theology: Spiritual Direction from St. Thomas Aquinas (EPUB, MOBI, PDF)\r\n\r\n\r\nFrom a lifetime of studying the writings of St. Thomas Aquinas, popular author Peter Kreeft says that his amazement has continually increased not only at Aquinas' theoretical, philosophical brilliance and sanity, but also at his personal, practical wisdom, his &quot;existential bite.&quot; Yet this second dimension of St. Thomas has usually been eclipsed by the other. Kreeft wrote this book to help bring that sun out from its eclipse. He provides easily digestible samples of the religious wisdom of Aquinas.\r\n\r\nHere are 359 pieces of wisdom from St. Thomas's masterpiece, the Summa Theologiae , which Kreeft says &quot;are literally more valuable than all the kingdoms of this world because they will help you to attain 'the one thing needful,' or 'the greatest good' &quot;, the ultimate end and purpose and meaning of life. Three of its names are &quot;being a saint,&quot; &quot;beatitude&quot; (&quot;supreme happiness&quot;) and &quot;union with God.&quot; That was the principle for Kreeft in choosing which passages to use: do they help you to attain your ultimate end - sanctity, happiness, union with God? St. Thomas would have agreed with writer Leon Bloy, who often wrote that in the end &quot;there is only one tragedy in life: not to have been a saint&quot;.\r\n\r\nThese 359 gold nuggets have helped Kreeft in the struggles of real life, to live in the real world, to grow closer to the Lord, and he hopes they will do the same for his readers. After each passage directly from Aquinas, Kreeft provides brief spiritual commentary to help explain it and apply it - practical, personal, existential, &quot;livable&quot; thoughts.\r\n\r\nHe has framed these readings as answers to questions that people actually ask their spiritual directors. Each answer is taken word for word from Aquinas.\r\n\r\nAmong the many topics Aquinas and Kreeft cover here include:\r\n\r\n    The problem of evil\r\n    Interpreting the Bible\r\n    Love vs. knowledge\r\n    Reconciling justice and mercy\r\n    Human freedom and divine grace\r\n    Angels and demons\r\n    The need for theology\r\n    Predestination and free will\r\n    Three kinds of goods\r\n\r\n&quot;Its notoriously difficult to synopsize Aquinas on anything. However, if I were to choose someone to do the job well, it would be Peter Kreeft. Many will find this presentation helpful to develop their own replies to the questions that bother the minds of today's searchers.&quot;\r\n- Romanus Cessario, O.P., Saint John's Seminary, Brighton, Mass.\r\n\r\n\r\n\r\nPlease seed!\r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.se/user/catholicstuff/\r\n\r\n\r\n\r\nIf you enjoy this media, please purchase a physical copy to support the producers and share with family and friends","torrent":{"xt":"urn:btih:aaf384bc6e2fc9e15c611146e9a540c4886e6a54","amp;dn":"Practical+Theology%3A+Spiritual+Direction+from+St.+Thomas+Aquinas","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaf384bc6e2fc9e15c611146e9a540c4886e6a54","infoHashBuffer":{"type":"Buffer","data":[170,243,132,188,110,47,201,225,92,97,17,70,233,165,64,196,136,110,106,84]},"announce":[],"urlList":[]}}