{"title":"UFOs &amp; Nukes (gnv64)","uid":14947593,"size":39858879,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aca62d905a62782a6c1056340dd785252790a26b&amp;dn=UFOs+%26amp%3B+Nukes+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gnv65","files":4,"time":1466066692,"description":"UFOs and Nukes - Extraordinary Encounters at Nuclear Weapon Sites\r\nBy Robert Hastings\r\nAuthor House | 2008 | ISBN-10: 1434398315 | scanned PDF | 604 Pages | 38 mb\r\n\r\nEveryone knows about the reported recovery of a crashed alien spaceship near Roswell, New Mexico, in July 1947. However, most people are unaware that, at the time of the incident, Roswell Army Airfield was home to the world's only atomic bomber squadron, the 509th Bomb Group. Was this merely a coincidence? During the Cold War, the United States and the Soviet Union built thousands of the far more destructive hydrogen bombs, some of them a thousand times as powerful as the first atomic bombs dropped on Japan. If the nuclear standoff between the superpowers had erupted into World War III, human civilization—and perhaps the very survival of our species—would have been at risk.\r\n- Did this ominous state of affairs come to the attention of outside observers?\r\n- Was there a connection between the atomic bomber squadron based at Roswell and the reported crash of a UFO nearby? - Did those who pilot the UFOs monitor the superpowers' nuclear arms race during the dangerous Cold War era?\r\n- Do they scrutinize American and Russian nuclear weapons sites even now?\r\nUFOs and Nukes provides the startling and sometimes shocking answers to these questions. Veteran researcher Robert Hastings has investigated nuclear weapons-related UFO incidents for more than three decades and has interviewed hundreds of U.S. Air Force personnel, from airmen to colonels, who witnessed extraordinary UFO encounters at nuclear weapons sites. Their amazing stories are presented here.\r\n \nhttps://s33.postimg.org/70jg32hkv/UFOs_and_Nukes.jpg","torrent":{"xt":"urn:btih:aca62d905a62782a6c1056340dd785252790a26b","amp;dn":"UFOs+%26amp%3B+Nukes+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aca62d905a62782a6c1056340dd785252790a26b","infoHashBuffer":{"type":"Buffer","data":[172,166,45,144,90,98,120,42,108,16,86,52,13,215,133,37,39,144,162,107]},"announce":[],"urlList":[]}}