{"title":"#004 - The Velvet Underground [self-titled] w/ Squeeze [bonus di","uid":4302328,"size":115485501,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ad8c7a588014a6ed059b7095ad0f3ebfe9ff8802&amp;dn=%23004+-+The+Velvet+Underground+%5Bself-titled%5D+w%2F+Squeeze+%5Bbonus+di&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"West-Independent","files":23,"time":1216371987,"description":"#004 in the West Independent catalog, originally released in 1969 as Verve: 815454-2.\n\n\n\nReview\tby Mark Deming\n\nUpon first release, the Velvet Underground&amp;#039;s self-titled third album must have surprised their fans nearly as much as their first two albums shocked the few mainstream music fans who heard them. After testing the limits of how musically and thematically challenging rock could be on Velvet Underground &amp; Nico and White Light/White Heat, this 1969 release sounded spare, quiet, and contemplative, as if the previous albums documented some manic, speed-fueled party and this was the subdued morning after. (The album&amp;#039;s relative calm has often been attributed to the departure of the band&amp;#039;s most committed avant-gardist, John Cale, in the fall of 1968; the arrival of new bassist Doug Yule; and the theft of the band&amp;#039;s amplifiers shortly before they began recording.) But Lou Reed&amp;#039;s lyrical exploration of the demimonde is as keen here as on any album he ever made, while displaying a warmth and compassion he sometimes denied his characters. &quot;Candy Says,&quot; &quot;Pale Blue Eyes,&quot; and &quot;I&amp;#039;m Set Free&quot; may be more muted in approach than what the band had done in the past, but &quot;What Goes On&quot; and &quot;Beginning to See the Light&quot; made it clear the VU still loved rock &amp; roll, and &quot;The Murder Mystery&quot; (which mixes and matches four separate poetic narratives) is as brave and uncompromising as anything on White Light/White Heat. This album sounds less like the Velvet Underground than any of their studio albums, but it&amp;#039;s as personal, honest, and moving as anything Lou Reed ever committed to tape.\n\nand the bonus digital CD: Squeeze (1973).\n\nReview\tby Stephen Thomas Erlewine\n\nAfter Lou Reed left the Velvet Underground, bassist Doug Yule took control of the group. Retaining the name &quot;The Velvet Underground,&quot; Yule assembled several new lineups of the band and toured the U.S. By the time Yule&amp;#039;s VU recorded their first album, the band featured Boston-based vocalist Willie Alexander and was playing a set of conventional pop/rock songs. Squeeze, the only album recorded with a bastardized version of the Velvet Underground, was released in 1973 to uniformly terrible reviews; Yule broke up the band shortly after its release. Over the years, Squeeze has not only become increasingly rare -- after all, not many copies of the record were pressed -- it has disappeared from the official Velvet Underground discography, and Yule&amp;#039;s attempt to prolong the band&amp;#039;s career has virtually been forgotten.  ","torrent":{"xt":"urn:btih:ad8c7a588014a6ed059b7095ad0f3ebfe9ff8802","amp;dn":"%23004+-+The+Velvet+Underground+%5Bself-titled%5D+w%2F+Squeeze+%5Bbonus+di","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad8c7a588014a6ed059b7095ad0f3ebfe9ff8802","infoHashBuffer":{"type":"Buffer","data":[173,140,122,88,128,20,166,237,5,155,112,149,173,15,62,191,233,255,136,2]},"announce":[],"urlList":[]}}