{"title":"First FRCR Anatomy- Mock Papers (Jaypee) [PDF] [StormRG]","uid":11141854,"size":56878945,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae4a862ba1611894a9bc70fec3e2cbc39e44c44f&amp;dn=First+FRCR+Anatomy-+Mock+Papers+%28Jaypee%29+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":2,"time":1412182725,"description":"Author: Matthew, M.D. Budak (Author), Magdalena, M.D. Szewczyk-Bieda (Author), Richard White (Author), Menelaos Philippou (Author), Ganapathy Ananthakrishnan (Author)\nPaperback: 468 pages\nPublisher: JP MEDICAL PUBLISHERS; 1 edition (September 30, 2012)\nLanguage: English\nISBN-10: 1907816429\nISBN-13: 978-1907816420\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Don't hesitate to PM me if you have any questions or problem with the download,as comments on torrents are easy to miss. Please allow a couple seconds forthe seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nFirst FRCR Anatomy: Mock Papers offers the most up-to-date and comprehensive coverage of practice cases for trainees preparing for the First FRCR Anatomy exam. Chapters presented as 15 complete mock papers, covering the full range of imaging modalities. Featuring a wealth of practice cases covering all the key topics, this book provides the essential revision tool to maximise chances of exam success. Key Points *300 high quality images, reflecting the breadth of topics encountered in the actual exam *15 mock papers to enable trainees to practice and improve exam technique * Highly illustrated to simplify complex anatomy and improve understanding * Edited by highly experienced radiological anatomist, Professor Jamie Weir * Complements First FRCR Anatomy: Practice Cases - the complete FRCR Anatomy revision package","torrent":{"xt":"urn:btih:ae4a862ba1611894a9bc70fec3e2cbc39e44c44f","amp;dn":"First+FRCR+Anatomy-+Mock+Papers+%28Jaypee%29+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae4a862ba1611894a9bc70fec3e2cbc39e44c44f","infoHashBuffer":{"type":"Buffer","data":[174,74,134,43,161,97,24,148,169,188,112,254,195,226,203,195,158,68,196,79]},"announce":[],"urlList":[]}}