{"title":"Political Performances: Theory and  Practice","uid":6555140,"size":3347303,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae8202050e52ba126f9866284e59fc4bd66462cd&amp;dn=Political+Performances%3A+Theory+and++Practice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"_F1_","files":-1,"time":1311263943,"description":"Political Performances: Theory and Practice\nRodopi | June 5, 2009 | ISBN-10: 9042026065 | 384 pages | PDF | 3.20 MB\n\nPolitical Performances: Theory and Practice emerges from the work of the Political Performances Working Group of the International Federation for Theatre Research/FÃƒÂ©dÃƒÂ©ration Internationale pour la Recherche de ThÃƒÂ©ÃƒÂ¢trale. The collection of essays strives to interrogate definitions and expand boundaries of political performance. Members of Political Performances are from around the world and so approach the intersection of politics and performance from very different perspectives. Some focus on socio-political context, others on dramatic content, others on political issues and activism, and still others examine the ways in which communities perform their collective identity and political agency. The organizational structure of Political Performances highlights the variety of ways in which politics and performance converge. Each section - &quot;Queries&quot;, &quot;Texts&quot;, &quot;Contexts&quot; and &quot;Practice&quot; - frames this confluence according to certain common threads that emerge from essays that deal with topics from the ethics of autobiographical performance, the political efficacy of verbatim theatre, the challenges of community-based performance, political and self-censorship, and the impossibility of representing atrocity. The essays challenge existing ideas of political performance and point the way to new approaches.","torrent":{"xt":"urn:btih:ae8202050e52ba126f9866284e59fc4bd66462cd","amp;dn":"Political+Performances%3A+Theory+and++Practice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae8202050e52ba126f9866284e59fc4bd66462cd","infoHashBuffer":{"type":"Buffer","data":[174,130,2,5,14,82,186,18,111,152,102,40,78,89,252,75,214,100,98,205]},"announce":[],"urlList":[]}}