{"title":"NubileFilms - Antonia Sainz (Foreplay Fantasy)","uid":12488411,"size":206922502,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ae98fa390378153b7a7af40c74e2a1123b2e9723&amp;dn=NubileFilms+-+Antonia+Sainz+%28Foreplay+Fantasy%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"EndYou","files":1,"time":1443131739,"description":"---------------\r\n: Screenshots :\r\n--------------- \nhttp://www.pornempire.org/viewtopic.php?f=124&amp;t=100\r\n\r\n---------------\r\n: Description :\r\n---------------\r\nThe name of the actress: Antonia Sainz\r\nName movie: Foreplay Fantasy\r\nNPP site and the site: NubileFilms.com / NubilesNetwork.com\r\n\r\nYear: 2015\r\nGenre: Big Areolas, Blowjob, Brunette, Girl-Boy, Hardcore, High Heels, Lingerie, Medium Boobs, Panties, Pussy Licking, Short hair, Stockings, Tall Girls\r\nDuration: 00:13:24\r\n\r\nDescription:\r\nLusty Antonia Sainz has Lutro's trust as she binds his hands to the bed. Once Lutro is firmly strapped down, the hot Czech can totally take advantage of him with heated kisses to his lips and chest as she works her way down his body to spring his hard cock free. Taking his stiff rod in her hand to steady it, she slides her mouth down on Lutro's dick in an enthusiastic blowjob that quickly gets wet and wild as she eagerly bobs her head.\r\n\r\nAlthough Antonia is having fun working her man into a horny frenzy with her mouth, she knows that she has more tools at her disposal. Rising to her feet, she peels off her sheer lingerie and bra, leaving herself clad in just thigh high stockings that frame Lutro's body when she climbs on top of him and slides down on his fuck stick to ride him like a personal stud.\r\n\r\nAntonia's tit-bouncing rhythm is exciting, but in order to really rock her own world she decides to free Lutro's hands so that he can support her as she goes full throttle until a climax rips through her tight body. Lutro is quick to flip Antonia onto her back while she's still throbbing with pleasure so that he can push himself deep inside and start thrusting while she continues to pulse from her first climax.\r\n\r\nLutro's long firm thrusts are enough to get Antonia's landing strip pussy fluttering again almost immediately, but he paces himself so that she is not able to just cum again right away. Instead he draws out her pleasure, using his cock and then his mouth to help her ride the edge for as long as possible.\r\n\r\nBy the time he gets her up on her hands and knees for a doggy style pussy pounding, Lutro has driven Antonia nearly crazy with wanting. Her next climax slams through her so hard and fast that she can not hold herself up; throbbing with ecstasy, she slides down to the bed and enjoys the glorious aftershocks.\r\n\r\nWhen she has finally recovered enough to see to Lutro's pleasure, Antonia does not hold anything back. Using her hands to pump Lutro's dick, she brings him off while arching her back to aim his jizz all over her sensitive tits that were just begging for a cum shower.\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 960x540 25fps 1923kbps\r\nAudio: AAC 44100Hz stereo 127kbps","torrent":{"xt":"urn:btih:ae98fa390378153b7a7af40c74e2a1123b2e9723","amp;dn":"NubileFilms+-+Antonia+Sainz+%28Foreplay+Fantasy%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae98fa390378153b7a7af40c74e2a1123b2e9723","infoHashBuffer":{"type":"Buffer","data":[174,152,250,57,3,120,21,59,122,122,244,12,116,226,161,18,59,46,151,35]},"announce":[],"urlList":[]}}