{"title":"Remembering Traditional Hanzi BK 1 (2009) Chinese Characters","uid":10314476,"size":20178263,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aebb39b5126e21613be3daef522731998088c513&amp;dn=Remembering+Traditional+Hanzi+BK+1+%282009%29+Chinese+Characters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1402187453,"description":"\n At long last the approach that has helped thousands of learners memorize Japanese kanji has been adapted to help students with Chinese characters. Book 1 of &quot;Remembering Simplified Hanzi&quot; and &quot;Remembering Traditional Hanzi&quot; covers the writing and meaning of the 1,000 most commonly used characters in the Chinese writing system, plus another 500 that are best learned at an early stage. (Book 2 adds another 1,500 characters for a total of 3,000.) Of critical importance to the approach found in these pages is the systematic arranging of characters in an order best suited to memorization. In the Chinese writing system, strokes and simple components are nested within relatively simple characters, which can, in turn, serve as parts of more complicated characters and so on. Taking advantage of this allows a logical ordering, making it possible for students to approach most new characters with prior knowledge that can greatly facilitate the learning process. Guidance and detailed instructions are provided along the way. Students are taught to employ 'imaginative memory' to associate each character's component parts, or 'primitive elements', with one another and with a key word that has been carefully selected to represent an important meaning of the character. This is accomplished through the creation of a 'story' that engagingly ties the primitive elements and key word together. In this way, the collections of dots, strokes, and components that make up the characters are associated in memorable fashion, dramatically shortening the time required for learning and helping to prevent characters from slipping out of memory. \n\nPDF","torrent":{"xt":"urn:btih:aebb39b5126e21613be3daef522731998088c513","amp;dn":"Remembering+Traditional+Hanzi+BK+1+%282009%29+Chinese+Characters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aebb39b5126e21613be3daef522731998088c513","infoHashBuffer":{"type":"Buffer","data":[174,187,57,181,18,110,33,97,59,227,218,239,82,39,49,153,128,136,197,19]},"announce":[],"urlList":[]}}