{"title":"Peters Friends","uid":6538176,"size":716478111,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:afbbfb085d0155298d99590bb371929d4ca99baa&amp;dn=Peters+Friends&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"FatFreddy16","files":2,"time":1310580560,"description":"Peter's Friends is a 1992 British comedy-drama film written by Rita Rudner and her husband Martin Bergman, and directed and produced by Kenneth Branagh.\n \nIt starred Stephen Fry, Kenneth Branagh, Emma Thompson, Hugh Laurie, Imelda Staunton, Rita Rudner, Tony Slattery, Phyllida Law, Alex Lowe, and Alphonsia Emmanuel.\n\n\n----\nPLOT\n----\n \nIt is New Year's weekend and the friends of Peter (Fry) gather at his newly inherited country house. Ten years ago, they all acted together in a Cambridge University student comedy troupe, but it's less clear how much they have in common now.\n \nPeter's friends are Andrew (Branagh), now a writer in Hollywood; married jingle writers Roger (Laurie) and Mary (Staunton); glamorous costume designer Sarah (Emmanuel); and eccentric Maggie (Thompson), who works in publishing. Cast in sharp relief to the university chums are Carol (Rudner), the American TV star wife of Andrew; and loutish Brian (Slattery), Sarah's very recently acquired lover. Law plays Peter's disapproving housekeeper, Vera; and Lowe, her son Paul. Richard Briers appears in a cameo role as Peter's father.\n \nAlthough the film is primarily a comedy, serious overtones are present from the beginning. Peter's father has died, and Peter plans to sell the house after this last party. While Andrew and Carol's troubled marriage is played mainly for laughs, Roger and Mary are recovering from a devastating personal tragedy only slowly revealed to the audience. A lonely Maggie arrives determined to persuade Peter they should be more than just friends and Sarah's not as happy with her life as she appears.\n \nThe film deals with themes of friendship, marriage, fidelity, materialism, and coping with death and loss. It has often been described as a British The Big Chill.\n\n\n-------\nCASTING\n-------\n\nMost of the cast are actually old university friends who attended Cambridge University together. Hugh Laurie, Stephen Fry, Emma Thompson, and Tony Slattery were all in the Cambridge Footlights, a student comedy troupe similar to the one portrayed in the film. Co-writer Martin Bergman (husband of co-writer/star Rita Rudner) was also in Footlights.\n \nAt the time the film was made, Branagh was married to Thompson, who had also dated Laurie while at university. Phyllida Law is Thompson's mother and along with Richard Briers, Imelda Staunton and Alex Lowe appeared with Branagh and Thompson in Branagh's adaptation of Much Ado About Nothing the following year. Laurie and Staunton, who play the married Roger and Mary, would again appear as a married couple in 1995's Sense and Sensibility, penned by Thompson. Hugh Laurie and Stephen Fry also starred in many television shows together, notably A Bit of Fry &amp; Laurie and Jeeves and Wooster.\n \nStephen Fry, Tony Slattery and Phyllida Law later appeared together in the ITV series Kingdom.\n\n\n----------\nSoundtrack\n---------- \n\nThe soundtrack featured many artists from the 1980s, including Tears for Fears (whose song &quot;Everybody Wants to Rule the World&quot; was heard over the opening credits of the film), Eric Clapton, The Pretenders, and Bruce Springsteen.\n \nThe soundtrack did not, however, feature the cast's rendition of the Jerome Kern standard &quot;The Way You Look Tonight&quot;, as performed in the film.\n","torrent":{"xt":"urn:btih:afbbfb085d0155298d99590bb371929d4ca99baa","amp;dn":"Peters+Friends","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afbbfb085d0155298d99590bb371929d4ca99baa","infoHashBuffer":{"type":"Buffer","data":[175,187,251,8,93,1,85,41,141,153,89,11,179,113,146,157,76,169,155,170]},"announce":[],"urlList":[]}}