{"title":"The Anthony Cumia Show 2015-04-16 Ron Bennington MP4 MP3","uid":11822574,"size":475263400,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b0c7f9df2ceb71ddb1e3c5ca1aac6560ae3a716c&amp;dn=The+Anthony+Cumia+Show+2015-04-16+Ron+Bennington+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mothergoose58","files":2,"time":1429330367,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest: Ron Bennington\n\nBlowout 3 hour show!!!\n\nEpisode 147 - While waiting for Ron Bennington, Anthony talks about his excitement for the new Star Wars and plays the trailer for it, the Dennis Quaid &quot;freak-out&quot; being a hoax, Kevin Pollak's film &quot;Misery Loves Comedy&quot;, Bobo calls in with an update on his Fan Duel account, we hear about a spring break gang rape, and talk about spring break antics. After a brief interruption (RAT!!), the great Ron Bennington joins TACS to discuss spring break, the transformation of radio, lack of honesty in the industry, Ron calls out Opie and Anthony for lying on Unmasked, and Ant clears up a few things that were said regarding his relationship with Opie. The guys then chat about booze and the WNEW days, Ant dropping by Ron's show, topping yourself in radio, old bits, the pros and cons of expressing your stance, changes in news reporting, we learn about Ronnie's childhood, get a Fez update, and find out that Anthony and Opie called a truce via text. They then get into the pitfalls of social media, &quot;Ant rants&quot;, Ronnie leaves Ant semi-speechless (imagine that!) with compliments on his humor and knowledge, KtC gets called out for spilling details, they acknowledge the effects of losing a partner, and Ant admits he doesn't believe in love and ranks his friends. TACS rolls into overtime with memories of being on-air during 9/11, revisions in history, conspiracies, shitty TV, Ant's shitty ex-wife, Ron addresses Anthony's drinking, they chat about the hilarity Jim Norton brings to the table, the new TACS studio and app, the infamous &quot;little cunt text&quot;, pyramid scheming in religion, childhood mishaps, racism, Earl, Bob Eatman dropping the ball, Bill Cosby, and spies.\n\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:b0c7f9df2ceb71ddb1e3c5ca1aac6560ae3a716c","amp;dn":"The+Anthony+Cumia+Show+2015-04-16+Ron+Bennington+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0c7f9df2ceb71ddb1e3c5ca1aac6560ae3a716c","infoHashBuffer":{"type":"Buffer","data":[176,199,249,223,44,235,113,221,177,227,197,202,26,172,101,96,174,58,113,108]},"announce":[],"urlList":[]}}