{"title":"The Homeowner's Guide to Renewable Energy - (Malestrom)","uid":7778494,"size":150958512,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b149464bc3d703f5f32af830db0bcb2e67508b3d&amp;dn=The+Homeowner%27s+Guide+to+Renewable+Energy+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1351711620,"description":" &lt;a href=&quot;http://www.picturevip.com/images/00236cc6j.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.picturevip.com/images/00236cc6j.jpg&lt;/a&gt;\n\nThe Homeowner's Guide to Renewable Energy: Achieving Energy Independence Through Solar, Wind, Biomass, and Hydropower\nNew Society Publishers | Dan Chiras | 2011 | PDF+OCR | ISBN: 0865716862 | 352 pages \n\nEnergy bills have skyrocketed in the United States, and traditional energy sources can be as damaging to the environment as they are to your pocketbook. The Homeowner's Guide to Renewable Energy will show you how to slash your home energy costs while dramatically reducing your carbon footprint.\n\nCompletely revised and updated, this new edition describes the most practical and affordable methods for making significant improvements in home energy efficiency and tapping into clean, affordable, renewable energy resources. If implemented, these measures will save the average homeowner tens of thousands of dollars over the coming decades.\n\nFocusing on the latest technological advances in residential renewable energy, this guide examines each alternative energy option available including:\n\n- Solar hot water and solar hot air systems\n- Passive and active solar retrofits for heating and cooling\n- Electricity from solar, wind, and microhydro\n- Hydrogen, fuel cells, methane digesters, and biodiesel\n\nThis well-illustrated and accessible guide is an essential resource for those wanting to enter the renewable energy field. Packed with practical tips and guidelines, it gives readers sufficient knowledge to hire and communicate effectively with contractors and is a must-read for anyone interested in saving money and achieving energy independence.\n\nDan Chiras is the author of twenty-nine books on residential renewable energy and green building and the director of The Evergreen Institute's Center for Renewable Energy and Green Building, where he teaches workshops on energy efficiency, renewable energy, and green building. ","torrent":{"xt":"urn:btih:b149464bc3d703f5f32af830db0bcb2e67508b3d","amp;dn":"The+Homeowner%27s+Guide+to+Renewable+Energy+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b149464bc3d703f5f32af830db0bcb2e67508b3d","infoHashBuffer":{"type":"Buffer","data":[177,73,70,75,195,215,3,245,243,42,248,48,219,11,203,46,103,80,139,61]},"announce":[],"urlList":[]}}