{"title":"DEFCON GOG","uid":7847433,"size":134945982,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b1dbdf1f0bd670918421cff4a34ca9a9e2a30e78&amp;dn=DEFCON+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"AN0NYMOUS142857","files":-1,"time":1353510294,"description":"genre: strategy / real-time / modern\nrelease date: September 29, 2006\ncompatible with: Windows (XP, Vista, 7)\nlanguages: English\ndeveloper / publisher: Introversion Software / Introversion Software\ngame modes: multi-player, co-op\n\nBonus content included for FREE with purchase:\nmanual\nsoundtrack\n18 developers' photos\n2 posters\n6 artworks\n\nWhat's cool about it:\n\nWith a large number of game modes for multiplayer, DefCon offers many hours of non-repetitive gameplay.\nStylized graphics inspired by movies such as Wargames and Dr. Strangelove invoke a very engrossing atmosphere.\nEasy to learn, hard to master mechanics that you can use to execute countless strategies.\n\nOverview:\n\n&quot;Kill one man, and you are a murderer. Kill millions of men, and you are a conqueror. Kill them all, and you are a god.&quot; - Jean Rostand Thoughts of a Biologist\n\nYou play the role of a military commander hidden deep within an underground bunker. Your mission - to successfully exterminate your enemy's civilian population whilst disabling their ability to attack your own. Start by launching your battleships, submarines, and bombers in order to decimate your opponent's defences. Scramble together your alliances, but remember only one can stand victorious. Prepare your pre-emptive strike before one of your supposed allies get the same idea. Choose the perfect moment for betrayal, obliterating your opponents with an apocalyptic thermonuclear barrage, but get it wrong and their devastating counter attack will bring you to your knees!\n\nDEFCON is a hell of a ride for a strategy games fan. What can be more thrilling that a world-wide, thermonuclear conflict that wipes out all of humanity from the face of the Earth? You start slowly, deploying your forces on international waters, sneaking under the radar. Then, as the DEFCON level changes, players are allowed to use aggressive tactics and even start a conventional war. The conflict is slowly but unavoidably heating up as the game progresses and when it reaches a critical level then the ultimate weapons of mass destruction are unleashed. Let the countdown to extinction begin!\n\nMultiplayer notice: In order to access the multiplayer you must first enter your unique cd-key that can be found under My Account. This is NOT included.\n\nAge requirements: ESRB Rating: TEEN with Mild Violence., PEGI Rating: 7+\n\nMinimum system requirements: Windows XP / Windows Vista / Windows 7, 1.8 GHz Processor, 512MB RAM (1 GB recommended), 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended), 2GB HDD, Mouse, Keyboard.\n\nInstallation\n\nInstall and play\n","torrent":{"xt":"urn:btih:b1dbdf1f0bd670918421cff4a34ca9a9e2a30e78","amp;dn":"DEFCON+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1dbdf1f0bd670918421cff4a34ca9a9e2a30e78","infoHashBuffer":{"type":"Buffer","data":[177,219,223,31,11,214,112,145,132,33,207,244,163,76,169,169,226,163,14,120]},"announce":[],"urlList":[]}}