{"title":"The Art of Philosophy, P. Sloterdijk (2010) [0231158718]","uid":7887065,"size":947514,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2798e149539746079e89130afa71910c55b7abe&amp;dn=The+Art+of+Philosophy%2C+P.+Sloterdijk+%282010%29+%5B0231158718%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"photoshopped","files":-1,"time":1354637325,"description":"In his best-selling book You Must Change Your Life, Peter Sloterdijk argued exercise and practice were crucial to the human condition. In The Art of Philosophy, he extends this critique to academic science and scholarship, casting the training processes of academic study as key to the production of sophisticated thought. Infused with humor and provocative insight, The Art of Philosophy further integrates philosophy and human existence, richly detailing the foundations of this relationship and its transformative role in making the postmodern self.\n\nSloterdijk begins with Plato's description of Socrates, whose internal monologues were so absorbing they often rooted the philosopher in place. The original academy, Sloterdijk argues, taught scholars to lose themselves in thought, and today's universities continue this tradition by offering scope for Plato's &quot;accommodations for absences.&quot; By training scholars to practice thinking as an occupation transcending daily time and space, universities create the environment in which thought makes wisdom possible. Traversing the history of asceticism, the concept of suspended animation, and the theory of the neutral observer, Sloterdijk traces the evolution of philosophical practice from ancient times to today, showing how scholars can remain true to the tradition of &quot;the examined life&quot; even when the temporal dimension no longer corresponds to the eternal. Building on the work of Husserl, Heidegger, Nietzsche, Arendt, and other practitioners of the life of theory, Sloterdijk launches a posthumanist defense of philosophical inquiry and its everyday, therapeutic value.\n","torrent":{"xt":"urn:btih:b2798e149539746079e89130afa71910c55b7abe","amp;dn":"The+Art+of+Philosophy%2C+P.+Sloterdijk+%282010%29+%5B0231158718%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2798e149539746079e89130afa71910c55b7abe","infoHashBuffer":{"type":"Buffer","data":[178,121,142,20,149,57,116,96,121,232,145,48,175,167,25,16,197,91,122,190]},"announce":[],"urlList":[]}}