{"title":"LibreOffice_5.2.1_Win_x86.msi","uid":15787539,"size":221716480,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b28d2ede0c0df7cd3c5060ce06ca4767b62261a4&amp;dn=LibreOffice_5.2.1_Win_x86.msi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"metheguy","files":1,"time":1473343247,"description":"The software and hardware prerequisites for installing LibreOffice on a Windows system are as follows:\r\n\r\n    Microsoft Windows XP SP3, Vista, Windows Server 2008, Windows 7, Windows 8, Windows Server 2012, or Windows 10\r\n    Pentium-compatible PC (Pentium III, Athlon or more-recent system recommended)\r\n    256 MB RAM (512 MB RAM recommended)\r\n    Up to 1.5 GB available hard disk space\r\n    1024x768 resolution (higher resolution recommended), with at least 256 colors\r\n\r\nAdministrator rights are needed for the installation process. It is a recommended best practice to back up your system and data before you remove or install software.\r\n\r\nFor certain features of the software - but not most - Java is required. Java is notably required for Base.\r\n\r\n\r\nLibreOffice is the most actively developed[9] free and open source office suite, a project of The Document Foundation. It was forked from OpenOffice.org in 2010, which was an open-sourced version of the earlier StarOffice. The LibreOffice suite comprises programs for word processing, the creation and editing of spreadsheets, slideshows, diagrams and drawings, working with databases, and composing mathematical formulae. It is available in 110 languages.[7]\r\n\r\nLibreOffice uses the international ISO/IEC standard OpenDocument file format (ODF) as its native format to save documents for all of its applications. LibreOffice also supports the file formats of most other major office suites, including Microsoft Office, through a variety of import/export filters.[10][11]\r\n\r\nLibreOffice is available for a variety of computing platforms,[5] including Microsoft Windows, OS X (10.8 or newer), and Linux (including a LibreOffice Viewer for Android[12]). It is the default office suite of most popular Linux distributions.[13][14][15][16]\r\n\r\nBetween January 2011 (the first stable release) and October 2011, LibreOffice was downloaded approximately 7.5 million times.[17] The project claims 120 million unique downloading addresses from May 2011 to May 2015, excluding Linux distributions, with 55 million of those being from May 2014 to May 2015.[18]","torrent":{"xt":"urn:btih:b28d2ede0c0df7cd3c5060ce06ca4767b62261a4","amp;dn":"LibreOffice_5.2.1_Win_x86.msi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b28d2ede0c0df7cd3c5060ce06ca4767b62261a4","infoHashBuffer":{"type":"Buffer","data":[178,141,46,222,12,13,247,205,60,80,96,206,6,202,71,103,182,34,97,164]},"announce":[],"urlList":[]}}