{"title":"W. G. Sebald - On the Natural History of Destruction (2003)","uid":8806833,"size":3901560,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2b7073eedd5d2de3c6a30fd61bc3b2ca9821ec5&amp;dn=W.+G.+Sebald+-+On+the+Natural+History+of+Destruction+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"workerbee","files":-1,"time":1376355243,"description":"W. G. Sebald - On the Natural History of Destruction (Random House, 2003).  Translated by Anthea Bell.\n\nISBN: 9780375504846 | 224 pages | EPUB\n\n\nOn the Natural History of Destruction, originally published in German in 1999, is W. G. Sebald's harrowing and precise investigation of one of the least examined &quot;silences&quot; of our time. In it, the acclaimed novelist examines the devastation of German cities by Allied bombardment, and the reasons for the astonishing absence of this unprecedented trauma from German history and culture.\n\nThis void in history is in part a repression of things -- such as the death by fire of the city of Hamburg at the hands of the RAF -- too terrible to bear. But rather than record the crises about them, writers sought to retrospectively justify their actions under the Nazis. For Sebald, this is an example of deliberate cultural amnesia; his analysis of its effects in and outside Germany has already provoked angry and painful debate.\n\nSebald's incomparable novels are rooted in meticulous observation; his essays are novelistic. They include his childhood recollections of the war that spurred his horror at the collective amnesia around him. There are moments of black humour and, throughout, the unmatched sensitivity of Sebald's intelligence. This book is a vital study of suffering and forgetting, of the morality hidden in artistic decisions, and of both compromised and genuine heroics.\n\n\nReviews\n\n&quot;On the Natural History of Destruction is a quietly spoken but fierce protest at the mendacity and moral evasiveness of our time. In the tragic absence of more Sebald fiction, it will have to do. One can do no better than to say of Sebald's work what he himself quotes Elias Canetti saying of the diary, 'notable for precision and responsibility', of a survivor of Hiroshima: 'If there were any point in wondering what form of literature is essential to a thinking, seeing human being today, then it is this.'&quot; -- John Banville, The Guardian\n\n&quot;Sebald's matter-of-fact evocation of the wartime events on which his collection turns make sickening reading. He relies on the written recollections of a few contemporary witnesses, notably Hans Erich Nossack and Alexander Kluge but offers long descriptions of the terrible events in his own even voice. . . It leaves an aftertaste of sadness that flows from both its own bleak reflections and the knowledge that Sebald's indispensable voice has been silenced.&quot; -- Kenneth Baker, San Francisco Chronicle\n\n&quot;[Sebald] is writing about what he regards as a disquieting refusal to face facts--not only about what was done to the nation, but by implication, by the nation. . . No better future for humankind is possible if we do less than look upon the crimes of our past, and their catastrophic results, with 'a steadfast gaze.'&quot; -- Boston Sunday Globe \n\n&quot;Sebald approaches his subject with sensitivity, yet avoids neither descriptions of horrible carnage nor criticism of writers too preoccupied with absolving themselves of blame to faithfully portray a destroyed Germany. The result is a balanced explication of devastation and denial, and a beautiful coda for Sebald.&quot; -- Booklist \n\n&quot;The secret of Sebald's appeal is that he saw himself in what now seems almost an old-fashioned way as a voice of conscience, someone who remembers injustice, who speaks for those who can no longer speak.&quot; -- The New York Review of Books\n\n____________________________________________\n\nFor more works by W. G. Sebald, see:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8449383/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8449383/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b2b7073eedd5d2de3c6a30fd61bc3b2ca9821ec5","amp;dn":"W.+G.+Sebald+-+On+the+Natural+History+of+Destruction+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2b7073eedd5d2de3c6a30fd61bc3b2ca9821ec5","infoHashBuffer":{"type":"Buffer","data":[178,183,7,62,237,213,210,222,60,106,48,253,97,188,59,44,169,130,30,197]},"announce":[],"urlList":[]}}