{"title":"A Year With The Church Fathers: Patristic Wisdom for Daily Livin","uid":15623882,"size":4025611,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b2ceb96cb94d0abe9326f2d9b5eddb6d5440ac2d&amp;dn=A+Year+With+The+Church+Fathers%3A+Patristic+Wisdom+for+Daily+Livin&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"catholicstuff","files":3,"time":1471895886,"description":"Mike Aquilina - A Year With The Church Fathers: Patristic Wisdom for Daily Living (EPUB, MOBI, PDF)\r\n\r\nTimes change, but human nature does not. Neither do the daily struggles that all Christians experience in their walk with the Lord. Today as two thousand years ago we fight anger, pride, lust, spiritual sloth. Now as then we strive to be more diligent in prayer, more faithful to the commandments, more patient and charitable toward others. And in our time, no less than in the earliest centuries of Christianity, we need wise guidance to direct us on the road to holiness.\r\n\r\nIn A Year with the Church Fathers, popular Patristics expert Mike Aquilina gathers the wisest, most practical teachings and exhortations from the Fathers of the Church, and presents them in a format perfect for daily meditation and inspiration. The Fathers were the immediate inheritors of the riches of the Apostolic Age, and their intimacy with the revelation of Jesus Christ is beautifully evident throughout their theological and pastoral writings: a profound patrimony that is ours to read and cherish and profit from.\r\n\r\nLearn to humbly accept correction from St. Clement of Rome. Let Tertullian teach you how to clear your mind before prayer. Read St. Gregory the Great and deepen your love for the Eucharist. Do you suffer from pain or illness? St. John Chrysostom's counsels will refresh you. Do you have trouble curbing your appetite for food and other fleshly things? St. John Cassian will teach you the true way to moderation and self-control.\r\n\r\nA Year with the Church Fathers is different from a study guide, and more than a collection of pious passages. It is a year-long retreat that in just a few minutes every day will lead you on a cycle of contemplation, prayer, resolution, and spiritual growth that is guaranteed to bring you closer to God and His truth. From the Church Fathers we should expect nothing less.\r\n\r\nFrom the Back Cover: Immerse yourself in the wisest, most practical teachings and exhortations from the Fathers of the Church, presented in a format perfect for daily meditation and inspiration! Learn from St. Clement of Rome how to accept correction. Let Tertullian teach you about prayer. Read St. Gregory the Great and deepen your love for the Eucharist. Follow St. John Cassian on the way to true moderation and self-control. St. John Crysostom's counsels will refresh you from pain and illness, and St. Augustine will keep your mind from straying during prayer. A Year with the Church Fathers leads you through a daily retreat of contemplation, prayer, resolution and spirtual growth that makes the wisdom of the Fathers accessible like never before. Profoundly moving and inspiring! Guaranteed to bring you close to God and His truth. \r\n\r\n---\r\n\r\nIf you enjoy this media, please seed and purchase a physical copy to support the producers and share with family and friends. \r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.org/user/catholicstuff/","torrent":{"xt":"urn:btih:b2ceb96cb94d0abe9326f2d9b5eddb6d5440ac2d","amp;dn":"A+Year+With+The+Church+Fathers%3A+Patristic+Wisdom+for+Daily+Livin","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2ceb96cb94d0abe9326f2d9b5eddb6d5440ac2d","infoHashBuffer":{"type":"Buffer","data":[178,206,185,108,185,77,10,190,147,38,242,217,181,237,219,109,84,64,172,45]},"announce":[],"urlList":[]}}