{"title":"The Sociopath Next Door: The Ruthless Versus the Rest of Us","uid":6553812,"size":14344978,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3066d5f172f8a0c442c3cb068a7e90b58e72c35&amp;dn=The+Sociopath+Next+Door%3A+The+Ruthless+Versus+the+Rest+of+Us&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"_F1_","files":-1,"time":1311200976,"description":"By request: g8mate\n\ng8mate at 2011-07-20 20:53 CET:\nthank you !! Is there any chance to upload The Sociopath Next Door by Martha Stout ?\n\n                                  -A N D -\ng8mate at 2011-07-20 21:17 CET:\nthank you very much ! Is there any chance to upload &quot; The Sociopath Next Door &quot; by Martha Stout? cheers\n------------------------------------------------------------------------------------\n\nHERE YOU GO.\n\nBUT NO NEED TO POST REPEATED REQUESTZ. ALSO, I DON'T FOLLOW RANDOM REQUESTERS REQUESTING SAME THING TO AMPLE OF UPLOADERS. I BELIEVE: 'SOMEBODY WILL POP-UP, I DON'T NEED TO' ///\n\n------------------------------------------------------------------------------------\n\nMartha Stout: The Sociopath Next Door: The Ruthless Versus the Rest of Us[Audiobook] \nEnglish | Scan PDF | Boardway | ISBN 1400151562 | 13.6 mb\n\n[Dr.] Stout says that as many as 4% of the population are conscienceless sociopaths who have no empathy or affectionate feelings for humans or animals. As Stout (The Myth of Sanity) explains, a sociopath is defined as someone who displays at least three of seven distinguishing characteristics, such as deceitfulness, impulsivity and a lack of remorse. Such people often have a superficial charm, which they exercise ruthlessly in order to get what they want. Stout argues that the development of sociopathy is due half to genetics and half to nongenetic influences that have not been clearly identified. The author offers three examples of such people, including Skip, the handsome, brilliant, superrich boy who enjoyed stabbing bullfrogs near his family's summer home, and Doreen, who lied about her credentials to get work at a psychiatric institute, manipulated her colleagues and, most cruelly, a patient. Dramatic as these tales are, they are composites, and while Stout is a good writer and her exploration of sociopaths can be arresting, this book occasionally appeals to readers' paranoia, as the book's title and its guidelines for dealing with sociopaths indicate. ","torrent":{"xt":"urn:btih:b3066d5f172f8a0c442c3cb068a7e90b58e72c35","amp;dn":"The+Sociopath+Next+Door%3A+The+Ruthless+Versus+the+Rest+of+Us","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3066d5f172f8a0c442c3cb068a7e90b58e72c35","infoHashBuffer":{"type":"Buffer","data":[179,6,109,95,23,47,138,12,68,44,60,176,104,167,233,11,88,231,44,53]},"announce":[],"urlList":[]}}