{"title":"Fly Fishing_Vol 3_Arthur Oglesby_Stillwater Fly Fishing","uid":6803714,"size":3347580928,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b3613ade1f738541d171082a1e7456023943ae8f&amp;dn=Fly+Fishing_Vol+3_Arthur+Oglesby_Stillwater+Fly+Fishing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Victortorrent","files":10,"time":1320781397,"description":"Arthur Oglesby was once described as one of the finest fly fishermen in Europe. He was also a distinguished \n\nfilmmaker on angling, a regular contributor to the angling press and author of the comprehensive book on \n\nsalmon fishing \\&quot;Salmon\\&quot;.\n\n\\&quot;Fly Fishing\\&quot; Volume 1 is an introduction to many of the locations, tactics and techniques demonstrated \n\nthroughout the series but begins with a look at some of the basic facts behind the art of fly fishing; knowing \n\nhow to cast; knowing about water; knowing how to find the fish and knowing what fly to use.\n\nThe Wet Fly - The River Nidd\nArthur Oglesby talks about fishing for trout early in the season and demonstrates how to cover a pool from a \n\nfixed position.\n\nNymph Fishing - Driffield Beck\nOn this well known Yorkshire chalk stream Arthur explains the techniques of nymph fishing and the \\&quot;induced \n\ntake\\&quot;.\n\nStillwater Bank Fishing - Avington\nAt Avington Arthur fishes with Bob Church, one ofbest-known Stillwater specialists. Here they \n\ndiscuss the different tactics used on small still waters.\n\nThe Dry Fly - River Test\nCelebrated angler Barrie Welham joins Arthur on the famous River Test at the height of the mayfly season to \n\ndemonstrate the art of dry fly fishing.\n\nCasting Techniques.\nFor many years Arthur Oglesby ran his famous angling courses at Grantown-on-Spey. Here he demonstrates his \n\ncasting techniques with a single-handed rod, including the use of the left hand with an Overhead Cast, the \n\nSide Cast, the Roll Cast and the Double Spey Cast.\n\n\n\n\n\\&quot;Fly Fishing\\&quot; Volume 2 offers the chance to learn by observation, watching experienced anglers like Arthur \n\nOglesby and his guests catch fish on some of the finest waters in\n\nThe Hatchery - Avington\nArthur Oglesby and Bob Church look at trout that have been reared specifically for Stillwater fisheries.\n\nBoat Fishing - Rutland Water\nArthur and Bob demonstrate two popular methods of boat fishing and discuss the clues to look for in locating \n\nfish on large Stillwaters.\n\nCompetitive Fly Fishing - Grafham Water\nA look at a heat in a major fishing competition.\n\nGrayling - River Eamont\nThis is rare footage of R.V Reghyni, an angler, writer and a keen fisherman all his life. He was recognised as \n\nan authority both on salmon and grayling and is reported to have caught grayling in 107rivers. Here \n\nhe demonstrates the traditional technique of trotting for grayling...\n\nSpring Salmon - River Spey\nThe life cycle of the Salmon. Arthur explains his methods of spinning for salmon and renowned broadcaster and \n\nfisherman Hugh Falkus is seen on this famous river catching a spring salmon.\n\nAutumn Salmon - The Tweed\nArthur shows us how to fish for salmon from a boat and then on a misty autumn day catches his largest ever UK \n\nsalmon weighing 27 1/2pounds.\n\nCasting Techiques\nArthur demonstrates casting techniques with a double-handed salmon rod, including the basic Overhead Cast, the \n\nRoll Cast, the Single Handed Spey Cast and the Double Spey Cast.\n\n\n\nFishing from the bank on a small Somerset Stillwater. The sun is shining, there is little ripple and no \n\nfeeding fish are showing. Our local experts battle with these nasty conditions as they explain their varying \n\ntactics to turn a most unpromising day into a real success.\n\nJeremy Lucas and Chris Ogborne fish from a boat at Bewl Water in a bitter northeast wind and brilliant sun. \n\nJeremy Lucas works a floating line to tempt fish to the surface while Chris Ogborne yet again shows his \n\nmastery of the intermediate line and very light tackle.\n\nThe 1987 world champion Brian Leadbetter and the well-known angler Bob Church fish the mighty Grafham Water. \n\nFish are hard to come by as these anglers search the depths with a variety of lines and flies. Bob Church \n\nproves his great versatility as he switches to the mysterious Northampton style and starts to catch fish.\n\nWe visit Rutland Water during the international final of the Benson &amp; Hedges Championship. Under great \n\npressure, the top anglers in the country fish for the most prestigious prize in competitive fly fishing.\n\nChew Valley Lake, that jewel of water in the Mendips may be full of fish, but they can be very choosey on \n\ncertain days. John Braithewaite and Chris Ogborne, both former captains of England show how to tackle really \n\nfinicky fish. We see them follow and even boil at the fly, but hooking them is something else.\n\nArthur Oglesby fishes the wild loughs of Southern Ireland for salmon and sea trout. Tempting these migratory \n\nfish when conditions are not perfect has always been one of the great frustrations of angling. Arthur Oglesby \n\nuses his vast experience to prove that it can be done, and Jeremy Lucas shows the locals howreservoir \n\ntechniques can catch sea trout when all the traditional methods have failed.\n\nThis DVD provides a fascinating insight into Stillwater angling and the personalities that have developed many \n\nof the techniques that have made them so successful.\n\n\nYou guys better keep seeding for a looooong time when download has completed, thanks\t","torrent":{"xt":"urn:btih:b3613ade1f738541d171082a1e7456023943ae8f","amp;dn":"Fly+Fishing_Vol+3_Arthur+Oglesby_Stillwater+Fly+Fishing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3613ade1f738541d171082a1e7456023943ae8f","infoHashBuffer":{"type":"Buffer","data":[179,97,58,222,31,115,133,65,209,113,8,42,30,116,86,2,57,67,174,143]},"announce":[],"urlList":[]}}