{"title":"Yo Yo Ma - Soul Of The Tango TQMP","uid":4761045,"size":354960912,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b36ba4065eb630999b40450a2a17de2a8c63888e&amp;dn=Yo+Yo+Ma+-+Soul+Of+The+Tango+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"zootallure","files":28,"time":1236700997,"description":"-Yo Ma was born in Paris to Chinese parents and had a musical upbringing. His mother, Marina Lu, was a singer, and his father, Hiao-Tsiun Ma, was a professor of music. His family moved to New York when he was four years old.\n\nAt a very young age, Ma began studying violin, and later viola, before taking up the cello in 1960 at age four. The child prodigy began performing before audiences at age five, and performed for President John F. Kennedy when he was seven.[3] At age eight, he appeared on American television in a concert conducted by Leonard Bernstein. By fifteen years of age, Ma had graduated from Trinity School in New York and appeared as a soloist with the Harvard Radcliffe Orchestra in a performance of the Tchaikovsky: Rococo Variations.\n\nMa studied at the Juilliard School of Music with Leonard Rose and attended Columbia University before ultimately enrolling at Harvard University. But, at some point, he began questioning if he should continue his studies, that is until he was inspired by Pablo Casals's performances in the seventies.[citation needed]\n\nHowever, even before that time, he had steadily gained fame and had performed with most of the world's major orchestras. His recordings and performances of the Johann Sebastian Bach: Cello Suites recorded in 1983 and again in 1994-1997 are particularly acclaimed. He has also played a good deal of chamber music, often with the pianist Emanuel Ax, with whom he has a close friendship back from their days together at the Juilliard School of Music in New York.\n\nHe received his bachelor's degree from Harvard in 1976.[4] In 1991, he received an honorary doctorate from Harvard.[5]\n\nHe is married to Jill Horner, a German Language professor.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay ?thank you? by seeding... just seed, it is not harmful to your health:-)","torrent":{"xt":"urn:btih:b36ba4065eb630999b40450a2a17de2a8c63888e","amp;dn":"Yo+Yo+Ma+-+Soul+Of+The+Tango+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b36ba4065eb630999b40450a2a17de2a8c63888e","infoHashBuffer":{"type":"Buffer","data":[179,107,164,6,94,182,48,153,155,64,69,10,42,23,222,42,140,99,136,142]},"announce":[],"urlList":[]}}