{"title":"International Standard Bible Encyclopedia - James Orr","uid":11773451,"size":18987052,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b383b9191638afdda1b9adb5084338e0dddfdfa5&amp;dn=International+Standard+Bible+Encyclopedia+-+James+Orr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1427168482,"description":"\nThe International Standard Bible Encyclopedia is an exhaustive classic Biblical encyclopedia consisting of five paper volumes. This bastion of knowledge is now available in one beautifully formatted ebook.\n\nThe ISBE includes almost 10000 thoroughly written authoritative articles representing the scholarship of nearly 200 evangelical scholars.\n\nIn harmony with the practical and authoritative character of the Encyclopedia the greatest pains were taken by the authors to secure comprehensiveness and completeness in its presentation of all Biblical matters, and in its fullness of typical scriptural references on all subjects dealt with. In scope the work embraces the Old and New Testaments and the Apocrypha, together with all related subjects of Language, Text, Literature (apocalyptic, apocryphal, sub-apostolic, etc.), Archeology, historical and religious environment?whatever, in short, may throw light on the meaning and message of the sacred Book. The aim was that nothing great or small conducing to this end was to be omitted. History of peoples and religions, Ethnology, Geography, Topography, Biography, Arts and Crafts, Manners and Customs, Family Life, Natural History, Agriculture, War, Shipping, Ritual, Laws, Sects, Music, and all else pertaining to the outer and inner life of the people of the Bible, and therefore throwing light upon the meaning of the original writers, are amply and minutely treated. Proper names are explained and their occurrences in the Bible and Apocrypha noted. Large space was devoted to the meanings and uses of the more ordinary, as well as of rarer and obsolete, English words with special reference to their Hebrew and Greek originals and to the variations of usage in the King James/Authorized Version and the Revised Versions. Careful attention was given to the figurative uses of words in connection with all subjects where such uses occur.\n\nIncorporates a cross-reference system between the articles and the included King James Bible, which makes it easy to navigate a huge amount of scholarly information and read the scripture.\n\n\nAbout the author:\nJames Orr was a Scottish Presbyterian minister and professor of church history and then theology. He was an influential defender of evangelical doctrine and a contributor to The Fundamentals.\n\nIn 1870, he obtained an M.A. in Philosophy of Mind, and after graduating from the theological college of the Presbyterian Church, he was ordained a minister in Hawick. In 1885 he received a D.D. from Glasgow University, and in the early 1890s delivered a series of lectures that later became the influential The Christian View of God and the World. He was appointed professor of Church history in 1891 at the theological college of the United Presbyterian Church. He was one of the primary promoters of the union of the United Presbyterian Church with the Free Church of Scotland, and he represented the United Presbyterians in the unification talks. After they joined in 1900, he moved to Free Church College (now Trinity College), as professor of apologetics and theology. He lectured widely in both Britain and the United States","torrent":{"xt":"urn:btih:b383b9191638afdda1b9adb5084338e0dddfdfa5","amp;dn":"International+Standard+Bible+Encyclopedia+-+James+Orr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b383b9191638afdda1b9adb5084338e0dddfdfa5","infoHashBuffer":{"type":"Buffer","data":[179,131,185,25,22,56,175,221,161,185,173,181,8,67,56,224,221,223,223,165]},"announce":[],"urlList":[]}}