{"title":"Human Computer Interaction - (Malestrom)","uid":4718096,"size":40122066,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3906163b099095160f06e42fd80d1a989dcbd2f&amp;dn=Human+Computer+Interaction+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1234379245,"description":" &lt;a href=&quot;http://www.image-upload.net/images/bv8crv8ki9tx7l79zyi2.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/bv8crv8ki9tx7l79zyi2.jpeg&lt;/a&gt;\n\nPanayiotis Zaphiris, Chee Siang Ang, &quot;Human Computer Interaction: Concepts, Methodologies, Tools and Applications&quot;\nInformation Science Reference | 2008-10-30 | ISBN: 1605660523 | 2824 pages | PDF \n\nThe systematic study of human-computer interaction has arguably been the most significant factor driving the exponential increase in technology acceptance, diffusion, and utilization, over the past two decades, as well as the technology-driven productivity gains that have benefited a full spectrum of organizations.\nHuman Computer Interaction: Concepts, Methodologies, Tools, and Applications penetrates the human computer interaction (HCI) field with more breadth and depth of comprehensive research than any other publication. The four-volume set contains more than 200 authoritative works from over 250 leading experts in the field of human computer interaction. This groundbreaking collection contains significant chapters in topics such as Web logs, technology influences, and human factors of information systems and technologies. Human Computer Interaction: Concepts, Methodologies, Tools, and Applications is the single vital source for practitioners and academicians aspiring to expand their knowledge of HCI.\n\n\nAbout the Author\n\n\nPanayiotis Zaphiris is a senior lecturer at the Centre for Human-Computer Interaction Design, School of Informatics of City University London, UK. Before joining City University, he was a researcher at the Institute of Gerontology at Wayne State University, USA, where he also got his Ph.D. in Human-Computer Interaction. He also holds an MSc in Systems Engineering and a BSc in Electrical Engineering from the University of Maryland. His research interests lie in Human-Computer Interaction with an emphasis in inclusive design and social aspect of computing. He is also interested in Internet-related research, such as Web usability, online communities, e-learning, computer aided leanguage learning (CALL) and social network analysis of online computer-mediated human-to-hman interactions. Panayiotis was the principal investigator of the JISC Information Visualisation Foundation Student an a co-investigator on teh DRC Formal Investigation into Web Site Accessibility (managing the automatic testing of 1000 websites) and the JISC Usability Studies for JISC Services and Information Environment projects.\n\n\nChee Siang Ang is a research fellow in the Centre for Human-Computer Interaction (HCI) Design. He is interested in human interactions and social tendencies in the virtual world, particularly Second Life, from a sociological, psychological and HCI perspective. His main research interests include the psychology and sociology of computer games, virtual worlds or 3D Computer-Mediated Communication (CMC), learning theories particularly in gaming, digital media such as interactive narrative and simulation. ","torrent":{"xt":"urn:btih:b3906163b099095160f06e42fd80d1a989dcbd2f","amp;dn":"Human+Computer+Interaction+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3906163b099095160f06e42fd80d1a989dcbd2f","infoHashBuffer":{"type":"Buffer","data":[179,144,97,99,176,153,9,81,96,240,110,66,253,128,209,169,137,220,189,47]},"announce":[],"urlList":[]}}