{"title":"Derek &amp; the Dominos - Layla and Other Assorted Love Songs [F","uid":10539459,"size":635084215,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b3943fc9a2079a9c7f8c5e391285aeeee6459776&amp;dn=Derek+%26amp%3B+the+Dominos+-+Layla+and+Other+Assorted+Love+Songs+%5BF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Big-Papi","files":-1,"time":1405208779,"description":"Source: 1990 Polydor CD + Fresh Cover Art Scan\n\nOhhhh, Sonnnnn, if you are a Clapton Fan then Big Papi has more quality that is free for the pickin'\n\n\nForces are trying to keep this from you: 695492E9BB3EAC0F9E483D1E3FB6E3042DC41115\n\n- Big Papi\n\n\n\nBy Themis-Athena\n\n&quot;Have you ever loved a woman, so much you're tremblin' in pain, and all the time you know she bears another man's name - but you just love that woman so much, it's a shame and a sin ... and all the time you know she belongs to your very best friend!&quot; If you'd never heard this album's title track, you would swear that &quot;Have You Ever Loved A Woman&quot; was the song that Eric Clapton wrote for Pattie Boyd Harrison; not only do the lyrics of Billy Myles' blues classic fit so perfectly, Clapton positively pours his heart out as he sings them, and his guitar screams with the pain of unrequited love. And even before get to this song, Clapton's own &quot;Bell Bottom Blues&quot; lays bare similar feelings and recalls his infamous heroin ultimatum to Pattie (&quot;Either you come with me or I'll take that&quot;): &quot;Do you wanna see me crawl across the floor to you? Do you wanna hear me beg you to take me back?&quot; And as the man pleads with her, so does his guitar, and you wonder what woman could possibly have resisted such an impassioned plea.\n\nUntil of course, almost at the end of the album, you hear &quot;Layla,&quot; this record's motto more than a simple title track and, in many respects, its reason for being. Torn by personal insecurity, Clapton used the cover and seeming anonymity of yet another band, and the parable of a medieval Persian love story (&quot;Layla and Majnun&quot; - reportedly, &quot;majnun,&quot; in Persian, means madman) to put into music what he couldn't put into words alone. From its opening riff to its last note the song is pure blues, Clapton audibly on the brink of the madness he sings about, and his guitar wailing, moaning and crying out all that was in his heart: &quot;Layla ... you got me on my knees - Layla ... I'm begging darling, please - Layla ... won't you ease my worry now?&quot; Sparks must have been flying in the studio while Eric Clapton and Duane Allman, recruited by manager Tom Dowd to add inspiration and take some of the lead guitar weight off Clapton's shoulders, drove each other to ever greater heights, simultaneously feeding off and to each other.\n\nLike most of the album, &quot;Layla&quot; was recorded live in the studio, and only a live recording could transmit this feverish outbreak of passion. Merely listening to the song is emotionally exhausting, and you can only imagine what must have gone on in the studio and inside Clapton during its recording. To hear the Allman Brothers' drummer Butch Trucks tell the story (in an interview for &quot;Off the Record&quot;), Duane Allman gave &quot;Layla&quot; its finishing touch when he added the five notes immediately following its signature riff. Yet, Allman is not credited as a writer (if that story is true, though, how much more than those five notes would it have taken I wonder?); only drummer Jim Gordon is, for having written the song's piano closing - which he had to be persuaded to allow to be used.\n\nWhile Eric Clapton continued to perform the song unaltered for years after its initial recording, he spontaneously decided to include it in the setlist of his MTV &quot;Unplugged&quot; appearance where, deprived of all its riffs, even its signature beginning toned down to a few simple notes, and Clapton's voice unexpectedly reflective, Layla assumed a different personality although not a word of the lyrics was altered. Yet, just as Eric Clapton's and Pattie Boyd's marriage was over by then, Layla was now less an object of burning desire than somebody the singer thought about - thought back to maybe, or sought a conversation with, possibly cautioning her about the consequences of her actions, or recalling his experiences with her: &quot;What will you do when you get lonely, no one waiting by your side? You've been running, hiding much too long - you know it's just your foolish pride ...&quot; And although Clapton has gone back to performing the song in its &quot;plugged in&quot; version during his recent tour in promotion of &quot;Reptile,&quot; he has confined himself to talking only about its musical values, commenting on the technical difficulties of playing riffs and chords that are virtually opposite to what you are singing in an interview for the &quot;Reptile&quot; tour's official program.\n\nBesides Eric Clapton and late addition Duane Allman, Derek And The Dominos consisted of the musicians &quot;left over&quot; by the breakup of Delaney and Bonnie, with whom Clapton had briefly found shelter after yet another supergroup of his (Blind Faith) had disintegrated way too quickly: Bobby Whitlock, Carl Radle and Jim Gordon. Like virtually all of Eric Clapton's albums, solo as well as with his various bands, this record combines material written by Clapton himself and covers of songs he liked; and of course, there is much more to it than &quot;Layla,&quot; &quot;Have You Ever Loved A Woman&quot; and &quot;Bell Bottom Blues.&quot; As always, Clapton makes his mark with every song alike, and as always, he needs and has found (or Tom Dowd found for him) a cast of outstanding musicians to work with. Segar/Bronzy's &quot;Key to the Highway&quot; becomes an extended blues jam session as there ever was one, and Jimmie Cox's &quot;Nobody Knows You When You're Down and Out&quot; forecasts the feelings which, among other things, later compelled Clapton to establish the Crossroads foundation.\n\nEric Clapton has said about Derek And The Dominos in the interview for the &quot;Reptile&quot; tour program: &quot;[That] was a band I really liked - and it's almost like I wasn't in that band. It's just a band that I'm a fan of. Sometimes, my own music can be like that. When it's served its purpose to being good music, I don't associate myself with it any more. It's like someone else. It's easy to do those songs then.&quot; Hearing the raging pain of &quot;Layla&quot;'s original recording, you wonder whether this is maybe also the only way for him to do it now ... at least &quot;plugged in.&quot;\n\n\n---------------------------------------------------------------------\nDerek &amp; the Dominos - Layla and Other Assorted Love Songs (Polydor 847 090)\n---------------------------------------------------------------------\n\nArtist...............: Derek &amp; the Dominos\nAlbum................: Layla and Other Assorted Love Songs (Polydor 847 090)\nGenre................: Blues-Rock\nSource...............: CD\nYear.................: 1970 11\n\nFLAC\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 58 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\n\nMP3 V0 (Highest Quality Available For MP3)\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 264kbps)\nChannels.............: Joint Stereo / 44100 hz\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. Derek &amp; the Dominos - I Looked Away [03:04]\n2. Derek &amp; the Dominos - Bell Bottom Blues [05:02]\n3. Derek &amp; the Dominos - Keep On Growing [06:21]\n4. Derek &amp; the Dominos - Nobody Knows You When You're Down and Out[05:00]\n5. Derek &amp; the Dominos - I Am Yours [03:35]\n6. Derek &amp; the Dominos - Anyday [06:35]\n7. Derek &amp; the Dominos - Key To the Highway [09:45]\n8. Derek &amp; the Dominos - Tell the Truth [06:39]\n9. Derek &amp; the Dominos - Why Does Love Got To Be So Sad [04:44]\n10. Derek &amp; the Dominos - Have You Ever Loved a Woman [06:55]\n11. Derek &amp; the Dominos - Little Wing [05:35]\n12. Derek &amp; The Dominos - It's Too Late [03:48]\n13. Derek &amp; The Dominos - Layla [07:05]\n14. Derek &amp; the Dominos - Thorn Tree In the Garden [02:52]\n\nPlaying Time.........: 01:17:06","torrent":{"xt":"urn:btih:b3943fc9a2079a9c7f8c5e391285aeeee6459776","amp;dn":"Derek+%26amp%3B+the+Dominos+-+Layla+and+Other+Assorted+Love+Songs+%5BF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3943fc9a2079a9c7f8c5e391285aeeee6459776","infoHashBuffer":{"type":"Buffer","data":[179,148,63,201,162,7,154,156,127,140,94,57,18,133,174,238,230,69,151,118]},"announce":[],"urlList":[]}}