{"title":"Powersat by Ben Bova (epub,mobi,pdf)","uid":10578656,"size":2554537,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3c0048cbe750c0372516d3929e9811e4f6c9de0&amp;dn=Powersat+by+Ben+Bova+%28epub%2Cmobi%2Cpdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"gratefuldawg77","files":5,"time":1405656998,"description":"&quot;Two hundred thousand feet up, things go horribly wrong. An experimental low-orbit spaceplane breaks up on reentry, falling to earth over a trail hundreds of miles long. And it its wake is the beginning of the most important mission in the history of space.\n\nAmerica needs energy, and Dan Randolph is determined to give it to them. He dreams of an array of geosynchronous powersats, satellites which gather solar energy and beam it to generators on Earth, freeing America from its addiction to fossil fuels and breaking the power of the oil cartels forever. But the wreck of the spaceplane has left his company, Astro Manufacturing, on the edge of bankruptcy. \n\nWorse, Dan discovers that the plane worked perfectly right up until the moment that saboteurs knocked it out of the sky. And whoever brought it down is willing and able to kill again to keep Astro grounded.\n\nNow Dan has to thread a dangerous maze. The visible threats are bad enough: Rival firms want to buy him out and take control of his dreams. His former lover wants to co-opt his unlimited-energy idea as a campaign plank for the candidate she's grooming for the presidency. NASA and the FAA want to shut down his maverick firm. And his creditors are breathing down his neck.\n\nMaking matters even more dangerous, an international organization of terrorists sees the powersat as a threat to their own oil-based power. And they've figured out how to use it as a weapon in their war against the West.\n\nA sweeping mix of space, murder, romance, politics, secrets, and betrayal, Powersat will take you to the edge of space and the dawning of a new world&quot;\n &lt;a href=&quot;\nhttps://www.goodreads.com/book/show/267291.Powersat&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.goodreads.com/book/show/267291.Powersat&lt;/a&gt;","torrent":{"xt":"urn:btih:b3c0048cbe750c0372516d3929e9811e4f6c9de0","amp;dn":"Powersat+by+Ben+Bova+%28epub%2Cmobi%2Cpdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3c0048cbe750c0372516d3929e9811e4f6c9de0","infoHashBuffer":{"type":"Buffer","data":[179,192,4,140,190,117,12,3,114,81,109,57,41,233,129,30,79,108,157,224]},"announce":[],"urlList":[]}}