{"title":"The Terror Factory by Trevor Aaronson","uid":9684735,"size":778069,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4134e090ac787b26d18df1b1c2beb5a0776e06c&amp;dn=The+Terror+Factory+by+Trevor+Aaronson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"PirateBook","files":2,"time":1393741317,"description":"\nThe Terror Factory: Inside the FBI's Manufactured War on Terrorism by Trevor Aaronson\n\nA groundbreaking work of investigative journalism, The Terror Factory: Inside the FBI's Manufactured War on Terrorism exposes how the FBI has, under the guise of engaging in counterterrorism since 9/11, built a network of more than 15,000 informants whose primary purpose is to infiltrate Muslim communities to create and facilitate phony terrorist plots so that the Bureau can then claim it is winning the war on terror.\n\nAn outgrowth of Trevor Aaronson's work as an investigative reporting fellow at the University of California, Berkeley, which culminated in an award-winning cover story in Mother Jones magazine, The Terror Factory reveals shocking information about the criminals, con men, and liars the FBI uses as paid informants--including the story of an accused murderer who has become one of the Bureau's most prolific terrorism snitches--as well as documenting the extreme methods the FBI uses to ensnare Muslims in terrorist plots, which are in reality conceived and financed by the FBI.\n\nThe book also offers unprecedented detail into how the FBI has transformed from a reactive law enforcement agency to a proactive counterterrorism organization that traps hapless individuals in manufactured terrorist plots in order to justify the $3 billion it spends every year fighting terrorism.\n\nMeet the Author:\n\nTrevor Aaronson is co-founder of the Florida Center for Investigative Reporting and a senior fellow at the Schuster Institute for Investigative Journalism. He was a 2010-11 investigative reporting fellow at the University of California, Berkeley, where his reporting about FBI informants in U.S. Muslim communities resulted in a Mother Jones cover story that won multiple awards, including the John Jay College/H.F. Guggenheim excellence in Criminal Justice reporting Award, the Molly National Journalism Prize, and the international Data Journalism Award.\n\nGenre: Non-Fiction | Government | Terrorism","torrent":{"xt":"urn:btih:b4134e090ac787b26d18df1b1c2beb5a0776e06c","amp;dn":"The+Terror+Factory+by+Trevor+Aaronson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4134e090ac787b26d18df1b1c2beb5a0776e06c","infoHashBuffer":{"type":"Buffer","data":[180,19,78,9,10,199,135,178,109,24,223,27,28,43,235,90,7,118,224,108]},"announce":[],"urlList":[]}}