{"title":"Discovery of Design - Donald DeYoung","uid":11773186,"size":3322621,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b448aa950397f45d18c0f954fb1c917b3c9c72b7&amp;dn=Discovery+of+Design+-+Donald+DeYoung&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1427157682,"description":"A world created in perfection, now unveiled...\n\nFrom the frontiers of scientific discovery, researchers are now taking design elements from the natural world and creating extraordinary breakthroughs that benefit our health, our quality of life, our ability to communicate, and even help us work more efficiently.\n\nAn exciting look at cutting-edge scientific advances, Discover of Design highlights incredible examples that include:\n\n-How things like batteries, human organ repair, micro-lenses, automotive engineering, paint, and even credit card security all have links to natural designs\n-Innovations like solar panels in space unfurled using technology gleaned from beech tree leaves, and optic research rooted in the photonic properties of opal gemstones\n-Current and future research from the fields of stealth technology, communications, cosmetics, nanotechnology, surveillance, and more!\n\nTake a fantastic journey into the intersection of science and God's blueprints for life - discovering answers to some of the most intricate challenges we face. Experience this powerful apologetics message in a multi-purpose resource as a personal enrichment tool or as an educational supplement.\n\n\nAbout the author:\nDonald B. DeYoung chairs the Natural Science Division at Grace College in Winona Lake, Indiana, where he resides. He is also on the faculty of the Institute for Creation Research, San Diego. DeYoung writes and speaks on creation topics","torrent":{"xt":"urn:btih:b448aa950397f45d18c0f954fb1c917b3c9c72b7","amp;dn":"Discovery+of+Design+-+Donald+DeYoung","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b448aa950397f45d18c0f954fb1c917b3c9c72b7","infoHashBuffer":{"type":"Buffer","data":[180,72,170,149,3,151,244,93,24,192,249,84,251,28,145,123,60,156,114,183]},"announce":[],"urlList":[]}}