{"title":"Blind to Betrayal, Why We Fool Ourselves [Epub &amp; Mobi] [Stor","uid":10333196,"size":912644,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b44ed9666da5a39ee12135e1b6d72f0baec6d91c&amp;dn=Blind+to+Betrayal%2C+Why+We+Fool+Ourselves+%5BEpub+%26amp%3B+Mobi%5D+%5BStor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"krystine","files":-1,"time":1402438175,"description":"Blind to Betrayal: Why We Fool Ourselves We Aren't Being Fooled\nAuthor: Jennifer J. Freyd &amp; Pamela Birrell\nPublished: 2013\nPublisher: Wiley\nISBN: 9780470604403\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\nOne of the world's top experts on betrayal looks at why we often can't see it right in front of our faces\nIf the cover-up is worse than the crime, blindness to betrayal can be worse than the betrayal itself. Whether the betrayer is an unfaithful spouse, an abusive authority figure, an unfair boss, or a corrupt institution, we often refuse to see the truth order to protect ourselves. This book explores the fascinating phenomenon of how and why we ignore or deny betrayal, and what we can gain by transforming &quot;betrayal blindness&quot; into insight.\n\nExplains the psychological phenomenon of &quot;betrayal blindness&quot;, in which we implicitly choose unawareness in order to avoid the risk of seeing treachery or injustice\nBased on the authors' substantial original research and clinical experience carried out over the last decade as well as their own story of confronting betrayal\nFilled with fascinating case studies involving unfaithful spouses, abusive authority figures and corrupt institutions, to name a few\nIn a remarkable collaboration of science and clinical perspectives, Jennifer Freyd, one of the world's top experts on betrayal and child abuse, teams up with Pamela Birrell, a psychotherapist and educator with 25 years of experience.","torrent":{"xt":"urn:btih:b44ed9666da5a39ee12135e1b6d72f0baec6d91c","amp;dn":"Blind+to+Betrayal%2C+Why+We+Fool+Ourselves+%5BEpub+%26amp%3B+Mobi%5D+%5BStor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b44ed9666da5a39ee12135e1b6d72f0baec6d91c","infoHashBuffer":{"type":"Buffer","data":[180,78,217,102,109,165,163,158,225,33,53,225,182,215,47,11,174,198,217,28]},"announce":[],"urlList":[]}}