{"title":"The Simpsons - Season 4 - Audio Commentary - DVDRip - AAC","uid":7407083,"size":311660839,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:b468fff7ad83437dd79631282a842eadfed68305&amp;dn=The+Simpsons+-+Season+4+-+Audio+Commentary+-+DVDRip+-+AAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"schleicher","files":24,"time":1341272655,"description":"A Streetcar Named Marge (8F18) (Audio Commentary by Matt Groening, Al Jean, Mike Reiss, Hank Azaria, Jon Lovitz and Jeff Martin)\n\nBrother from the Same Planet (9F12) (Audio Commentary by Matt Groening, Al Jean, Mike Reiss, Jon Vitti and Jeff Lynch)\n\nDuffless (9F14) (Audio Commentary by Matt Groening, Al Jean, Mike Reiss, David M. Stern and Jim Reardon)\n\nHomer the Heretic (9F01) (Audio Commentary by Matt Groening, Al Jean, George Meyer and Jim Reardon)\n\nHomer's Triple Bypass (9F09) (Audio Commentary by Matt Groening, Al Jean, Mike Reiss, Michael Carrington and David Silverman)\n\nI Love Lisa (9F13) (Audio Commentary by Matt Groening, Al Jean, Frank Mula, Wes Archer and David Silverman)\n\nItchy &amp; Scratchy - The Movie (9F03) (Audio Commentary by Matt Groening, Al Jean, Mike Reiss and Rich Moore)\n\nKamp Krusty (8F24) (Audio Commentary by Matt Groening, Al Jean, Mark Kirkland and David Silverman)\n\nKrusty Gets Kancelled (9F19) (Audio Commentary by Matt Groening, Al Jean, Mike Reiss and David Silverman)\n\nLast Exit to Springfield (9F15) (Audio Commentary by Matt Groening, Al Jean, Jay Kogen, Wallace Wolodarsky and Mark Kirkland)\n\nLisa the Beauty Queen (9F02) (Audio Commentary by Matt Groening, Al Jean, Mike Reiss, Jeff Martin and Mark Kirkland)\n\nLisa's First Word (9F08) (Audio Commentary by Matt Groening, Al Jean, Jeff Martin and Mark Kirkland)\n\nMarge Gets a Job (9F05) (Audio Commentary by Matt Groening, Al Jean, Bill Oakley, Josh Weinstein, Jeff Lynch and Jim Reardon)\n\nMarge in Chains (9F20) (Audio Commentary by Matt Groening, Al Jean, Bill Oakley, Josh Weinstein, Jim Reardon and Jeff Lynch)\n\nMarge vs. the Monorail (9F10) (Audio Commentary by Matt Groening, Al Jean, Mike Reiss, Rich Moore and David Silverman)\nMarge vs. the Monorail (9F10) (Additional Audio Commentary by Matt Groening, Al Jean, Mike Reiss, Conan O'Brien, Rich Moore and David Silverman)\n\nMr. Plow (9F07) (Audio Commentary by Matt Groening, Al Jean, Jon Vitti and Jim Reardon)\n\nNew Kid on the Block (9F06) (Audio Commentary by Matt Groening, Al Jean, Mike Reiss, Conan O'Brien and David Silverman)\n\nSelma's Choice (Audio Commentary by Matt Groening, Al Jean, Mike Reiss, David M. Stern and Jim Reardon)\n\nSo It's Come to This - A Simpsons Clip Show (9F17) (Audio Commentary by Matt Groening, Al Jean, Mike Reiss, Jon Vitti and Jeff Lynch)\n\nThe Front (9F16) (Audio Commentary by Matt Groening, Al Jean, Mike Reiss, Adam I. Lapidus and Rich Moore)\n\nTreehouse of Horror III (9F04) (Audio Commentary by Matt Groening, Al Jean, Jay Kogen, Wallace Wolodarsky and Jon Vitti)\n\nWhacking Day (9F18) (Audio Commentary by Matt Groening, Al Jean, Mike Reiss, Jeff Lynch and David Silverman)","torrent":{"xt":"urn:btih:b468fff7ad83437dd79631282a842eadfed68305","amp;dn":"The+Simpsons+-+Season+4+-+Audio+Commentary+-+DVDRip+-+AAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b468fff7ad83437dd79631282a842eadfed68305","infoHashBuffer":{"type":"Buffer","data":[180,104,255,247,173,131,67,125,215,150,49,40,42,132,46,173,254,214,131,5]},"announce":[],"urlList":[]}}