{"title":"God's Debris: a Thought Experiment-Scott Adams AZW3, EPUB, MOBI","uid":14819801,"size":700164,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b50f8a193a0d1ad14bb07f54e3ce83851c8f9d2e&amp;dn=God%27s+Debris%3A+a+Thought+Experiment-Scott+Adams+AZW3%2C+EPUB%2C+MOBI&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"FreddyFroggy1","files":5,"time":1465253754,"description":"God's Debris: a Thought Experiment—Scott Adams. Formats: AZW3, EPUB, MOBI. Published in 2004. \r\nTags: Fiction, God, Philosophy, Physics, Religion\r\nisbn: 9781449459840\r\n\r\nGod's Debris is the first non-Dilbert, non-humor book by best-selling author Scott Adams. Adams describes God's Debris as a thought experiment wrapped in a story. \r\n\r\nImagine that you meet a very old man who you eventually realize knows literally everything. Imagine that he explains for you the great mysteries of life: quantum physics, evolution, God, gravity, light psychic phenomenon, and probability in a way so simple, so novel, and so compelling that it all fits together and makes perfect sense. What does it feel like to suddenly understand everything?\r\n\r\nYou may not find the final answer to the big question, but God's Debris might provide the most compelling vision of reality you will ever read. The thought experiment is this: Try to figure out what's wrong with the old man's explanation of reality. \r\n\r\nAmazon Review\r\n=============\r\nScott Adams, creator of the popular comic strip &quot;Dilbert,&quot; has written a modern-day parable about a young man and an unlikely mentor. God's Debris starts with a young deliveryman trying to hand over a package to an old man with a San Francisco address. But delivering the package proves to be as difficult as trying to understand the meaning of God.\r\n\r\nThe deliveryman begins to realize that he's not dealing with a feeble-minded old man; he's dealing with a situation that could alter his life. The sincerity and metaphysical complexity of this fable will surprise those who expect comedy, but Adams is following a tradition set by such writers as Dan Millman (Way of the Peaceful Warrior) and Richard Bach (Illusions). As in many parables that have come before, the deliveryman learns the meaning of life from an illusive mentor who seems to arise from a wrinkle in time. The cleverness of the God's Debris concept is original and bound to leave readers pondering some altered definitions of God, the universe, and just about everything else.—Gail Hudson","torrent":{"xt":"urn:btih:b50f8a193a0d1ad14bb07f54e3ce83851c8f9d2e","amp;dn":"God%27s+Debris%3A+a+Thought+Experiment-Scott+Adams+AZW3%2C+EPUB%2C+MOBI","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b50f8a193a0d1ad14bb07f54e3ce83851c8f9d2e","infoHashBuffer":{"type":"Buffer","data":[181,15,138,25,58,13,26,209,75,176,127,84,227,206,131,133,28,143,157,46]},"announce":[],"urlList":[]}}