{"title":"Deathlok Collection","uid":9717502,"size":1276206262,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b5158d714df46eb2ca88dae716d75abfa9f36733&amp;dn=Deathlok+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"thedude557","files":-1,"time":1394174203,"description":"I have here a collection of Deathlok comics published by Marvel.\n\nThis torrent has many of the files already posted here on TPB, but with a bit more order, and a bit more of an &quot;All in One&quot; approach. Also contained in here is the elusive Volume 4 issues from 2010 which are not currently on TPB. (Well, the Spanish language issues are, but English wasn't)\n\nCredit to Blazedbill whose torrent was used here. His collection consisted of the volume 1 and volume 2 folders you'll find in my torrent, as well as Marvel Presents #62. I did however trim down the &quot;Marvel Presents&quot; issue to only include the Deathlok portion. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/4252601/Deathlok&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/4252601/Deathlok&lt;/a&gt;\n\n\nCredit to brodahisou for his Astonishing Tales torrent that I used in order to include those issues here. Only difference is I removed the advertisements from the ones in this pack. His torrent is still up as well if you wanted the complete collection from Astonishing Tales, or if you prefer ads intact. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5470987/Astonishing_Tales_(Marvel)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5470987/Astonishing_Tales_(Marvel)&lt;/a&gt;\n\nCredit to drknark83 who supplied the &quot;Marvel Two in One&quot; torrent which is also still available for those looking to complete the set. &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6182814/Marvel_Two_In_One&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6182814/Marvel_Two_In_One&lt;/a&gt;\n\nCredit to whoever posted the Volume 3 torrent as well. You are Anonymous, but your contribution to this is appreciated! \n\nCredit to all those who I got the other &quot;Appearances&quot; issues from, as there are too many to list, and too many comics that I acquired over time to remember all the various torrents I got them from. But thank you all the same!\n\nAs for Volume 4, credit to those who posted the Marvel Chronology torrent not found on TPB, but that's where I managed to finally find them all. So here they are collected for us Bay users!\n\n\n\nThis is in no way a complete list of all his appearances, but it's a pretty healthy chunk. Some of his more recent appearances are absent(Uncanny X-Force, Wolverine and the X-Men) Missing as well are some of his appearances in some larger story arcs. He appeared in Spider-Man's &quot;Revenge of the Sinister Six&quot; arc, as well as &quot;Maximum Carnage&quot;. I excluded those appearances on purpose since the over all arc is bigger than just Deathloks role in them, not to mention anyone with a decent digital comic collection probably already has them.\n\nThank you!\n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:b5158d714df46eb2ca88dae716d75abfa9f36733","amp;dn":"Deathlok+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5158d714df46eb2ca88dae716d75abfa9f36733","infoHashBuffer":{"type":"Buffer","data":[181,21,141,113,77,244,110,178,202,136,218,231,22,215,90,191,169,243,103,51]},"announce":[],"urlList":[]}}