{"title":"Vatsyayana - Kamasutra (Oxford World's Classics) (pdf)","uid":8510144,"size":3123465,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b5161fea83eb0316b31d9c2f092af747f0691dbb&amp;dn=Vatsyayana+-+Kamasutra+%28Oxford+World%27s+Classics%29+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1369552488,"description":"Vatsyayana (Wendy Doniger, Sudhir Kakar, trans.) - Kamasutra (Oxford World's Classics, 2002). 231 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nSorry, guys, no pictures. Just the text.\n\n\ndescription:\n\nThe Kamasutra is the oldest extant textbook of erotic love. But it is more than a book about sex. It is about the art of living--about finding a partner, maintaining power in a marriage, committing adultery, living as or with a courtesan, using drugs--and also, of course, about the many and varied positions available to lovers in sexual intercourse and the pleasures to be derived from each. \n\nThe Kamasutra was composed in Sanskrit, the literary language of ancient India, sometime in the third century, probably in North India. It combines an encyclopedic coverage of all imaginable aspects of sex with a closely observed sexual psychology and a dramatic, novelistic narrative of seduction, consummation, and disentanglement. Best known in English through the highly mannered, padded, and inaccurate nineteenth-century translation by Sir Richard Burton, the text is newly translated here into clear, vivid, sexually frank English. This edition also includes a section of vivid Indian color illustrations along with three uniquely important commentaries: translated excerpts from the earliest and most famous Sanskrit commentary (thirteenth century) and from a twentieth-century Hindi commentary, and explanatory notes by the two translators.\n\nThe lively and entertaining introduction by translator Wendy Doniger, one of the world's foremost Sanskrit scholars, discusses the history of The Kamasutra and its reception in India and Europe, analyses its attitudes toward gender and sexual violence, and sets it in the context of ancient Indian social theory, scientific method, and sexual ethics.\n\n&quot;[This] new translation is fascinating, thought-provoking and occasionally even amusing.&quot;--Salon\n\n\nReview\n\n&quot;A radically different view of the famous sex manual.&quot;--The New York Times\n\n&quot;A fresh translation of the Kamasutra, gloriously rendered by Wendy Doniger and Sudhir Kakar. Put Doniger, one of the University of Chicago's top historians of religion, and Kakar, India's leading psychoanalyst of sex, together and you've got the kind of moxie and revisionist energy that lead some to try 'splitting the bamboo.' In a highly entertaining and learned 57-page introduction packed with crisp insights and droll asides, they put the Kamasutra in historical context, outline its numerological conceits, and clarify its gender ambiguities. Thanks to two nervy scholars, we now have a Kamasutra in which everyone's on top.&quot;--Philadelphia Inquirer\n\n&quot;A new look at the ancient Indian textbook of erotic love has fleshed out--and in some cases corrected--the original translation from Sanskrit into English, done in 1883 by explorer and writer Sir Richard Burton.&quot;--Chicago Tribune\n\n&quot;The Kamasutra is one of those rare publishing gems, an ancient Hindu treatise on sex and romance that has engaged generations of serious scholars as well as lesser minds like Homer Simpson. Far from being an ancient dime-store manual, the Kamasutra comes off as a potent social commentary. Nonetheless, it is also a terribly sexy book.&quot;--Religion News Service","torrent":{"xt":"urn:btih:b5161fea83eb0316b31d9c2f092af747f0691dbb","amp;dn":"Vatsyayana+-+Kamasutra+%28Oxford+World%27s+Classics%29+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5161fea83eb0316b31d9c2f092af747f0691dbb","infoHashBuffer":{"type":"Buffer","data":[181,22,31,234,131,235,3,22,179,29,156,47,9,42,247,71,240,105,29,187]},"announce":[],"urlList":[]}}