{"title":"Certified Ethical Hacker (CEH) Cert Guide","uid":14923227,"size":124037238,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b53c534bde11dba0131ebcfc57c104d92ce60ffe&amp;dn=Certified+Ethical+Hacker+%28CEH%29+Cert+Guide&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":null,"files":1,"time":1465935093,"description":"Learn, prepare, and practice for CEH v9 exam success with Certified Ethical Hacker (CEH) Cert Guide from Pearson IT Certification, a leader in IT certification.\r\n\r\nMaster CEH exam topics\r\nAssess your knowledge with chapter-ending quizzes\r\nReview key concepts with exam preparation tasks\r\nPractice with realistic exam questions on the CD\r\nCertified Ethical Hacker (CEH) Cert Guide is a best-of-breed exam study guide. Leading security consultant and certification expert Michael Gregg shares preparation hints and test-taking tips, helping you identify areas of weakness and improve both your conceptual knowledge and hands-on skills. Material is presented in a concise manner, focusing on increasing your understanding and retention of exam topics.\r\n\r\nYou'll get a complete test preparation routine organized around proven series elements and techniques. Exam topic lists make referencing easy. Chapter-ending Exam Preparation Tasks help you drill on key concepts you must know thoroughly. Review questions help you assess your knowledge, and a final preparation chapter guides you through tools and resources to help you craft your final study plan.\r\n\r\nThe companion CD contains the powerful Pearson IT Certification Practice Test engine, complete with hundreds of exam-realistic questions. The assessment engine offers you a wealth of customization options and reporting features, laying out a complete assessment of your knowledge to help you focus your study where it is needed most, so you can succeed on the exam the first time.\r\n\r\nThis study guide helps you master all the topics on the CEH v8 (312-50) exam, including\r\n\r\nEthical hacking basics\r\nTechnical foundations of hacking\r\nFootprinting and scanning\r\nEnumeration and system hacking\r\nLinux distros and automated assessment tools\r\nTrojans and backdoors\r\nSniffers, session hijacking, and denial of service\r\nWeb server hacking, web applications, and database attacks\r\nWireless technologies, mobile security, and mobile attacks\r\nIDS, firewalls, and honeypots\r\nBuffer overflows, viruses, and worms\r\nCryptographic attacks and defenses\r\nPhysical security and social engineering","torrent":{"xt":"urn:btih:b53c534bde11dba0131ebcfc57c104d92ce60ffe","amp;dn":"Certified+Ethical+Hacker+%28CEH%29+Cert+Guide","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b53c534bde11dba0131ebcfc57c104d92ce60ffe","infoHashBuffer":{"type":"Buffer","data":[181,60,83,75,222,17,219,160,19,30,188,252,87,193,4,217,44,230,15,254]},"announce":[],"urlList":[]}}