{"title":"Auschwitz: A Doctor's Eyewitness Account","uid":9452816,"size":886941,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b61b73de35db3f66cbf080fe6d8fd2bee0861b3a&amp;dn=Auschwitz%3A+A+Doctor%27s+Eyewitness+Account&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Doowangle","files":-1,"time":1389207820,"description":"NEW YORK TIMES BESTSELLER! \n\n    Auschwitz was one of the first books to bring the full horror of the Nazi death camps to the American public; this is, as the New York Review of Books said, &quot;the best brief account of the Auschwitz experience available.&quot;\n\n    When the Nazis invaded Hungary in 1944, they sent virtually the entire Jewish population to Auschwitz. A Jew and a medical doctor, the prisoner Dr. Miklos Nyiszli was spared death for a grimmer fate: to perform &quot;scientific research&quot; on his fellow inmates under the supervision of the man who became known as the infamous &quot;Angel of Death&quot;: Dr. Josef Mengele. Nyiszli was named Mengele's personal research pathologist. In that capactity he also served as physician to the Sonderkommando, the Jewish prisoners who worked exclusively in the crematoriums and were routinely executed after four months. Miraculously, Nyiszli survived to give this horrifying and sobering account.\n\n    Auschwitz was one of the first books to bring the full horror of the Nazi death camps to the American public. Although much has since been written about the Holocaust, this eyewitness account remains, as the New York Review of Bookssaid in 1987, &quot;the best brief account of the Auschwitz experience available.&quot; Of Bruno Bettelheim's famous foreword Neal Ascherson has written, &quot;Its eloquence and outrage must guarantee it a permanent place in Jewish historiography.&quot;\n","torrent":{"xt":"urn:btih:b61b73de35db3f66cbf080fe6d8fd2bee0861b3a","amp;dn":"Auschwitz%3A+A+Doctor%27s+Eyewitness+Account","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b61b73de35db3f66cbf080fe6d8fd2bee0861b3a","infoHashBuffer":{"type":"Buffer","data":[182,27,115,222,53,219,63,102,203,240,128,254,109,143,210,190,224,134,27,58]},"announce":[],"urlList":[]}}