{"title":"David Lynch - Blue Velvet (1986)","uid":6805766,"size":1725101492,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b62b5c48ef9ff46886193da7a00898d8403e6af0&amp;dn=David+Lynch+-+Blue+Velvet+%281986%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"lord_terabyte","files":-1,"time":1320857726,"description":"David Lynch - Blue Velvet (1986)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0090756&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0090756&lt;/a&gt;\n\nDirector David Lynch crafted this hallucinogenic mystery-thriller that probes beneath the cheerful surface of suburban America to discover sadomasochistic violence, corruption, drug abuse, crime and perversion.\n\nKyle Maclachlan stars as Jeffrey Beaumont, a square-jawed young man who returns to his picture-perfect small town when his father suffers a stroke. Walking through a field near his home, Jeff discovers a severed human ear, which he immediately brings to the police. Their disinterest sparks Jeff's curiosity, and he is soon drawn into a dangerous drama that's being played out by a lounge singer, Dorothy Vallens (Isabella Rossellini) and the ether-addicted Frank Booth (Dennis Hopper). The sociopathic Booth has kidnapped Dorothy's young son and is using the child as a bargaining chip to repeatedly beat, humiliate and rape Dorothy. Though he's drawn to the virginal, wholesome Sandy Williams (Laura Dern), Jeff is also aroused by Dorothy and in trying to aid her, he discovers his dark side.\n\nAs the film nears its conclusion, our hero learns that many more indivduals are tacitly involved with Frank, including a suave, lip-synching singer, Ben (Dean Stockwell), who is minding the kidnapped boy. Director Lynch explored many similar themes of the &quot;disease&quot; lying just under the surface of the small town, all-American faÃƒÂ§ade in his later television series Twin Peaks (1990-91).\n\n\n\n\n\n------not my rip------\n\nFile Name .............: Blue Velvet.avi\nRuntime ...............: 2:00:32\n\nVideo Codec ...........: XviD 1.1.0 Final\nFrame Size ............: 640x272\nFPS ...................: 23.976\nVideo Bitrate .........: 1454 kb/s\nBits per Pixel ........: 0.348 bpp\nB-VOP, N-VOP, QPel, GMC: B-VOP (Standalone Friendly)\n\nAudio Codec ...........: AC3\nAudio Bitrate .........: 448 kb/s [6 channels] CBR\nNo. of audio streams ..: 1\n\n**********************************************\n\n    Freakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\n    The Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\n    If you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n                           \n   &lt;a href=&quot; https://board.freakyflicks.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://board.freakyflicks.org/index.php&lt;/a&gt;\n\n    'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&quot;","torrent":{"xt":"urn:btih:b62b5c48ef9ff46886193da7a00898d8403e6af0","amp;dn":"David+Lynch+-+Blue+Velvet+%281986%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b62b5c48ef9ff46886193da7a00898d8403e6af0","infoHashBuffer":{"type":"Buffer","data":[182,43,92,72,239,159,244,104,134,25,61,167,160,8,152,216,64,62,106,240]},"announce":[],"urlList":[]}}