{"title":"Emerson, Lake &amp; Palmer 24 Bit Vinyl Pack","uid":9049780,"size":9236497316,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b6906187b810ea583eba1520da30e99ec8516d3f&amp;dn=Emerson%2C+Lake+%26amp%3B+Palmer+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"politux","files":-1,"time":1381845967,"description":"\n  Emerson, Lake &amp; Palmer 24 Bit Vinyl Pack\n  \n  Genre: Pop/Rock\n  Styles: Art Rock, Prog-Rock, Album Rock\n  Source: vinyl \n  Codec: FLAC\n  Bit Rates: ~ 2,900 - 5,600 kbps\n  Bit Depth: 24\n  Sampling Rates: 96,000 Hz, 192,000 Hz\n\n  1970 Emerson, Lake &amp; Palmer\n  1971 Tarkus\n  1973 Brain Salad Surgery\n  1974 Welcome Back My Friends to the Show That Never Ends\n  1977 Providence Civic Center, 1977-07-14\n  1979 In Concert  \n\n  Emerson, Lake &amp; Palmer were progressive rock's first supergroup. Greeted by the rock press and the public as something akin to conquering heroes, they succeeded in broadening the audience for progressive rock from hundreds of thousands into tens of millions of listeners, creating a major radio phenomenon as well. Their flamboyance on record and in the studio echoed the best work of the heavy metal bands of the era, proving that classical rockers could compete for that arena-scale audience. Over and above their own commercial success, the trio also paved the way for the success of such bands as Yes, who would become their chief rivals for much of the 1970s.\n\n  Keyboardist Keith Emerson planted the seeds of the group in late 1969 when his band the Nice shared a bill at the Fillmore West with King Crimson, and the two first spoke of the possibility of working together. After the Crimson lineup began disintegrating during their first U.S. tour, Lake opted to leave the group. Upon officially teaming in 1970, Emerson and Lake auditioned several drummers before they approached Carl Palmer, not yet 20 years old and already an overpowering talent, as well as a former member of the Crazy World of Arthur Brown and Atomic Rooster.\n\n  The trio's first rehearsals mostly picked up from the Nice's and King Crimson's respective repertoires, including such well-known numbers as &quot;Rondo&quot; and &quot;21st Century Schizoid Man.&quot; In August of 1970, ELP played their first show at the Plymouth Guildhall, just ahead of the Isle of Wight Festival in August of 1970, where they astonished more than half a million onlookers with their sound and instrumental prowess. One month later, the group finished their debut album, Emerson, Lake &amp; Palmer, comprised of their strongest early originals and two dazzling classical adaptations filled with rippling piano and synthesizer playing by Emerson along lightning-fast drumming by Palmer, anchored around Lake's bass work. That album was an instant success, rising to the Top Five in England and the Top 20 in America with considerable help from a last-minute addition -- pressed to fill out the running time of the album, the group settled on a composition that Lake had written as a boy, called &quot;Lucky Man.&quot; The latter became their debut single and made the Top 50 in America.\n\n  The trio's stage act rapidly became the stuff of legend, Emerson's organ pyrotechnics -- which dated from his days with the Nice -- getting him compared to Jimi Hendrix. The recording of the second ELP album, Tarkus (1971), tested their cohesiveness while stretching their sound in new directions and dimensions, with a much more complex electronic keyboard sound and a running time on the title track that took up the entire first side. But &quot;Tarkus&quot; the composition, despite its difficult birth (at first, Lake didn't resonate very well to the musical textures or time signature that Emerson and Palmer had begun with), ultimately defined the ELP sound as most people understood it: loud and bombastic, somewhat gloomy in its lyrical tone, and boundlessly exultant in its instrumental power. The Tarkus album reached number one in England and the Top Ten in America, and it seemed at this point as though the trio could do little wrong -- after a couple of abortive attempts, they captured a new feature of their concerts, a rock adaptation of Mussorgsky's Pictures at an Exhibition, at a March 21, 1971, concert at Newcastle City Hall, and it, in turn, became another major hit. Indeed, as a result of the release of that album, several million teenagers of high-school age suddenly had Mussorgsky's name and music -- after a fashion -- in their consciousness, to the delight or chagrin of music educators (depending on their outlook) everywhere.","torrent":{"xt":"urn:btih:b6906187b810ea583eba1520da30e99ec8516d3f","amp;dn":"Emerson%2C+Lake+%26amp%3B+Palmer+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6906187b810ea583eba1520da30e99ec8516d3f","infoHashBuffer":{"type":"Buffer","data":[182,144,97,135,184,16,234,88,62,186,21,32,218,48,233,158,200,81,109,63]},"announce":[],"urlList":[]}}