{"title":"The Beatles - Let It Be...Naked [320k MP3]","uid":7735794,"size":137327987,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b712c5d853b96ea5ba4eb746c759151c63c5539c&amp;dn=The+Beatles+-+Let+It+Be...Naked+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"smbdownload","files":-1,"time":1350482801,"description":"Let It Be... Naked is a 2003 album by English rock group The Beatles. It is a remixed &amp; remastered version of their 1970 album Let It Be. The project was overseen by Paul McCartney, who felt that Phil Spector's production did not accurately represent the group's &quot;stripped-down&quot; intentions for the original album. Let It Be... Naked presents the songs &quot;naked&quot; - without Spector's overdubs and without the incidental studio chatter featured between most cuts of the original album. Let It Be... Naked also replaces &quot;Dig It&quot; and &quot;Maggie Mae&quot; with &quot;Don't Let Me Down&quot;, originally featured as the B-side of the &quot;Get Back&quot; single\n\nThe album is presented in a form which Paul McCartney considers closer to its original artistic vision: to &quot;get back&quot; to the rock and roll sound of their early years rather than the orchestral overdubs and embellishments which were added by Phil Spector in the production of the final Let It Be album. McCartney in particular was always dissatisfied with the &quot;Wall of Sound&quot; production style of the Phil Spector remixes, especially for his song &quot;The Long and Winding Road&quot;, which he believed was ruined by the process. George Harrison gave his approval for the Naked project before he died. McCartney's attitude contrasted with Lennon's from over two decades earlier. In his 1971 interview with Rolling Stone magazine, Lennon had defended Spector's work, saying, &quot;He was given the shittiest load of badly recorded shit with a lousy feeling to it ever, and he made something of it... When I heard it, I didn't puke.&quot;\n\nMost of the songs on Let It Be... Naked, differ significantly from the original versions on Let It Be. First, they are in a different running order than the original. Second, all of Phil Spector's orchestral and choral overdubs were removed, and his Wall of Sound mixing technique was not used; this is especially evident in the guitars and vocals on &quot;For You Blue&quot;. All lead vocals and drums are now placed in the middle of the stereo picture, giving the album a more modernised sound and feel. Finally, all studio and rooftop dialogue from the original album was removed, resulting in a number of sharp fade-outs where dialogue had been previously.\n\nTrack Listing [320k MP3]\n\n01. \t&quot;Get Back&quot;   \t2:34\n02. \t&quot;Dig a Pony&quot;   \t3:38\n03. \t&quot;For You Blue&quot; (George Harrison) \t2:27\n04. \t&quot;The Long and Winding Road&quot;   \t3:34\n05. \t&quot;Two of Us&quot;   \t3:21\n06. \t&quot;I've Got a Feeling&quot;   \t3:30\n07. \t&quot;One After 909&quot;   \t2:44\n08. \t&quot;Don't Let Me Down&quot;   \t3:18\n09. \t&quot;I Me Mine&quot; (Harrison) \t2:21\n10. \t&quot;Across the Universe&quot;   \t3:38\n11. \t&quot;Let It Be&quot;   \t3:55\n\nFly On The Wall - Bonus Disc [320k MP3]\n\nThe 22-minute bonus disc contains song excerpts and dialogue from the many hours of tape which accumulated during the Let It Be sessions. Some of the removed dialogue that had appeared on the original album appears on this disc. In total, the track is 21 minutes and 55 seconds long and brings the album's total length to 56:59.","torrent":{"xt":"urn:btih:b712c5d853b96ea5ba4eb746c759151c63c5539c","amp;dn":"The+Beatles+-+Let+It+Be...Naked+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b712c5d853b96ea5ba4eb746c759151c63c5539c","infoHashBuffer":{"type":"Buffer","data":[183,18,197,216,83,185,110,165,186,78,183,70,199,89,21,28,99,197,83,156]},"announce":[],"urlList":[]}}