{"title":"Hitman 3 Contracts [Ntsc] (Working) PS2","uid":4352264,"size":1906674183,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:b7a714ce149e2bf1a5b93ef96ed018b249ece278&amp;dn=Hitman+3+Contracts+%5BNtsc%5D+%28Working%29+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Big_dude","files":-1,"time":1219220494,"description":"Hitman 3 Contracts &amp; Working! for the PS2                      Rel. 04/20/2004\n\n\nFormat:        DVD5 NTSC-USA\nLanguage:      English\nDiscs:         1\nImage:         MDS/ISO\nRequirements:  Modded/Chipped Ps2, or Swap Magic Disc method.\n\n\nCompressed with WinRar. Game was tested and works.\nTry 7Zip its free google it, if you don't have WinRar.\n\n\nNote: No Ps2 Backup disc/game or copy will work unless your Ps2 Console is\n      Modded or if you use Swap Magic.\n\n\nI know there was several bad uploads of this game for the ps2 which didn't work, or were later Removed from download.\n\nSo I wanted to upload a proper working rip for the Ps2.\n\nDownload also includes a pdf walkthru for the game.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n     &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n     &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n    &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n    &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nYou will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Try Verbatim DVD+R (Booktype to DVD-ROM), or Tayio Yuden, burn at 8x if its a 16x max. You really can't use Maxell DVD+R for example or some other brand as it more than likely will not work.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Try Swap Magic to load the game.\n\n\nGame Description:\n\nExplore the dark psychology of killing for a living as you delve into the mind of the most ruthless &amp; efficient contract killer. Hitman: Contracts delivers more action-packed and suspenseful missions with a greater variety of ways to make the perfect hit and an increased arsenal of firearms and close-combat weapons at your disposal. A new graphics engine showcases your 'work' in brutal detail and brings the dark &amp; disturbing world of the Hitman to life.\n\nFeatures:\n\n* Travel the globe from England to China and eliminate international terrorists,\n  crime bosses and corrupt politicians from your hit list. \n\n* Complete your mission objectives with an increased number of tactical \n  approaches. \n\n* Improved enemy intelligence that will use squad-based tactics to communicate     \n  with each other to bring you down. \n\n* All-new arsenal for Agent 47 to use including: Micro Uzi, stun gun, syringe, \n  and an assortment of blades and firearms. \n\n* Interactive environments dense with &quot;improvisational weaponry&quot; allow\n  unprecedented freedomto pick up objects like meat hooks, pool cues, shovels,\n  pillows and more for use as weapons. \n\n\n\nRipped from original retail disc.\n\n\n\nBurn with Dvd Decrypter or ImgBurn.\n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Tayio Yuden DVD Media, or if other media isn't working.\n\nIf using DVD+R Booktype to DVD-ROM.\n(Only if your mod-chip or Ps2 doesn't support DVD+R's).\n\n\nGame Pics Included.\n\n\nAny Problems or Questions please post a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7 do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:b7a714ce149e2bf1a5b93ef96ed018b249ece278","amp;dn":"Hitman+3+Contracts+%5BNtsc%5D+%28Working%29+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7a714ce149e2bf1a5b93ef96ed018b249ece278","infoHashBuffer":{"type":"Buffer","data":[183,167,20,206,20,158,43,241,165,185,62,249,110,208,24,178,73,236,226,120]},"announce":[],"urlList":[]}}