{"title":"Putumayo Presents-Dougie Maclean-Collection by Ulysses56","uid":3515663,"size":74109171,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b81bcefc5f372ad32566bb7778758912ac43811c&amp;dn=Putumayo+Presents-Dougie+Maclean-Collection+by+Ulysses56&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ulysses56","files":14,"time":1156429281,"description":"Putumayou Presents:\nDougie Maclean-Collection  1995\nThis guy has been writing songs since the 1970s and performing with great names such as the Tannahill Weavers and Silly Wizard. His song &quot;Caledonia&quot; is known to some as the &quot;unofficial anthem&quot; of Scotland. \nRip 192kbs\nCovers Included.\n\nIn 1990, country star Kathy Mattea decided she needed to slow down and reconnect with her musical roots. That meant folk music, and she took some time off to go visit her favorite Scottish folk singer, Dougie MacLean. While over there, MacLean coproduced and played several instruments on Mattea&amp;#039;s version of &quot;From a Distance,&quot; and when Mattea returned to Nashville, she recorded a version of MacLean&amp;#039;s &quot;Ready for the Storm.&quot; Both songs showed up on Mattea&amp;#039;s &amp;#039;91 album, Time Passes By, and left her fans asking, Who is this Dougie MacLean?\nThis anthology answers that question. The Dougie MacLean Collection skims the cream from seven different albums and a video that MacLean released on his own Dunkeld Records in Scotland. The centerpiece of the collection is &quot;Caledonia,&quot; a lovely homesick ballad which has become the unofficial anthem of Scottish nationalism. Throughout the album MacLean&amp;#039;s sparkling acoustic guitar work is evidence of the long years he put in playing traditional Celtic tunes with such top Scottish folk bands as Silly Wizard and the Tannahill Weavers.\n\nMany of his own compositions deal with his attachment to his homeland, and when he describes how &quot;across the Arlick the amber sun beats down to tinge the vivid green,&quot; as he does on &quot;Solid Ground,&quot; MacLean can be quite evocative. Unfortunately, he seldom stops himself before he turns simple sentiments into sentimental excess. With none of the saving humor of Andy Stewart or the tough-minded realism of Dick Gaughan, MacLean too often gives in to smug, middle-brow bombast.\n\n\nTracklist:\n1. Rite Of Passage   \n2. Singing Land   \n3. Solid Ground  \n4. Broken Wings   \n5. Marching Mystery   \n6. The Search    \n7. Turning Away    \n8. Caledonia    \n9. Ready For The Storm  \n10. Trail Of The Survivor  \n11. This Love Will Carry \n\n\n \nThis is one of the many PutumayoÂ´s records I have in mind to upload, so please help keep seeding after you downloaded.\nEnjoy It!\nUlysses56","torrent":{"xt":"urn:btih:b81bcefc5f372ad32566bb7778758912ac43811c","amp;dn":"Putumayo+Presents-Dougie+Maclean-Collection+by+Ulysses56","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b81bcefc5f372ad32566bb7778758912ac43811c","infoHashBuffer":{"type":"Buffer","data":[184,27,206,252,95,55,42,211,37,102,187,119,120,117,137,18,172,67,129,28]},"announce":[],"urlList":[]}}