{"title":"Ram Ke Naam, In the Name of God, India, 1991","uid":5563096,"size":1754757078,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b820d78716a0643a32d6eb848552e186e0d121db&amp;dn=Ram+Ke+Naam%2C+In+the+Name+of+God%2C+India%2C+1991&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"nunicorn","files":1,"time":1273900074,"description":"Ram Ke Naam (In the Name Of God)\n\nAn Anand Patwardhan Documentary.\n\n\n(1991/Colour/75 minutes/Hindi/English Subtitles)\n\n\nSynopsis:\n\nSince gaining independence in 1947, India has been a secular state. But now, as religious fundamentalism grips much of India's population, the greatest danger to the nation's extremely strained social fabric may come not from Sikh or Muslim separatists, but from Hindu fundamentalists who are appealing to the 83% Hindu majority to redefine India as a Hindu nation.\n\nIN THE NAME OF GOD focuses on the campaign waged by the militant Vishwa Hindu Parishad (VHP) to destroy a 16th century mosque in Ayodhya said to have been built by Babar, the first Mughal Emperor of India. The VHP claim the mosque was built at the birthsite of the Hindu god Ram after Babar razed an existing Ram temple. They are determined to build a new temple to Ram on the same site. This controversial issue, which successive governments have refused to resolve, has led to religious riots which have cost thousands their lives, culminating in the mosque's destruction by the Hindus in December of 1992. The resulting religious violence immediately spread throughout India and Pakistan leaving more than 5,000 dead, and causing thousands of Indian Muslims to flee their homes.\n\nFilmed prior to the mosque's demolition, IN THE NAME OF GOD examines the motivations which would ultimately lead to the drastic actions of the Hindu militants, as well as the efforts of secular Indians - many of whom are Hindus - to combat the religious intolerance and hatred that has seized India in the name of God.\n\nAwards:\n\nFilmfare Award, Best Documentary, India, 1992\nNational Award, Best Investigative Doc. India, 1992\nEcumenical Prize, Nyon, Switzerland, 1993\nDocumentary Prize, Freibourg, Switzerland, 1993\nCitizen's Prize, Yamagata, Japan, 1993\n\n--------------------------------------\nPLEASE SEED AFTER YOU HAVE DOWNLOADED.\n--------------------------------------","torrent":{"xt":"urn:btih:b820d78716a0643a32d6eb848552e186e0d121db","amp;dn":"Ram+Ke+Naam%2C+In+the+Name+of+God%2C+India%2C+1991","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b820d78716a0643a32d6eb848552e186e0d121db","infoHashBuffer":{"type":"Buffer","data":[184,32,215,135,22,160,100,58,50,214,235,132,133,82,225,134,224,209,33,219]},"announce":[],"urlList":[]}}