{"title":"Carlos Saura - Iberia (2005)","uid":6628107,"size":1468869154,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b8f144c1d6a8092ba3833d95f0905401e8118d53&amp;dn=Carlos+Saura+-+Iberia+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mfccorrea","files":4,"time":1314226888,"description":"Carlos Saura's recent filmography has been dominated by spectacular tributes to the many regional dances of the Spanish-speaking world. (Festival audiences will remember the dazzling Flamenco.) Fusing together an array of art forms, his films burst with sensual force, enrapturing the viewer by engaging the body as well as the mind and heart. In his latest effort, Saura adapts sections of Isaac AlbÃƒÂ©niz's Iberia suite on its one hundredth anniversary, using a plethora of Spanish stars to play, dance and sing modern, folk, operetta and flamenco variations of the piece in a tribute to the composer.\n\nThrough his non-narrative approach to filmmaking, Saura evokes the gypsy culture of southern Spain. In Iberia, the music and dances are performed against a minimalist background and are introduced by only the names of the pieces and the performers. The numbers flow into one another seamlessly, as if following their own internal logic and the simplicity of the spectacle is made remarkable by its luxurious grace and elegance. Each episode stirs a myriad of emotions.\n\nIberia enjoys a cast of some of the biggest stars in Spain's music and dance world. The dancers include the internationally renowned Sara Baras; Antonio Canales, choreographer and former soloist for the Spanish National Ballet; and AÃƒÂ­da GÃƒÂ³mez, the Ballet's former director and star of Saura's SalomÃƒÂ©. Guitarists Manolo SanlÃƒÂºcar, Gerardo NÃƒÂºÃƒÂ±ez and JosÃƒÂ© Antonio Ruiz play alongside pianist Rosa Torres Pardo. Legendary singer-songwriter Enrique Morente is featured, as is his daughter, singer Estrella Morente.\n\nRather than focusing exclusively on polished performances, Saura captures all the elements that go into their creation, from initial preparations to rehearsals to the final show. The viewer is invited to witness the organic nature of the process. The fluidity of the movement is complemented by bold set designs that feature striking white screens, mirrors and multicoloured lights. Iberia incorporates flamenco, ballet, contemporary dance and a variety of musical genres to create a breathtaking work of art that is a feast for the senses.\n\nFile Name .........................................: Iberia.avi\nFile Size (in bytes) ............................: 1,468,866,560 bytes\nRuntime ............................................: 1:31:09\n\nVideo Codec ...................................: DivX 6.0.0\nFrame Size ......................................: 712x392 (AR: 1.816)\nFPS .................................................: 25.000\nVideo Bitrate ...................................: 1755 kb/s\nBits per Pixel ...................................: 0.252 bpp\nB-VOP, N-VOP, QPel, GMC.............: [B-VOP], [], [], []\n\nAudio Codec ...................................: 0x2000 (Dolby AC3) AC3\nSample Rate ...................................: 48000 Hz\nAudio Bitrate ...................................: 384 kb/s [6 channel(s)] CBR\nNo. of audio streams .......................: 1\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0443057/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0443057/&lt;/a&gt;\n\nSpanish audio (very little); English, Spanish and Portuguese subtitles\n\nPosted at KG by odietamo, whom we thank\n\nCarlos Saura - Iberia (2005)","torrent":{"xt":"urn:btih:b8f144c1d6a8092ba3833d95f0905401e8118d53","amp;dn":"Carlos+Saura+-+Iberia+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8f144c1d6a8092ba3833d95f0905401e8118d53","infoHashBuffer":{"type":"Buffer","data":[184,241,68,193,214,168,9,43,163,131,61,149,240,144,84,1,232,17,141,83]},"announce":[],"urlList":[]}}