{"title":"Count Like an Egyptian: Introduction Ancient Mathematics (2014)","uid":10271479,"size":28439466,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b98eb05ba4b5b55fb84a2f621d3ee0c55343dd88&amp;dn=Count+Like+an+Egyptian%3A+Introduction+Ancient+Mathematics+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bookzilla","files":1,"time":1401591217,"description":"Count Like an Egyptian: A Hands-on Introduction to Ancient Mathematics\n\nepub\n\nThe mathematics of ancient Egypt was fundamentally different from our math today. Contrary to what people might think, it wasn't a primitive forerunner of modern mathematics. In fact, it can't be understood using our current computational methods. Count Like an Egyptian provides a fun, hands-on introduction to the intuitive and often-surprising art of ancient Egyptian math. David Reimer guides you step-by-step through addition, subtraction, multiplication, and more. He even shows you how fractions and decimals may have been calculated--they technically didn't exist in the land of the pharaohs. You'll be counting like an Egyptian in no time, and along the way you'll learn firsthand how mathematics is an expression of the culture that uses it, and why there's more to math than rote memorization and bewildering abstraction.\n\n Reimer takes you on a lively and entertaining tour of the ancient Egyptian world, providing rich historical details and amusing anecdotes as he presents a host of mathematical problems drawn from different eras of the Egyptian past. Each of these problems is like a tantalizing puzzle, often with a beautiful and elegant solution. As you solve them, you'll be immersed in many facets of Egyptian life, from hieroglyphs and pyramid building to agriculture, religion, and even bread baking and beer brewing.\n\n Fully illustrated in color throughout, Count Like an Egyptian also teaches you some Babylonian computation--the precursor to our modern system--and compares ancient Egyptian mathematics to today's math, letting you decide for yourself which is better. ","torrent":{"xt":"urn:btih:b98eb05ba4b5b55fb84a2f621d3ee0c55343dd88","amp;dn":"Count+Like+an+Egyptian%3A+Introduction+Ancient+Mathematics+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b98eb05ba4b5b55fb84a2f621d3ee0c55343dd88","infoHashBuffer":{"type":"Buffer","data":[185,142,176,91,164,181,181,95,184,74,47,98,29,62,224,197,83,67,221,136]},"announce":[],"urlList":[]}}