{"title":"TANGHETTO - 4 ALBUMS","uid":4163063,"size":391924548,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ba67a93a5035535c79ef68b4772094c3b6f503c8&amp;dn=TANGHETTO+-+4+ALBUMS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"amowgli","files":59,"time":1209430068,"description":"2003 - Emigrante (electrotango) [mp3-192]\n2004 - Hybrid Tango [mp3-192]\n2005 - Buenos Aires Remixed [mp3-320]\n2008 - El Miedo A La Libertad [mp3-vbr]\n\n\nTanghetto is a musical group based in Buenos Aires, Argentina, and one of the most important on the neo tango scene.\n\nThe style of Tanghetto is a blend of tango and electronic music. Formed in 2001 by producer and composer/songwriter Max Masri and composer/arranger and instrumentalist Diego S. Velazquez, the band&amp;#039;s lineup includes bandoneon, violoncello, acoustic piano, acoustic guitar, electronic and acoustic drums, samplers, and synthesizers. The main feature of their music, apart from the balance of electronic and ethnic sounds, is the strong presence of melody and song structure.\n\nTanghetto released their first album, Emigrante (electrotango) in 2003. It was nominated for a Latin Grammy award in 2004, and reached platinum status in Argentina in 2006. In late 2004 the group released an album from a side project called Hybrid Tango, in which a variety of world music styles are blended with their sound, including flamenco, candombe, and jazz. This album was also nominated for a Latin Grammy award in 2005.\n\nIn early 2005 a compilation of different electronic and neo-tango artists was released in Buenos Aires under the name Tangophobia Vol. 1: Contemporary sounds of Buenos Aires, including five unreleased tracks by Tanghetto.\n\nIn October 2005 a new album, Buenos Aires Remixed, was released. It&amp;#039;s an album that contains 12 remixed versions of Tanghetto songs plus two cover songs (Enjoy the Silence, from Depeche Mode and New Order&amp;#039;s Blue Monday. Their version of &amp;#039;Blue Monday&amp;#039; became an alternative radio hit in the USA, and a favorite on KCRW radio station in Los Angeles. Buenos Aires Remixed reached gold status in early 2007 and became their second gold album.\n\nAfter consistently touring through Europe and the Americas, the band recorded their next studio album, called El Miedo a la Libertad, named after Erich Fromm&amp;#039;s classic essay, Fear of Freedom. The album was released on March the 1st, 2008.","torrent":{"xt":"urn:btih:ba67a93a5035535c79ef68b4772094c3b6f503c8","amp;dn":"TANGHETTO+-+4+ALBUMS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba67a93a5035535c79ef68b4772094c3b6f503c8","infoHashBuffer":{"type":"Buffer","data":[186,103,169,58,80,53,83,92,121,239,104,180,119,32,148,195,182,245,3,200]},"announce":[],"urlList":[]}}