{"title":"The History of Witchcraft - Lois Martin (2009 - Unabridged)","uid":9067501,"size":102463872,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ba8297a4346c5f9c5291ab53ad8fafd81817e68f&amp;dn=The+History+of+Witchcraft+-+Lois+Martin+%282009+-+Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"Robin1966","files":6,"time":1382135800,"description":"Audio Books : History : MP3/Variable : English\n\n\nThe History of Witchcraft (Audiobook) By Lois Martin, read by Brogan West\nUnabridged edition 2009 | 3 hours and 32 mins | ISBN: n/a | ASIN: B002LTZYOK | MP3 64 kbps | 97 MB\n\nWitchcraft has recently been undergoing a huge popular revival, but does modern pagan witchcraft really bear any resemblance to its historical antecedents? The witch in history was a very different creature from her modern counterpart, and this book sets out to explore the historical background to the European witchcraft phenomenon. It examines in detail the growth of the ideological, cultural and legal concepts that eventually led to the carnage of the Witch Craze in the 16th and 17th centuries, which, it is estimated, may have claimed the lives of around 40,000 people. For both Medieval and Reformation scholars alike the Devil and all his works were a very real threat. Their conviction that witches were the servants of Satan led to the formation of perhaps one of the greatest conspiracy theories of all time: a belief that witches were working in league with the Devil in a diabolical plot against all Christendom. Witches were transformed from poor deluded old women who rode out at night with the pagan goddess Diana into devil-worshipping heretics who became the focus of a centuries-long, Europe-wide campaign determined to seek out and destroy this evil wherever it was to be found, regardless of whether any of its victims were actually guilty or not.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:ba8297a4346c5f9c5291ab53ad8fafd81817e68f","amp;dn":"The+History+of+Witchcraft+-+Lois+Martin+%282009+-+Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba8297a4346c5f9c5291ab53ad8fafd81817e68f","infoHashBuffer":{"type":"Buffer","data":[186,130,151,164,52,108,95,156,82,145,171,83,173,143,175,216,24,23,230,143]},"announce":[],"urlList":[]}}