{"title":"Nanotechnologies - Concepts, Processing and Applications","uid":15430340,"size":7508503,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bb1c4a16a3682ae8789e4dc58479be9c0dbdd01f&amp;dn=Nanotechnologies+-+Concepts%2C+Processing+and+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1469717720,"description":"Nanotechnologies - Concepts, Processing and Applications - Pierre Camille Lacaze (Wiley-ISTE, 2013).pdf\r\n\r\nNanotechnologies: Concepts, Processing and Applications describes and explains how nanotechnologies have entered our everyday lives through scientific and industrial applications with the emphasis placed on the new perspectives in various fields related to societal problems. This book details how successive discoveries of new nanocarbon structures along with progress in different microscopy techniques have caused nanomaterials to take on an increasingly important role in electronics, electrochemical energy storage – batteries and fuel cells – and the electrical conversion of solar energy. Views once seen as futuristic on nanomachines and nanorobotics, therapeutic hopes and medical advances – such as those resulting from the application of new in-situ drug-delivery nanotechniques – are all presented.\r\nThe most innovative developments are analyzed in terms of applications and should enable the reader to form his or her own opinion about the reality of the progress that can be expected from nanotechnologies in the near future. The book offers background reading for teachers in colleges who wish to have an overview on this subject","torrent":{"xt":"urn:btih:bb1c4a16a3682ae8789e4dc58479be9c0dbdd01f","amp;dn":"Nanotechnologies+-+Concepts%2C+Processing+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb1c4a16a3682ae8789e4dc58479be9c0dbdd01f","infoHashBuffer":{"type":"Buffer","data":[187,28,74,22,163,104,42,232,120,158,77,197,132,121,190,156,13,189,208,31]},"announce":[],"urlList":[]}}