{"title":"Michael Z. Williamson - The Weapon (Freehold: Grainne War #2)","uid":11676392,"size":277359200,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bb8d4eb50f9bc03e29573d73010e4c19a7db4749&amp;dn=Michael+Z.+Williamson+-+The+Weapon+%28Freehold%3A+Grainne+War+%232%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cybotage","files":1,"time":1422890597,"description":"Kenneth Chinran was a disaffected youth who joined the military and was recruited for an elite deep cover unit, shrugging off training and exercises so tough that several of the recruits did not survive. Then he was sent by his star nation to infiltrate a fascistic, militaristic planetÂ¿Earth. He lived in deep cover for years, marrying and having a daughter. Then the Earth forces attacked his home system, and he and his team came out of hiding, attacking and destroying the infrastructure of the crowded planet, disabling transportation and communications in city after city. As a result of his attacks, billions died for lack of the food, water and power which the ravaged system could no longer supply. His sabotage was successful, but the deaths of so many weighs heavily on his mind, making him wonder if he can stay sane. Then the secret police discovered his identity. With his daughter, the only thing in his life that had so far kept him human, he was on the run, while the resources of a planetwide police state were tracking him down. He could see no way to escape from the planet, no way to keep hiding, and if he and his daughter were caught, death was the very least that they could expect. But Chinran is a warrior to the core, and even if he loses this last battle, he wonÂ¿t go down without a fight that his pursuers, the ones who survive, will never forget.\n\nRead by Stephen Bowlby\nFormat: M4A\nLength: 17 hrs and 42 mins\nBitrate: 32 Kbps\nUnabridged","torrent":{"xt":"urn:btih:bb8d4eb50f9bc03e29573d73010e4c19a7db4749","amp;dn":"Michael+Z.+Williamson+-+The+Weapon+%28Freehold%3A+Grainne+War+%232%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb8d4eb50f9bc03e29573d73010e4c19a7db4749","infoHashBuffer":{"type":"Buffer","data":[187,141,78,181,15,155,192,62,41,87,61,115,1,14,76,25,167,219,71,73]},"announce":[],"urlList":[]}}