{"title":"RSC  Live Shakespeare's Hamlet (2016) recode","uid":15185169,"size":783259230,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bc1bda0f419e2f8071b4b4c5721066c65106b649&amp;dn=RSC++Live+Shakespeare%27s+Hamlet+%282016%29+recode&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"loninappleton","files":4,"time":1467488475,"description":"Royal Shakespeare Company Live Hamlet by Wm Shakespeare (2016)\r\n\r\nThis is a new edit with thanks to the original uploader at TPB.  It is much smaller and coded for small screen viewing.\r\n\r\nThe files are:\r\n\r\nRSC Introduction and Interview with the Director     runtime   11:40\r\nRSC Hamlet 2016 Part one to Interval                         1:44:50\r\nRSC Hamlet 2016 Part Two to conclusion and credits           1:15:45\r\n\r\nThis encode is playable on the VLC player.\r\n\r\nSummary\r\n\r\n&quot;William Shakespeare's play in which a Danish prince avenges the murder of his father, the king, by killing his uncle Claudius who murdered the king, usurped the throne, and married Hamlet's mother, Gertrude. Hamlet, considered the most complex of all Shakespeare's characters, examines the fundamental issues of justice, guilt and death.&quot;\r\n\r\nCast and Creatives\r\n\r\nDirected for the stage by  Simon Godwin\r\nDirected for the screen by Robin Lough\r\n\r\nPaapa Essiedu                 Hamlet\r\nNatalie Simpson               Ophelia\r\nClarence Smith                Claudius\r\nTanya Moodie                  Gertrude     \r\nCyril Nri                     Polonius\r\nHamlet's Ghost/Gravedigger    Ewart James Walters\r\n\r\nfull cast and crew in the credits\r\n\r\nMy notes\r\n\r\n   The new encode was done with a number of processes to reduce size,  balance the audio and change the frame count for use with VLC and other common players. It is less than one third of the original fileshared torrent.  The original at 3 GB can be found at TPB which also hosts my fileshares.   I have recoded in the interest of those who, like me, have little bandwidth and by doing so reduce the time to download this fine presentation captured by the original uploader.\r\n\r\n  In the introduction it is noted that this director  Simon Godwin  also has done Two Gentlemen of Verona for the RSC.  It is also a great piece of creative directing and can be found in my group of torrents under loninappleton at TPB. \r\n\r\n  And the great voice of Ewart James Walters (Hamlet's Ghost)  appears singing in the Globe production of &quot;As You Like It&quot; is also in my group at TPB.  \r\n\r\n  This archive is growing and I hope to keep it going for a long time.\r\n\r\n  Select a few or all to add to your permanent seeds","torrent":{"xt":"urn:btih:bc1bda0f419e2f8071b4b4c5721066c65106b649","amp;dn":"RSC++Live+Shakespeare%27s+Hamlet+%282016%29+recode","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc1bda0f419e2f8071b4b4c5721066c65106b649","infoHashBuffer":{"type":"Buffer","data":[188,27,218,15,65,158,47,128,113,180,180,197,114,16,102,198,81,6,182,73]},"announce":[],"urlList":[]}}