{"title":"Scott, James C - Seeing Like a State.epub","uid":9808400,"size":4190814,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc554cdf95880f187d4164490464a89d45cfdcdb&amp;dn=Scott%2C+James+C+-+Seeing+Like+a+State.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Papushi","files":-1,"time":1395446661,"description":"Compulsory ujamaa villages in Tanzania, collectivization in Russia, Le Corbusier's urban planning theory realized in Brasilia, the Great Leap Forward in China, agricultural &quot;modernization&quot; in the Tropics -- the twentieth century has been racked by grand utopian schemes that have inadvertently brought death and disruption to millions. Why do well-intentioned plans for improving the human condition go tragically awry?\n\nIn this wide-ranging and original book, James C. Scott analyzes failed cases of large-scale authoritarian plans in a variety of fields. Centrally managed social plans misfire, Scott argues, when they impose schematic visions that do violence to complex interdependencies that are not -- and cannot -- be fully understood. Further, the success of designs for social organization depends upon the recognition that local, practical knowledge is as important as formal, epistemic knowledge. The author builds a persuasive case against &quot;development theory&quot; and imperialistic state planning that disregards the values, desires, and objections of its subjects. He identifies and discusses four conditions common to all planning disasters: administrative ordering of nature and society by the state; a &quot;high-modernist ideology&quot; that places confidence in the ability of science to improve every aspect of human life; a willingness to use authoritarian state power to effect large-scale interventions; and a prostrate civil society that cannot effectively resist such plans.\n\n&quot;A broad-ranging, theoretically important, and empirically grounded treatment of the modern state and its propensity to simplify and make legible a society which by nature is complex and opaque. For anyone interested inlearning about this fundamental tension of modernity and about the destruction wrought in the twentieth century as a consequence of the dominant development ideology of the simplifying state, this is a must-read&quot;. -- Daniel Jonah Goldhagen, author of Hitler's Willing Executioners","torrent":{"xt":"urn:btih:bc554cdf95880f187d4164490464a89d45cfdcdb","amp;dn":"Scott%2C+James+C+-+Seeing+Like+a+State.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc554cdf95880f187d4164490464a89d45cfdcdb","infoHashBuffer":{"type":"Buffer","data":[188,85,76,223,149,136,15,24,125,65,100,73,4,100,168,157,69,207,220,219]},"announce":[],"urlList":[]}}