{"title":"I Shouldn't Be Alive - Season 6 - HD 720p","uid":11252977,"size":15778267080,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:bc6143a675a9c0641c88443a1a22808c033509b3&amp;dn=I+Shouldn%27t+Be+Alive+-+Season+6+-+HD+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"voltxrid","files":-1,"time":1413859849,"description":" &lt;a href=&quot;http://bayimg.com/fAClIAagc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/fAClIAagc&lt;/a&gt;\n\n\n=========================================\n\nI Shouldn't Be Alive - Season 6 - HD 720p\n\n=========================================\n\n\nEpisode 1 - &quot;Chasm of Death&quot; - October 7, 2011\n\nA 2002 hike in Leprechaun Canyon, Utah turns into a nightmare when three friends take a wrong turn and end up trapped deep in a slot canyon on one of the most technical routes in the area. The situation takes a tragic turn for the worse when Ben, attempting to climb out, falls 70 feet and sustains a severe head injury. The others must fight to keep him alive, deep in a canyon with no way out.\n\n\nEpisode 2 - &quot;Volcano Vacation Hell&quot; - October 7, 2011\n\nIn July 2005 a man on a sightseeing trip becomes lost on a volcano. He must fight to survive in an inhospitable lava plain with only his video camera to keep him sane. Several planes passed off, without noticing Gilbert.\n\n\nEpisode 3 - &quot;Dive of Terror&quot; - October 14, 2011\n\nIn 2006 a Navy diver on a recreational diving trip is dragged out to sea by a rip current off the coast of New Zealand. He desperately tries to find a way to survive the open water and to be seen by rescuers. His fate relies on the ocean's currents if they were to take him back to shore or adrift the open sea.\n\n\nEpisode 4 - &quot;Escape from Bear Mountain&quot; - October 14, 2011\n\nIn July 2010 two friends have to hike out of the wilderness after their plane crashes in Alaska and badly injures both with Gary a fractured skull and Dave a 2 ribs and a collarbone broken. They are in bear country and encounter several bears on their way out while they face their injuries and hypothermia. They must get to a nearby river that can lead them to civilization.\n\n\nEpisode 5 - &quot;Lost in the Jungle&quot; - February 17, 2012\n\nIn 1993 a young man on a sightseeing trip through the Mayan ruins wanders away from his tour group. With temperatures rising above 100 degrees and the denseness of the jungle he ends up in a 19 day fight for survival with nothing but his sheer willpower as he tries to find his way out.\n\n\nEpisode 6 - &quot;Perfect Storm&quot; - February 24, 2012\n\nHalloween 1991. In an attempt to rescue a stranded fisherman during a storm, a Coast Guard helicopter experiences a breakdown and crashes into the North Atlantic Ocean. Now it is the rescuers that need rescuing. They are out at sea for 1 night after their helicopter gets pulled down by strong winds. The men battle waves ten stories high, relying on each other to stay alive.\n\n\nIf problems or inconsistencies with any of the content files are noticed, please let me know via the comments and I will attempt to upload some corrected replacements.  Thanks much and enjoy!  :-)","torrent":{"xt":"urn:btih:bc6143a675a9c0641c88443a1a22808c033509b3","amp;dn":"I+Shouldn%27t+Be+Alive+-+Season+6+-+HD+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc6143a675a9c0641c88443a1a22808c033509b3","infoHashBuffer":{"type":"Buffer","data":[188,97,67,166,117,169,192,100,28,136,68,58,26,34,128,140,3,53,9,179]},"announce":[],"urlList":[]}}