{"title":"EMPIRE OF COTTON A Global History By Sven Beckert","uid":12981766,"size":36186813,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bc7379f260c01ca10026d95bd429fdc214b1d57f&amp;dn=EMPIRE+OF+COTTON+A+Global+History+By+Sven+Beckert&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1450040708,"description":"EMPIRE OF COTTON A Global History By Sven Beckert\r\n\r\n\r\nONE OF THE NEW YORK TIMES 10 BEST BOOKS OF THE YEAR\r\n\r\nWINNER OF THE BANCROFT PRIZE\r\n\r\nPULITZER PRIZE FINALIST\r\n\r\nThe epic story of the rise and fall of the empire of cotton, its centrality to the world economy, and its making and remaking of global capitalism.\r\n \r\nCotton is so ubiquitous as to be almost invisible, yet understanding its history is key to understanding the origins of modern capitalism. Sven Beckert’s rich, fascinating book tells the story of how, in a remarkably brief period, European entrepreneurs and powerful statesmen recast the world’s most significant manufacturing industry, combining imperial expansion and slave labor with new machines and wage workers to change the world. Here is the story of how, beginning well before the advent of machine production in the 1780s, these men captured ancient trades and skills in Asia, and combined them with the expropriation of lands in the Americas and the enslavement of African workers to crucially reshape the disparate realms of cotton that had existed for millennia, and how industrial capitalism gave birth to an empire, and how this force transformed the world.\r\n\r\nThe empire of cotton was, from the beginning, a fulcrum of constant global struggle between slaves and planters, merchants and statesmen, workers and factory owners. Beckert makes clear how these forces ushered in the world of modern capitalism, including the vast wealth and disturbing inequalities that are with us today. The result is a book as unsettling as it is enlightening: a book that brilliantly weaves together the story of cotton with how the present global world came to exist.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:bc7379f260c01ca10026d95bd429fdc214b1d57f","amp;dn":"EMPIRE+OF+COTTON+A+Global+History+By+Sven+Beckert","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc7379f260c01ca10026d95bd429fdc214b1d57f","infoHashBuffer":{"type":"Buffer","data":[188,115,121,242,96,192,28,161,0,38,217,91,212,41,253,194,20,177,213,127]},"announce":[],"urlList":[]}}