{"title":"Simon And Garfunkle's - Greatest Hits [FLAC] TNT Village","uid":8891642,"size":231952577,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bcbbcfbc38f53138340bf3484a3690a4f721336a&amp;dn=Simon+And+Garfunkle%27s+-+Greatest+Hits+%5BFLAC%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"l.diliberto","files":14,"time":1378595601,"description":"Simon And Garfunkle's - Greatest Hits [FLAC] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=358533&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=358533&lt;/a&gt;\n\nGenere: Pop\nAnno: 1972 \n\nThis album has had over three decades to make an impact, and it says something for its staying power that, in the face of more recent, more generously programmed, and better mastered compilations of the duo's work, it remains one of the most popular parts of the Simon &amp; Garfunkel catalog -- which doesn't mean it isn't fraught with frustrations for anyone buying it. Its very existence is something of a fluke -- in the spring of 1972, the five original Simon &amp; Garfunkel albums, Wednesday Morning, 3 AM, Sounds of Silence, Parsley, Sage, Rosemary &amp; Thyme, Bookends and Bridge Over Troubled Water, were still selling almost as well as they had in the 1960s; indeed, Bridge Over Troubled Water had carved out a seemingly permanent place for itself on the charts for years; and between the continued radio play of the duo's biggest hits, and the inevitable discovery of their catalog by successive new waves of junior high and high school students, those five LPs stood among the most profitable parts of the Columbia Records back catalog, rivaling Bob Dylan's much larger library in sheer numbers. Columbia might have gone years longer without compiling the duo's hits, but then, in June of 1972, Paul Simon and Art Garfunkel did something totally unexpected -- in the midst of Simon's still-emerging solo career (and the careful crafting of his identity as a single act), and Garfunkel's re-identification of himself as an actor, the two reunited for one night, to do a benefit performance at New York's Madison Square Garden for the presidential candidacy of Senator George McGovern. (The latter event also took on a life of its own, as the first widely available Simon &amp; Garfunkel concert bootleg, with terrible sound but capturing for posterity what had to be one of the funniest moments of their stage history, when Simon, attempting to suppress his laughter, remarks in connection with requests being called out, that someone &quot;wants to hear &quot;Voices of Old People&quot; from Bookends). The performance was widely publicized, both before and after the event -- McGovern had captured the hearts and imaginations of tens of millions of high school and college students around the United States that spring, and this reviewer can attest to the fact that millions of people who were not at that show felt like they were there in spirit. It was inevitable that Columbia would want to put out a new Simon &amp; Garfunkel release to take advantage of the renewed attention and excitement surrounding the duo, and they probably could have gotten away with a straight greatest-hits collection; but thanks to some inspiration and cooperation between the label and the artists, Greatest Hits went far beyond that. Nine of the tracks on the 14-song LP did, indeed, comprise the duo's biggest hits -- including &quot;Bridge Over Troubled Water,&quot; &quot;Mrs. Robinson,&quot; and &quot;The Sounds of Silence&quot; -- in their familiar studio versions; but interspersed between them were previously unheard live recordings of &quot;For Emily, Whenever I May Find Her,&quot; &quot;The 59th Street Bridge Song (Feelin' Groovy),&quot; &quot;Homeward Bound,&quot; and &quot;Kathy's Song,&quot; plus an alternate take of &quot;America.&quot; At that time, Simon &amp; Garfunkel had never released a live album, and as it happened, at least four of those five were among the most personal songs in the duo's repertory -- songs that millions of fans responded to individually (as opposed to the mass appeal of the pair's hit singles). The fact that they were present as excellent live performances made the appeal of this record irresistible to fans at every level, from the most casual to the most serious and dedicated. It was a sign of just how much they were loved and missed (and, perhaps, needed?) that without anything but that one unrecorded and untelevised benefit show to support its release, the record peaked at number five on the Billboard charts. And a couple of years later, it joined their original five albums as a perennial catalog favorite. And it still holds up -- it touches all the right buttons, providing an overview of the duo's most popular songs, but with those live cuts and the &quot;America&quot; outtake to make it essential in its own right, separate from the overview -- indeed, it manages to present both the duo's broader history, and their most widely appealing music, and their most intimate work, all seamlessly; only some interesting and ambitious singles that either hadn't stood the test of time (&quot;Fakin' It&quot;) or were artistic blind alleys (&quot;The Dangling Conversation&quot;), were missing, along with &quot;Punky's Dilemma,&quot; a perennial FM radio favorite that lay just below Columbia Records' and the duo's radar. All of that is the good part about this collection, which ought to get an unqualified rave -- the bad part, and the reason that it doesn't get that rave, is the sound quality, which was indifferent on the LP and worse on the CD, with sound that audibly cracks on parts of &quot;The Sounds of Silence&quot; and some of the other early studio cuts; Greatest Hits has begged for a sonic upgrade, and remastering from better sources, for two decades, and Columbia somehow missed the obvious opportunity to do this as part of either its Mastersound and SACD catalogs. It's the one caveat that anyone buying it should bear in mind. \n\n.: Cover :.\n &lt;a href=&quot;\nhttp://img216.imageshack.us/img216/3272/simonandgarfunkelgreatesthitsfuv7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img216.imageshack.us/img216/3272/simonandgarfunkelgreatesthitsfuv7.jpg&lt;/a&gt;\n\n.: TrackList :.\n\n1. Mrs. Robinson [3:54]\n2. For Emily, Whenever I May Find Her [Live] [2:26]\n3. The Boxer [5:12]\n4. The 59th Street Bridge Song (Feelin' Groovy) [Live] [1:52]\n5. The Sound of Silence [Live] [3:08]\n6. I Am A Rock [2:54]\n7. Scarborough Fair/Canticle [3:11]\n8. Homeward Bound [Live] [2:44]\n9. Bridge Over Troubled Water [Live] [4:54]\n10. America [3:35]\n11. Kathy's Song [Live] [3:25]\n12. El Condor Pasa (If I Could) [3:09]\n13. Bookends [1:22]\n14. Cecilia [2:53]","torrent":{"xt":"urn:btih:bcbbcfbc38f53138340bf3484a3690a4f721336a","amp;dn":"Simon+And+Garfunkle%27s+-+Greatest+Hits+%5BFLAC%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcbbcfbc38f53138340bf3484a3690a4f721336a","infoHashBuffer":{"type":"Buffer","data":[188,187,207,188,56,245,49,56,52,11,243,72,74,54,144,164,247,33,51,106]},"announce":[],"urlList":[]}}