{"title":"Linux Mint Essentials","uid":10591233,"size":13029640,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd3ed6ba08e8e09339e92ffa7853d237a2589c08&amp;dn=Linux+Mint+Essentials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"freeshare4all","files":1,"time":1405799907,"description":"Overview\n\nLearn to use Linux Mint like a pro, starting with the installation and going all the way through maintaining your system\nCovers everything you need to know in order to be productive, including browsing the Internet, creating documents, and installing software\nHands-on activities reinforce your knowledge\nIn Detail\n\nLinux Mint is one of the most popular and proven distributions for beginners and advanced users alike. Out of the box hardware and multimedia support makes Mint your go-to choice for general computing. Its ease of use has transformed it into a celebrated Linux distribution.\n\nThis is an all-inclusive guide to Linux Mint, and will teach you everything you need to know in order to use a Linux Mint system. The book starts with the installation process and covers task-oriented topics such as browsing the Internet and installing software as well as shell commands. This guide walks the reader through installing and maintaining Linux Mint on a personal computer.\n\nUsing task-oriented examples, readers will journey through understanding what sets Mint apart from the competition, how to maintain it, and how to use it. Topics covered in the book include getting acquainted with Cinnamon, navigating the filesystem, software management, an introduction to the terminal, and more!\n\nWhat you will learn from this book\n\nExplore Linux Mint's functions\nConfigure and install the distribution\nDiscover the Cinnamon user interface\nManage user permissions\nUnderstand how to launch programs\nLearn how to use shell commands\nSet up Mint Firewall to prevent attacks\nand explore disaster recovery\nPlay music and videos\nManage digital camera photos\nTroubleshoot your Mint system\nApproach\n\nA task-oriented look at Linux Mint, using actual real-world examples to stimulate learning. Each topic is presented in an easy-to-follow order, with hands-on activities to reinforce the content.\n\nWho this book is written for\n\nIf you are starting out with Linux from a different platform or are well versed with Linux Mint and want a guide that shows you how to exploit certain functionality, this book is for you. No previous Linux experience is assumed.","torrent":{"xt":"urn:btih:bd3ed6ba08e8e09339e92ffa7853d237a2589c08","amp;dn":"Linux+Mint+Essentials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd3ed6ba08e8e09339e92ffa7853d237a2589c08","infoHashBuffer":{"type":"Buffer","data":[189,62,214,186,8,232,224,147,57,233,47,250,120,83,210,55,162,88,156,8]},"announce":[],"urlList":[]}}