{"title":"Cocoa Nut Busters 2 (2013 The Score Group) [DVDRip]","uid":8709827,"size":1693567334,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:bd5e42b6b09ebbc1b0ce5ca5151eb5cdbdea2285&amp;dn=Cocoa+Nut+Busters+2+%282013+The+Score+Group%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"chkm8te","files":4,"time":1374212433,"description":"Cocoa Nut Busters 2 (2013 The Score Group) [DVDRip]\n\nKristina Milan, Maserati, Natasha Dulce, Stacy Adams, Kristi Maxx, Melissa Reed, Luxury Amore, Chantal Raye, Sadie Blooms, Betty Blac, Stacey Monroe, Delilah Black\n\nThey've got ripe, brown cannons and they use them to help fire off loads of cum! These 12 cocoa nut busters are built for hard fucking, and that's just what they do in hot XXX action that ends up with them coated in hot jizz! Starring Kristina Milan and her lactating jugs! Plus fan favorites Maserati, Natasha Dulce and Kristi Maxx drain dicks, and Stacey Monroe gets ass-fucked, too!\n\nThey use their cocoa jugs to make you bust a nut!\n\nThe biggest, juiciest mocha tits await you in this second installment of Cocoa Nut Busters. These dark and lovely babes use their lust pillows, juicy pussies and mouths to siphon all the spooge from your cock. Starring Dominican tit-juggernaut Kristina Milan, who fucks and sucks while her tits lactate all over the place! She might take a load on her chest, but her chest drizzles a load of breast milk all over her fuck buddy!\n\nNewcomer Melissa Reed does her first XXX ever, and, boy, does she love pro cock! She gets the casting couch treatment and then a healthy coating of nut sauce.\n\nChantal Raye is another newcomer who decided to try porn so she could have sex all the time. She gets speared in her bedroom and then opens her mouth wide so she can swallow some sperm!\n\nWe all love ladies who are cock hungry like curvy Latina Natasha Dulce. She fucks her friend and then gets a mouth load of his cum, too!\n\nDelilah Black struts around in kinky mesh lingerie that shows off all of her curves. Then she gets plowed in every position before asking for her mouth to be filled with hot, sticky jizz.\n\nBetty Blac seems like the perfect girl-next-door, but once you get her in the bedroom, she drops the nice girl act and unleashes her inner freak. She likes her pussy plowed so much that she asks her partner to shoot his load in her pussy.\n\nBetty isn't the only busty, black beauty who likes creampies. Big-tit hottie Maserati goes for a job interview and ends up getting the position...but only after she fucks her soon-to-be-boss in every position possible and gets a creampie, too!\n\nLuxury Amore and Stacy Adams also go the creampie route, getting their pink slits filled to the brim with baby batter and loving every moment.\n\nStacey Monroe gets her tight asshole fucked and Kristi Maxx gets her face coated in ball sauce. Plus, newcomer Sadie Blooms entices her man with some strawberries and whipped cream, but she gets a mouthful of hot cum as her dessert! These dozen mocha madams want cum...so whip out your cock and give it to them!\n\nScreens: &lt;a href=&quot;\nhttp://imgsure.com/?v=525294&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsure.com/?v=525294&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgsure.com/?v=938207&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsure.com/?v=938207&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgsure.com/?v=145919&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsure.com/?v=145919&lt;/a&gt;","torrent":{"xt":"urn:btih:bd5e42b6b09ebbc1b0ce5ca5151eb5cdbdea2285","amp;dn":"Cocoa+Nut+Busters+2+%282013+The+Score+Group%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd5e42b6b09ebbc1b0ce5ca5151eb5cdbdea2285","infoHashBuffer":{"type":"Buffer","data":[189,94,66,182,176,158,187,193,176,206,92,165,21,30,181,205,189,234,34,133]},"announce":[],"urlList":[]}}