{"title":"Alexander Pope - 1 - The Rape of the Lock - Penguin Audiobooks","uid":8767434,"size":184990959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd72403449174a990720b5264bb7f5419db70937&amp;dn=Alexander+Pope+-+1+-+The+Rape+of+the+Lock+-+Penguin+Audiobooks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"wordcity","files":85,"time":1375366852,"description":"\nWhat dire offence from am'rous causes springs,\n  What mighty contests rise from trivial things,\n  I sing--This verse to CARYL, Muse! is due:\n  This, ev'n Belinda may vouchsafe to view:\n  Slight is the subject, but not so the praise,                    \n  If She inspire, and He approve my lays.\n\n  Say what strange motive, Goddess! could compel\n  A well-bred Lord t' assault a gentle Belle?\n  O say what stranger cause, yet unexplor'd,\n  Could make a gentle Belle reject a Lord?                        \n  In tasks so bold, can little men engage,\n  And in soft bosoms dwells such mighty Rage?\n\n  Sol thro' white curtains shot a tim'rous ray,\n  And oped those eyes that must eclipse the day:\n  Now lap-dogs give themselves the rousing shake,                 \n  And sleepless lovers, just at twelve, awake:\n  Thrice rung the bell, the slipper knock'd the ground,\n  And the press'd watch return'd a silver sound.\n  Belinda still her downy pillow prest,\n  Her guardian SYLPH prolong'd the balmy rest:                    \n  'Twas He had summon'd to her silent bed\n  The morning-dream that hover'd o'er her head;\n  A Youth more glitt'ring than a Birth-night Beau,\n  (That ev'n in slumber caus'd her cheek to glow)\n  Seem'd to her ear his winning lips to lay,                      \n  And thus in whispers said, or seem'd to say...\n\nAn excellent reading, from the Penguin Audiobook of Eighteenth Century English Verse, of Pope's mock-epic,Â The Rape of the Lock ","torrent":{"xt":"urn:btih:bd72403449174a990720b5264bb7f5419db70937","amp;dn":"Alexander+Pope+-+1+-+The+Rape+of+the+Lock+-+Penguin+Audiobooks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd72403449174a990720b5264bb7f5419db70937","infoHashBuffer":{"type":"Buffer","data":[189,114,64,52,73,23,74,153,7,32,181,38,75,183,245,65,157,183,9,55]},"announce":[],"urlList":[]}}