{"title":"Dungeons &amp; Dragons: Krynn Series (GOG)","uid":12656895,"size":153921392,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bd7439019c905cf79df5746d85090ff7d259b67d&amp;dn=Dungeons+%26amp%3B+Dragons%3A+Krynn+Series+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mercs215","files":13,"time":1446234390,"description":"Install instructions:\r\n- Run &quot;setup_champions_of_krynn_2.0.0.3.exe&quot;\r\n- Run &quot;setup_death_knights_of_krynn_2.0.0.2.exe&quot;\r\n- Run &quot;setup_the_dark_queen_of_krynn_2.0.0.5.exe&quot;\r\n- Play\r\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS! :)\r\nIf you like this game, support the developers and BUY IT!\r\n\r\nTitle: DUNGEONS &amp; DRAGONS: KRYNN SERIES\r\nGenre: Role-playing - Turn-based - Fantasy\r\nWorks on: Windows (XP, Vista, 7, 8, 10), Mac OS X (10.7) and Linux (Ubuntu 14.04, Mint 17)\r\nLanguages: Text only: English\r\nModes: Single-player\r\nReleased: January 1, 1990\r\nCompany: Strategic Simulations Inc. &amp; MicroMagic inc. / GOG Ltd.\r\nStore page: http://www.gog.com/game/dungeons_dragons_krynn_series\r\n\r\nAbout:\r\nReturn to the first fantasy role-playing epic set in the legendary Dragonlance game world of Krynn. This immortal pack includes Champions of Krynn, Death Knights of Krynn and The Dark Queen of Krynn.\r\nChampions of Krynn\r\nThe War of the Lance is over, but Evil is a BAD loser... With the Dragonarmies defeated and the lands to the east reconquered, the forces of good have withdrawn and settled down to a well-earned rest. Evil forces, however, never rest and have been quietly plotting a cataclysmic return to power! Their goal: nothing short of establishing the Dark Queen, Takhisis, as undisputed ruler of Krynn! Guide your party of characters through a dark web of intrigue and combat, where dragons, draconians and other unspeakable monstrosities dwell. Go with a brave heart - for you and your heroic adventurers are all that stand in the way of evil tyranny.\r\nDeath Knights of Krynn \r\nLord Soth has thrown down the gauntlet of challenge - a challenge that you are oath-bound to accept. It has been one short year since the Champions of Krynn claimed victory over the massed forces of evil. Now, the Lord of the Death Knights, Soth himself, is preparing to wreak havoc in an eruption of evil such as Krynn has never witnessed! As members of the Special Solamnic Order of the Champions of Krynn, you and your party stand as the only force capable of answering soth's deadly challenge... and living to tell of it.\r\nThe Dark Queen of Krynn \r\nThe Epic began with Champions of Krynn. Then, the adventure continues in Death Knights of Krynn. Now, the amazing conclusion to SSI's award-winning Dragonlance fantasy role-playing epic is here! The Dark Queen of Krynn propels you across the sea to Taladas for the final battle against Krynn's worst nightmare. You must once more take up arms and traverse from the depths of the ocean to the very pinnacle of the Tower of Flame to confront this evil, once and for all...\r\nAssemble a party of fearsome warriors, wise clerics and nimble thieves, and take them with you throughout your three adventures\r\nGuide your party through a dark web of intrigue and combat, where dragons, draconians and other unspeakable terrors dwell\r\nOnly great wit and valor will defeat the Dark Queen's minions\r\n\r\nMinimum system requirements - Windows: XP / Vista / 7 / 8 / 10 \r\nProcessor: 1.8 GHz Processor \r\nMemory: 512MB RAM (1 GB recommended) \r\nGraphics: 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended) \r\nHard Drive: 2GB HDD \r\nMouse, Keyboard","torrent":{"xt":"urn:btih:bd7439019c905cf79df5746d85090ff7d259b67d","amp;dn":"Dungeons+%26amp%3B+Dragons%3A+Krynn+Series+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd7439019c905cf79df5746d85090ff7d259b67d","infoHashBuffer":{"type":"Buffer","data":[189,116,57,1,156,144,92,247,157,245,116,109,133,9,15,247,210,89,182,125]},"announce":[],"urlList":[]}}