{"title":"Outlaw By Ted Dekker","uid":9250026,"size":2048838,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be19e0fb8cb6c79d60c2d3a233ca005a64ae3402&amp;dn=Outlaw+By+Ted+Dekker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"maxdesolate","files":4,"time":1385448262,"description":"\nThe story of how I, Julian Carter, and my precious two-year old son, Stephen, left Atlanta Georgia and found ourselves on a white sailboat, tossed about like a cork on a raging sea off of Australia's northern tip in 1963, is harrowing.\n\nBut it pales in comparison to what happened deep in the jungle where I was taken as a slave by a savage tribe unknown to the world. Some places dwell in darkness so deep that even God seems to stay away.\n\nThere, my mind was torn in two by the gods of the earth. There, one life ended so another could begin.\n\nSome will say I was a fool for making the choices I made. But they would have done the same. They, too, would have embraced death if they knew what I knew, and saw through my eyes.\n\nMy name is Julian and this is my story. But more, it is the story of my son who was born to change the world.\n\nFrom deep in the impenetrable jungles where New York Times bestselling author Ted Dekker was born and raised, comes OUTLAW, an epic adventure of two worlds that perhaps only he could write. Full of harrowing twists, sweeping violence, and wild love, Outlaw takes us beyond the skin of this world to another unseen.\n\nepub and mobi. ","torrent":{"xt":"urn:btih:be19e0fb8cb6c79d60c2d3a233ca005a64ae3402","amp;dn":"Outlaw+By+Ted+Dekker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be19e0fb8cb6c79d60c2d3a233ca005a64ae3402","infoHashBuffer":{"type":"Buffer","data":[190,25,224,251,140,182,199,157,96,194,211,162,51,202,0,90,100,174,52,2]},"announce":[],"urlList":[]}}