{"title":"Lost In Space Fiction","uid":15506643,"size":8141437,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be3bf99573d500ae6259df037e16714a71653628&amp;dn=Lost+In+Space+Fiction&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Psychodad149","files":5,"time":1470595420,"description":"These three works are what is commonly called &quot;fanfic&quot;, a term I dislike.\nAnyway, what you have here is some of my own original fiction based on the classic TV series, &quot;Lost In Space.&quot;\n\n&quot;Lost In Space Adventures&quot; is a collection of stories based on actual episodes from the series, rewritten as serious science fiction for grown-ups. The included introduction explains a bit more. They are presented in the order in which the actual episodes aired, which is not the order in which they were written. \n\n&quot;Endless Skies Trilogy&quot; is a collection of three independent works, although they comprise a continuous story in chronological order. I wrote them so each can stand by itself, and provide all necessary backstory. If, for some reason, you wanted to start with the last (&quot;Through Endless Skies&quot;), you would not find yourself lost and wondering just the heck was going on here (although you would miss the pleasure of reading the first two.) I also wrote so that one need not be familiar with the series itself to understand and enjoy the story. With few exceptions, I make no references to incidents from the series which are otherwise unexplained; this is meant to stand alone both for those who know the show and those who don't.\n\nAlso, &quot;Endless Skies&quot; departs somewhat from the original series, although not in any significant ways. It may be in a slightly alternate universe from the series and from our own. I drop a few clues along the way that the history of that universe departs in some ways from our own, a fact which becomes of some significance in the last story of the trilogy.  I will confess that the one glaring departure from the series was sheer laziness on my part. In the series, the first season was spent on one planet, then a second planet in the second season, and the third season saw the Robinsons careening through the universe. For simplicity's sake, I have postulated instead that their entire time &quot;lost in space&quot; was on one single planet. \n\n&quot;Requiem &quot; is a short-short, in the same universe as &quot;Endless Skies&quot;, and provides an ending to the saga, although at some unspecified future time. Unlike the trilogy, this one does invoke a few references to episodes from the series, most particularly, &quot;My Friend, Mr. Nobody&quot; (one of my favorites!). It has also, I think, a touch of Lovecraft, and is meant to be a bit spooky (not to mention a tearjerker.) Also unlike the trilogy, this is NOT a standalone, and you will not understand some bits if you haven't read that.\n\nBut in any case, please download and enjoy!\n\nAnd if you REALLY like &quot;Endless Skies&quot;, you can get a real, professionally bound copy for a purely nominal cost of $22 (cost of printing &amp; postage -- strictly non-profit), see our front page at the Penny Robinson Fan Club: http://pennyrobinsonfanclub.net/","torrent":{"xt":"urn:btih:be3bf99573d500ae6259df037e16714a71653628","amp;dn":"Lost+In+Space+Fiction","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be3bf99573d500ae6259df037e16714a71653628","infoHashBuffer":{"type":"Buffer","data":[190,59,249,149,115,213,0,174,98,89,223,3,126,22,113,74,113,101,54,40]},"announce":[],"urlList":[]}}