{"title":"Phosphorescent - Muchacho de Lujo (Delux Version)(2013)FLAC-Cue","uid":10084054,"size":602739118,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:be4706af66281f892fc39075d6f225c36c235d41&amp;dn=Phosphorescent+-+Muchacho+de+Lujo+%28Delux+Version%29%282013%29FLAC-Cue&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"77ausy","files":-1,"time":1399064383,"description":"\n\nUnder the name Phosphorescent, indie country songwriter Matthew Houck has walked a drunken path, wobbling \ncloser to the indie side on some records and slumping more toward the country side on others, with the best \nexample being his 2009 collection of Willie Nelson covers, To Willie. With sixth album Muchacho, Houck \nreturns to some of the experimental textures that marked his early breakthrough album Pride, weaving ambient\n tones and feral whoops throughout his sometimes shiny, sometimes grizzled Americana. The album is bookended\n by tracks &quot;Sun, Arise!&quot; and &quot;Sun's Arising,&quot; meditative drones with multi-tracked layers of Houck harmonizing\n with himself, ushering the listener into and out of the record over arpeggiated synth tones and far-off-sounding\n instrumentation. There's more implementation of electronic instruments here than most Phosphorescent material\n that came before, with 808 drum patterns and dubby echoes in the forefront on some songs, but at no point \ndoes the songwriting surrender the starring role. Whether the tunes are piling on pedal steel and mariachi \ntrumpet in the vein of Dylan's soundtrack work for Pat Garrett &amp; Billy the Kid, as on the honky tonk hoedown \nof &quot;A Charm/A Blade,&quot; or finding some dreamy Will Oldham/early Animal Collective hybrid, as with the\n ghostly &quot;The Quotidian Beasts,&quot; Houck's use of simplistic but haunting chord progressions and world-weary\n melodies always overrides any other sonic surroundings. The songs here are so strong, in fact, they're \nsometimes cluttered by excessive instrumentation or detail-burying production. While the atmospheric string \nloops and delay-doused bass plucks of &quot;Song for Zula&quot; help make it one of the best tracks on the album, one \ncan't help but wonder what the effect would be if it were stripped down to Houck's damaged vocals and a \nsimple guitar or piano figure. Throughout the album, lyrics peek through the waves like &quot;I will not open \nmyself up this way again&quot; and &quot;Hey can this kill me? I don't know, but I've sure been finding out,&quot; hinting\n at heartache and the possibility that Muchacho is some drunken-hearted breakup record, but it's never made\n abundantly clear. What is clear, even through the sometimes heavier-than-necessary arrangements, is that\n Muchacho has some of Houck's best songwriting since his early days, seemingly tapped into the grainy pain, \nhard-living tendencies, and wandering muse of his subconscious with the most listenable results\n Phosphorescent has produced in years.\n  \n==================================================\n\nTrack List:\n\n1 - Sun, Arise! (An Invocation, An Introduction)\n2 - Song for Zula\n3 - Ride On / Right On\n4 - Terror In the Canyons (The Wounded Master)\n5 - A Charm / A Blade\n6 - Muchacho's Tune\n7 - A New Anhedonia\n8 - The Quotidian Beasts\n9 - Down to Go\n10 - Sun's Arising (A Koan, An Exit)\n\n=====================================\n\nDeluxe Edition Bonus Tracks:\n\n11 - Muchacho's Tune (Live at St. Pancras Church)\n12 - A New Anhedonia (Live at St. Pancras Church)\n13 - Song for Zula (Live at St. Pancras Church)\n14 - A Picture of Our Torn Up Praise (Live at St. Pancras Church)\n15 - We'll Be Here Soon (Live at St. Pancras Church)\n16 - My Dove, My Lamb (Live at St. Pancras Church)\n17 - Terror In the Canyons (The Wounded Master) (Live at St. Pancras Church)\n18 - Storms Never Last (Live at St. Pancras Church)\n19 - Down to Go (Live at St. Pancras Church)\n20 - Wolves (Live at St. Pancras Church)\n21 - Mrs. Juliette Low (Live at St. Pancras Church)\n22 - Los Angeles (Live at St. Pancras Church)","torrent":{"xt":"urn:btih:be4706af66281f892fc39075d6f225c36c235d41","amp;dn":"Phosphorescent+-+Muchacho+de+Lujo+%28Delux+Version%29%282013%29FLAC-Cue","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be4706af66281f892fc39075d6f225c36c235d41","infoHashBuffer":{"type":"Buffer","data":[190,71,6,175,102,40,31,137,47,195,144,117,214,242,37,195,108,35,93,65]},"announce":[],"urlList":[]}}