{"title":"Robert Plant, A Life (in Led Zeppelin) by Paul Rees epub mobi az","uid":9187337,"size":6579460,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be998af5f1ffe10c1348f447043221993da79304&amp;dn=Robert+Plant%2C+A+Life+%28in+Led+Zeppelin%29+by+Paul+Rees+epub+mobi+az&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dovah12","files":-1,"time":1384327869,"description":"Robert Plant: A Life\n\nAuthor : Paul Rees\n\n\nisbn: 0062281402\nisbn13: 9780062281401\nformat: ebook epub, mobi, azw3\nPublished October 22nd 2013 by It Books\n\n\nThe definitive biography of the larger-than-life Led Zeppelin singer-the man who defined the very notion of what it means to be a rock god\n\nWith a voice recognized around the world, Robert Plant is a living legend-frontman of one of the biggest and most influential rock bands of all time: Led Zeppelin. The sheer scale of Zeppelin's success is extraordinary. In the U.S. alone they have sold 70 million records-a figure surpassed only by the Beatles-while &quot;Stairway to Heaven,&quot; the band's most recognizable song, has been played more times on American radio than any other track and is frequently referred to as one of the greatest rock 'n' roll songs ever.\n\nBut Plant's legacy stretches far beyond Led Zeppelin and with Robert Plant: A Life, Paul Rees, former Editor of Q and Kerrang! magazines, whose professional relationship with Plant spans decades, brings the whole picture into focus for the first time. From the forces that shaped him as a boy in England's Black Country to the ravaging highs and lows of the Zeppelin years; from his relationship with Jimmy Page and John Bonham to the solo career that today, at the age of 62, sees him producing some of the most acclaimed work of his career, Rees paints a rich, complicated portrait of a man who changed the face of rock 'n' roll at just 19 years old.\n\nTold with tenacity, emotion and the spark of brilliance that befits such an enigmatic frontman, this is the definitive story of a musical icon.\n\n\n================\n\nDovah","torrent":{"xt":"urn:btih:be998af5f1ffe10c1348f447043221993da79304","amp;dn":"Robert+Plant%2C+A+Life+%28in+Led+Zeppelin%29+by+Paul+Rees+epub+mobi+az","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be998af5f1ffe10c1348f447043221993da79304","infoHashBuffer":{"type":"Buffer","data":[190,153,138,245,241,255,225,12,19,72,244,71,4,50,33,153,61,167,147,4]},"announce":[],"urlList":[]}}