{"title":"A Suitable Enemy: Racism, Migration and Islamophobia in Europe","uid":8770820,"size":1852530,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:beb5e6f03f79890172583408aec36fac19ebac2c&amp;dn=A+Suitable+Enemy%3A+Racism%2C+Migration+and+Islamophobia+in+Europe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"blackatk","files":-1,"time":1375450743,"description":"[img]http://image.bayimg.com/fe23b2a6deeffee7de80f256e51bf184979e6407.jpg[/img]\n\n\n\nRelease date: March 17, 2009 | With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload | filetype: pdf |\n\n\nLiz Fekete is a leading authority on issues of racism, Islamophobia and national security legislation. A Suitable Enemy draws on sixteen years of research to present a comprehensive overview of EU immigration, asylum, race and security policies. Fekete argues that at the same time as the EU introduces selective migration policies, it closes its borders against asylum seekers who were the first victims of the growth of the security state which now embraces Muslims. She explores the way in which anti-terrorist legislation has been used to evict undesirable migrants, how deportation policies commodify and de-humanise the most vulnerable and how these go hand in hand with evolving forms of racism, particularly Islamophobia. At the heart of the book is an examination of xeno-racism -- a non-colour coded form of institutionalised racism -- where migrants who do not assimilate, or who are believed to be incapable of assimilation, are excluded.\n\n\n\nReview\nLiz Fekete is one of the best analysts of the complexities of racism in Europe today. In showing how racism has been profoundly impacted by Islamophobia, the War on Terror, and by a 'xeno-racism' directed at undocumented migrants and asylum seekers, A Suitable Enemy is the major work we've been waiting for. An enormously accomplished and important book -- Professor Avery Gordon, Department of Sociology, University of California, Santa Barbara A Suitable Enemy shows how the extreme right captured the political initiative by portraying immigrants and asylum seekers as a threat to European security, identity and prosperity ... Liz Fekete presents an important analysis that should be used by anyone concerned about the real threats to human rights and democracy today. -- Professor Stephen Castles International Migration Institute, University of Oxford Liz Fekete's work is an important and timely book. The author is addressing crucial issues helping the readers to understand how new kinds of racism, exclusion and power struggles are at work. Liz Fekete shows us how the far right discourses and policies are being more and more normalised ... She reveals the many dangers facing the European societies. -- Professor Tariq Ramadan Senior Research Fellow, Oxford St Antony's College This book deserves a slow and careful reading. Liz Fekete reaches into the unique archives of knowledge ... and provides a clear, detailed and insightful road map for those who want to navigate and understand where, how and why current executive actions are reproducing ... This work of extraordinary thoroughness and clear, passionate moral insight provides a primer of unparalleled utility. -- Gareth Peirce, civil rights lawyer\nAbout the Author\nLiz Fekete is Executive Director of the Institute of Race Relations and has written and lectured widely on issues of migration, race and security in Europe. She edits the European Race Bulletin. She is a consultant on refugee and immigration issues to a number of organisations, including the Refugee Council, and was an expert witness at the Basso Permanent Peoples' Tribunal and the World Tribunal on Iraq. \n\n\n\nPaperback: 240 pages\nPublisher: Pluto Press (March 17, 2009)\nLanguage: English\nISBN-10: 0745327923\nISBN-13: 978-0745327921\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Suitable-Enemy-Racism-Migration-Islamophobia/dp/0745327923/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Suitable-Enemy-Racism-Migration-Islamophobia/dp/0745327923/&lt;/a&gt;\n\n\n\nTags: race, racism, discrimination, christianity, Islam, religion, xenophobia, nationalism, EU, Europe, European Union, Union, ECC, economy, wealth, culture, discrimination, middle east, scandanavia, norway, sweden, finland, \nrace racism slavery servitude indentured servitude bondage diet health african , iraq, iraqi, yugoslavia, turkey, turkish, bosnia, bosnian, africa, ghettoization, superiority, double standard, ","torrent":{"xt":"urn:btih:beb5e6f03f79890172583408aec36fac19ebac2c","amp;dn":"A+Suitable+Enemy%3A+Racism%2C+Migration+and+Islamophobia+in+Europe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"beb5e6f03f79890172583408aec36fac19ebac2c","infoHashBuffer":{"type":"Buffer","data":[190,181,230,240,63,121,137,1,114,88,52,8,174,195,111,172,25,235,172,44]},"announce":[],"urlList":[]}}