{"title":"Donizetti  -  Roberto Devereux  (1994)","uid":4752905,"size":554456419,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bf262aabf15db9349f9c0729025938be63ff2d88&amp;dn=Donizetti++-++Roberto+Devereux++%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"sheila6","files":37,"time":1236288717,"description":"Music : Classical : Lossless\n\n\nDonizetti: Roberto Devereux 2 CDs 62:25 67:20 DDD\n\nNightingale Classics NC070563-2 P1994 C1994\n\nRecorded 19.-23. 03. 1994., Palais de la Musique et des Congres, Strasbourg\nOrchestre Philharmonique de Strasbourg, Choeurs de l'OpÃƒÂ©ra du Rhin, Friedrich Haider (cond.)\n\nEdita Gruberova (Elisabetta), Delores Ziegler (Sara), Don Bernadini (Roberto), Ettore Kim (Nottingham), Benoit Boutet (Lord Cecil), Merih Kazbek (Sir Gualtiero Raleigh), Francois Richert (Un Paggio/Un Familiare)\n\n\n\nRoberto Devereux (or Roberto Devereux, ossia Il conte di Essex [Robert Devereux, or the Earl of Essex]) is a tragedia lirica, or tragic opera, by Gaetano Donizetti. Salvatore Cammarano wrote the Italian libretto after FranÃƒÂ§ois Ancelot's tragedy Elisabeth d'Angleterre.\n\nIt is loosely based on the life of Robert Devereux, 2nd Earl of Essex, an influential member of Queen Elizabeth's court. It is one of a number of operas by Donizetti which deal with the Tudor period in English history and include Anna Bolena, Maria Stuarda and Il castello di Kenilworth.\n\n\n\nPerformance history:\n\nIt was first performed on October 29, 1837 at the Teatro San Carlo, Naples.\n\n\n\nBackground:\n\nThe plot of Roberto Devereux was hardly original and was liberally taken from Il Conte d'Essex by Felice Romani (1833). Romani's widow charged Cammarano with plagiarism though the practice of stealing plots was very common between rival Italian opera houses.\n\nRobert Devereux was the subject of at least three French plays: Le Comte d'Essex by Pierre Corneille, Le Comte d'Essex by La Calprenede, and the source of this opera Elisabeth d'Angleterre by FranÃƒÂ§ois Ancelot.\n\nThere are many historical inaccuracies in the libretto but it makes for an excellent drama.\n\n\n\nMusic:\n\nThough the opera is rarely performed today, it contains some of Donizetti's best vocal writing. The opera is raw and emotional; it is a powerful vehicle for the soprano. Some of the highlights include the Act I duet between Elizabeth and Robert Nascondi, frena i palpiti. The final scene is one of the most dramatic and difficult in bel canto opera. As Elizabeth is going mad with the death of her lover, Quel sangue versato pushes romantic opera to the limits of melodic expression.\n\n\n\nSynopsis:\n\nThe story revolves around a love quadrangle involving Elizabeth, Queen of England; Robert Devereux, Earl of Essex; the Duke of Nottingham; and Sara, the Duchess of Nottingham. Robert and Sara had been lovers, but while Robert was fighting in Ireland, the Queen forced Sara to marry Nottingham. Elizabeth has given Robert a special ring to guarantee his safety. The Queen is in love with Robert and is willing to forgive his treachery to the throne of England if he pledges his love to her. He is arrested with incriminating evidence including a blue scarf that belongs to Sara. Robert refuses to name his secret lover. This enrages Elizabeth who orders him sent to the Tower of London and executed.\n\nRobert refuses to betray Sara and further enrages Elizabeth and Nottingham. While in the Tower of London, Robert sends Sara his ring and tells her to beg Elizabeth for mercy. Nottingham stops Sara and imprisons her to enact his revenge on Robert.\n\nElizabeth is mournful about the pending death of her lover and wonders where Sara is. Finally, Sara arrives disheveled and gives Elizabeth the ring. The Queen in vain tries to stop the execution but then hears the cannons announcing Robert's death. She demands to know why Nottingham prevented this evidence from being given to her and he says, &quot;Blood I wanted, and blood I got!&quot; Elizabeth is haunted by the headless corpse of Robert. She longs for her own death and for James' accession to her throne. The opera ends with Elizabeth kissing Robert's ring to her lips.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:bf262aabf15db9349f9c0729025938be63ff2d88","amp;dn":"Donizetti++-++Roberto+Devereux++%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf262aabf15db9349f9c0729025938be63ff2d88","infoHashBuffer":{"type":"Buffer","data":[191,38,42,171,241,93,185,52,159,156,7,41,2,89,56,190,99,255,45,136]},"announce":[],"urlList":[]}}