{"title":"Story Structure Architect: A Writer's Guide to Building Dramatic","uid":8943045,"size":852740,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bfa033dae535766791dfcada50b28d80af4d2444&amp;dn=Story+Structure+Architect%3A+A+Writer%27s+Guide+to+Building+Dramatic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1379712101,"description":"Story Structure Architect: A Writer's Guide to Building Dramatic Situations and Compelling Characters\nby Victoria Lynn Schmidt\n\n\n\nIt's been said that there are no new ideas; but there are proven ideas that have worked again and again for all writers for hundreds of years.\n\nStory Structure Architect is your comprehensive reference to the classic recurring story structures used by every great author throughout the ages. You'll find master models for characters, plots, and complication motifs, along with guidelines for combining them to create unique short stories, novels, scripts, or plays. You'll also learn how to:\n\nBuild compelling stories that don't get bogged down in the middle\nSelect character journeys and create conflicts\nDevise subplots and plan dramatic situations\nDevelop the supporting characters you need to make your story work\nEspecially featured are the standard dramatic situations inspire by Georges Polti's well-known 19th century work, The Thirty-Six Dramatic Situations. But author Victoria Schmidt puts a 21st-century spin on these timeless classics and offers fifty-five situations to inspire your creativity and allow you even more writing freedom. Story Structure Architect will give you the mold and then help you break it.\nThis browsable and interactive book offers everything you need to craft a complete, original, and satisfying story sure to keep readers hooked!\n","torrent":{"xt":"urn:btih:bfa033dae535766791dfcada50b28d80af4d2444","amp;dn":"Story+Structure+Architect%3A+A+Writer%27s+Guide+to+Building+Dramatic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfa033dae535766791dfcada50b28d80af4d2444","infoHashBuffer":{"type":"Buffer","data":[191,160,51,218,229,53,118,103,145,223,202,218,80,178,141,128,175,77,36,68]},"announce":[],"urlList":[]}}