{"title":"S01E01-Pretty Guardian Sailor Moon Crystal","uid":10493924,"size":383334401,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c05cb5e34d60a8b15f613325746b6fcae419e5df&amp;dn=S01E01-Pretty+Guardian+Sailor+Moon+Crystal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"ligre","files":-1,"time":1404579456,"description":"On her way to school, 14-year-old Usagi Tsukino briefly encounters a cat with a crescent-shaped bald patch on its forehead. Elsewhere, a shadowy figure creates a woman out of clay, tasking it with obtaining the &quot;Legendary Silver Crystal&quot;. Meanwhile, after Usagi hears from her friends about the masked vigilante, Sailor V, who recently thwarted a jewelry store robbery, she goes with her best friend Naru Osaka to visit her mother's jewelry store, which is undergoing a sudden sale for some reason. After briefly bumping into a handsome stranger wearing a tuxedo and getting lectured by her mother for her low test grades, Usagi is once again approached by the cat, who reveals she can speak and reveals that her name is Luna. Luna gives Usagi a mysterious broach and has her utter the words &quot;Moon Prism Power - Make Up&quot;, which transforms her into a Sailor Guardian. Upon transforming, Usagi hears a cry for help from Naru, whose mother had been replaced by an evil &quot;youma&quot; named Morga, who was using the discount jewelry to drain energy from those who bought them. As Usagi confronts Morga, calling herself &quot;Sailor Moon,&quot; Morga possesses the girls who had bought jewelry from her and has them attack her. Usagi's fearful cries turn into ultrasonic waves which incapacitate the possessed girls. With encouragement from the stranger Usagi encountered earlier, who reveals himself as Tuxedo Mask, Usagi kills Morga using her Moon Tiara Boomerang.\n\nSUBTITLE LANGUAGE: SPANISH","torrent":{"xt":"urn:btih:c05cb5e34d60a8b15f613325746b6fcae419e5df","amp;dn":"S01E01-Pretty+Guardian+Sailor+Moon+Crystal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c05cb5e34d60a8b15f613325746b6fcae419e5df","infoHashBuffer":{"type":"Buffer","data":[192,92,181,227,77,96,168,177,95,97,51,37,116,107,111,202,228,25,229,223]},"announce":[],"urlList":[]}}