{"title":"Alice in Chains - 24 Bit Vinyl Pack","uid":9494543,"size":9475117972,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c10d78162053d65549c15996c81a85a957b64c17&amp;dn=Alice+in+Chains+-+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"77ausy","files":-1,"time":1390067232,"description":"\nAlice in Chains is an American rock band formed in Seattle, Washington, in 1987 by guitarist and songwriter Jerry Cantrell and \noriginal lead vocalist Layne Staley. The initial lineup was rounded out by drummer Sean Kinney, and bassist Mike Starr \n(who was replaced in 1993 by Mike Inez).\nAlthough widely associated with grunge music, the band's sound incorporates heavy metal and acoustic elements. Since its formation\n, Alice in Chains has released five studio albums, three EPs, two live albums, four compilations, and two DVDs. \nThe band is known for its distinct vocal style which often included the harmonized vocals of Staley and Cantrell.\nAlice in Chains rose to international fame as part of the grunge movement of the early 1990s, along with other Seattle bands such\n as Nirvana, Pearl Jam, and Soundgarden. The band was one of the most successful music acts of the 1990s, selling over 25 million\n albums worldwide, and over 14 million in the US alone.In 1992, the band released their album Dirt, which was critically acclaimed\n and has been certified quadruple platinum. The band also achieved two No. 1 Billboard 200 releases \n( The Jar of Flies EP and the self-titled album), 14 top ten songs on the Mainstream Rock Tracks chart and eight Grammy Award \nnominations.\nAlthough never officially disbanding, Alice in Chains was plagued by extended inactivity from 1996 onwards due to Staley's\n substance abuse, which resulted in his death in 2002. The band reunited in 2005 with new lead vocalist William DuVall, and \nreleased their fourth studio album, Black Gives Way to Blue, in 2009. The album was a success, being certified gold by the RIAA \nin 2010. Alice in Chains released their fifth studio album, The Devil Put Dinosaurs Here, on May 28, 2013.\n\n===============================\n\nAlbum List\n\n(1990) Alice In Chains - Facelift\n(1992) Alice In Chains - Dirt\n(1994) Alice In Chains - Jar of Files,SAP\n(1995) Alice in Chains - Alice In Chains\n(1996) Alice In Chains - MTV Unplugged\n(2009) Alice In Chains - Black Gives Way to Blue\n(2013) Alice in Chains - The Devil Put Dinosaurs Here\n\n====================================\n\nGroup:Alice In Chains\nYears active:1990 - Present\nStyle:Grunge,Metal\nBit rate mode: Variable\nBit rate: 2 476 Kbps - 3 000  kbps\nChannel(s): 2 channels\nSampling rate: 96.0 KHz\nBit depth: 24 bits","torrent":{"xt":"urn:btih:c10d78162053d65549c15996c81a85a957b64c17","amp;dn":"Alice+in+Chains+-+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c10d78162053d65549c15996c81a85a957b64c17","infoHashBuffer":{"type":"Buffer","data":[193,13,120,22,32,83,214,85,73,193,89,150,200,26,133,169,87,182,76,23]},"announce":[],"urlList":[]}}