{"title":"Socom U.S. Navy Seals (NTSC) PS2","uid":6465002,"size":2799139687,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:c157bbebb29302c5f0ac39d31475d770c27b5fab&amp;dn=Socom+U.S.+Navy+Seals+%28NTSC%29+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":5,"uploader":"Big_dude","files":-1,"time":1307932095,"description":"Socom U.S. Navy Seals for the Ps2                                   Rel. 02/28/2002\n\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nOnline:        Yes &amp; No (Unable to Patch DNAS)\nGenre.:        Action, Strategy\nRating:        Mature\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method.\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\n\nRelease Notes:  This is a direct rip from the original, and was tested and working\n                fine with a modbo 4.0 chipped Ps2 burned on disc. Includes FMCB\n                with ESR, if emulator or fmcb doesn't work use swap magic or\n                get a hard modded chipped PS2. Some games don't work with emulator\n                or fmcb/esr so be aware of that.\n\n\n\n\n\nGame Description:\n\nSOCOM: U.S. Navy Seals is a military action game, putting you in command of an elite four-person team, that takes you to various locales throughout the world, such as Thailand, Turkmenistan and the Congo.\n\nAs the commander of the team, you can give various orders to your squad, instructing them to go to a certain location (marked by military codes Delta, Bravo, Charlie, Foxtrot, etc.), kill people, cover an area, cover you, or set up an ambush. You can do this via the in-game command system, or with the included voice headset.\n\nThroughout the game, you will have access to over 30 real-life military weapons, such as the SOCOM Pistol, sub-machine guns, machine-guns and sniper rifles.\n\nSOCOM: U.S. Navy Seals is the launch game for the PlayStation 2's online play service. With an easy to launch system, you can join various players throughout the world to compete against others. All you need is a PS2 Network Adapter, the game, and a Memory Card with 130-ish blocks of memory. With the included headset, you can issue commands to your team, or chat with other players. SOCOM: U.S. Navy Seals includes an on-screen keyboard so that you may chat, or you can use any regular USB-compatible keyboard. SOCOM: U.S. Navy Seals only supports broadband connections, meaning those using a phone line are out of luck.\n\n\n\nFeatures:\n\n* Engage enemy terrorists via intense team based gameplay.\n\n* Association with Naval Special Warfare Command provides realistic\n  SEAL actions and mission designs.\n\n* Undertake 12 dangerous missions, including ambushes, reconnaissance, \n  demolitions and hostage rescue in treacherous locales such as\n  Thailand, Congo and Turkmenistan.\n\n\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:c157bbebb29302c5f0ac39d31475d770c27b5fab","amp;dn":"Socom+U.S.+Navy+Seals+%28NTSC%29+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c157bbebb29302c5f0ac39d31475d770c27b5fab","infoHashBuffer":{"type":"Buffer","data":[193,87,187,235,178,147,2,197,240,172,57,211,20,117,215,112,194,123,95,171]},"announce":[],"urlList":[]}}