{"title":"Stille Nacht(Nederlands)(2Lions-Team","uid":5956536,"size":3628200147,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c194c8941f4428f04be563dbcee5251eb93811aa&amp;dn=Stille+Nacht%28Nederlands%29%282Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"juutje","files":52,"time":1289743407,"description":"Stille Nacht (2004) \n\nNederland\nDrama / Thriller\n82 minuten\n\ngeregisseerd door Ineke Houtman\nmet Victoria Koblenko, Liesbeth Kamerling en Caro Lenssen\n\nNadat een studente slachtoffer is geworden van een serieverkrachter ondernemen vijf vriendinnen, gefrustreerd door het gebrek aan slagvaardigheid van de politie, zelf stappen om de dader in de val te lokken. Een beruchte zaak in Utrecht een aantal jaar geleden vormde de basis voor deze film, die deels thriller is en deels een maatschappelijk kijkje in cijfers en statistieken rond seksueel geweld, recidivisten en aangiften. Regisseur Houtman (Polleke) verzamelde een prima gezelschap jonge actrices. Het scenario van Stille nacht werd geschreven door Frank Ketelaar.\n\n\nThe young woman Laura Fischer has a session with a psychologist. The session begins with Laura telling that after two years of successive rapes of female students riding bicycles in the woods nearby the campus of the college where she studied, the student Emma Machielsen forms a committee with Josien Schippers, Marieke Kopermode, Bonnie Javoer and her to discuss a possible solution with the dean. However, the dean claims that he has no budget to improve the security and could only afford to provide three buses for the students. The girls decide to bike through the woods together in convoy, but when Marieke is late, they leave her alone in the campus. She decides to cross the woods alone, and the serial rapist rapes her. Her friends decide to investigate the crimes by themselves and they prepare a list of possible rapists, leading the group to a tragic consequence.\n\nWeblink http://www.imdb.com/title/tt0403539/\nWeblink http://www.moviemeter.nl/film/22288\n\nVideo....................: Retail\nAudio....................: Nederlands AC3  5.1\nSubs.....................: Geen\nID..........................: 224 (0xE0)\nFormaat................ : MPEG Video\nFormaatversie.........: Version 2\nBitrate-modus.........: Variabel\nBreedte..................: 720 pixels\nHoogte...................: 576 pixels\nBeeldverhouding......: 16:9\nFramerate...............: 25,000 fps\nStandaard...............: PAL\nCover+Label............: Ja\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\nEnjoy\n2Lions-Team\n\n                        \nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!","torrent":{"xt":"urn:btih:c194c8941f4428f04be563dbcee5251eb93811aa","amp;dn":"Stille+Nacht%28Nederlands%29%282Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c194c8941f4428f04be563dbcee5251eb93811aa","infoHashBuffer":{"type":"Buffer","data":[193,148,200,148,31,68,40,240,75,229,99,219,206,229,37,30,185,56,17,170]},"announce":[],"urlList":[]}}