{"title":"C. S. Lewis - An Experiment in Criticism (pdf)","uid":8570577,"size":1221761,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c265680cbd0b40950577f1011b60a315e9c9cab4&amp;dn=C.+S.+Lewis+-+An+Experiment+in+Criticism+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"pharmakate","files":-1,"time":1371145642,"description":"C. S. Lewis - An Experiment in Criticism (Cambridge Univ. Press, 1961). 143 pages.\n\nNew scan. Searchable pdf (clearscan), with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nWhy do we read literature and how do we judge it? C. S. Lewis's classic An Experiment in Criticism springs from the conviction that literature exists for the joy of the reader and that books should be judged by the kind of reading they invite. He argues that 'good reading', like moral action or religious experience, involves surrender to the work in hand and a process of entering fully into the opinions of others: 'in reading great literature I become a thousand men and yet remain myself'. Crucial to his notion of judging literature is a commitment to laying aside expectations and values extraneous to the work, in order to approach it with an open mind. Amid the complex welter of current critical theories, C. S. Lewis's wisdom is valuably down-to-earth, refreshing and stimulating in the questions it raises about the experience of reading.\n\nReview\n\n'Lewis is at one and the same time provocative, tactful, biased, open-minded, old-fashioned, far-seeing, very annoying and very wise.' Church Times\n\n'Genuinely provocative ... makes the best case against evaluative criticism that I have read.' David Daiches, New York Times Book Review\n\nBook Description\n\nWhy do we read literature and how do we judge it? C.S. Lewis's classic analysis springs from the conviction that literature exists for the joy of the reader and that books should be judged by the kind of reading they invite.","torrent":{"xt":"urn:btih:c265680cbd0b40950577f1011b60a315e9c9cab4","amp;dn":"C.+S.+Lewis+-+An+Experiment+in+Criticism+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c265680cbd0b40950577f1011b60a315e9c9cab4","infoHashBuffer":{"type":"Buffer","data":[194,101,104,12,189,11,64,149,5,119,241,1,27,96,163,21,233,201,202,180]},"announce":[],"urlList":[]}}