{"title":"Building Your Cult: Power, Politics and People","uid":8592818,"size":214300,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c2670da9b20b6177a35d3fc88e83eeee56863eed&amp;dn=Building+Your+Cult%3A+Power%2C+Politics+and+People+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"candymancan","files":1,"time":1371684260,"description":"This book deals with the art and science of protecting and promoting your own interests. It is about reaching that pentacle of accomplishment where you have groups of people devoted to you, your goals and your ambitions. In other words, it is about the politics of life. It is about making your own cult. No one has to build a cult from this book. That's a personal decision and you'll get some very useful tools to do that... if you decide. What this book should do is help you to create a personal sense of purpose. More often when someone talks about a sense of purpose or a feeling of destiny they are met with cynicism. People generally don't even have a language to understand the concept of purpose and destiny. Yes, we have plans and goals and problems to solve and we work to solve those problems but there are few who can say they are driven by a sense of purpose. Those who are are usually are live like unstoppable forces of nature. If you have to wait to find your sense of purpose then it will likely never happen. Right NOW you are in the perfect place to choose your purpose. When you do, life gains a clearer perspective and you can do the ordinary and mundane acts of daily life with more vigor and joy because everything is connected by your sense of purpose.\n","torrent":{"xt":"urn:btih:c2670da9b20b6177a35d3fc88e83eeee56863eed","amp;dn":"Building+Your+Cult%3A+Power%2C+Politics+and+People+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2670da9b20b6177a35d3fc88e83eeee56863eed","infoHashBuffer":{"type":"Buffer","data":[194,103,13,169,178,11,97,119,163,93,63,200,142,131,238,238,86,134,62,237]},"announce":[],"urlList":[]}}