{"title":"WinRAR x86 (32 bit) 5.00 Final+Key {Team EAT} (Alien)","uid":8947201,"size":1767397,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c27a2caaac696fe6aac7b33615b9a0350a33eac3&amp;dn=WinRAR+x86+%2832+bit%29+5.00+Final%2BKey+%7BTeam+EAT%7D+%28Alien%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Alien119","files":3,"time":1379803273,"description":"WinRAR 5.00 Final\n\nWinRAR is a powerful archive manager. RAR files can usually compress content by 8 percent to 15 percent more than ZIP files can. WinRAR is a powerful compression tool with many integrated additional functions to help you organize your compressed archives. It can backup your data and reduce size of email attachments, decompress RAR, ZIP and other files downloaded from Internet and create new archives in RAR and ZIP file format.\n\nWinRAR puts you ahead of the crowd when it comes to compression. By consistently creating smaller archives, WinRAR is often faster than the competition. This will save you disc space, transmission costs AND valuable working time as well. WinRAR is ideal for multimedia files. WinRAR automatically recognizes and selects the best compression method. The special compression algorithm compresses multimedia files, executables and object libraries\n\nFeatures of WinRAR:\n- Using WinRAR puts you ahead of the crowd when it comes to compression by consistently making smaller archives than the competition, saving disk space and transmission costs.\n- WinRAR provides complete support for RAR and ZIP archives and is able to unpack CAB, ARJ, LZH, TAR, GZ, ACE, UUE, BZ2, JAR, ISO, 7Z, Z archives.\n- WinRAR offers a graphic interactive interface utilizing mouse and menus as well as the command line interface.\n- WinRAR is easier to use than many other archivers with the inclusion of a special &quot;Wizard&quot; mode which allows instant access to the basic archiving functions through a simple question and answer procedure. This avoids confusion in the early stages of use.\n- WinRAR offers you the benefit of industry strength archive encryption using AES (Advanced Encryption Standard) with a key of 128 bits.\n- WinRAR supports files and archives up to 8,589 billion gigabytes in size. The number of archived files is, for all practical purposes, unlimited.\n- WinRAR offers the ability to create selfextracting and multivolume archives.\nRecovery record and recovery volumes allow to reconstruct even physically damaged archives.\n- WinRAR features are constantly being developed to keep WinRAR ahead of the pack.\n\nChangelog:\n\nVersion 5.00\n\n1. New RAR 5.0 archiving format. You can use &quot;RAR 5.0&quot; option\nin archiving dialog or -ma command line switch to create\nRAR 5.0 archives.\n\nOlder software including older WinRAR versions is not able to\ndecompress RAR 5.0 archives, so if you plan to send an archive\nto other people, it is necessary to take the compatibility issue\ninto consideration. You can select &quot;RAR&quot; instead of &quot;RAR5&quot; option\nin archiving dialog to create RAR 4.x archives compatible with\nprevious WinRAR versions.\n\n2. Changes in RAR 5.0 compression algorithm:\n\na) maximum compression dictionary size is increased up to 1 GB\nin 64 bit WinRAR. 32 bit WinRAR version can use up to 256 MB\ndictionary when creating an archive. Both 32 bit and 64 bit\nversions can unpack archives with any dictionary size,\nincluding 1 GB;\n\nb) default dictionary size for RAR 5.0 is 32 MB, typically resulting\nin higher compression ratio and lower speed than RAR 4.x 4 MB.\nYou can use &quot;Dictionary size&quot; archiving dialog option or -md\nswitch to change this value;\n\nc) -md switch syntax is modified to support larger dictionary\nsizes. Append 'k', 'm' and 'g' modifiers to specify the size\nin kilo-, mega- and gigabytes, like -md64m for 64 MB dictionary.\nIf modifiers are not present, megabytes are assumed,\nso -md64m is equal to -md64;\n\nd) RAR 5.0 format includes Intel IA-32 executable and delta\ncompression algorithms, but RAR 4.x text, audio, true color\nand Itanium algorithms are not supported. These excluded algorithms\nare not efficient for modern data types and hardware configurations;\n\ne) RAR 5.0 decompression can utilize several CPU cores.\nThough not to same extent as in compression algorithm,\nit improves the decompression speed on large files\nwith poorly compressible data or when using BLAKE2 checksums.\n\n3. Changes in RAR 5.0 archive format:\n\na) file times are stored as Coordinated Universal Time (UTC)\ninstead of former local time, making file exchange among\nseveral time zones more straightforward;\n\nb) file names and archive comments use UTF-8 encoding.\n\n4. RAR 5.0 recovery record is based on Reed-Solomon error correction\ncodes. If recovery record size is large enough, 5% and more,\nthe new error correction scheme provides much higher resistance to\nmultiple damages comparing to RAR 4.x recovery record.\nSmaller record, such as 1 - 2%, or less random damage type would\nresult in less difference between 4.x and 5.0. For single continuous\ndamage 4.x and 5.0 efficiency is about the same.\n","torrent":{"xt":"urn:btih:c27a2caaac696fe6aac7b33615b9a0350a33eac3","amp;dn":"WinRAR+x86+%2832+bit%29+5.00+Final%2BKey+%7BTeam+EAT%7D+%28Alien%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c27a2caaac696fe6aac7b33615b9a0350a33eac3","infoHashBuffer":{"type":"Buffer","data":[194,122,44,170,172,105,111,230,170,199,179,54,21,185,160,53,10,51,234,195]},"announce":[],"urlList":[]}}