{"title":"The Woman Who Would Be King  (Unabridged)","uid":12089789,"size":299179620,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c2b1fe6bd0916d33269dc846e698244d80f298f1&amp;dn=The+Woman+Who+Would+Be+King++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"davieboy1966","files":12,"time":1436006675,"description":"Written by Kara Cooney\nRead by Kara Cooney\nFormat: MP3\nBitrate: 64 Kbps\n\nAn engrossing biography of the longest-reigning female pharaoh in Ancient Egypt and the story of her audacious rise to power.\n\nHatshepsut - the daughter of a general who usurped Egypt's throne and a mother with ties to the previous dynasty - was born into a privileged position in the royal household, and she was expected to bear the sons who would legitimize the reign of her father's family. Her failure to produce a male heir was ultimately the twist of fate that paved the way for her improbable rule as a cross-dressing king. At just over twenty, Hatshepsut ascended to the rank of pharaoh in an elaborate coronation ceremony that set the tone for her spectacular reign as co-regent with Thutmose III, the infant king whose mother Hatshepsut out-maneuvered for a seat on the throne. Hatshepsut was a master strategist, cloaking her political power plays in the veil of piety and sexual reinvention. Just as women today face obstacles from a society that equates authority with masculinity, Hatshepsut shrewdly operated the levers of power to emerge as Egypt's second female pharaoh.\n\nHatshepsut successfully negotiated a path from the royal nursery to the very pinnacle of authority, and her reign saw one of Ancient Egypt's most prolific building periods. Scholars have long speculated as to why her monuments were destroyed within a few decades of her death, all but erasing evidence of her unprecedented rule. Constructing a rich narrative history using the artifacts that remain, noted Egyptologist Kara Cooney offers a remarkable interpretation of how Hatshepsut rapidly but methodically consolidated power - and why she fell from public favor just as quickly. The Woman Who Would Be King traces the unconventional life of an almost-forgotten pharaoh and explores our complicated reactions to women in power.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:c2b1fe6bd0916d33269dc846e698244d80f298f1","amp;dn":"The+Woman+Who+Would+Be+King++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2b1fe6bd0916d33269dc846e698244d80f298f1","infoHashBuffer":{"type":"Buffer","data":[194,177,254,107,208,145,109,51,38,157,200,70,230,152,36,77,128,242,152,241]},"announce":[],"urlList":[]}}