{"title":"How to Be Black - Baratunde Thurston - Audiobook MP3","uid":11692535,"size":186297785,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c2c376ac4c150ecb7cf67e6bc27f2b6d25909526&amp;dn=How+to+Be+Black+-+Baratunde+Thurston+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Squiddy82","files":7,"time":1423594350,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nHow to Be Black\n\nWritten by: Baratunde Thurston\nNarrated by: Baratunde Thurston\nLength: 6 hrs and 27 mins\nUnabridged Audiobook\nRelease Date:01-31-12\n\nIf you don't buy this book, you're a racist.\nHave you ever been called &quot;too black&quot; or &quot;not black enough&quot;?\nHave you ever befriended or worked with a black person?\nRaised by a pro-black, Pan-Afrikan single mother during the crack years of 1980s Washington, DC, and educated at Sidwell Friends School and Harvard University, Baratunde Thurston has over 30 years' experience being black. Now, through stories of his politically inspired Nigerian name, the heroics of his hippie mother, the murder of his drug-abusing father, and other revelatory black details, he shares with listeners of all colors his wisdom and expertise in how to be black.\nBeyond memoir, this guidebook offers practical advice on everything from &quot;How to Be the Black Friend&quot; to &quot;How to Be the (Next) Black President&quot; to &quot;How to Celebrate Black History Month.&quot;\nTo provide additional perspective, Baratunde assembled an award-winning Black Panel - three black women; three black men; and one white man (Christian Lander, author of Stuff White People Like) - and asked them such revealing questions as: &quot;When did you first realize you were black?&quot; &quot;How black are you?&quot; &quot;Can you swim?&quot;\nThe result is a humorous, intelligent, and audacious guide that challenges and satirizes the so-called experts, purists, and racists who purport to speak for all black people. With honest storytelling and biting wit, Baratunde plots a path not just to blackness, but one open to anyone interested in simply &quot;how to be&quot;","torrent":{"xt":"urn:btih:c2c376ac4c150ecb7cf67e6bc27f2b6d25909526","amp;dn":"How+to+Be+Black+-+Baratunde+Thurston+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2c376ac4c150ecb7cf67e6bc27f2b6d25909526","infoHashBuffer":{"type":"Buffer","data":[194,195,118,172,76,21,14,203,124,246,126,107,194,127,43,109,37,144,149,38]},"announce":[],"urlList":[]}}