{"title":"Inside.The.Factory.s02e06.Shoes.EN.SUB.x264.MPup","uid":15750078,"size":1059384372,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c34313e5a502d40dcd9ea70cc0d722c69a4c9c09&amp;dn=Inside.The.Factory.s02e06.Shoes.EN.SUB.x264.MPup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"makinapufterpup","files":2,"time":1473025567,"description":"Inside.The.Factory.How.Our.Favourite.Foods.Are.Made.s02e06.Shoes.EN.SUB.MPEG4.x264.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nGregg Wallace joins a human production line in the largest sports shoe factory in the UK to see how they produce three-and-a-half thousand pairs of trainers every 24 hours by sewing 32 million individual stiches and using 140 miles of thread. He makes his own pair of shoes and discovers how they put together 27 different pieces made from eight different materials which require auto and manual stitching and finishing with a 'roughening' robot and a hot oven. He also meets the man who comes up with new designs, including trainers inspired by the three most popular pub names in England.\r\n\r\nMeanwhile, Cherry Healey gets hands on in a tannery to help them process thousands of rawhides into finished leather for the nation's shoes, and finds out how a ballet shoe company painstakingly turns 37,000 square meters of satin into a quarter-of-a-million ballet shoes - some of which only last for one performance. She also gets to design her own court shoes at Cordwainers College in London, where she learns how to turn creative ideas into commercial products - last year, sales of women's designer shoes topped £532 million.\r\n\r\nAnd historian Ruth Goodman reveals how, when the sewing machine was first introduced into shoe factories in the mid-19th century, traditional shoemakers went on strike, rebelling against joining a restrictive production line. She also traces the surprising origins of the humble trainer to the back streets of Bolton, where Joe Foster invented his running spike in 1895, above his father's sweet shop, and discovers that Reebok trainers were originally British","torrent":{"xt":"urn:btih:c34313e5a502d40dcd9ea70cc0d722c69a4c9c09","amp;dn":"Inside.The.Factory.s02e06.Shoes.EN.SUB.x264.MPup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c34313e5a502d40dcd9ea70cc0d722c69a4c9c09","infoHashBuffer":{"type":"Buffer","data":[195,67,19,229,165,2,212,13,205,158,167,12,192,215,34,198,154,76,156,9]},"announce":[],"urlList":[]}}