{"title":"Leica.Cyclone.v7.0-RECOiL","uid":5195467,"size":147411502,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:c440e63d4da1b1f18ce797ebc0f57f95888eef26&amp;dn=Leica.Cyclone.v7.0-RECOiL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TvTeam","files":33,"time":1259901957,"description":"zk.\n                     \n                                       \n                                  \n                       \n                \n  \n \n    \n                            \n                                                  \n                                                      \n                                                   \n                                                          \n                                                           \n                                                           \n                                                            \n                                                            \n                                        \n                                      \n       \n         \n         \n\n\n                                                                      \n              [ MOST PROUDLY PRESENTS ]            \n                                                                   \n                                                                      \n                                                                      \n                                 Cyclone v7.0\n                                  (c) Leica\n\n               Supplier . : RECOiL       Size ..... : 30 x 5.00MB\n               Cracker .. : RECOiL       Protection : FlexLM\n               Packager . : RECOiL       Type ..... : Utility\n               Date ..... : 12-04-2009   OS ....... : Win\n                                                                      \n                                                                      \n                                                                   \n                                                  \n  \n     [ RELEASE NOTES  ]  \n  \n\n   Cyclone lets users take advantage of traverse, back-sight, and\n   resection capabilities of the new Leica ScanStation laser scanner for\n   more cost-effective as-built and topographic surveys and lets users\n   create plant as-built models more efficiently from laser scans.\n   \n   Unique, Efficient Foundation\n   The inherent completeness of 3D point clouds represents one of their\n   major advantages over other sources of geometric information. Cyclone's\n   unique Object Database Client/Server software architecture provides the\n   highest performance environment for laser scanning projects. Cyclone\n   software makes it easy for users to manage data efficiently in\n   databases. Users can work concurrently on databases, thereby reducing\n   the need to copy and/or transmit large point cloud project files.\n   \n   Cyclone Modules for Flexible Configuration\n   Leica Cyclone is comprised of individual software modules for\n   different needs and for flexible product customization.\n   \n   Cyclone-SCAN\n   \n   Cyclone-SCAN is the software interface for operating the Leica\n   ScanStation, HDS6000, and HDS3000. User-specified scan area and density,\n   data filtering, scan scripting, and automatic recognition and extraction\n   of both planar and spherical Leica Geosystems HDS targets  all\n   contribute to this easy-to-use, intelligent data capture application.\n   \n   Cyclone-REGISTER\n   \n   Cyclone-REGISTER provides the complete set of tools for aligning point\n   clouds captured from different scanning positions, quickly and\n   accurately. Cyclone-REGISTER supports the use of Leica Geosystems HDS\n   targets to geo-reference scan data, as well as the ability to align\n   overlapping areas of point clouds  without the use of targets. This\n   results in optimum registration, and provides significant time- and\n   cost-savings by reducing the need to place and extract targets. \n   \n   Cyclone-MODEL\n   \n   This versatile, powerful module enables professionals to use point\n   clouds directly, to process them into objects for robust export into CAD\n   (and other applications), and to allow robust import of data from CAD\n   (and other applications). Cyclone-MODEL has the industrys largest,\n   most complete and automated set of tools for accurately modeling 3D\n   point clouds as CAD geometry or as meshes for engineering, surveying,\n   construction, architectural and related applications.\n   \n   Cyclone-SURVEY\n   \n   Cyclone-SURVEY lets surveyors quickly extract relevant feature and\n   coordinate information from the point cloud data via the Cyclone Virtual\n   Surveyor function. Powerful tools support complex topographic models,\n   with intelligent mesh decimation that minimizes file size while\n   retaining accurate geometry. Cyclone-SURVEY is a subset of the\n   Cyclone-MODEL product and is an ideal module for surveyors. \n   \n   Cyclone-VIEWER\n   \n   Cyclone-VIEWER is a view-only version of the Cyclone software. This\n   product, free of charge, enables visualization of Cyclone data on a\n   desktop or portable PC, without a full featured Cyclone license. Share\n   your Cyclone databases with non-Cyclone-MODEL users; the Cyclone-VIEWER\n   provides full viewing capabilities to allow users to rotate, zoom and\n   navigate through Cyclone data, including point clouds and 3D models.\n   \n   Cyclone-SERVER\n   \n   Cyclone-SERVER enables individual members of workgroups to\n   simultaneously access 3D point cloud data sets and/or models. This\n   provides a powerful environment for collaborative design on large,\n   complex projects, and can significantly reduce project execution time.\n   Cyclone- SERVER supports the simultaneous connection of one through ten\n   client users to the same data server in a network environment. These\n   clients can be licensees of Cyclone-REGISTER, MODEL, SURVEY, VIEWER, or\n   Cyclone CloudWorx for AutoCAD and for MicroStation.\n   \n   Leica TruView and Cyclone Publisher\n   \n   Leica Cyclone PUBLISHER publishes point cloud data for web-based sharing\n   and viewing allowing access from anywhere in the world. Using the FREE\n   Leica TruView panoramic point cloud viewer, users can view, zoom in, or\n   pan over point clouds naturally and\n   intuitively.\n\n  \n     [  INSTALLATION  ]  \n  \n\n   Unzip, Unrar, Install. Use the patch.\n\n  \n     [   GROUP iNFO   ]  \n  \n\n        We are not taking any applications. We are an invite only group.\n\n  \n     [   GREETINGS    ]  \n  \n\n           Our friends, our loyal members and our fair competitors.\n                             You know who you are.\n\n  \n     [ RECOiL IN 2009 - ONE MORE IMPACT! ]","torrent":{"xt":"urn:btih:c440e63d4da1b1f18ce797ebc0f57f95888eef26","amp;dn":"Leica.Cyclone.v7.0-RECOiL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c440e63d4da1b1f18ce797ebc0f57f95888eef26","infoHashBuffer":{"type":"Buffer","data":[196,64,230,61,77,161,177,241,140,231,151,235,192,245,127,149,136,142,239,38]},"announce":[],"urlList":[]}}