{"title":"Peter Brook's The Mahabharata","uid":3391190,"size":5039212754,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c456adef4df6e4390046f1dcffdd7c725503b8a5&amp;dn=Peter+Brook%5C%27s+The+Mahabharata&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"toronto_bengali","files":4,"time":1128267479,"description":"The Mahabharata - (Directed by Peter Brook)\n===========================================\n\nRetail Double DVD Set Rip\nRun time: 330 minutes\nDVD Codec: XVid\nAudio Codec: AC3\nIMDB: http://www.imdb.com/title/tt0097810/\n\n\nOne of the great epics of world culture comes to vivid life in an elaborate production from acclaimed theater and film innovator Peter Brook. This collection of ancient Sanskrit stories (composed into the longest book ever written) comprises a series of enlightened fables at the heart of countless beliefs, legends, and teachings; indeed, its very title means &quot;the great story of mankind.&quot; Brook and  writer Jean-Claude Carriere worked for eight years to develop this epic concerning two sides of a royal family, the Pandavas and the Kauravas, whose struggle leads to a fascinating voyage of emotions, passion and vision of glory. Briefly, the Mahabharata is a tale of two rival sets of brothers, cousins to eachother, each born into royalty and with divinely guided paths in life. The result, however, is a great war, death, destruction - a vast epic \n\n\nHowever, Mahabaratha is not a Aryan story, but an Indian epic that exists all over the Asian continent from Uzbekistan to Bali that has transcended the geopolities of millenia and the simplicities of a family soap opera. The epic exists at many levels of the intellect, the lowest being the family drama of jelousy, greed, avarice that are most likely to be transmitted from one generation to the other with scant editing and knowledge while the metaphorical parts and thought provoking ideas are likely to suit a perpetually small audience across generations and time-space. \n\nThis version will not be suitable for minds that think Bollywood dramas and movies like Titanic are great works of film. If you can comprehend Baraka, Dr Caligari's Cabinet, Lanz's Metropolis, the Qatsi trilogy then you are most likely to enjoy this version of Mahabaratha by Peter Brooks. \n","torrent":{"xt":"urn:btih:c456adef4df6e4390046f1dcffdd7c725503b8a5","amp;dn":"Peter+Brook%5C%27s+The+Mahabharata","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c456adef4df6e4390046f1dcffdd7c725503b8a5","infoHashBuffer":{"type":"Buffer","data":[196,86,173,239,77,246,228,57,0,70,241,220,255,221,124,114,85,3,184,165]},"announce":[],"urlList":[]}}