{"title":"Stratovarius - Visions (1997) WMA320","uid":6128351,"size":177176920,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c46ad0517aea26cc3a78bb51870c92560975144f&amp;dn=Stratovarius+-+Visions+%281997%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1296028507,"description":"I've just recently became a Stratovarius fan this year and have now listened to all their CDs over and over and over. I have to say that not only do I think Visions is the band's BEST CD, I think this is one of the GREATEST albums EVER. Every track on this cd is great. I cannot even pick 1 or 2 songs that I think are the best, because I think that besides Holy Light, Before the Winter and Coming Home (which are still good songs), the other 7 songs are simply AWESOME. The title track is a 10 minute masterpiece that ends the CD perfectly. That final chorus simply blows me away. If anyone says this track is too long, they are SORELY mistaken. The song is so good, it doesn't even seem like 10 minutes. I wish it was longer. Try listening to this song with headphones on your home stereo and crank it up as loud as your ears can take. The affect is AMAZING. \nIf I HAD to pick my 3 favorite tracks, they would have to be &quot;Paradise&quot;, &quot;Legions&quot; and &quot;Abyss of your Eyes&quot; with the others (first 3 tracks) certainly NOT TOO FAR BEHIND. In fact I might even say it's a 7-way tie. That's how much I love this CD.\n\nStratovarius has taken Hard Rock to whole new level especially starting with the Timo K era and all their 6 Timo K cds are great but Visions is a TRUE MASTERPIECE of music. Any hard rock fan will like this album to some degree. If not, then they don't appreciate good/creative music.\n\nIt's only a shame that Stratovarius is not even heard of here in the United States (nor ever on tour here) because we can SURE use their talent over here because today's hard rock bands in the United States simply stink. And that's putting it mildly. Look who we have over here, System of a Down, POD and Drowning Pool? PLEASE!!! Those bands are sickening compared to Strato. Whenever I saw the song &quot;Drops of Jupiter&quot; by Train win the Grammy for best rock song of the year a couple of years ago, I said &quot;never again will I ever watch the Grammys&quot;. How can a song LIKE THAT win when you have Stratovarius songs (pick any one) that can raise your adrenalin level to the highest meter mark? \n\nThank God for Stratovarius! I'll show my support for this band ALWAYS even if it means buying their CDs over the internet if I cannot find it here. They are a mountain of talent and have proved it with Visions.\n\nDOWNLOAD THIS CD NOW. You won't regret it. It's worth all 5 stars.\n\nby James A. Calabrese\n\nTRACKLIST:\n\n01 - Black Diamond.wma                                      \n02 - The Kiss Of Judas.wma                                  \n03 - Forever Free.wma                                       \n04 - Before The Winter.wma                                  \n05 - Legions.wma                                            \n06 - The Abyss Of Your Eyes.wma                             \n07 - Holy Light.wma                                         \n08 - Paradise.wma                                           \n09 - Coming Home.wma                                        \n10 - Visions (Southern Cross).wma                           \n11 - Black Diamond (Demo Version).wma                       \n12 - Uncertainty (Live Version).wma\n\nWMA 320Kbps 44100Hz STEREO \n\n","torrent":{"xt":"urn:btih:c46ad0517aea26cc3a78bb51870c92560975144f","amp;dn":"Stratovarius+-+Visions+%281997%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c46ad0517aea26cc3a78bb51870c92560975144f","infoHashBuffer":{"type":"Buffer","data":[196,106,208,81,122,234,38,204,58,120,187,81,135,12,146,86,9,117,20,79]},"announce":[],"urlList":[]}}