{"title":"Golden Eye 4.50.rar","uid":4615423,"size":2402883,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c4a9e9ffc8c0f8d2fe83d48960001d758d036205&amp;dn=Golden+Eye+4.50.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"loldavid","files":1,"time":1230817813,"description":"Golden Eye works like a surveillance camera pointed directly at your computer monitor, monitoring and recording anything anybody does on your computer, and storing this in a secure area for your later review. With the full detail and searchable Interactive and Html report, you can easily know how your computer is being used or what is being done on your computer. Here is a total solution. Golden Eye is a powerful spy tool and can tell you what and when they are really doing!\n\t\nFEATURES\n\nGolden Keylogger -  Monitors and logs all keystrokes during monitoring sessions, including user name, passwords, email, chat, instant message, all with a timestamp, all keystrokes are Fully searchable \n\nWeb Spy  Records all URLs of visited websites.  Currently works with Internet Explorer, other browsers will be supported soon. \n\nApplication Spy Monitors and spys all active applications window title and Exe file name on the computer,  \n\nFile/Folder Operation Spy logs all file/folder operations that happens on your computer, such as file/folder creation,  file/folder copy and deletion, etc.\n\nScreenshot Recorder See EVERYTHING that happens on your PC with the built-in screenshot recorder. you can select to take screenshots every xxx minutes, you can also select to capture the whole screen or the active window. With the screenshot picture quality setting, you can set the quality of the screenshot picture, the higher the quality, the clearer the pictures and the more disk space it takes \n\nStartup/Shutdown Spy  logs all all system starts/shutdowns and user log in with the timestamp. \n\nExe File Path Spy  log the execute file path of active window. \n\nInstant Messenger Spy  Monitors and logs chat in Instant Messenger. including ICQ , MSN Messenger , AOL Instant Messenger, Yahoo! Messenger.\n\nAdditional POWERFUL FEATURES:\n\nNetwork Supported  Golden Eye has a flexible data storing method, you can store it in a secure folder on your computer or stores the log files over a corporate or small business network, which lets you to easily monitor other computer on the network and read the report on your own computer.\n\nInvisible Mode Run Golden Eye totally stealth, Invisible mode ensures that Golden Eye is completely hidden from everyone except you. Others can not see it in the Windows System tray, desktop, task Manager or in the Add/Remove in Control Panel. You can call it up with Hotkey you choose. Only you can launch or delete Golden Eye.\n\nNormal Mode Like a normal application, the icon of Golden Eye will appear on  program menu, desktop, you can use normal mode for testing and learning. you can easily switch between invisible/normal mode.\n\nPassword Protection Golden Eye can use password protected to prevent  monitoring termination and option changes.\n\nLog File Option you can set Golden Eye to clear your monitoring logs after the log files in the log folder exceed a set size. This prevent it using too much of the disk space.\n\nHotkey Use the hotkey to show Golden Eye when it hides, you can set the hotkey you like. \n &lt;a href=&quot;\nhttp://www.topsecretsoftware.com/golden-eye.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.topsecretsoftware.com/golden-eye.html&lt;/a&gt;\n\nActivation: Keygen","torrent":{"xt":"urn:btih:c4a9e9ffc8c0f8d2fe83d48960001d758d036205","amp;dn":"Golden+Eye+4.50.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4a9e9ffc8c0f8d2fe83d48960001d758d036205","infoHashBuffer":{"type":"Buffer","data":[196,169,233,255,200,192,248,210,254,131,212,137,96,0,29,117,141,3,98,5]},"announce":[],"urlList":[]}}