{"title":"Sophie's World","uid":9125891,"size":2656290,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4b0ffe8fa649e45189abaf0ee9ea54041d89933&amp;dn=Sophie%27s+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"FFlintston","files":4,"time":1383224635,"description":"Sophie's World is a history of philosophy in mixed lecture/novel form. The chief protagonists are 15-year-old girls; the character with the most lines is a male philosophy teacher in his 50s.\n\nThe book was very popular when published in Norway, and later, worldwide. The lecture portions provide a pretty good introduction to the history of philosophy, and the novel portion is fairly interesting and &quot;novel.&quot; The mix of the two gets kind of formulaic - a little bit of story, then a lot of the young girl listening with rapt attention to the old man, from time to time interjecting &quot;What's that?&quot;, &quot;I see,&quot; &quot;Explain that, please,&quot; and so on. Repeated over and over and over again. But though formulaic, the book's enjoyable and educational for certain readers. Like many philosophy texts, it includes the conceit that philosophers themselves are the epitomy of all humankind, but since that's a really common conceit among philosophers, this is also a good introduction to an important aspect of philosophy in the real world.\n\nThe action of the book occurs in 1990, and in the 20+ years since then, current thought regarding later &quot;philosophers&quot; has changed. So the Freud and Marx sections are dated now. But this too may be beneficially noted when using the book in education. Philosophy isn't static - it changes as we continue to learn, think, discuss, and figure things out.\n\nThere are several e-versions of the book available, generally with many scan errors. This edition has been spell-checked, and the paragraphs and chapters fixed up to match the printed original. Complete word-by-word spell and punctuation checking by human proofreaders has not been done; also there may remain some errors in paragraph breaks. The original printed book makes extensive use of two fonts and this e-version retains this usage.","torrent":{"xt":"urn:btih:c4b0ffe8fa649e45189abaf0ee9ea54041d89933","amp;dn":"Sophie%27s+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4b0ffe8fa649e45189abaf0ee9ea54041d89933","infoHashBuffer":{"type":"Buffer","data":[196,176,255,232,250,100,158,69,24,154,186,240,238,158,165,64,65,216,153,51]},"announce":[],"urlList":[]}}