{"title":"The Rise and Fall of the City of Mahagonny by Bertolt Brecht","uid":7874799,"size":1374956691,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c4f4e1a0a07cb7d134b71205b7a845c6aacdd76d&amp;dn=The+Rise+and+Fall+of+the+City+of+Mahagonny+by+Bertolt+Brecht&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"loninappleton","files":4,"time":1354306498,"description":"The Rise and Fall of the City of Mahagonny\nBy Bertolt Brecht\nmusic by Kurt Weill\nFrom the production in English at the Los Angeles Opera House 2007\n\nAudra McDonald\nPatti LuPone\nAnthony Dean Griffey \nRobert Wo?rle, Donnie Ray Albert \nJohn Easterlin \nMel Ulrich \nSteven Humes \n\nLos Angeles Opera Orchestra and Chorus, James Conlon, conductor.\nCredits:\nSet designer, Mark Bailey\ncostume designer, Ann Hould-Ward \neditor, Steve Prime\nstage director, John Doyle.\n\nRecording date:  Recorded live March 1 &amp; 4, 2007 at the Los Angeles Opera.\n\n\nSummary :\n\n Welcome to Mahagonny, where sin is 'in' and love is always on sale. This Old West boomtown rises from the desert to become a razzle-dazzle mecca for lust and the pursuit of pleasure, where cash is king and poverty is punishable by death.\n\nSpecial feature: John Conlon talks about the opera (22 min.).\n\n   My notes:\n\n   Previously I have made torrents on how opera gets made in &quot;Wonders Are Many&quot; which is from an opera about J.  Robert Oppenheimer and the Manahattan Project.  Then &quot;Wagner's Dream&quot;.  Wagner's Dream documents the the set machinery which is the most complex of it's kind for The Ring Cycle.\n\n   Here, in English,  is Bertolt Brecht's &quot;Mahagonny&quot; with music by Kurt Weill.  The best known melody in Mahagonny is the &quot;Alabama Song.&quot;  This is more commonly known as the Whiskey Bar song which I first heard on an album by Jim Morrison and the Doors. That was many years ago and in my theater studies I learned of Brecht. The interview with James Conlon is included here since Conlon describes not only his interpretation of the characters but also what Brechtian drama is.\n\n   For those who think all this might be pretty stilted, the story of Mahagonny very much resembles how Las Vegas became what it is today.  The settings begin in a desert and through the course of the opera the familiar siteline of LV takes shape.\n\n   More than that would be taking away from the actual production.\n\n   Enjoy Mahagonny and seek out other Brecht pieces available on torrents including Baal (with David Bowie) and Three Penny Opera (which contains &quot;Mack The Knife&quot;.)","torrent":{"xt":"urn:btih:c4f4e1a0a07cb7d134b71205b7a845c6aacdd76d","amp;dn":"The+Rise+and+Fall+of+the+City+of+Mahagonny+by+Bertolt+Brecht","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4f4e1a0a07cb7d134b71205b7a845c6aacdd76d","infoHashBuffer":{"type":"Buffer","data":[196,244,225,160,160,124,183,209,52,183,18,5,183,168,69,198,170,205,215,109]},"announce":[],"urlList":[]}}