{"title":"Good Design in China (Art Architecture Ebook).pdf","uid":10866167,"size":43358284,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4f68d8e4d643e9944cbe09e62948c39e47aacd4&amp;dn=Good+Design+in+China+%28Art+Architecture+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1408918168,"description":"pdf / English / 2001 / 37.2 MB / 165 pag\n\nThe book is an attempt to introduce Chinese gardens in various cities from unique professional perspectives, demonstrating the exquisiteness of traditional gardens in an effort to present the skilful and elaborate designs. The Chinese gardens presented here are classified in three categories: Traditional Chinese private gardens, Historic Chinese gardens in modern time, and Newly-built Chinese gardens. Traditional Chinese private gardens value harmony between man and nature. They are characterized by delicacy, freedom, exquisiteness, grace and an impressionistic style. Historic Chinese gardens in modern time are mostly set in historical sites or used to be the estate of rich families; now they are renovated to serve contemporary needs, such as clubs, parks, exhibition halls, and restaurants. Newly-built Chinese gardens are actually Chinese gardens built in conformity with the traditional styles. Moreover, they are an innovation of tradition, based on available materials and current technologies to restore the essence of Chinese gardens.","torrent":{"xt":"urn:btih:c4f68d8e4d643e9944cbe09e62948c39e47aacd4","amp;dn":"Good+Design+in+China+%28Art+Architecture+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4f68d8e4d643e9944cbe09e62948c39e47aacd4","infoHashBuffer":{"type":"Buffer","data":[196,246,141,142,77,100,62,153,68,203,224,158,98,148,140,57,228,122,172,212]},"announce":[],"urlList":[]}}