{"title":"Mount Sims (2 albums)","uid":5427218,"size":194747165,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c5557a00e9648b226e1248548d1338889e3f62db&amp;dn=Mount+Sims+%282+albums%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"allrockedout","files":37,"time":1268301111,"description":" &lt;a href=&quot;http://en.wikipedia.org/wiki/Mount_Sims&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://en.wikipedia.org/wiki/Mount_Sims&lt;/a&gt;\n\nAmerican DJ performance artist/producer/musician. His earlier work was situated within the field of electronic music, though it shows influences as varied as post punk, new wave, techno and darkwave. Sims was almost exclusively responsible for every aspect of his music, providing the vocals, instrumentation and production. However at present Mt. Sims, the current incarnation of Mount Sims, is a 3 piece band which includes Rand Twigg on bass and Andre Lange on drums.\n\nHis first album, &quot;Ultra Sex&quot; (2002 / International DeeJay Gigolo Records) and Emperor Norton records was well-received at clubs. Major influences to the work were German and British New Wave bands, funk and electronica. It was a concept album focused on the themes of technology and sexuality. The album contains the tracks &quot;How We Do&quot; and &quot;Rational Behaviour.&quot;\n\nMount Sims' Second album &quot;Wild Light&quot; (2005 / International Deejay Gigolo), a much darker album than the previous release, largely focuses on themes of death and information. Major musical influences are darkwave and post punk styles throughout the album. David J. Bauhaus played bass on some of Wild Light's songs along with Roger Manning Jr.'s (Beck) synth production. Its most popular songs were &quot;No Yellow lines&quot; and &quot;Lights on&quot;.\n\nMount Sims is responsible for Madonna's remixes of her song &quot;Nobody Knows Me&quot;, from her 2003 album American Life. In which he was noted to time compress a speech by Charles Manson in order to construct different electronic drums which he then placed in the remix.\n\nLike &quot;Wild Light&quot; Mt. Sims's third album &quot;Happily Ever After&quot; (2008/ Hungry Eye Records) ,is of made from themes which touch on the darker side of human nature: Obsession, isolation, horror and madness. It was produced by Thomas Stern of Crime and the City Solution, and features guest appearances by Jessie Evans (formerly of Subtonix, Autonervous and The Vanishing), Toby Dammit (The Swans, The Residents and Iggy Pop) and Bryan Black (Motor). Album artwork is by Peter Wu with layout by Dez of CROSSOVER. Photography is by Echo Danon.\n\nMount Sims will be spending the summer playing throughout Europe and a fall tour of the United States is being planned to support the album. Dates will be announced as they become available, as well as details regarding a European release for the album.\n\n\nalbums\n\nUltra Sex (International DeeJay Gigolo Records) (2002)\nWild Light (International DeeJay Gigolo Records) (2005)\n\n\nplease seed a lot  because im on welfare and im a minority and i got mental health\n\n","torrent":{"xt":"urn:btih:c5557a00e9648b226e1248548d1338889e3f62db","amp;dn":"Mount+Sims+%282+albums%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5557a00e9648b226e1248548d1338889e3f62db","infoHashBuffer":{"type":"Buffer","data":[197,85,122,0,233,100,139,34,110,18,72,84,141,19,56,136,158,63,98,219]},"announce":[],"urlList":[]}}