{"title":"The Beach Boys 1967 SMiLE (PurpleChick Reconstruction) [FLAC]","uid":11833620,"size":281080991,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c586f92e10a96c28b73aaa84504e487c359f70cc&amp;dn=The+Beach+Boys+1967+SMiLE+%28PurpleChick+Reconstruction%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"sailorsaint","files":20,"time":1429676000,"description":"Purple Chick presents: \n\nTHE BEACH BOYS SMILE - a reconstruction\n\nBrian Wilson's 2004 arrangement of SMiLE, as performed by the Beach Boys. In glorious STEREO, just like it says on the cover. We decided to do it the way we imagined which necessitated edits, manipulation, speed, tempo and pitch correction, etc. Despite killing all the sacred cows, it sounds mighty fine to us.\n\n1: Our Prayer/Gee (Mok; Archaeology; Good Vibrations)\nOur Prayer starts us off, just as the BB recorded it (Mok's synchronization of stereo and mono mixes); into the Gee and H+V theme which is slowed down at the end and fades into the sax solo, which is crossfaded into:\n\n2: Heroes And Villains (Hawthorne California; Archaeology; Hawthorne California; Archaeology; BWPS)\nStereo single version; with restored &quot;cantina&quot; and ending sections (plus only four &quot;woo-woos&quot;, instead of five)\n\n3: Roll Plymouth Rock (Unsurpassed Masters 17; Unsurpassed Masters 16; Archaeology)\nVarious stereo sections from Unsurpassed Masters. Fixed the vocal flub at the end of stereo &quot;Wa halla loo lay&quot;.\n\n4: Barnyard (Unsurpassed Masters 16/Endless Harmony)\nMono backing track edited to match the BWPS format, then Brian's mono piano/vocal demo overlaid on the verses in perfect sync. A little panning keeps the stereo theme intact - just about.\n\n5: Old Master Painter/You Are My Sunshine (Mok)\nMok's edit of the stereo instrumental with the mono vocal mix. (If it ain't broke, don't fix it!)\n\n6: Cabin Essence (20/20; BWPS)\nUntouched, for the most part, but the fade-out is restored to its full glory. Needing a suitable ending, horror of horrors, we used BWPS for the final chord because it worked so damn well.\n\n7: Wonderful (Good Vibrations/Vigotone; Vigotone)\nSynchronized two versions into stereo. This everso briefly falls back into mono for the transition into:\n\n8: Song For Children (Mok)\nEdited to match the BWPS arrangement. Digital pitch changes for the ending? Heresy!!\n\n9: Child Is Father Of The Man (Vigotone; Archaeology; BWPS)\nTwo Vigotone versions/mixes synchronized into stereo. The piano ending had the beautiful trumpet part that I didn't want to cut short. So there\nare four 'extra' bars before BWPS appears. How do I live with myself?\n\n10: Surf's Up (Good Vibrations; Good Vibrations/Endless Harmony-DVD; Surf's Up/Endless Harmony-DVD)\nIt's hard to improve on the Ann Wallace mix, but I think we managed it. The first part is a new synchronization of Brian's piano/vocal demo with the instrumental track. Brian's vocal now includes &quot;Canvas the town...&quot; twice. Did I mention the restored &quot;bygone&quot;s?? The middle section reverts to Brian's demo, with a little help from the bass. The Surf's Up's coda is edited to match Brian's modern arrangement, and its main vocal line strengthened/doubled.\n\n11: I'm In Great Shape/I Wanna Be Around/Workshop (BWPS; EH/Psychedelic Sounds; UM 16)\nAfter the orchestral introduction, Brian's piano/vocal demo takes over, synchronized with one of the three known instrumental versions. You might not notice the sax in the left channel, but the bass is there loud and clear. The crossfade into another instrumental version isn't ideal, but it is what it is. The final part is the regular stereo mix, with the workshop sounds reduced in volume. All crossfading into:\n\n12: Vega-Tables (Unsurpassed Masters 17; Good Vibrations; Mok; Hawthorne California)\nShockingly complicated. Bits and pieces from all over UM 17 - way too hard to describe. Many different takes/mixes all edited, synchronized and mixed together, with the bass line from the Good Vibrations version overlaid as a finishing touch. Also, check out the exclusive vocal-only bonus track.\n\n13: On A Holiday (Mok; Mok/Stereo Smiley Smile)\nThe only (mostly) mono track here - we couldn't find a true stereo mix. It does expand into stereo when the &quot;whispering winds&quot; vocals fade in at the end. (That took a bit of tempo and pitch matching, I can tell you.)\n\n14: Wind Chimes (Unsurpassed Masters 17; Mok; Unsurpassed Masters 17; Mok)\nMostly Mok's reconstruction, I think, edited to match BWPS, with UM 17 for the intro and the middle eight.\n\n15: Mrs. O'Leary's Cow (Unsurpassed Masters 17; Mok/Stereo Smiley Smile)\nWhy yes, that *is* the &quot;Fall Breaks&quot; vocal part synchronized neatly in the middle.\n\n16: In Blue Hawaii (Unsurpassed Masters 17; Secret Smile; BWPS; Mok)\nFixed the end of the &quot;Water&quot; chant, to remove what sounds like a studio comment. Then a tough choice: the Secret Smile tracks are in stereo, but don't sound as good as the mono version. We chose to stick with the stereo theme, but the bonus track uses the mono mix for these parts, just in case you prefer.\n\n17: Good Vibrations (Good Vibrations; Unsurpassed Masters 15; Hawthorne California; Heroes and Vibrations)\nAn awesome stereo version - this one really packs a punch. All the bits in all the right places and, like Vega-Tables, really hard to explain how we got there. We maybe took a little artistic liberty, but it's well worth it","torrent":{"xt":"urn:btih:c586f92e10a96c28b73aaa84504e487c359f70cc","amp;dn":"The+Beach+Boys+1967+SMiLE+%28PurpleChick+Reconstruction%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c586f92e10a96c28b73aaa84504e487c359f70cc","infoHashBuffer":{"type":"Buffer","data":[197,134,249,46,16,169,108,40,183,58,170,132,80,78,72,124,53,159,112,204]},"announce":[],"urlList":[]}}