{"title":"Christopher Davidson - After the Sheikhs_The Coming Collapse of","uid":10324484,"size":2068123,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c59998a53e9d8baea156f0305e3dbc28bd76019a&amp;dn=Christopher+Davidson+-+After+the+Sheikhs_The+Coming+Collapse+of+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Papushi","files":-1,"time":1402344066,"description":"The Gulf monarchies (Saudi Arabia and its five smaller neighbours: the United Arab Emirates, Kuwait, Qatar, Oman, and Bahrain) have long been governed by highly autocratic and seemingly anachronistic regimes. Yet despite bloody conflicts on their doorsteps, fast-growing populations, and powerful modernising and globalising forces impacting on their largely conservative societies, they have demonstrated remarkable resilience. Obituaries for these traditional monarchies have frequently been penned, but even now these absolutist, almost medieval, entities still appear to pose the same conundrum as before: in the wake of the 2011 Arab Spring and the fall of incumbent presidents in Egypt, Tunisia, and Libya, the apparently steadfast Gulf monarchies have, at first glance, re-affirmed their status as the Middle East s only real bastions of stability. In this book, however, noted Gulf expert Christopher Davidson contends that the collapse of these kings, emirs, and sultans is going to happen, and was always going to. While the revolutionary movements in North Africa, Syria, and Yemen will undeniably serve as important, if indirect, catalysts for the coming upheaval, many of the same socio-economic pressures that were building up in the Arab republics are now also very much present in the Gulf monarchies. It is now no longer a matter of if but when the West s steadfast allies fall. This is a bold claim to make but Davidson, who accurately forecast the economic turmoil that afflicted Dubai in 2009, has an enviable record in diagnosing social and political changes afoot in the region.","torrent":{"xt":"urn:btih:c59998a53e9d8baea156f0305e3dbc28bd76019a","amp;dn":"Christopher+Davidson+-+After+the+Sheikhs_The+Coming+Collapse+of+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c59998a53e9d8baea156f0305e3dbc28bd76019a","infoHashBuffer":{"type":"Buffer","data":[197,153,152,165,62,157,139,174,161,86,240,48,94,61,188,40,189,118,1,154]},"announce":[],"urlList":[]}}