{"title":"Bones Season 4 HDTV.XviD DutchReleaseTeam (dutch subs nl)","uid":6471691,"size":9172799371,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c5f5ecc7418669f4695425f1fd0a89caa7563392&amp;dn=Bones+Season+4+HDTV.XviD+DutchReleaseTeam+%28dutch+subs+nl%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Koedje","files":-1,"time":1308162048,"description":"Plot:\n\nemperance Brennan is als forensisch antropologe werkzaam op het Jeffersonian Institute. Samen met haar team van uitermate getalenteerde wetenschappers helpt ze de FBI om moordzaken op te lossen. Niet alleen oude, onopgeloste moordzaken worden opgelost, maar ook recente moordzaken. Tijdens haar werk voor de FBI werkt ze samen met Seeley Booth (David Boreanaz). Tussen de FBI en het Jeffersonian Institute bestaan soms onenigheden, zoals die ook tussen Brennan (en haar team) en Booth bestaan. Maar uiteindelijk lossen de twee partijen de zaken altijd weer op.\n\n\n\n\nSeizoen 4:\n\n\nSeason 4, Episode 1: The Yanks in the U.K.: Parts 1 and 2\nDuring Bones' stay in England, the daughter of an American businessman is murdered. The businessman insists that the FBI help with the case, so Booth and Bones investigate. \nMeanwhile, Angela's husband shows up at the Jeffersonian.\n\n\n\t\nSeason 4, Episode 2: The Man in the Outhouse\nA body is discovered in an outhouse. The victim is a host of show that exposes men's infidelities. Booth learns about Bones's dating situation.\n\n\n\t\nSeason 4, Episode 3: The Finger in the Nest\nWhile spending some time with his son, Booth finds a human finger. They find the body of a veterinarian. Hodgins starts to realize how he's been affected by the turmoil in his life.\n\n\n\t\nSeason 4, Episode 4: The Perfect Pieces in the Purple Pond\nThe dissected body of an author with OCD is discovered by a pair of teenagers and leads the team on a search for the head and the killer. Also, Sweets and Hodgins visit Zack in the mental institution.\n\n\n\t\nSeason 4, Episode 5: The Crank in the Shaft\nPart of a leg drops into an elevator. The gruesome discovery finds the body had been in the shaft for a few days. \nThe victim was an office manager who was disliked by everyone. As the team investigates, Angela and Hodgins come to terms with their break up.\n\n\n\t\nSeason 4, Episode 6: The He in the She\nHalf a decomposed body is discovered by a pair of beach combers. They find the deceased was leader of a local religious congregation. \nWhen the other half of the body is found, they learn the leader had a hidden past.\n\n\n\t\nSeason 4, Episode 7: The Skull in the Sculpture\nA skull is found in a crushed car. The investigation leads to an artist who used crushed vehicles in his artwork, leaving the team to wonder if he made himself part of his art.\n\n\n\t\nSeason 4, Episode 8: The Con Man in the Meth Lab\nA body flies out of an exploding meth lab. As the team tries to identify the body, Booth works on a big case which could boost his career, but he's distracted when his brother shows up and shows some interest in Bones.\n\t\n\n\nSeason 4, Episode 9: The Passenger in the Oven\nBones and Booth fly to China so Brennan can identify some remains. During the flight, a body is discovered inside an oven. Bones and Booth must solve the crime before the flight lands in China.\n\n\n\t\nSeason 4, Episode 10: The Bone That Blew\nBrennan and Booth investigate the remains of a bodyguard of two children who attend a high security school for the children of important people. Also, Cam hires Brennan's father as a teacher which causes some conflicts for Bones.\n\n\n\t\nSeason 4, Episode 11: Double Trouble in the Panhandle\nThe remains of a set of conjoined twins are found on an oil field. When they find out the twins worked at a Circus, Bones and Booth go undercover to find the culprit.\n\n\n\t\nSeason 4, Episode 12: Fire in the Ice\nThe body of a victim is found in a frozen lake. Booth identifies the body as a rival hockey player, making Booth a suspect in the crime. Now the Squints have to work with a new agent to solve the crime.\n\n\n\t\nSeason 4, Episode 13: The Hero in the Hold\nThe Gravedigger returns and captures Booth. He wants the evidence that someone has stolen from the case, and he believes that Bones has it. Can the Squints find their friend before Booth becomes the Gravediggers latest casualty?\n\n\n\t\nSeason 4, Episode 14: The Princess and the Pear\nBooth asks Bones to fix his back again, but she ends up aggravating his condition. While Booth is sidelined, Bones works with Agent Perotta to solve the murder of a woman who was working at a Fantasy convention.\n\n\n\t\nSeason 4, Episode 15: The Bones That Foam\nRemains are discovered by a newly wed couple after they literally take the plunge. The squints soon determine the identity of the victim, \nbut discovering the cause of death presents interesting dilemmas as a mysterious corrosive foam secreting from the bones is destroying the remains and causing the Jeffersonian's alarms go off with each test they try. \nAlso, Bones tries to work on her interpersonal skills.\n\n\n\t\nSeason 4, Episode 16: The Salt in the Wounds\nThe remains of a volleyball player are found in a Salt Truck. They discover that she was pregnant, and that several of her friends are also pregnant.\n\n\n\t\nSeason 4, Episode 17: The Doctor in the Den\nThe murder of a doctor at a Wildlife Reserve gets a little personal for Cam, when the victim turns out to be a former paramour. \nAngela tries to go celibate to work on her relationship issues.\n\n\n\t\nSeason 4, Episode 18: The Science in the Physicist\nThe frozen shattered remains of a scientist leads the team to a highly regarded research institute. Angela's father comes to town\n\n\n\t\nSeason 4, Episode 19: The Cinderella in the Cardboard\nThe flattened remains of a woman are found in a recycling plant, leading the team to a wedding planner, the woman's fiancee, and the owner of an online dating service. \nAs the Squints work to solve the case, Bones and Booth are at odds when it appears that someone they know is cheating on a friend/colleague.\n\n\n\t\nSeason 4, Episode 20: Mayhem on a Cross\nSkeletal remains used by a Norwegian Black Metal Band lead the team to explore the underground music scene. Gordon-Gordon prepares to retire from psychology, \nbut not before meeting with Sweets and helping Bones and Booth solve their current case.\n\n\n\t\nSeason 4, Episode 21: The Double Death of the Dearly Departed\nWhile attending a coworker's funeral, Brennan realizes that he was murdered rather than dying of natural causes and begins covertly investigating his death.\n\t\n\n\nSeason 4, Episode 22: The Girl in the Mask\nBones asks for Booth's advice on which of her assistants she should hire. Booth gets a call from a friend, a Japanese cop who Booth once worked with in an exchange program, \nwho asks him to check on his sister. Unfortunately they locate her head. Now the squints must locate the body.\n\n\n\t\nSeason 4, Episode 23: The Beaver in the Otter\nThe remains of a college student are found in a mascot costume from a rival college. As the squints investigate how the body got in there, \nBooth finds out what his brother plans on doing with his life after his court martial.\n\n\n\t\nSeason 4, Episode 24: The Critic in the Cabernet\nThe remains are found in a barrel of wine. Bones realizes she wants to have a child and asks Booth for help.\n\n\n\t\nSeason 4, Episode 25: The End in the Beginning\nStory of a murder in a nightclub with multiple suspects, with familiar faces in a different perspective. When the story's finished, Booth's health crisis takes an expected twist.\n\n\n\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nga dan eens naar http://www.hetmultimediacafe.be\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:c5f5ecc7418669f4695425f1fd0a89caa7563392","amp;dn":"Bones+Season+4+HDTV.XviD+DutchReleaseTeam+%28dutch+subs+nl%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5f5ecc7418669f4695425f1fd0a89caa7563392","infoHashBuffer":{"type":"Buffer","data":[197,245,236,199,65,134,105,244,105,84,37,241,253,10,137,202,167,86,51,146]},"announce":[],"urlList":[]}}