{"title":"Dishonored PROPER.Crack.Only-FLT","uid":7713210,"size":18387397,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c629884c1f5f5bc0b590d40f09647ae529afe09d&amp;dn=Dishonored+PROPER.Crack.Only-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Gh0stNet","files":4,"time":1349861552,"description":"\n\n  Proper Notes:\n  =============\n\n  The SKIDROW release doesnt properly handle the Steam API. As a result, the\n  game does not show any required information when you load a saved game.\n  So finding your wanted save game, is like fishing in the dark, because all\n  saved games basically look the same. We included a screenshot on our ISO.\n\n  Game information:\n  =================\n\n  You are the once-trusted bodyguard of the Empress. Framed  for  her  murder\n  and driven by revenge, you must become an infamous assassin, known only  by\n  the disturbing mask that has become your calling card.\n\n  As you navigate a world torn apart by plague and oppressed by a  government\n  armed with strange new technologies, the truth behind your betrayal  is  as\n  murky as the waters surrounding the city.\n\n  The choices you make will determine the fate of the world,  but  no  matter\n  what happens your old life is gone forever.\n\n  Features:\n  ~~~~~~~~~\n\n  * Improvise and Innovate:\n\n    Approach each assassination with precise first-person control and\n    creatively combine your abilities and gadgets to eliminate targets\n    with your own ruthless strategy. Improvise and innovate to define\n    your play style.\n\n  * Supernatural Assassin:\n\n    Teleport for stealth approaches, possess any living creature, or stop\n    time itself to orchestrate unearthly executions! Combining your suite\n    of supernatural abilities and weapons opens up even more ways to\n    overcome obstacles and eliminate targets. The game's upgrade\n    system allows for the mastery of deadly new abilities and\n    devious gadgets.\n\n  * Action with Meaning:\n\n    Move like a ghost and resist corruption, or show no mercy and leave\n    a path of destruction in your wake. Decide your approach for each\n    mission, and the outcomes will change as a result.\n\n  * A City Unlike Any Other:\n\n    Enter an original world envisioned by Half-Life 2 art director Viktor\n    Antonov. In a place where industry and mysticism collide, the world\n    is yours to discover.\n\n  Installation Information:\n  =========================\n\n  * Burn or mount\n  * Install the game\n  * Play the game\n\n  NOTE: As usual, block the game exe in your firewall.\n\n                                                              /TEAM FAiRLIGHT\n\n  ","torrent":{"xt":"urn:btih:c629884c1f5f5bc0b590d40f09647ae529afe09d","amp;dn":"Dishonored+PROPER.Crack.Only-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c629884c1f5f5bc0b590d40f09647ae529afe09d","infoHashBuffer":{"type":"Buffer","data":[198,41,136,76,31,95,91,192,181,144,212,15,9,100,122,229,41,175,224,157]},"announce":[],"urlList":[]}}