{"title":"3D Pinball: Space Cadet (Windows XP Pinball) *TyMoD*","uid":6633974,"size":2566399,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c653f690c51c86104e70f9b90a0cdc004c4dfb5d&amp;dn=3D+Pinball%3A+Space+Cadet+%28Windows+XP+Pinball%29+%2ATyMoD%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TyMod","files":-1,"time":1314476602,"description":"I looked for this EVERYWHERE.  Very hard to find.  I use to love playing this on Windows XP but ofcoarse with the transition to Vista and later 7 it was lost.  Until now.\n\nDoes this work on Vista and 7? YES\n\nWill it work on 64 Bit computers? Works on mine. So it should.\n\nWhat do I need to do? Open the folder when the games done downloading and play by clicking Pinball.exe!!!\n\nGame Info:\n**********\n\nRelease Date: 1996\n\nFull Name: 3D Pinball: Space Cadet or Windows XP Pinball\n\nThe Space Cadet table features the player as a member of a space fleet that completes missions to increase their rank. Players can attain 9 different ranks (listed from lowest to highest): Cadet, Ensign, Lieutenant, Captain, Lieutenant Commander, Commander, Commodore, Admiral, and Fleet Admiral. Players accept a mission by hitting &quot;mission targets&quot; which select which mission they will take, and by going up the &quot;launch ramp&quot;. Each mission has a set number of things for players to do, such as hitting the &quot;attack bumpers&quot; (which are a set of four bumpers at the top of the table) eight times (this is the &quot;target practice&quot; mission). Missions end either when the goal is met, or when all of the lights under the launch ramp (a.k.a. fuel lights) turn off. The fuel lights turn off after a certain amount of time, and can each be turned on by having the ball go over them, or all at once by going up the launch ramp again. Upon completing a mission, some of the blue lights in a circle in the middle of the table turn on. When all of the lights in the blue circle turn on, the player's rank increases, and a light in the orange circle turns on. This table (and possibly the others) contains cheat codes that must be typed in at the beginning of the game. Typing in the words &quot;hidden test&quot; (with a space between the words) accesses Hidden Test mode. Hidden Test mode allows the player to click and drag the mouse to move the ball, makes the 2nd place slot in the High Scores table show a score of title &quot;Mem&quot;. Lastly, typing in &quot;bmax&quot; at any time gives the player unlimited lives (balls). A new ball is ejected from the Yellow Wormhole when the previous one is lost. If the game is tilted during 'bmax' play, that ball is lost and 'bmax' play is cancelled. Play resumes at a Replay ball, an Extra ball (either can be earned during \\'bmax\\' play) or the next of the 3 primary balls. 'bmax' can be re-enabled by typing it in. A game that has had any 'bmax' play is not eligible for the High Scores list. Play Space Cadet is included, by default, on all computers running Microsoft Windows ME and all computers running Microsoft Windows XP. The game can be found in these computers by going to the GAMES section of the start menu on these versions of Windows.\n \nThe &quot;Hidden Test&quot; cheat code does not work on the Full Tilt! version of the game, however it does work on the Windows version. (This version.)\n\nSEED, COMMENT, RATE, and Spread the love.  I love this game and I think anyone who appreciates the classics will too.\n\nTyMoD\n","torrent":{"xt":"urn:btih:c653f690c51c86104e70f9b90a0cdc004c4dfb5d","amp;dn":"3D+Pinball%3A+Space+Cadet+%28Windows+XP+Pinball%29+%2ATyMoD%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c653f690c51c86104e70f9b90a0cdc004c4dfb5d","infoHashBuffer":{"type":"Buffer","data":[198,83,246,144,197,28,134,16,78,112,249,185,10,12,220,0,76,77,251,93]},"announce":[],"urlList":[]}}