{"title":"Doom Patrol v1","uid":4155913,"size":589795034,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c6d3e02f8aa270a8c4aa3155bab7524b6ea16c6c&amp;dn=Doom+Patrol+v1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gilgamesh07","files":48,"time":1209152331,"description":"This is a request from the forums. This torrent contains Doom Patrol v1.\n\nFrom Wikipedia, the free encyclopedia:\n\nThe Doom Patrol is a fictional superhero team appearing in publications from DC Comics. The original Doom Patrol first appeared in My Greatest Adventure #80 (June 1963). Writers Bob Haney and Arnold Drake and artist Bruno Premiani created the team. The Doom Patrol has since appeared in multiple incarnations.\n\nThe first Doom Patrol consisted of super-powered misfits, whose &quot;gifts&quot; caused them alienation and trauma. The series was canceled in 1968, and Drake killed the team off in the final issue, Doom Patrol #121 (September-October 1968).\n\nThe Doom Patrol first appeared in 1963, when the DC title My Greatest Adventure, an adventure anthology title, was being converted to a superhero format. The task assigned writer Arnold Drake was to create a team that fit both formats. With fellow writer Bob Haney and artist Bruno Premiani, he created the Doom Patrol, a team of superpowered misfits regarded as freaks by the world at large. It first appeared in My Greatest Adventure #80, June 1963. Doctor Niles Caulder motivated the original Doom Patrol, bitter from being isolated from the world, to use their powers for the greater good. The series was such a success that My Greatest Adventure was officially retitled The Doom Patrol beginning with issue #86.\n\nThe Doom Patrol&amp;#039;s rogues gallery matched the strange, weird tone of the series. Villains included the immortality-seeking General Immortus, the shapeshifting Animal-Vegetable-Mineral Man, and the Brotherhood of Evil led by the Brain, an actual brain kept alive by technology. The Brotherhood of Evil also included the intelligent gorilla Monsieur Mallah and Madame Rouge, who was given powers similar to those of Elongated Man, with the extra attribute of a malleable face, allowing her to impersonate various people.\n\n \nWhen the popularity of the book waned and the publisher canceled it, Drake ended the series in a dramatic manner: he killed off the entire Doom Patrol. In Doom Patrol #121 (September-October 1968), the Doom Patrol sacrificed their lives to save the small fishing village of Codsville, Maine. This marked the first time in comic book history that a canceled book ended by having most of its cast of main characters die. Artist Bruno Premiani and editor Murray Boltinoff appeared at the beginning and the end of the story, asking fans to write to DC to resurrect the Doom Patrol, although the latter was supposed to have been Drake. According to the writer, he was replaced with the editor because he had just resigned over a pay dispute and moved to Marvel Comics. He finished the script only out of friendship for Boltinoff.[1] A few years later, three more issues appeared in DC&amp;#039;s short-lived attempt to copy Marvel&amp;#039;s line of series reprint titles (as opposed to DC&amp;#039;s anthology reprint titles). A Doom Patrol revival did not occur until nine years after the original&amp;#039;s demise.\n\nSome similarities exist between the original Doom Patrol and Marvel Comics&amp;#039; original X-Men. Both include misfit superheroes shunned by society and both are led by men of preternatural intelligence confined to wheelchairs. These similarities ultimately led series writer Arnold Drake to maintain that the concept of the X-Men had been based on the Doom Patrol.\n\nDrake stated &quot;...I?ve become more and more convinced that [Stan Lee] knowingly stole The X-Men from The Doom Patrol. Over the years I learned that an awful lot of writers and artists were working surreptitiously between [Marvel and DC]. Therefore from when I first brought the idea into [DC editor] Murray Boltinoff?s office, it would?ve been easy for someone to walk over and hear that [I was] working on a story about a bunch of reluctant superheroes who are led by a man in a wheelchair. So over the years I began to feel that Stan had more lead time than I realized. He may well have had four, five or even six months.&quot; (X-Men #1 debuted three months after MGA #80; due to publication lag times, Lee could not have know of the Doom Patrol when he scripted the first X-Men story unless he had been told about it in advance of its publication.)[2]\n\nHowever, others have noted that the Doom Patrol shares fundamental similarities with Stan Lee&amp;#039;s earlier title, Fantastic Four. The original lineup of both teams included four members, who did not have secret/double identities; each had a headquarters that was a public building in the middle of a major city; each team had one member with stretching powers (Rita Farr of the Doom Patrol, Reed Richards of the Fantastic Four), one member with flame or flame-like powers (Larry Trainor of the DP and Johnny Storm of the FF), a member with brute strength and a freakish body, with bitterness at being trapped in it (Cliff Steele and Ben Grimm) and a member who was invisible or stayed out of the public view (Niles Caulder and Sue Storm). Both teams quarrelled amongst themselves, unlike most other teams published by DC/National. This has led to assertions that the Doom Patrol were created with the Fantastic Four in mind.[3] One commentator has stated that ?it is considered common knowledge that the Doom Patrol was inspired by The Fantastic Four?.[4]\n\nThanks to the scanners and the original varied sources from which I was able to assemble this collection.\n\nPlease seed. Please enjoy.\n","torrent":{"xt":"urn:btih:c6d3e02f8aa270a8c4aa3155bab7524b6ea16c6c","amp;dn":"Doom+Patrol+v1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6d3e02f8aa270a8c4aa3155bab7524b6ea16c6c","infoHashBuffer":{"type":"Buffer","data":[198,211,224,47,138,162,112,168,196,170,49,85,186,183,82,75,110,161,108,108]},"announce":[],"urlList":[]}}