{"title":"Truth, Lies and Advertising: The Art of Account Planning [PDF]","uid":8213522,"size":2635911,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c6e2e539e9170ef6a1459be3a95951473189bab9&amp;dn=Truth%2C+Lies+and+Advertising%3A+The+Art+of+Account+Planning+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"theBooks","files":-1,"time":1362290055,"description":"Truth, Lies and Advertising: The Art of Account Planning\nAuthor(s): Jon Steel\nPublisher: Wiley\nDate: 1998\nPages: 322\nFormat: PDF\nLanguage: English\nISBN-10: 0471189626\nISBN-13: 978-0471189626\nSize: 2.58 MB\n\n------------------------------------------------------------------------------\n------------------------------------------------------------------------------\n\nDescription:\n\n------------------------------------------------------------------------------\n------------------------------------------------------------------------------\n\nAccount planning exists for the sole purpose of creating advertising that truly connects with consumers. While many in the industry are still dissecting consumer behavior, extrapolating demographic trends, developing complex behavioral models, and measuring Pavlovian salivary responses, Steel advocates an approach to consumer research that is based on simplicity, common sense, and creativity - an approach that gains access to consumers' hearts and minds, develops ongoing relationships with them, and, most important, embraces them as partners in the process of developing and advertising.\n\nA witty, erudite raconteur and teacher, Steel describes how successful account planners work in partnership with clients, consumer, and agency creatives. He criticizes research practices that, far from creating relationships, drive a wedge between agencies and the people they aim to persuade; he suggests new ways of approaching research to cut through the BS and get people to show their true selves; and he shows how the right research, when translated into a motivating and inspiring brief, can be the catalyst for great creative ideas.\n\nHe draws upon his own experiences and those of colleagues in the United States and abroad to illustrate those points, and includes examples of some of the most successful campaigns in recent years, including Polaroid, Norwegian Cruise Line, Porsche, Isuzu, &quot;got milk?&quot; and others.\n\nThe message of this book is that well-thought-out account planning results in better, more effective marketing and advertising for both agencies and clients. And also makes an evening in front of the television easier to bear for the population at large.\n\n------------------------------------------------------------------------------\n------------------------------------------------------------------------------\n\nReviews:\n\n------------------------------------------------------------------------------\n------------------------------------------------------------------------------\n\n&quot;A very smart, very funny look at what works, what doesn't, and why, in the sometimes maddening, sometimes inspiring business of advertising. One of the brightest books about the subject in a long, long time.&quot;\n--Geoffrey Frost, Director of Global Advertising, Nike Inc.\n\n&quot;Jon Steel is one of the top five account planners in the world. The depth and breadth of this book reflects his vast personal experience and exceptional talent. It's not just a great book about account planning, it's a great book about advertising.&quot;\n--Jane Newman, Partner, Director of Strategic Planning, Markley, Newman, Harty\n\n&quot;The beauty of this book is that it discusses the theories and practice of one of the brightest minds in advertising today, yet never loses its irreverent tone. It's a great book for the advertising industry and a must read for planners.&quot;\n--Rob White, Director of Planning, Fallong McElligott\n\n&quot;...I was glued to Jon's book. Best practice, common sense, and extraordinary intelligence throughout.&quot;\n--David Wheldon, President, BBDO Europe\n\n&quot;Jon Steel's book is the perfect insight into a discipline that for some time has been misunderstood, misused, and maligned by most agencies and clients in the U.S. So, run it up the flag pole, put it to groups, check it agains the norms, the answer is the same -- Truth, Lies, and Advertising should be read by anyone who has to make or approve advertising.&quot;\n--Rick Boyko, President, Chief Creative Officer, Ogilvy &amp; Mather, New York\n\n------------------------------------------------------------------------------\n------------------------------------------------------------------------------\n\nAbout the Author:\n\n------------------------------------------------------------------------------\n------------------------------------------------------------------------------\n\nJon Steel is Director of Account Planning and Vice Chairman at Goodby, Silverstein &amp; Partners, an advertising agency whose clients include American Isuzu Motors, Anheuser-Busch, the California Milk Processors (&quot;got milk?&quot;), Hewlett-Packard, Nike, Polaroid, and Porsche. Jon began his career in advertising as a 21-year-old account planner with the English agency Boase Massimi Pollitt.\n\nBy the age of 26, he was appointed to BMP's board of directors. In 1989 he left the United Kingdom to become the first Director of Account Planning at Goodby, Silverstein &amp; Partners in San Francisco. He has been profiled by Adweek as &quot;West Coast Executive of the Year,&quot; by Advertising Age as an &quot;Agency Innovator,&quot; and by San Francisco Focus as one of the 100 smartest people in the Bay Area. In 1995, Jon Steel was inducted into the American Advertising Federation's Hall of Achievement for executives under 40.\n\n------------------------------------------------------------------------------\n------------------------------------------------------------------------------\n\nAmazon Customer Ratings (36 Reviews):\n\n------------------------------------------------------------------------------\n------------------------------------------------------------------------------\n\n5 star: (24)\n4 star: (10)\n3 star: (1)\n2 star: (1)\n1 star: (0)\n\n------------------------------------------------------------------------------\n------------------------------------------------------------------------------\n\nNo Password or Surveys. Guaranteed!!!\n\nPlease seed the torrent if you want to Help :)\n\n------------------------------------------------------------------------------\n------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:c6e2e539e9170ef6a1459be3a95951473189bab9","amp;dn":"Truth%2C+Lies+and+Advertising%3A+The+Art+of+Account+Planning+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6e2e539e9170ef6a1459be3a95951473189bab9","infoHashBuffer":{"type":"Buffer","data":[198,226,229,57,233,23,14,246,161,69,155,227,169,89,81,71,49,137,186,185]},"announce":[],"urlList":[]}}