{"title":"Was It Only a Paper Moon (Apollo hoax) (James M. Collier) (1997)","uid":3552484,"size":554312022,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c700b5fb76a440c07d13ad886103e377b2c32e38&amp;dn=Was+It+Only+a+Paper+Moon+%28Apollo+hoax%29+%28James+M.+Collier%29+%281997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"red_gonzo","files":1,"time":1162826694,"description":"This is James M. Collier&amp;#039;s shocking video documentary Was It Only A Paper Moon (1997) which provides startling evidence that NASA&amp;#039;s Project Apollo was in reality filmed in a television studio rather than on the Moon itself. Did we really go to the Moon or was it only a paper Moon? Did America really go to the Moon. . .or were taxpayers just taken for a ride? This amazing report by James Collier, author of &quot;VOTESCAM: The Stealing of America&quot;, includes new evidence taken in the Johnson Space Center in  Houston - and questions whether NASA was guilty of spending billions of taxpayer money - to stage the greatest theatrical hoax of all time. This video demands answers from the U.S. Government before America goes to Mars. Find out how the hatch between the Command Module &amp; the Lunar Module was too small for the space-suited astronauts to pass through no matter what contortions they could go through to try, how the front hatch of the Lunar Module opened inward making it impossible for the astronauts to exit the cramped LM, how there was actually no NASA manual instructing the astronauts how to get out of the LM, leaving it up to each individual to figure that out for himself (as told on camera to Collier by Frank Hughes, Chief of Astronaut Training at NASA) and how the 10-foot Rover was simply too long to fit into the 5-foot side of the LM. Collier challenges NASA to disprove the above in a public demonstration to American taxpayers! This investigation and that of others, including investigator Bill Kaysing, who is now suing Astronaut James Lovell for slander, cannot be ignored. 90 min. long. A must see for everyone.\n\nVideo specs:\nVideo codec: divx, 384x288, 25 fps\nAudio codec: mp3, 44 kHz, stereo\n","torrent":{"xt":"urn:btih:c700b5fb76a440c07d13ad886103e377b2c32e38","amp;dn":"Was+It+Only+a+Paper+Moon+%28Apollo+hoax%29+%28James+M.+Collier%29+%281997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c700b5fb76a440c07d13ad886103e377b2c32e38","infoHashBuffer":{"type":"Buffer","data":[199,0,181,251,118,164,64,192,125,19,173,136,97,3,227,119,178,195,46,56]},"announce":[],"urlList":[]}}