{"title":"The Crusades: The War for the Holy Land - Thomas Asbridge","uid":10441712,"size":789839912,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c75281b3b6118a941844a04878a09e9c2ea4603b&amp;dn=The+Crusades%3A+The+War+for+the+Holy+Land+-+Thomas+Asbridge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Robin1966","files":77,"time":1403898297,"description":"Audio Books : History : MP3/128Kbps : English\n\n\nAuthor of The First Crusade (2004), British historian Asbridge widens his vista to the entire 1195-1291 duration of the crusading era, giving prominence in the holy-war epic to antagonists forever famous: Richard the Lionheart and Saladin. Each leader's role as standard-bearer of his cause reflects Asbridge's significant emphasis on the entanglement of secular politics with the overt religious aspect to the wars between Latin Christianity and Islam.\n\nCrass considerations of dynastic power were never separate from the calculations of these champions and their successors, and partly indicate Islam's desultory pace in expunging the Christian states established by the First Crusade. In addition, medieval warfare's high-risk character-in which a single encounter, such as the 1098 siege of Antioch or the 1187 Battle of Hattin, could completely turn the strategic tables-goes far in Asbridge's able hands to informing readers about the course of the Crusades. With perceptive commentary about spiritual motivations behind crusading and perspectives from contemporary Islamic sources, Asbridge constructs a comprehensive, sophisticated, and arresting analytical narrative rewarding to any level of historical interest, whether recreational or scholarly. --Gilbert Taylor --This text refers to an out of print or unavailable edition of this title.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:c75281b3b6118a941844a04878a09e9c2ea4603b","amp;dn":"The+Crusades%3A+The+War+for+the+Holy+Land+-+Thomas+Asbridge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c75281b3b6118a941844a04878a09e9c2ea4603b","infoHashBuffer":{"type":"Buffer","data":[199,82,129,179,182,17,138,148,24,68,160,72,120,160,158,156,46,164,96,59]},"announce":[],"urlList":[]}}