{"title":"Brian Eno/Phil Manzanera - 801 Live","uid":7911618,"size":42043090,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c7b4eafc5619fa91dc58c8fd299df1f01f1f7e73&amp;dn=Brian+Eno%2FPhil+Manzanera+-+801+Live&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"jazznbluz","files":-1,"time":1355234701,"description":"801 provided Roxy Music guitarist Phil Manzanera with one of his most intriguing side projects. Although the band only played three gigs in August and September 1976, this album captures a night when everything fell right into place musically. That should only be expected with names like Eno and Simon Phillips in the lineup. (Still, the lesser-known players -- bassist Bill MacCormick, keyboardist Francis Monkman, and slide guitarist Lloyd Watson -- are in exemplary form, too.) The repertoire is boldly diverse, opening with &quot;Lagrima,&quot; a crunchy solo guitar piece from Manzanera. Then the band undertakes a spacey but smoldering version of &quot;Tomorrow Never Knows&quot;; it's definitely among the cleverest of Beatles covers. Then it's on to crisp jazz-rock (&quot;East of Asteroid&quot;), atmospheric psych-pop (&quot;Rongwrong&quot;), and Eno's tape manipulation showcase, &quot;Sombre Reptiles.&quot; And that's only the first five songs. The rest of the gig is no less audacious, with no less than three Eno songs -- including a frenetic &quot;Baby's on Fire,&quot; &quot;Third Uncle,&quot; and &quot;Miss Shapiro&quot;'s dense, syllable-packed verbal gymnastics. There's another unlikely cover of the Kinks' &quot;You Really Got Me,&quot; while Manzanera turns in another typically gutsy instrumental performance on &quot;Diamond Head.&quot; This album marks probably one of the last times that Eno rocked out in such an unself-consciously fun fashion, but that's not the only reason to buy it: 801 Live is a cohesive document of an unlikely crew who had fun and took chances. Listeners will never know what else they might have done if their schedules had been less crowded, but this album's a good reminder. \n","torrent":{"xt":"urn:btih:c7b4eafc5619fa91dc58c8fd299df1f01f1f7e73","amp;dn":"Brian+Eno%2FPhil+Manzanera+-+801+Live","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7b4eafc5619fa91dc58c8fd299df1f01f1f7e73","infoHashBuffer":{"type":"Buffer","data":[199,180,234,252,86,25,250,145,220,88,200,253,41,157,241,240,31,31,126,115]},"announce":[],"urlList":[]}}