{"title":"The Elegant Gentleman's Guide to Knife Fighting (Series 1, 2013)","uid":8723681,"size":1444128848,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c7ee453c18ec843c0f4740875984f208ca8c57e1&amp;dn=The+Elegant+Gentleman%27s+Guide+to+Knife+Fighting+%28Series+1%2C+2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"DrNusbaum","files":12,"time":1374468944,"description":"Welcome to The Elegant Gentleman's Guide To Knife Fighting, a surreal stroll into the creative minds of some of Australia's most exciting and newest comedy writers and directors.\n\nThe Elegant Gentleman's Guide To Knife Fighting aspires to take sketch comedy in a different direction. With longer-form scenes, less traditional material, and a surprising cast, it will be at times random, often ridiculous and occasionally surreal.\n\nProduced by the award-winning Jungleboys and the creators of Review with Myles Barlow and A Moody Christmas, The Elegant Gentleman's Guide To Knife Fighting creates a brand new uncharted space for sketch comedy in Australia.\n\nBased on the experimental online comedy site of the same name, the series has attracted a formidable lineup of the country's finest comedic and dramatic actors.\n\nPatrick Brammall (A Moody Christmas, East West 101), Phil Lloyd (Review with Myles Barlow, A Moody Christmas), Damon Herriman (Breaking Bad, Justified), Georgina Haig (Fringe, Underbelly), Darren Gilshenan (A Moody Christmas,Top of the Lake), Robin McLeavy (Hell on Wheels, Abraham Lincoln: Vampire Hunter), Craig Anderson (Next Stop Hollywood, Laid), Janis McGavin (The Urban Monkey, Laid) and Dave Eastgate (A Moody Christmas, Problems) lead an amazing lineup of onscreen talent.\n\n6 episodes in series.\n\nNot my rip, thanks must go to whoever lets these wee beauties loose on the 'Net.","torrent":{"xt":"urn:btih:c7ee453c18ec843c0f4740875984f208ca8c57e1","amp;dn":"The+Elegant+Gentleman%27s+Guide+to+Knife+Fighting+%28Series+1%2C+2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7ee453c18ec843c0f4740875984f208ca8c57e1","infoHashBuffer":{"type":"Buffer","data":[199,238,69,60,24,236,132,60,15,71,64,135,89,132,242,8,202,140,87,225]},"announce":[],"urlList":[]}}