{"title":"Tomasz Kołodziejczak - Ostatnia Rzeczpospolita 1-3 [PDF] [Polish","uid":13883373,"size":7948533,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c7f31b3b04a01ef0ff6fa0b6037fd821a03b94b5&amp;dn=Tomasz+Ko%C5%82odziejczak+-+Ostatnia+Rzeczpospolita+1-3+%5BPDF%5D+%5BPolish&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"everdarksoul","files":7,"time":1458172479,"description":"Tomasz Kołodziejczak - Ostatnia Rzeczpospolita (1-3)\r\njęzyk: PL / format: PDF / jakość: dobra i średnia\r\n\r\nWstawka zawiera paczzkę e-book'ów trzech pierwszych, wydanych dotąd, części cyklu &quot;Ostatnia Rzeczpospolita&quot; Tomasza Kołodziejczaka. To bezprecedensowa mieszanka Fantasy, historii alternatywnej i klasycznego S-F. Barwny świat elfiej magii, zagadka, która ma zostać wyjaśniona przez główną postać i dynamiczne sceny walki. Cudownia zwariowana mieszanina różnych gatunków fantastyki i jednocześnie manifest przywiązania do tradycji i honoru...\r\nChoć książki te tematycznie stanowią cykl, to jednak każda z nich przedstawia inne historie - które można poznawać, niezależnie od całej serii.\r\n\r\n1 - Czarny Horyzont:\r\nOstatnia Rzeczpospolita wciąż walczy - na miecze i bomby, runy i satelity, relikwie i karabiny... W niedalekiej przyszłości złowrogie istoty z innej rzeczywistości, korzystające z magii i niezwykłych technologii, atakują nasz świat. Błyskawicznie podbijają kolejne państwa. Jednym z ostatnich bastionów zjednoczonych sił ludzi i elfów staje się Królestwo Polski. Kajetan Kłobucki – tajny wysłannik hetmana wielkiego koronnego do zadań specjalnych – rusza na kontrolowane przez najeźdźców terytorium, by przedrzeć się przez czarne horyzonty zdarzeń i zdobyć bezcenne informacje wywiadowcze.\r\nMocna dawka fantasy, science fiction i historii Polski w doskonale napisanej powieści - pierwszej z niezwykłego uniwersum Ostatniej Rzeczpospolitej.\r\n\r\n2 - Czerwona Mgła:\r\nRzeczywistość pękła i na świat zstąpiła zagłada. Rzeczpospolita broni się jeszcze. Zawarła sojusz, a jej król pochodzi nie z tego świata... ONI nie chcą nas podbić. Nie chodzi im o nasze skarby. Interesuje ich tylko zadawanie bólu. Potrzebują go jak powietrza, żywią się nim...\r\nWalczymy ze złem elementarnym. Z pomocą technologii i czarów. Karabinem maszynowym i mieczem. Bombami i modlitwą. Musieliśmy odkryć na nowo dawno zapomniane rytuały, gesty i zabobony. Sięgnąć po narodowe symbole i magiczne artefakty... Granice wolności naszego świata wyznaczają menhiry, święte dęby, przydrożne kapliczki i najeżone lufami bunkry. Poza nimi rosną Czarne Horyzonty i pulsuje Czerwona Mgła. Tam jest martwy świat. My trwamy...\r\n&quot;Zło dobrem zwyciężaj&quot; - ciężko uzbrojonym i mocno opancerzonym!\r\n\r\n3 - Biała Reduta. Tom 1\r\nWszechogarniające Zło - by zapanować nad światem - nie cofnie się przed niczym. Stale rodzi się i odnawia z większą siłą w mrocznych przestrzeniach Gehenny... Zarówno w Warszawie, jak i w Zachodnich Kresach Rzeczpospolitej, a także w zagrożonej kolonii na Marsie - trwa nieustanne śledztwo i rozpaczliwa próba zbudowania powłoki ochronnej z pomocą zaklęć.\r\nBiała Reduta to nowy wymiar fantastyki - Tomasz Kołodziejczak wysoko podniósł poprzeczkę i stworzył powieść dla tych, którzy pragną od takiej literatury czegoś więcej","torrent":{"xt":"urn:btih:c7f31b3b04a01ef0ff6fa0b6037fd821a03b94b5","amp;dn":"Tomasz+Ko%C5%82odziejczak+-+Ostatnia+Rzeczpospolita+1-3+%5BPDF%5D+%5BPolish","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7f31b3b04a01ef0ff6fa0b6037fd821a03b94b5","infoHashBuffer":{"type":"Buffer","data":[199,243,27,59,4,160,30,240,255,111,160,182,3,127,216,33,160,59,148,181]},"announce":[],"urlList":[]}}