{"title":"A Quick Guide to API 570 Certified Pipework Inspector Syllabus","uid":12586002,"size":5121819,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca0046a66bfb8d9e5534901c3aeafcc5126621b3&amp;dn=A+Quick+Guide+to+API+570+Certified+Pipework+Inspector+Syllabus&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1445019541,"description":"A Quick Guide to API 570 Certified Pipework Inspector Syllabus - Clifford Matthews (Woodhead, ASME, 2009).pdf\r\n\r\nISBN 9781845695699\r\n\r\nThe API Individual Certification Programs (ICPs) are well established worldwide in the oil, gas, and petroleum industries. This Quick Guide is unique in providing simple, accessible and well-structured guidance for anyone studying the API 570 Certified Pipework Inspector syllabus by:\r\nSummarising and helping them through the syllabus\r\nProviding multiple example questions and worked answers\r\nTechnical standards covered include the full API ‘body of knowledge’ for the examination, i.e. API570 Piping inspection code; API RP 571 Damage mechanisms affecting fixed equipment in the refining industry; API RP 574 Inspection practices for piping system components; API RP 577 Welding and metallurgy; API RP 578 Material verification program for new and existing alloy piping systems; ASME V Non-destructive examination; ASME IX Welding qualifications; ASME B16.5 Pipe flanges and flanged fittings; and ASME B 31.3 Process piping.\r\nProvides simple, accessible and well-structured guidance for anyone studying the API 570 Certified Pipework Inspector syllabus\r\nSummarizes the syllabus and provides the user with multiple example questions and worked answers\r\nTechnical standards covered include the full API ‘body of knowledge’ for the examination","torrent":{"xt":"urn:btih:ca0046a66bfb8d9e5534901c3aeafcc5126621b3","amp;dn":"A+Quick+Guide+to+API+570+Certified+Pipework+Inspector+Syllabus","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca0046a66bfb8d9e5534901c3aeafcc5126621b3","infoHashBuffer":{"type":"Buffer","data":[202,0,70,166,107,251,141,158,85,52,144,28,58,234,252,197,18,102,33,179]},"announce":[],"urlList":[]}}