{"title":"Nmap Essentials (2015) (Pdf and Epub) Gooner","uid":12627912,"size":10259183,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb109a168635eea7bb5407404412aab016465862&amp;dn=Nmap+Essentials+%282015%29+%28Pdf+and+Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1445798532,"description":"Publisher: Packt Publishing - ebooks Account (May 27, 2015)\r\nLanguage: English\r\nISBN-10: 1783554061\r\nISBN-13: 978-1783554065\r\n\r\nHarness the power of Nmap, the most versatile network port scanner on the planet, to secure large scale networks\r\n\r\nAbout This Book\r\n\r\nGet acquainted with the intricacies of Nmap's powerful software suite\r\nSet up and configure NMAP for different network specifications effectively\r\nSecure and troubleshoot large scale networks using the powerful features of NMAP with this easy-to-follow guide\r\n\r\nWho This Book Is For\r\n\r\nThis book is for beginners who wish to start using Nmap, who have experience as a system administrator or of network engineering, and who wish to get started with Nmap.\r\n\r\nWhat You Will Learn\r\n\r\nLearn about the inner workings of networks and the importance of ports\r\nRun a basic or default scan to detect services using Nmap\r\nRun an advanced scan with Nmap to designate different types of scans\r\nDeal with slow or sluggish networks to optimize timing, parallelism, and so on in order to complete scans efficiently\r\nUnderstand the internal workings of the Nmap scripting engine to find and run specific Nmap scripts\r\nCreate and run a basic Nmap script in Lua by learning Lua basics, Nmap scripting, and Nmap script submission\r\nCrack passwords with Ncrack, map networks with Nping, and communicate over the network with Ncat\r\n\r\nIn Detail\r\n\r\nNmap is an extremely powerful network port scanner used to identify hosts on a network. Nmap is free, flexible, powerful, and easy to implement, which makes it a very convenient utility.\r\n\r\nThis book demonstrates how to run basic and advanced scans, optimizing them to perform well in a variety of environments. Starting with an overview of Nmap, the reader will be guided through installation on popular operating systems. The book then explains how to use Nmap to run basic and advanced scans in addition to using the Nmap Scripting Engine (NSE). All this helps with optimizing Nmap performance in a variety of environments, eventually enabling the reader to integrate with other Nmap tools such as Nessus, Nikto, Burp Suite, and NSE versus NASL scanning.\r\n\r\nBy the end of the book, the reader will have gained essential insights into network security analysis","torrent":{"xt":"urn:btih:cb109a168635eea7bb5407404412aab016465862","amp;dn":"Nmap+Essentials+%282015%29+%28Pdf+and+Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb109a168635eea7bb5407404412aab016465862","infoHashBuffer":{"type":"Buffer","data":[203,16,154,22,134,53,238,167,187,84,7,64,68,18,170,176,22,70,88,98]},"announce":[],"urlList":[]}}