{"title":"Defenders of the Motherland: The Tsarist Elite in Revolutionary","uid":11809737,"size":10118350,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb99556e80e8374f93229fbf82408783bec649db&amp;dn=Defenders+of+the+Motherland%3A+The+Tsarist+Elite+in+Revolutionary+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1428726124,"description":"Defenders of the Motherland studies how the most powerful social groups in tsarist Russia reacted to the challenges posed by the Russian Revolutions of 1917. Arguing that elite groups-especially nobles, landowners, and officers-played an important role in these events, Matthew Rendle shows how the alienation of tsarist elites from the tsar during the First World War and their support for the new Provisional Government in February 1917 secured the initial success of the revolution.\n\nElites engaged actively with revolutionary politics, serving in the government and forming unions to promote their interests and gather wider support. In doing so, they fostered fears of counter-revolution amongst the lower social classes, radicalizing the popular mood and paving the way for the Bolsheviks.\n\nAlthough increasingly disillusioned with events, elites were not solely counter-revolutionary and were far from united. A poorly-supported military revolt in August 1917 demonstrated different aspirations for the future, whilst as many served the Bolshevik regime after October 1917 as opposed it. The divisions that had existed prior to 1917, exacerbated by the revolution, consequently undermined the White armies' opposition to Bolshevism during Russia's civil war. Nevertheless, the Bolsheviks' fear of &quot;class enemies&quot; was endemic, and their obsession with removing the threat that former elites posed laid the foundations of the violent and repressive Soviet regime","torrent":{"xt":"urn:btih:cb99556e80e8374f93229fbf82408783bec649db","amp;dn":"Defenders+of+the+Motherland%3A+The+Tsarist+Elite+in+Revolutionary+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb99556e80e8374f93229fbf82408783bec649db","infoHashBuffer":{"type":"Buffer","data":[203,153,85,110,128,232,55,79,147,34,159,191,130,64,135,131,190,198,73,219]},"announce":[],"urlList":[]}}