{"title":"X Gold X Beyond The Frontier X-Tension","uid":4144082,"size":850649118,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cbeedf9c27c1d92223075d008e2bba7b224f632b&amp;dn=X+Gold+X+Beyond+The+Frontier+X-Tension&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"tom.slick","files":5,"time":1208638274,"description":" This is the story of the ultimate dream, mans dream, a dream of escaping from the confines of his own planet. A dream of freedom within his own universe, a dream of reaching the stars.\n\n  \n \n \n \n                       TRADE : FIGHT : BUILD : THINK\n\nX-Gold is two games in one, not only does it contain X: Beyond the Frontier, it also contains the expansion pack X-Tension.\n\nX: Beyond the Frontier tells the story of mankind\\\\\\&amp;#039;s rise and fall in the universe, and the attempt by Kyle Brennan to help repopulate the stars using a new ship called the Experimental Shuttle, and how he became trapped in a closed group of sectors linked by a series of jumpgates. \nX-Tension is the eagerly awaited expansion pack to X: Beyond the Frontier. The expansion is not limited by a linear plot line but makes use of new ways to expand your empire. You can now take part in missions that are offered to you throughout the game. You are no longer limited to one ship, but can now buy and pilot all fighters and small transports in the game.\n\nExplore the universe, trade in over 90 sectors, with over 50 goods, upgrade your ship with dozens of wares available to you by 5 unique alien races and protect yourself from the hostile Xenon.\n \n","torrent":{"xt":"urn:btih:cbeedf9c27c1d92223075d008e2bba7b224f632b","amp;dn":"X+Gold+X+Beyond+The+Frontier+X-Tension","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbeedf9c27c1d92223075d008e2bba7b224f632b","infoHashBuffer":{"type":"Buffer","data":[203,238,223,156,39,193,217,34,35,7,93,0,142,43,186,123,34,79,99,43]},"announce":[],"urlList":[]}}