{"title":"The Christ Conspiracy: The Greatest Story Ever Sold","uid":11608246,"size":3726012,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd14642da3746e5a526cc0d03f142d414f441914&amp;dn=The+Christ+Conspiracy%3A+The+Greatest+Story+Ever+Sold&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1417418843,"description":"Controversial and explosive, The Christ Conspiracymarshals an enormous\namount of startling evidence that the religion of Christianity and Jesus\nChrist were created by members of various secret societies, mystery schools\nand religions in order to unify the Roman Empire under one state religion!\nThis powerful book maintains that these groups drew upon a multitude of\nmyths and rituals that already existed long before the Christian era and\nreworked them into the story the Christian religion presents today-known to\nmost Westerners as the Bible.\n\nAuthor Acharya makes the case that there was no actual person named Jesus,\nbut that several characters were rolled into one mythic being inspired by\nthe deities Mithras, Heracles/Hercules, Dionysus and many others of the\nRoman Empire. She demonstrates that the story of Jesus, as portrayed in the\nGospels, is nearly identical in detail to those of the earlier savior-gods\nKrishna and Horus, and concludes that Jesus was certainly neither original\nnor unique, nor was he the divine revelation. Rather, he represents the\nvery ancient body of knowledge derived from celestial observation and\nnatural forces.\nA book that will initiate heated debate and inner struggle, it is\nintelligently written and referenced. The only book of its kind, it is\ndestined for controversy.\n\nChapters in The Christ Conspiracy include:\n\nThe Quest for Jesus Christ\nThe Holy Forgery Mill\nBiblical Sources\nNon-Biblical Sources\nFurther Evidence of a Fraud\nPhysical Evidence\nThe Myth of Hebrew Monotheism\nThe Characters\nAstrology and the Bible\nThe Son of God is the Sun of God\nThe Disciples are the Signs of the Zodiac\nThe Gospel Story\nOther Elements and Symbols of the Christian Myth\nThe Patriarchs and Saints are the Gods of Other Cultures\nThe Meaning of Revelation\nThe Bible, Sex and Drugs\nEssenes, Zealots and Zadokites\nAlexandria: Crucible of Christianity\nEnter Rome\nThe Making of a Myth, etc.\nThis book contains a table of contents, bibliography and index, and includes over 1,100 citations and 30+ illustrations. Primary sources discussed include the Bible, Dead Sea Scrolls, Talmud, Book of Enoch, Gospel of the Hebrews, Gospel of Thomas, Gospel of the Infancy, Epistle of Barnabas and Shepherd of Hermas, as well as Josephus, Pliny, Tacitus, Suetonius, Justin Martyr, Marcion, Irenaeus, Tertullian, Augustine, Eusebius, Porphyry, Celsus, et al","torrent":{"xt":"urn:btih:cd14642da3746e5a526cc0d03f142d414f441914","amp;dn":"The+Christ+Conspiracy%3A+The+Greatest+Story+Ever+Sold","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd14642da3746e5a526cc0d03f142d414f441914","infoHashBuffer":{"type":"Buffer","data":[205,20,100,45,163,116,110,90,82,108,192,208,63,20,45,65,79,68,25,20]},"announce":[],"urlList":[]}}