{"title":"Icons of Evolution: Science or Myth? - Dr. Jonathan Wells","uid":11773434,"size":32293432,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd2cfa0a5200dbcde4a5ae0c5cce37d184a8f193&amp;dn=+Icons+of+Evolution%3A+Science+or+Myth%3F+-+Dr.+Jonathan+Wells&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":1,"time":1427167988,"description":"\nHow would you react if told that you and your children have been lied to in science lessons at school and university? Yet this is exactly what has been happening for decades, as Icons of Evolution' demonstrates.\n\nThe author, a Berkeley Ph.D in Biology, is not a creationist, but his book describes many serious misrepresentations of facts commonly found in biology textbooks, which are used to perpetuate belief in evolution. The main part of the book describes ten of these icons', devoting one chapter to each, and shows what is wrong with them in the light of published scientific evidence. The chapters are all fairly brief, and each is divided into short sections, to make the material easier to assimilate. The author's thesis is amply documented with 71 pages of research notes at the end of the book.\n\n\nAbout the author:\nJonathan Wells has received two Ph.D.s, one in Molecular and Cell Biology from the University of California at Berkeley, and one in Religious Studies from Yale University. A Senior Fellow at Discovery Institute's Center for Science and Culture, he has previously worked as a postdoctoral research biologist at the University of California at Berkeley and the supervisor of a medical laboratory in Fairfield, California, and he has taught biology at California State University in Hayward.\n\nDr. Wells has published articles in Development, Proceedings of the National Academy of Sciences USA, BioSystems, The Scientist and The American Biology Teacher. He is the author of Charles Hodge's Critique of Darwinism (Edwin Mellen Press, 1988), Icons of Evolution: Why much of what we teach about evolution is wrong (Regnery Publishing, 2000), and The Politically Incorrect Guide to Darwinism and Intelligent Design (Regnery, 2006). He is also co-author with William Dembski of The Design of Life (FTE, 2008). His latest book, The Myth of Junk DNA (Discovery Institute Press, 2011), dismantles a new favorite Darwinian icon by showing that much of our non-protein-coding DNA performs essential biological functions.\n\nDr. Wells is currently doing research and writing on developmental information in embryos that is outside of, and inherited independently of, their DNA","torrent":{"xt":"urn:btih:cd2cfa0a5200dbcde4a5ae0c5cce37d184a8f193","amp;dn":"+Icons+of+Evolution%3A+Science+or+Myth%3F+-+Dr.+Jonathan+Wells","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd2cfa0a5200dbcde4a5ae0c5cce37d184a8f193","infoHashBuffer":{"type":"Buffer","data":[205,44,250,10,82,0,219,205,228,165,174,12,92,206,55,209,132,168,241,147]},"announce":[],"urlList":[]}}