{"title":"Rory Block - 2014 - Hard Luck Child A Tribute to Skip James","uid":11257101,"size":110910435,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:cd4e52dba7b58198f9fd50a94a17db267addc405&amp;dn=Rory+Block+-+2014+-+Hard+Luck+Child+A+Tribute+to+Skip+James&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"eika256","files":-1,"time":1413914713,"description":"Rory Block - 2014 - Hard Luck Child: A Tribute to Skip James\n\nRory Block is simply one of the finest living interpreters of vintage acoustic blues, a guitarist who understands both the technique and the spirit of the great country blues artists of the '20s and '30s. As a teenager, Block had the good fortune to meet some of the founding fathers of the country blues, and her &quot;Mentor Series&quot; has found her recording songs by some of these pioneering artists. 2014's Hard Luck Child: A Tribute to Skip James is the fifth album in the series, and features solo acoustic performances of nine songs from James's songbook, as well as one original tune, &quot;Nehemiah James,&quot; penned by Block and based on James' life story. Block's guitar work on this album is typically splendid, capturing the rudiments of Skip James' style while adding just enough of her own personality that the listener can see not just what Block learned from James, but how it evolved when it was fused with her own musical thinking. (Block does appear to occasionally beef up her picking with some discreet overdubs, but the overall effect feels comfortable and organic.) Block is a guitarist first and a vocalist second, but on Hard Luck Child her voice is in fine form, and she brings a confidence and subtle emotional force to &quot;Devil Got My Woman,&quot; &quot;Hard Time Killing Floor Blues,&quot; and &quot;I'm So Glad&quot; that mirror her understanding of this music. Hard Luck Child was recorded in Block's home, and engineer Rob Davis does excellent work here, giving Block's guitar and vocals an intimate presence that suggests an updated, high-fidelity version of James'78s for Paramount. Hard Luck Child is an album that honors the legacy of Skip James while confirming that Block is one of the few artists in contemporary blues who can not only play his music well, but understands the ideas behind it as well as the art; for fans of acoustic blues, this is highly recommended. (AllMusic)\n\nTrack list:\n01. Nehemiah James\n02. Special Rider Blues\n03. Cypress Grove Blues\n04. If You Haven't Any Hay, Get On Down the Road\n05. Little Cow and Calf Is Gonna Die Blues\n06. Devil Got My Woman\n07. Jesus Is a Mighty Good Leader\n08. Hard Time Killing Floor Blues\n09. I'm So Glad\n10. Hard Luck Child\n\nEnjoy and share!","torrent":{"xt":"urn:btih:cd4e52dba7b58198f9fd50a94a17db267addc405","amp;dn":"Rory+Block+-+2014+-+Hard+Luck+Child+A+Tribute+to+Skip+James","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd4e52dba7b58198f9fd50a94a17db267addc405","infoHashBuffer":{"type":"Buffer","data":[205,78,82,219,167,181,129,152,249,253,80,169,74,23,219,38,122,221,196,5]},"announce":[],"urlList":[]}}