{"title":"Whitney Houston - My Love Is Your Love [V0](Big Papi) 1998 R&amp;amp","uid":9808075,"size":122362911,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cdd16c03e246be27d74b57ef93ea9895e3f211a5&amp;dn=Whitney+Houston+-+My+Love+Is+Your+Love+%5BV0%5D%28Big+Papi%29+1998+R%26amp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Big-Papi","files":15,"time":1395482136,"description":"Source: Arista 07822-19037-2 1998 CD\n\nimage\n\nBy Michael Kerner VINE VOICE\nWhen it has came right down to it, there honestly haven't been very exciting albums lately. But honestly, there are a lot of classics we are right now listening to in R&amp;B lately. In the wake of Michael Jackson's death, many people have begun to discover what talent Jackson had left behind for so many generations. While he unfortunately didn't make that comeback that he was attempting to, another legend is set to come back into the public eye, Whitney Houston. Not only to remind fans of how powerful her voice still is for her upcoming 25th Anniversary, but also because of her anticipated record, I Look To You. But there are those who sadly have written Whitney off as a joke because of the vices that she had went through, and a heartbreaking divorce with Bobby Brown, they should also be strongly re-introduced to her elequent voice too, and why we still have fell in love with Whitney's strong songs. But in the meantime, her classics from her last few albums with Arista have finally been re-released on CD, after being out of print for awhile, and it really is time to feel that love again.\n\nThe 2009 re-release of Whitney Houston's 1998 album My love Is Your Love is definitely worth taking a strong listen too, all over again. Her last record with Clive Davis heading Arista &amp; then Clive leaving a few years later to form J Records, and also right at the time before her personal problems came around in the media. The songs really sound great all over again and have been remastered nicely, with a strong and dominant mix of Hip Hop, Urban R&amp;B, and contemporary Soul, it definitely has still been Whitney's best record yet. The album includes a lot of great songs including It's Not Right But Its okay, the strong Diane Warren penned I Learned From The Best, the seductive and intimate Say Yes, and the somber You'll Never Stand Alone, which I found very soulful, on a personal not which helped me cope with my cousin's death back in 1999. But unlike current R&amp;B records like Ciara's Fantasy Ride, which the collaborations seem flimsy and weak as a mouse and lacked a lot of chemistry in the soul, the collaborations on My Love Is Your Love here are strong and really keep with the rhythm on a lot of great songs including When You Believe, Whitney's acclaimed duet with Mariah Carey that won an Oscar for the movie The Prince Of Egypt, Heartbreak Hotel with Faith Evans and Mariah's former backup singer Kelly Price that still remains soulful and down to Earth, and a great collaboration with Missy Elliot on In My Business, all the way to ending with a urban and driven cover of Stevie Wonder's I Was Made To Love Him.\n\nAll in all, while there honestly isn't anything extra to add to the re-release of the record like her dance mixes of the songs, it still feels great to be reminded of why Whitney Houston is truly one of the best female songstress' and icons in music history. If you haven't yet owned a copy of My Love Is Your Love, than I absolutely recommend this record for your MP3 music library, and even as a CD as a whole too. I still think of this as one of the Top 20 records of the 90's. I am very anxious to see Whitney comeback into the light with her new record soon, and her upcoming performance on Good Morning America in September, but in the meantime, I'll be listening to the classics, and if you haven't heard My Love Is Your Love, than I strongly suggest you give it a great listen to.\n\n\n---------------------------------------------------------------------\nWhitney Houston - My Love Is Your Love\n---------------------------------------------------------------------\n\nArtist...............: Whitney Houston\nAlbum................: My Love Is Your Love\nGenre................: R&amp;B\nSource...............: CD\nYear.................: 1998\n\nMP3 V0 (Highest Quality Available For MP3)\n\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: Extreme, (avg. bitrate: 266kbps)\nChannels.............: Joint Stereo / 44100 hz\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. Whitney Houston - It's Not Right But It's Okay [04:52]\n2. Whitney Houston/Kelly Price/Faith Evans - Heartbreak Hotel[04:41]\n3. Whitney Houston - My Love Is Your Love [04:21]\n4. Whitney Houston/Mariah Carey - When You Believe [04:32]\n5. Whitney Houston - If I Told You That [04:37]\n6. Whitney Houston/Missy Elliott - In My Business [03:27]\n7. Whitney Houston - I Learned from the Best [04:21]\n8. Whitney Houston - Oh Yes [06:47]\n9. Whitney Houston - Get It Back [04:53]\n10. Whitney Houston - Until You Come Back [04:52]\n11. Whitney Houston - I Bow Out [04:31]\n12. Whitney Houston - You'll Never Stand Alone [04:21]\n13. Whitney Houston - I Was Made to Love Him [04:26]\n\nPlaying Time.........: 01:00:47\nTotal Size...........: 116.61 MB","torrent":{"xt":"urn:btih:cdd16c03e246be27d74b57ef93ea9895e3f211a5","amp;dn":"Whitney+Houston+-+My+Love+Is+Your+Love+%5BV0%5D%28Big+Papi%29+1998+R%26amp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdd16c03e246be27d74b57ef93ea9895e3f211a5","infoHashBuffer":{"type":"Buffer","data":[205,209,108,3,226,70,190,39,215,75,87,239,147,234,152,149,227,242,17,165]},"announce":[],"urlList":[]}}