{"title":"Max Brooks - World War Z: An Oral History of the Zombie War","uid":8815047,"size":432819916,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ce0571f27c5fb802f72c7c7fbaf99e017ceff7d7&amp;dn=Max+Brooks+-+World+War+Z%3A+An+Oral+History+of+the+Zombie+War&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"AN0NYMOUS142857","files":93,"time":1376560193,"description":"\nI watched the first episode of The Walking Dead last night, and it reminded me of this book.  I grabbed it to listen again and thought I would pass it along.  My favorite zombie stuff always has more to do with the people than the zombies, so if you feel the same way, grab this book.\n\n---------------------------------------\n\nWorld War Z: An Oral History of the Zombie War (abbreviated WWZ) is a 2006 post-apocalyptic horror novel by Max Brooks. It is a follow-up to his 2003 book The Zombie Survival Guide. Rather than a grand overview or narrative, World War Z is a collection of individual accounts in the form of first-person anecdote. Brooks plays the role of an agent of the United Nations Postwar Commission who published the report a decade after the Zombie War. The United Nations left out much of his work from the official report, choosing to focus on facts and figures from the war rather than individual stories; these form the bulk of the novel. The interviews chart a decade-long war against zombies from the view point of many different people of various nationalities. The personal accounts also describe the changing religious, geo-political, and environmental aftermath of the Zombie War.\n\nWorld War Z was inspired by The Good War, an oral history of World War II by Studs Terkel; and by the zombie films of director George Romero. Brooks used World War Z to comment on social issues like government ineptitude and American isolationism, while also examining themes of survivalism and uncertainty. Critics have praised the novel for reinventing the zombie genre; the audiobook version, performed by a full cast including Alan Alda, Mark Hamill and John Turturro, won an Audie Award in 2007. A film based upon the book is in development, produced by Plan B Entertainment, with a screenplay by J. Michael Straczynski.\n\nAn abridged audiobook was published in 2007 by Random House, directed by John McElroy, produced by Dan Zitt, with sound editing by Charles De Montebello. The book is read by author Max Brooks, but includes many other actors taking on the roles of the many individual characters who are interviewed in the novel. Brooks, thanks to his first career doing voice-over work and cartoons, was able to recommend a large number of the cast members.\n\n---------------------------------------\n160Kbps MP3\n","torrent":{"xt":"urn:btih:ce0571f27c5fb802f72c7c7fbaf99e017ceff7d7","amp;dn":"Max+Brooks+-+World+War+Z%3A+An+Oral+History+of+the+Zombie+War","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce0571f27c5fb802f72c7c7fbaf99e017ceff7d7","infoHashBuffer":{"type":"Buffer","data":[206,5,113,242,124,95,184,2,247,44,124,127,186,249,158,1,124,239,247,215]},"announce":[],"urlList":[]}}