{"title":"An Inspector Calls and Other Plays - J. B. Priestley","uid":8816113,"size":975508,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce65d295fc66b756d68c60f7bb379e611251db8b&amp;dn=An+Inspector+Calls+and+Other+Plays+-+J.+B.+Priestley&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"ShitBomb","files":2,"time":1376589958,"description":"An Inspector Calls, written at a time when society was undergoing sweeping transformations, has been produced as a successful film, and enjoyed repeated revivals since it was first produced in 1946. While holding its audience with the gripping tension of a detective thriller, it is also a philosophical play about social conscience and the crumbling of middle class values. Time and the Conways and I Have Been Here Before belong to Priestley's 'time' plays, in which he explores the idea of precognition and pits fate against free will. The Linden Tree also challenges preconceived ideas of history when Professor Linden comes into conflict with his family about how life should be lived after the war.\n\nJohn Boynton Priestley (1894-1984) was born in Bradford, the son of a schoolmaster. On receiving an ex-officers' grant after the First World War, Priestley went to Trinity Hall, Cambridge. In 1922, after refusing several academic posts, he went to London, where he soon established a reputation as an essayist and critic. With his third and fourth novels, The Good Companions (1929) and Angel Pavement (1930), he found great success and established an international reputation. This was enlarged by the plays he wrote in the 1930s and 1940s, notably Dangerous Corner (1932), Time and the Conways (1937) and An Inspector Calls (1945), which have been translated and produced all over the world","torrent":{"xt":"urn:btih:ce65d295fc66b756d68c60f7bb379e611251db8b","amp;dn":"An+Inspector+Calls+and+Other+Plays+-+J.+B.+Priestley","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce65d295fc66b756d68c60f7bb379e611251db8b","infoHashBuffer":{"type":"Buffer","data":[206,101,210,149,252,102,183,86,214,140,96,247,187,55,158,97,18,81,219,139]},"announce":[],"urlList":[]}}