{"title":"Oxford Navigate: English Course for Adults (Elementary, Pre-Inte","uid":12854024,"size":5096202424,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce708662dbe5ab7947c5c38e056d399dea60da01&amp;dn=Oxford+Navigate%3A+English+Course+for+Adults+%28Elementary%2C+Pre-Inte&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":1205,"time":1448647760,"description":"Graduation Year: 2015\r\nAuthor: Jake Hughes, Katie Wood, Paul Dummett, Catherine Walter\r\nCategory: English Course for Adults\r\nPublisher: Oxford University Press\r\nLanguage course: English\r\nFormat: PDF\r\nQuality: (eBook)\r\nNumber of pages: \r\nA2 Elementary: 232+206+242+112=792\r\nB1 Pre-intermediate: 224+198+228+112=762\r\nB1+ Intermediate: 240+214+230+112=796\r\nTotal: 2350\r\nISBN: 978-0-19-456673-5, 978-0-19-456663-6, 978-0-19-456666-7, 978-0-19-456660-5, 978-0-19-456657-5, 978-0-19-456551-6, 978-0-19-456532-5, 978-0-19-456644-5, 978-0-19-456531-8\r\nAudio codec: MP3\r\nAudio Bitrate: 128 , 192 kbps\r\nQuality of video: DVDRip\r\nVideo Format: MP4\r\n\r\nAbout:\r\nOxford Navigate\r\nA brand new adult course based on academic research as to how adults best learn languages and extensive classroom research. Navigate is a brand new, six-level General English course tailored exclusively to adults.\r\nThe course takes an innovative approach to reading and listening based on academic research as to how adults best learn languages. It teaches reading and listening from the bottom up, giving learners the skills they need to understand the next text they will read and hear, not just the one they are reading or hearing now. The content has been extensively piloted and reviewed in ELT classrooms across the world, giving teachers the confidence that it really works. The first 3 levels are publishing early 2015 (A2, B1 and B1+) with the next 3 levels following early 2016.\r\nKey features:\r\n- Based on the Oxford 3000™ so learners are only covering the most relevant vocabulary for them\r\n- Driven by learning outcomes and end goals of adult learners, so that learners can make the most of their time\r\n- Truly adult and truly international\r\n- Information-rich topics and texts immerse adult learners in themes and issues from around the world so that learning English is more relevant\r\n- Based on extensive academic and classroom research\r\n- Learner materials have been thoroughly tested and piloted in ELT classrooms across the world - giving teachers confidence that it works\r\n- Innovative approach to skills development based on academic research helps your learners to listen and read for tomorrow\r\n- Innovative skills strand takes a bottom-up decoding approach to listening and reading\r\n- Equal weight given to grammar and vocabulary learning with clear on-the-page practice\r\n- Vocabulary based on the Oxford 3000 and levelled against the CEFR, giving learners the relevant language they need to communicate in the world today\r\n- Clear aims and outcomes linked to the CEFR throughout the course\r\n- Learners are immersed in themes and issues from around the world through content-rich, authentic texts that are really relevant to adult learners\r\n- Focus on vocabulary systems and vocabulary-building techniques\r\n- Real world video content provides integrated listening practice – video lesson in every unit plus vox pops throughout the course\r\n- Speaking practice throughout each lesson to help learners become more confident at using new language in the real world","torrent":{"xt":"urn:btih:ce708662dbe5ab7947c5c38e056d399dea60da01","amp;dn":"Oxford+Navigate%3A+English+Course+for+Adults+%28Elementary%2C+Pre-Inte","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce708662dbe5ab7947c5c38e056d399dea60da01","infoHashBuffer":{"type":"Buffer","data":[206,112,134,98,219,229,171,121,71,197,195,142,5,109,57,157,234,96,218,1]},"announce":[],"urlList":[]}}