{"title":"The Heroes of Telemark - (Kirk Douglas - Richard Harris)(1965)[D","uid":5005501,"size":891168815,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ce826a9783488793d057c52d70033db1039c6a7e&amp;dn=The+Heroes+of+Telemark+-+%28Kirk+Douglas+-+Richard+Harris%29%281965%29%5BD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"seanprince","files":2,"time":1247706508,"description":"The Heroes of Telmark - (Kirk Douglas - Richard Harris)(1965)[DvdRip,Xvid,English]\n\n\n\n\nStaring\n\nKirk Douglas\nRichard Harris\nUlla Jacobsson\nMichael Redgrave\nDavid Weston\nSebastian Breaks\nJohn Golightly\nAlan Howard\nPatrick Jordan\nWilliam Marlowe\nBrook Williams\nRoy Dotrice\nAnton Diffring\nRalph Michael\nEric Porter\n\nIMDB Rating =\n6.3/10\n\n\n\nFile Size = 849 MB\nLanguage = English\nSubs = None\nDuration = 02:04:57\nResolution = 608 x 256\nVideo Codec = Xvid\nAudio = English AC3\nFrame Rate = 25 Fps\n\n\nPlot\nSet in German-occupied Norway, this is an embellished account of the remarkable efforts of the Norwegian resistance to sabotage the German development of the atomic bomb. Resistance fighter Knut Straud enlists the reluctant physicist Rolf Pedersen in an effort to destroy the German heavy water production plant near the village of Rjukan in rural Telemark. In the process, Pedersen discovers that his ex-wife Anna and her uncle have also joined the resistance. British commandos dispatched to destroy the plant are killed when their glider hits the mountainside at night. An improvised raid by the resistance ends in the partial destruction of the heavy water canisters, but the contingency plans of Reichskommissar Terboven enable the Germans to resume production quickly. Pedersen wants to recommend to London that the Allies bomb the plant. Straud opposes him because of the potential death toll on Norwegian civilians and a fight ensues. They send in separate recommendations, and the air raid takes place, but it fails to destroy the heavy water. A Norwegian traitor gives away the resistance hideout, and Anna's uncle is killed. The Germans load the canisters onto a ferry for shipment to Germany, and the resistance rig explosives to sink the ferry in the fjord. As the ferry is about to leave, it is boarded by the widow and baby of one of Pedersen's and Straud's colleagues. Pedersen boards the ferry and organizes a children's game of &quot;lifejacket&quot; in order to minimize civilian deaths. The film closes with resistance members rescuing passengers as the ferry sinks. Written by Peter Grosvenor\n\nDuring WW2 Norway was occupied by Germany. In the clear deep fjords they tried to produce &quot;heavy&quot; water; a vital component in the making of an atomic bomb. A weapon that would win the war for Germany. Norwegian resistance movement finds out about this and the allied are alerted. But will they have the time and opportunity to stop this from happening? Written by rof\n\nFictionalized account of the Norwegian resistance's success at destroying German heavy water production during World War II. The initial plan is for British commandos to destroy the heavy water plant in Telemark but when they are all killed, it is left to Dr. Rolf Pederson and Kurt Straud to lead a team of Norwegian resistance fighters. Their first attempt to destroy the heavy water factory is only partly successful and their last chance is to sink the ferry carrying the plant's heavy water production - and also many civilians including school children.\nWritten by garykmcd","torrent":{"xt":"urn:btih:ce826a9783488793d057c52d70033db1039c6a7e","amp;dn":"The+Heroes+of+Telemark+-+%28Kirk+Douglas+-+Richard+Harris%29%281965%29%5BD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce826a9783488793d057c52d70033db1039c6a7e","infoHashBuffer":{"type":"Buffer","data":[206,130,106,151,131,72,135,147,208,87,197,45,112,3,61,177,3,156,106,126]},"announce":[],"urlList":[]}}