{"title":"Negotiate to Win: The 21 Rules for Successful Negotiating","uid":8543194,"size":2918627,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ceb623c3ddd055e2df8198cfcdf79f453c8a2f9f&amp;dn=Negotiate+to+Win%3A+The+21+Rules+for+Successful+Negotiating&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1370451477,"description":"Negotiate to Win: The 21 Rules for Successful Negotiating by Jim Thomas\nEnglish | ISBN: 0060781068 | edition 2005 | PDF | 321 pages | 2,7 mb\n\nAmericans as a whole are really bad at negotiating. We find haggling to be beneath us and we're uncomfortable with it, yet we feel cheated when we don't get the best deal possible. World-class negotiator, author, and attorney Thomas takes his cues from cultures where negotiating is celebrated as an art.\n\nWhile India or the Middle East may come to mind, when it comes to masters of negotiation, Japan tops the list. Thomas explains that the American way of logic and reasoning is persuasion, not negotiation, and you can persuade until you're blue in the face and still get nowhere. The art of negotiation is allowing your counterpart (don't think of them as your &quot;opponent&quot;) to save face, which means always giving some concessions to get what you really want. &quot;Beating&quot; your colleague is not a way to create long-term relationships, but a &quot;win-win&quot; solution is. Thomas presents 21 powerful rules of negotiating, plus gives &quot;Quickies,&quot; specific tips on how to negotiate with your boss, spouse, child, car dealer, contractor, and more. Inspiring.","torrent":{"xt":"urn:btih:ceb623c3ddd055e2df8198cfcdf79f453c8a2f9f","amp;dn":"Negotiate+to+Win%3A+The+21+Rules+for+Successful+Negotiating","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceb623c3ddd055e2df8198cfcdf79f453c8a2f9f","infoHashBuffer":{"type":"Buffer","data":[206,182,35,195,221,208,85,226,223,129,152,207,205,247,159,69,60,138,47,159]},"announce":[],"urlList":[]}}