{"title":"How to Fold It: Mathematics of Linkages, Origami and Polyhedra","uid":8883908,"size":17468421,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cedb0024044bea92c76d743da17adc4b1e97a708&amp;dn=How+to+Fold+It%3A+Mathematics+of+Linkages%2C+Origami+and+Polyhedra&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1378403090,"description":"Joseph O'Rourke, &quot;How to Fold It: The Mathematics of Linkages, Origami and Polyhedra&quot;\nEnglish | 2011-04-25 | ISBN: 0521145473, 0521767350 | 192 pages | PDF | 16.66 mb\n\nWhat do proteins and pop-up cards have in common? How is opening a grocery bag different from opening a gift box? How can you cut out the letters for a whole word all at once with one straight scissors cut? How many ways are there to flatten a cube? You can answer these questions and more through the mathematics of folding and unfolding. From this book, you will discover new and old mathematical theorems by folding paper and find out how to reason toward proofs. With the help of 200 color figures, author Joseph O'Rourke explains these fascinating folding problems starting from high school algebra and geometry and introducing more advanced concepts in tangible contexts as they arise. He shows how variations on these basic problems lead directly to the frontiers of current mathematical research and offers ten accessible unsolved problems for the enterprising reader. Before tackling these, you can test your skills on fifty exercises with complete solutions. The book's Web site, http://www.howtofoldit.org, has dynamic animations of many of the foldings and downloadable templates for readers to fold or cut out.","torrent":{"xt":"urn:btih:cedb0024044bea92c76d743da17adc4b1e97a708","amp;dn":"How+to+Fold+It%3A+Mathematics+of+Linkages%2C+Origami+and+Polyhedra","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cedb0024044bea92c76d743da17adc4b1e97a708","infoHashBuffer":{"type":"Buffer","data":[206,219,0,36,4,75,234,146,199,109,116,61,161,122,220,75,30,151,167,8]},"announce":[],"urlList":[]}}