{"title":"Guide to Wild Foods and Useful Plants - 2nd Edition [EPUB]","uid":9933810,"size":5982971,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf0706b264176327b7eea769c187a30a39bfa1c5&amp;dn=Guide+to+Wild+Foods+and+Useful+Plants+-+2nd+Edition+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"AtomTPB","files":1,"time":1397142088,"description":"Language: English \nISBN: 1613746989 \nPublished 2014 \nFormat: EPUB \nPages: 352 pages\n\n\n\n\nChristopher Nyerges book, &quot;Guide To WildFoods and Useful Plants' features an array of abundant wild foods is available to hikers, campers, foragers, or anyone interested in living closer to the earth. Written by a leading expert on wild foods and a well-known teacher of survival skills, Guide to Wild Foods and Useful Plants is more than a listing of plant types; it teaches how to recognize edible plants and where to find them, their medicinal and nutritional properties, and their growing cycles. The 2nd edition features more than 70 plants found all around the United States along with more than 100 full color photos plus handy leaf, fruit, and seed keys to help readers identify the plants. It also includes fascinating folklore about plants, personal anecdotes about trips and meals, and simple and tasty recipes. With a Forward written by Ed Begley Jr.Includes Latin and common names.Fully indexed.About the Author &amp; the Illustrator - Christopher Nyerges is the director of the School of Self-Reliance, where he has taught classes on wild foods and survival skills since 1974. He is an associate editor of Wilderness Way and West Coast editor of Wild Food Forum. He has published hundreds of articles on wild foods, gardening, self-reliance, and survival skills in American Survival Guide, Whole Life Times, Mother Earth News, Herbalist, and many other magazines","torrent":{"xt":"urn:btih:cf0706b264176327b7eea769c187a30a39bfa1c5","amp;dn":"Guide+to+Wild+Foods+and+Useful+Plants+-+2nd+Edition+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf0706b264176327b7eea769c187a30a39bfa1c5","infoHashBuffer":{"type":"Buffer","data":[207,7,6,178,100,23,99,39,183,238,167,105,193,135,163,10,57,191,161,197]},"announce":[],"urlList":[]}}