{"title":"EXPLOITED COLLEGE GIRLS - Alicia - Big Butt Amateur Facial 720p","uid":11750889,"size":1980083958,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:cf07e6e0536d74e093b98bfcb4cc035585fb960c&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Alicia+-+Big+Butt+Amateur+Facial+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"beta2008x","files":1,"time":1426205513,"description":" &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=zuhd6_cil.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=zuhd6_cil.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=uv0oa_ecg_15_03_12_alicia_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=uv0oa_ecg_15_03_12_alicia_.jpg&lt;/a&gt;\n\nAss lovers rejoice, we've got another big booty cutie this week on Ex Co Gi. Her name is Alicia and she's a sassy 22 year old Cuban import by way of Las Vegas. While most girls offer up some random hobbies when Jay asks, Alicia doesn't beat around the bush and admits that she just loves riding dick. We can definitely work with a girl like this.\n\nWe aren't sure why a girl would go to the beauty parlor and ask her eyebrow waxer to make her look like a comic book super villain, but that's Alicia's &quot;look&quot; and she seems to rock it. Maybe it's her way of saying, &quot;I know you are staring at my big, round ass anyway, so this is how I do.&quot; Jay counters by getting Alicia to strip so he can finger fuck her and then pound her with a huge pink vibrator. That is how HE do.\n\nAfter getting Alicia close to orgasm, Jay has her drop to the floor to suck his cock. If Alicia has an evil super villian plan it MIGHT be to drain the earth's male population of their essence via their cocks. She certainly sucks Jay off like world domination is at stake. From her hand technique to her deep throating, she just might take over. Once Jay is rock hard, he has Alicia climb aboard for some reverse cowgirl so he can watch that phat ass bounce. He flips her over for some deep dicking and then flips her back to fuck her in doggy and get some footage of that big, tan ass getting drilled.\n\nIf Alicia looks like a comic book villain, Jay looks like the world's most useless (but coolest) comic book hero when he unleashes a mutant-like cumshot that covers Alicia's face and tits and foils her evil plans. If, that is, her evil plans were to spend the rest of the day not covered in Jay jizz. If she's planning to take over Las Vegas and bend it to her will, well, like we said, Jay's pretty useless at fighting crime","torrent":{"xt":"urn:btih:cf07e6e0536d74e093b98bfcb4cc035585fb960c","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Alicia+-+Big+Butt+Amateur+Facial+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf07e6e0536d74e093b98bfcb4cc035585fb960c","infoHashBuffer":{"type":"Buffer","data":[207,7,230,224,83,109,116,224,147,185,139,252,180,204,3,85,133,251,150,12]},"announce":[],"urlList":[]}}