{"title":"FSX Flight1- Ground Environment X Africa &amp; Mid East","uid":6923769,"size":2915326089,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cf1a1ae55f48763a85dd303851386e437caac2f6&amp;dn=FSX+Flight1-+Ground+Environment+X+Africa+%26amp%3B+Mid+East&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"mickyfinnny","files":1,"time":1325363743,"description":"For the very first time in GEX texture coverage, Flight One Software is proud to announce that Ground Environment X Africa-Middle East for Microsoft Flight Simulator X is now available.\n\nGround Environment X Africa-Middle East builds on the award winning techniques of the GEX series and continues using our new approach in texture design, incorporating high level detail graphics in the default Flight Simulator X 1-meter texture resolution format. This delivers a hi-fidelity image without using excessive disk space or processor power. Our design allows a simulation pilot to enjoy clearly defined visuals from nearly ground level up to higher altitudes.\n\nGround Environment X brings all-new ground textures to FSX, and it boasts an incredible 1 m/pixel texture resolution, using native 1024x1024 pixel images, and includes all seasons, meticulously designed night textures and the latest techniques in autogen placement and alignment. All this while keeping maximum Flight Simulator performance in mind during development.\n\nThe easy-to-use interface will provide for easy installing the new textures, and is designed with Flight1's &quot;keep-it-simple yet powerful&quot; philosophy.\n\nWhether you are flying over the savannas of Africa or the oasis-dotted desert sands of the Middle East, the entire area will now come to life with brighter colors, unique autogen, and so much more.\n\nProduct Features\n\nGenerous discount for purchasing Africa and the Middle East. (limited time offer)\n\nComplete coverage of the Middle East and Africa from Pakistan to Cape Town.\n\nEnhanced textures to assist in rendering clear visuals as low as 250-500ft.\n\nHigh volume autogen layout with optimizations for maximum performance.\n\nUpdates GEX Europe in the southern regions when installed with GEX EU.\n\nMajor upgrade for GEX North America users when installed with GEX NA.\n\nSynchronizes all GEX regions. No texture switching between regions.\n\n1m/pixel - 1024x1024 Textures - No excessive resolution to render.\n\nFull texture support for SceneryTech and Xclass landclass products.\n\nAutomated file backup system with merged region backup storage.\n\nSync patches provided for UTX USA\\Canada\\UT Alaska and Europe.\n\n2D enhancements produce simulated 3D depth in textures.\n\nTextures derived from licensed Arial and Satellite imagery.\n\nAll seasons including snowy winters and mountain terrain.\n\nFSX tree render issue addressed in autogen annotation.\n\nRealistic custom designed night lighting textures.\n\nImproved default FSX road night lighting.\n\nHighly detailed aerial views.\n\nNatural seasonal blending.\n\nTested and working with http://thepiratebay.se/torrent/6920696/FSX_Ground_Environment_X_Africa-Middle_East_Update_v1.10\n\nI will seed this 24/7 untill the appropriate amount of data has been exchanged in order to facillitate the seeding quota required.\nHappy New Year Guys. :+)","torrent":{"xt":"urn:btih:cf1a1ae55f48763a85dd303851386e437caac2f6","amp;dn":"FSX+Flight1-+Ground+Environment+X+Africa+%26amp%3B+Mid+East","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf1a1ae55f48763a85dd303851386e437caac2f6","infoHashBuffer":{"type":"Buffer","data":[207,26,26,229,95,72,118,58,133,221,48,56,81,56,110,67,124,170,194,246]},"announce":[],"urlList":[]}}