{"title":"[Jan_Allbeck,_Norman_Badler,_Timothy_Bickmore,_Cat]Intelligent V","uid":11047155,"size":11659546,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf53bf70c316a573e073b7ba8726277709ea5545&amp;dn=%5BJan_Allbeck%2C_Norman_Badler%2C_Timothy_Bickmore%2C_Cat%5DIntelligent+V&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"zombie_rox","files":2,"time":1410967140,"description":"th Welcome to the proceedings of the 10 International Conference on Intelligent Virtual Agents (IVA), held 20-22 September, 2010 in Philadelphia, Pennsylvania, USA. Intelligent Virtual Agents are interactive characters that exhibit human-like qualities and communicate with humans or with each other using natural human modalities such as behavior, gesture, and speech. IVAs are capable of real-time perception, cognition, and action that allow them to participate in a dynamic physical and social environment. IVA 2010 is an interdisciplinary annual conference and the main forum for prese- ing research on modeling, developing, and evaluating Intelligent Virtual Agents with a focus on communicative abilities and social behavior. The development of IVAs - quires expertise in multimodal interaction and several AI fields such as cognitive modeling, planning, vision, and natural language processing. Computational models are typically based on experimental studies and theories of human-human and hum- robot interaction; conversely, IVA technology may provide interesting lessons for these fields. Visualizations of IVAs require computer graphics and animation te- niques, and in turn supply significant realism problem domains for these fields. The realization of engaging IVAs is a challenging task, so reusable modules and tools are of great value. The fields of application range from robot assistants, social simulation, and tutoring to games and artistic exploration. The enormous challenges and diversity of possible applications of IVAs have - sulted in an established annual conference.\n\nLanguage: English\nISBN-10: 3642158919\nISBN-13: 978-3642158919\n\n","torrent":{"xt":"urn:btih:cf53bf70c316a573e073b7ba8726277709ea5545","amp;dn":"%5BJan_Allbeck%2C_Norman_Badler%2C_Timothy_Bickmore%2C_Cat%5DIntelligent+V","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf53bf70c316a573e073b7ba8726277709ea5545","infoHashBuffer":{"type":"Buffer","data":[207,83,191,112,195,22,165,115,224,115,183,186,135,38,39,119,9,234,85,69]},"announce":[],"urlList":[]}}