{"title":"Martin Sexton - Seeds [2007][EAC,log,cue. FLAC]","uid":8632553,"size":339700737,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cf89af5b9d07e0766db54f6b2a463bc44240f6ad&amp;dn=Martin+Sexton+-+Seeds+%5B2007%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":16,"time":1372667894,"description":"Artist:Martin Sexton\nRelease:Seeds\nReleased: 2007\nLabel: Kitchen Table Records\nCatalog#: KTR 005\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:Folk Rock,folk\n\n1. Happy\n2. Thought I Knew Ya\n3. Wild Angels\n4. Will It Go Round in Circles\n5. Goin' to the Country\n6. I'm Here\n7. There Go I\n8. Right Where You Belong\n9. Marry Me\n10. Failure\n11. Still Think About You\n12. How Far I've Come\n13. Wild Angels Reprise\n14. Keep It Simple\n\nYou never know just which Martin Sexton you're going to get from one track to the next on Seeds, his first studio album of new material since 2000s Wonder Bar. In a sense that's always been true of this chameleo-like singer/songwriter, but this time around the patchwork quilt of styles and sounds is even more deliberately premeditated. Citing the Beatles' interlocking song suites of Abbey Road and the impressive array of cartoon voices masterfully invented by the late Mel Blanc as his dual, if disparate, inspirations, Sexton worked hard to lay out a landscape of surprising shifts in temperament and environment for these songs. And then he worked doubly hard on the fine-tuned, last-minute touches, tossing in found sounds and a bit of this and a lot of that to dust each track with a signature. But none of that in-studio fancifulness would be worth much of anything if the songs were no good and, for the most part, they are fairly fetching. That's not immediately apparent, however: &quot;Happy,&quot; which opens the album with tossed-off lines like &quot;the first day of summer vacation/apple pie and relaxation,&quot; is a bit more simplistic and obvious than one has come to expect from Sexton (although the &quot;choir,&quot; all of whose voices belong to Sexton, is pretty cool). And &quot;Thought I Knew Ya,&quot; with its economical, acoustic-based setting and Dave Matthews-ish vocal, is hardly memorable. But by &quot;Wild Angels,&quot; the bluesy third track, Sexton's particular gift kicks in. Establishing that &quot;I sing because I must&quot; and clarifying that &quot;We are born with all this music in our hearts,&quot; Sexton's words are transparent and not exactly profound, but his honesty and forthrightness bring the song home nonetheless. Seeds' willy-nilly-ness truly grabs hold midway though, when consecutive tracks volley from homey country blues to reflective gospel and from crisply recorded, late-Beatlesque pop to good-old-fashioned sleepy, low-key country. &quot;We're goin' where the grass is green and the people always smile,&quot; Sexton sings in &quot;Goin' to the Country,&quot; and in &quot;Marry Me&quot; he keeps irony at bay to request the hand of his loved one. In other hands those simple sentiments might cause diabetes, but Sexton's clearly having a blast, tying the loose ends together while achieving his goal of creating distinctive, separate entities with each new tune. There's a highly confessional, plainspoken quality to these compositions that lends an endearing feel to the music: in &quot;Failure,&quot; the singer admits to having been one at times, but thanks the deity for the opportunity as it all turned out all right in the end: &quot;making the dreams that chose me come true.&quot; And in &quot;There Go I,&quot; accompanied only by acoustic guitar and bass, Sexton, his voice particularly flexible and inspired, proclaims, &quot;Thank you for my voice, I let it sing/Gonna raise it up, let it ring,&quot; just before slipping into a falsetto that's more false than etto. A cover of Billy Preston's &quot;Will It Go Round in Circles&quot; feels lost here, other than as an acknowledgement of Sexton's unquestionable debt to classic-era soul-pop. But like everything else on Seeds, he makes it work. It's the final track, though, &quot;Keep It Simple,&quot; that's the album's real hoot: think Dr. John rapping about anything and everything that comes to mind, with a little Tuvan throat singing tossed in for laughs. &quot;Gotta have some fun&quot; are the last words Sexton plants on Seeds, having just proven irredeemably that he surely knows how to do that.","torrent":{"xt":"urn:btih:cf89af5b9d07e0766db54f6b2a463bc44240f6ad","amp;dn":"Martin+Sexton+-+Seeds+%5B2007%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf89af5b9d07e0766db54f6b2a463bc44240f6ad","infoHashBuffer":{"type":"Buffer","data":[207,137,175,91,157,7,224,118,109,181,79,107,42,70,59,196,66,64,246,173]},"announce":[],"urlList":[]}}