{"title":"ESET NOD32 Antivirus v50950x64-x86 Incl Keys-Kyd","uid":6910957,"size":110391581,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cfdf55f226cb6cf8b8de3bcd73fb23db191563c1&amp;dn=ESET+NOD32+Antivirus+v50950x64-x86+Incl+Keys-Kyd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"TheKyd","files":-1,"time":1324810252,"description":"\n\nESET NOD32 Antivirus v50950x64-x86InclKeys-Kyd\n\nESET NOD32 Antivirus System - Integrated, Real-Time Protection against viruses, worms, trojans, spyware, adware, phishing, and hackers.\nBest detection, fastest performance &amp; smallest footprint. NOD32 Antivirus System provides well balanced, state-of-the-art protection against\nthreats endangering your PC and enterprise systems running various platforms from Microsoft Windows, through a number of UNIX/Linux,\nNovell, MS DOS operating systems to Microsoft Exchange Server, Lotus Domino and other mail servers.\n\nHere are some key features of &quot;ESET NOD32 Antivirus&quot;:\n\nSmarter Scanner:\nÃ‚Â· Threats don't always enter your network in ways you expect. ESET NOD32 Antivirus inspects SSL-encrypted communication channels\nlike HTTPS and POP3S and intelligently scans compressed files to find hidden threats other products miss. Proactive protection begins at\nthe earliest point in system startup to ensure your computer is always secure.\n\nClean and Safe Email:\nÃ‚Â· Email scanning for Microsoft Outlook, Outlook Express, Mozilla Thunderbird, Windows Live Mail, Windows Mail, and other POP3/IMAP mail\nclients, ensuring your email is free of viruses and other threats.\n\nRemovable Media Security:\nÃ‚Â· Threats can enter your PC from removable media such as USB thumb drives. For self-running media, ESET NOD32 Antivirus scans\nautorun.inf and associated files when the medium is inserted, in addition to scanning any file on any removable device when it is accessed,\nor during a full-scan of the media. Power users can adjust ESET NOD32 Antivirus to perform additional levels of scanning on removable\nmedia.\n\nSystem Tools:\nÃ‚Â· ESET SysInspector and ESET SysRescue simplify diagnosing and cleaning of infected systems by allowing deep scans of system\nprocesses to find hidden threats, and creating bootable rescue CD/DVD or USB drives to help you repair an infected computer.\n\nSelf Defense:\nÃ‚Â· ESET NOD32 Antivirus has built-in technology to prevent malicious software from corrupting or disabling it, so you can rest assured\nyour system is always protected.\n\nMany Usability Improvements:\nÃ‚Â· Energy-sipping battery mode extends laptop battery life without compromising security\nÃ‚Â· Advanced Protection Status screen informs you of threat detections\nÃ‚Â· Information pop-ups are hidden when running full screen applications like games, video players or presentations\nÃ‚Â· Password protection prevents ESET NOD32 Antivirus from being uninstalled by strangers\nÃ‚Â· New interface and keyboard shortcuts simplify use for visually impaired users\n\nTotal Size...........: 105 MB\n\nEnjoy!","torrent":{"xt":"urn:btih:cfdf55f226cb6cf8b8de3bcd73fb23db191563c1","amp;dn":"ESET+NOD32+Antivirus+v50950x64-x86+Incl+Keys-Kyd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfdf55f226cb6cf8b8de3bcd73fb23db191563c1","infoHashBuffer":{"type":"Buffer","data":[207,223,85,242,38,203,108,248,184,222,59,205,115,251,35,219,25,21,99,193]},"announce":[],"urlList":[]}}