{"title":"[MAC] Borderlands","uid":5225694,"size":7516225536,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:d0cc92d5e036eb8e97eab786579b98d325f1a246&amp;dn=%5BMAC%5D+Borderlands&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":5,"uploader":"eksilimon13","files":1,"time":1261108385,"description":"This is my second upload,first one wasn't successful lots of user think it was fake but it is not my mistake I changed my account(I had some issue about my source) and now uploading once again it is working perfect,(It is not fake).And I'm sorry but I have to say something about users who think knows everything, they saying I searched and no one say it is playing, YEEEES I made this and working very well you can't find anywhere else.by old naberlangodos,new eksilimon13\n\nBorderlands is a first-person shooter that includes character-building elements found in role playing games, leading to Gearbox calling the game a &quot;role-playing shooter&quot;. At the start of the game, players select one of four characters, each with a unique special skill and with proficiencies with certain weapons. The four characters are: Soldier, Hunter, Siren, and Beserker.[4] From then on, players take on quests assigned through non-player characters or from bounty boards, each typically rewarding the player with experience points and a reward item.[4] Players also earn experience by killing foes and completing in-game challenges (such as getting a certain number of kills using a specific type of weapon). As they gain levels from experience growth, players can then allocate skill points into a skill tree that features three distinct specializations of the base character; for example, a Hunter can become specialized in sniping, melee combat, or scavenging. Players can distribute points among any of the specializations, and can also spend a small amount of in-game money to redistribute their skill points.\n\nJust Intel processors\n1GB system RAM\nNVIDIA Geforce 8600 GS\nATI Radeon X850 Series\n8 GB of hard disk space\n\n\nBugs:\n-Use widescreen res or sniper scope won't work.\n-Turn of shadows it lagging so much.\n\np.s: I didn't try under 10.4 just leopard and snow leopard but i think it is not problem.\n\nFor any help and cider request just visit:","torrent":{"xt":"urn:btih:d0cc92d5e036eb8e97eab786579b98d325f1a246","amp;dn":"%5BMAC%5D+Borderlands","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0cc92d5e036eb8e97eab786579b98d325f1a246","infoHashBuffer":{"type":"Buffer","data":[208,204,146,213,224,54,235,142,151,234,183,134,87,155,152,211,37,241,162,70]},"announce":[],"urlList":[]}}