{"title":"GODLAND 01-36 (2005-2012) (Image Comics) (REQUESTED)","uid":8178891,"size":743194377,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d0e48b024c0bceebc4cbfe2dc7db8f345cc2a32f&amp;dn=GODLAND+01-36+%282005-2012%29+%28Image+Comics%29+%28REQUESTED%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1361587298,"description":"This fills a request for binderguy1. All credit goes to the original scanners. In this case they include Kman, eclipse-DCP, Hartigan-DCP, Danger-Empire and several more! Please seed and share with our friends here on TPB.\n\n------\n\nFrom Wikipedia:\n\nGodland is an American comic book series by Joe Casey and Tom Scioli, published by Image Comics since 2005.\n\nThe series was conceived as both a homage to and a revival of the Cosmic Superhero Epic as told by many great comic creators of the 1970s like Steve Engelhart, Jim Starlin and Jack Kirby. The style of the series is strongly inspired by Kirby's style in The Eternals and The Fourth World family of series. While obviously strongly inspired by these influences, Casey and Scioli add their own twist on the stories with a little humor.\n\nThe main character of the series is astronaut Adam Archer. As the sole survivor of an ill-fated journey to Mars, Adam Archer meets the alien entities known as the Cosmic Fetus Collective, who transform him into a cosmic being and instruct him in the uses of his new powers. Archer is sent back to Earth as the first human to be touched by universal enlightenment.\n\nThe series starts four years later. Archer has become a famous superhero, but is distrusted by government and the public. The military have provided him with a base, Infinity Tower, from where Archer and his three sisters, Neela, Angie and Stella, protect the Earth from the invasion of robot zombies. Neela, an astronaut and military commander, resents that her brother's powers overshadow her own talents and that she is forced to keep an eye on him instead of pursuing her own career. Angie, a fighter pilot, is a rebellious spirit, while Stella, who oversees communication with her brother, is clear-headed and rational.\n\nOn his adventures, Adam comes into conflict with many bizarre supervillains like Basil Cronus, a floating skull in jar on a quest for the ultimate high, Friedrich Nickelhead, Discordia and her father the Tormentor and his army of Superman-Mice.\n\nOn his first adventure, Adam saves the giant, dog-like alien Maxim, who turns out to know about the Cosmic Fetus Collective. Maxim was enhanced by his own species and sent to Earth to contact Archer and prepare him for his destiny. He is rather disappointed with the human race though, who are further from enlightenment than he would have hoped. Nevertheless he is fully committed to his task as a mentor to Adam.\n\nImage is collecting the series as trade paperbacks. Image has also published two hardcovers collecting issues 1-12 and 13-24 respectively, with notes from Casey, sketches by Scioli, a cover and advertisement gallery, and an introduction by Grant Morrison.\n\nIn 2008, Godland was nominated for the &quot;Best Graphic Album - Reprint&quot; Eisner Award, for Godland Celestial Edition Book One.","torrent":{"xt":"urn:btih:d0e48b024c0bceebc4cbfe2dc7db8f345cc2a32f","amp;dn":"GODLAND+01-36+%282005-2012%29+%28Image+Comics%29+%28REQUESTED%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0e48b024c0bceebc4cbfe2dc7db8f345cc2a32f","infoHashBuffer":{"type":"Buffer","data":[208,228,139,2,76,11,206,235,196,203,254,45,199,219,143,52,92,194,163,47]},"announce":[],"urlList":[]}}