{"title":"Architecture of France (Art Ebook).pdf","uid":8338936,"size":25014479,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d185a93031955ba6888eba8cc1c773b81a2ff31a&amp;dn=Architecture+of+France+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1365039436,"description":"David A. Hanser, &quot;Architecture of France&quot;\n2005 | ISBN: 0313319022 | 368 pages | PDF | 24 MB\n\nCovering all regions of France, from Avignon's Palace of the Popes to Versailles' Petit Trianon, and all periods of French architecture, from the Roman theater at Orange to the Arc de Triomphe in Paris, this volume examines more than 60 of France's most important architectural landmarks. Writing in a clear and engaging style, David Hanser, professor of architecture at Oklahoma State University, describes the features, functions, and historical importance of each structure. Besides identifying location, style, architects, and periods of initial construction and major renovation, the cross-referenced and illustrated entries also highlight architectural and historical terms explained in the Glossary and conclude with a useful listing of further readings. \n\nThe volume also offers ready-reference lists of entries by location, architectural style, and time period, as well as a general bibliography, a subject index, and a detailed introductory overview of French architecture. Entries cover major architectural structures as well as smaller sites, including everything from the Cathedral of Notre Dame to Metro (subway) stations. Topics include: BLAigues-Mortes BLArc de Triomphe BLBasilica of the Sacre Coeur BLChartres Cathedral BLEiffel Tower BLFontainbleau BLLouvre and Tuileries Gardens BLMadeleine BLMont St. Michel BLNimes Amphitheater BLParis Opera (Palais Garnier) BLPompidou Center BLReims Cathedral BLVersailles BLVilla Savoye Ideal for college and high school students alike, this comprehensive look at the architecture of France is an indispensible addition to any shelf.","torrent":{"xt":"urn:btih:d185a93031955ba6888eba8cc1c773b81a2ff31a","amp;dn":"Architecture+of+France+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d185a93031955ba6888eba8cc1c773b81a2ff31a","infoHashBuffer":{"type":"Buffer","data":[209,133,169,48,49,149,91,166,136,142,186,140,193,199,115,184,26,47,243,26]},"announce":[],"urlList":[]}}