{"title":"Corazon de tinta.(DVDRIP.spanish.2009)","uid":5105165,"size":1476988928,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d1c0b3844d54d64a1768c1bc28fa91b90d38563f&amp;dn=Corazon+de+tinta.%28DVDRIP.spanish.2009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zurera","files":1,"time":1254270982,"description":"TÃƒÂ­tulo: CorazÃƒÂ³n de Tinta\nTÃƒÂ­tulo original: Inkheart\nPaÃƒÂ­s: USA / Alemania / UK\nEstreno en USA: 23/01/2009\nEstreno en EspaÃƒÂ±a: 19/06/2009\nLanzamiento en DVD (alquiler): 21/10/2009\nProductora: New Line Cinema\nDirector: Iain Softley\nGuiÃƒÂ³n: David Lindsay-Abaire\nReparto: Brendan Fraser, Paul Bettany, Eliza Bennett, Jim Broadbent, Rafi Gavron, Sienna Guillory, Helen Mirren, Andy Serkis \n\nBasada en el primer libro de la trilogÃƒÂ­a de Cornelia Funke.\n\nMortimer &quot;Mo&quot; Folchart (Brendan Fraser) y su hija Meggie de 12 aÃƒÂ±os de edad (Eliza Hope Bennett), comparten la pasiÃƒÂ³n por la literatura. Tienen tambiÃƒÂ©n un talento ÃƒÂºnico para hacer que los personajes de los libros cobren vida con sÃƒÂ³lo leer en voz alta. Pero existe un peligro: por cada personaje de un libro que traen a la vida, una persona real debe desaparecer entre las pÃƒÂ¡ginas.\n\nEn una de sus visitas a una librerÃƒÂ­a de libros de segunda mano, Mo escucha voces que no habÃƒÂ­a escuchado durante mucho tiempo y cuando localiza el libro de dÃƒÂ³nde provienen, un escalofrÃƒÂ­o le recorre el cuerpo por toda la columna vertebral. Es CorazÃƒÂ³n de tinta, un libro cubierto de ilustraciones de castillos medievales y de extraÃƒÂ±as criaturas. Un libro que ha estado buscando desde que Meggie tenÃƒÂ­a tres aÃƒÂ±os, cuando Resa (Sienna Guillory), su madre, desapareciÃƒÂ³ en ese mundo mÃƒÂ­stico.\n\nSin embargo, el plan de Mo de utilizar el libro para encontrar y rescatar a Resa se ve ensombrecido cuando Capricornio (Andy Serkis), el malvado villano de CorazÃƒÂ³n de tinta, secuestra a Meggie y le exige a Mo que haga que cobren vida otros personajes de la ficciÃƒÂ³n. Determinado a rescatar a su hija y a enviar a los personajes de la ficciÃƒÂ³n de nuevo al lugar al que pertenecen, Mo organiza un grupo de aliados sin igual, tanto reales, como imaginarios, y se embarca en un viaje osado y peligroso para poner las cosas en orden.","torrent":{"xt":"urn:btih:d1c0b3844d54d64a1768c1bc28fa91b90d38563f","amp;dn":"Corazon+de+tinta.%28DVDRIP.spanish.2009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1c0b3844d54d64a1768c1bc28fa91b90d38563f","infoHashBuffer":{"type":"Buffer","data":[209,192,179,132,77,84,214,74,23,104,193,188,40,250,145,185,13,56,86,63]},"announce":[],"urlList":[]}}