{"title":"Mr.Beans.Holiday.2007.DvDRip.Xvid.Swesub-Dark_Lord","uid":6890715,"size":2141401284,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d2b110229ff7dc5661f3aca1990ec6c88206eb2c&amp;dn=Mr.Beans.Holiday.2007.DvDRip.Xvid.Swesub-Dark_Lord&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"DarkLord2011","files":2,"time":1324001906,"description":"                                  Mr.Beans Holiday (2007)\n\nMR BEANS HOLIDAY is another senseless comedy with Rowan Atkinson as the classic Mr.. Bean. TV series on Mr.. Bean was the first time in British television in 1990 and quickly made Rowan Atkinson to a world celebrity.\n\n An ordinary, rainy afternoon in England will win Mr. Bean, to his great joy, the first prize in a local contest. The price is a camcorder and a week's vacation in Cannes, in the midst of the hectic festival. Expectant take Mr.. Bean train to Paris together to change trains and continue to Cannes. At the Gare de Lyons, he asks one of his fellow passengers to film him as he rises on the new train. Co-driver is the Russian film director Emil Duchevsky, to be in Cannes to sit in the festival jury.\n\n During the confusion that erupts when he is filming Mr.. Bean, succeeds Emil Duchevsky miss his train. He also drops off his son, Stepan, as the mess comes with Bean on the train bound for Cannes. Stepan and Mr.. Bean does not understand their languages, but Bean succeed after all persuade Stepan that the two should get off at the next station to await the train with Stepan's father. Unfortunately, the next train is an express train that does not stop at the little station, Bean and his minions got off on.\n\n To top it all, Mr.. Bean lost both money, tickets and passport so the two odd passengers are forced to work up the money for a bus ticket. Meanwhile, Stepan's father notified Mr.. Bean for kidnapping and a zealous police force scans the French countryside after the English winner?\n\nhope you all enjoying this movie and pleas guys \n\nSeed after you =)\n\n\n\n\n\n\n             Visit *-- | Tankan. com | --* for more movies and series!","torrent":{"xt":"urn:btih:d2b110229ff7dc5661f3aca1990ec6c88206eb2c","amp;dn":"Mr.Beans.Holiday.2007.DvDRip.Xvid.Swesub-Dark_Lord","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2b110229ff7dc5661f3aca1990ec6c88206eb2c","infoHashBuffer":{"type":"Buffer","data":[210,177,16,34,159,247,220,86,97,243,172,161,153,14,198,200,130,6,235,44]},"announce":[],"urlList":[]}}