{"title":"Understanding VoltammetrySimulation of Electrode Processes(pdf){","uid":11412492,"size":2985422,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d2d771d9f9f44bdfb50704e35e6e4882642e855c&amp;dn=Understanding+VoltammetrySimulation+of+Electrode+Processes%28pdf%29%7B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415544726,"description":"This is the first textbook in the field of electrochemistry that will teach experimental electrochemists how to carry out simulation of electrode processes. Processes at both macro- and micro-electrodes are examined and the simulation of both diffusion-only and diffusion convection processes are addressed. The simulation of processes with coupled homogeneous kinetics and at microelectrode arrays are further discussed.\n\nOver the course of the book the reader's understanding is developed to the point where they will be able to undertake and solve research-level problems. The book leads the reader through from a basic understanding of the principles underlying electrochemical simulation to the development of computer programs which describe the complex processes found in voltammetry.\n\nThis is the third book in the Understanding Voltammetry series, published with Imperial College Press and written by the Compton group. Other books in the series include Understanding Voltammetry , written by Richard G Compton with Craig Banks and also Understanding Voltammetry: Problems and Solutions (2012) written by Richard G Compton with Christopher Batchelor-McAuley and Edmund Dickinson. These are and continue to be successful textbooks for graduates in electrochemistry and electroanalytical studies.\n\nReadership: Graduate students pursuing electrochemistry and electroanalytical studies, as well as researchers and professionals working in the area.\n\nPublisher: Imperial College Press (November 29, 2013)\nLanguage: English\nISBN-10: 1783263237\nISBN-13: 978-1783263233","torrent":{"xt":"urn:btih:d2d771d9f9f44bdfb50704e35e6e4882642e855c","amp;dn":"Understanding+VoltammetrySimulation+of+Electrode+Processes%28pdf%29%7B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2d771d9f9f44bdfb50704e35e6e4882642e855c","infoHashBuffer":{"type":"Buffer","data":[210,215,113,217,249,244,75,223,181,7,4,227,94,110,72,130,100,46,133,92]},"announce":[],"urlList":[]}}