{"title":"Predicament of Belief: Science, Philosophy, and Faith (ePub)","uid":11169493,"size":241398,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d32db8c4c53e781294372acd0a7e0392875e1a64&amp;dn=Predicament+of+Belief%3A+Science%2C+Philosophy%2C+and+Faith+%28ePub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":1,"time":1412679442,"description":"The Predicament of Belief: Science, Philosophy, and Faith (2011)\nPhilip Clayton &amp; Steven Knapp\nePub\n\nDoes it make sense - can it make sense - for someone who appreciates the explanatory power of modern science to continue believing in a traditional religious account of the ultimate nature and purpose of our universe? This book is intended for those who care about that question and are dissatisfied with the rigid dichotomies that dominate the contemporary debate. The extremists won't be interested - those who assume that science answers all the questions that matter, and those so certain of their religious faith that dialogue with science, philosophy, or other faith traditions seems unnecessary. But far more people today recognize that matters of faith are complex, that doubt is endemic to belief, and that dialogue is indispensable in our day.\n\nIn eight probing chapters, the authors of The Predicament of Belief consider the most urgent reasons for doubting that religious claims - in particular, those embedded in the Christian tradition - are likely to be true. They develop a version of Christian faith that preserves the tradition's core insights but also gauges the varying degrees of certainty with which those insights can still be affirmed. Along the way, they address such questions as the ultimate origin of the universe, the existence of innocent suffering, the challenge of religious plurality, and how to understand the extraordinary claim that an ancient teacher rose from the dead. They end with a discussion of what their conclusions imply about the present state and future structure of churches and other communities in which Christian affirmations are made.","torrent":{"xt":"urn:btih:d32db8c4c53e781294372acd0a7e0392875e1a64","amp;dn":"Predicament+of+Belief%3A+Science%2C+Philosophy%2C+and+Faith+%28ePub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d32db8c4c53e781294372acd0a7e0392875e1a64","infoHashBuffer":{"type":"Buffer","data":[211,45,184,196,197,62,120,18,148,55,42,205,10,126,3,146,135,94,26,100]},"announce":[],"urlList":[]}}