{"title":"Cuentos de Eva Luna - Isabel Allende [Epub][Spanish]","uid":6945012,"size":312448,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d3532bd36958934767f37096adff5650dc1dde45&amp;dn=Cuentos+de+Eva+Luna+-+Isabel+Allende+%5BEpub%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"virana","files":-1,"time":1326194083,"description":"Titulo: \tCuentos de Eva Luna - Isabel Allende [epub]\nAutor: \tIsabel Allende\n\n\nSinopsis: Una niÃƒÂ±a solitaria se enamora del amante de su madre y practica misteriosas ceremonias rituales; una mujer permanece medio siglo encerrada en un sÃƒÂ³tano, vÃƒÂ­ctima de un caudillo celoso; en el fragor de una batalla, un hombre viola a una muchacha y mata a su padre... Estas son algunas de las historias reunidas en este volumen que recupera, con pulso vibrante, los inolvidables protagonistas de la novela Eva Luna: Rolf CarlÃƒÂ©, la Maestra InÃƒÂ©s, el Benefactor... VeintitrÃƒÂ©s relatos de amor y violencia secretamente entrelazados por un fino hilo narrativo y un rico lenguaje que recrea azarosas peripecias en un mundo exuberante y voluptuoso.\n\nCon ternura e impecable factura literaria, Isabel Allende perfila el destino de sus personajes como parte indisoluble del destino colectivo de un continente marcado por el mestizaje, las injusticias sociales y la bÃƒÂºsqueda de la propia identidad. Este logrado universo narrativo es el resultado de una lÃƒÂºcida conciencia histÃƒÂ³rica y social, asÃƒÂ­ como de una propuesta estÃƒÂ©tica que constituye una singular expresiÃƒÂ³n del realismo mÃƒÂ¡gico.\n\t\nVeintitrÃƒÂ©s cuentos memorables de Isabel Allende escritos con exquisita precisiÃƒÂ³n y profundo conocimiento del alma humana, con un tono siempre contenido, casi secreto; en contraste con las extraordinarias imÃƒÂ¡genes, el paisaje exuberante y las extravagantes pasiones que determinan el destino de los personajes\n","torrent":{"xt":"urn:btih:d3532bd36958934767f37096adff5650dc1dde45","amp;dn":"Cuentos+de+Eva+Luna+-+Isabel+Allende+%5BEpub%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3532bd36958934767f37096adff5650dc1dde45","infoHashBuffer":{"type":"Buffer","data":[211,83,43,211,105,88,147,71,103,243,112,150,173,255,86,80,220,29,222,69]},"announce":[],"urlList":[]}}