{"title":"Space and Astronomy Handbook (Facts on File)","uid":6576851,"size":4706771,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d35378f2b8af0922ac5f0ffffa20fc3efe3b8f1a&amp;dn=Space+and+Astronomy+Handbook+%28Facts+on+File%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"_F1_","files":-1,"time":1312234844,"description":"Joseph A., Jr. Angelo, &quot; Space and Astronomy Handbook&quot; \nFacts on File | 2009 | ISBN: 0816073880 | PDF | 342 pages | 4.48 MB \n\nIn order to comprehend the universe and how it works, one must first have a firm understanding of astronomy and space exploration. &quot;The Facts on File Space and Astronomy Handbook, Revised Edition&quot; is a thoroughly revised and updated edition of a popular and comprehensive reference. With special emphasis on the most recent planetary exploration missions, including NASA's Phoenix lander as well as NASA's plans to explore the moon and Mars with astronauts, this new resource is essential for middle and high school students interested in space technology, space exploration, and astronomy. The 'downsizing' of Pluto to dwarf planet status and the significance of this new designation in astronomy is also explored in this fascinating resource. This straightforward book contains an extensive glossary with more than 1,250 entries - more than 100 new to this edition - as well as 35 biographies, an updated chronology of events, essential charts and tables, and an index. With 129 new and updated black-and-white photographs and 47 line illustrations, this encyclopedia reflects some of the latest discoveries and achievements in the field.","torrent":{"xt":"urn:btih:d35378f2b8af0922ac5f0ffffa20fc3efe3b8f1a","amp;dn":"Space+and+Astronomy+Handbook+%28Facts+on+File%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d35378f2b8af0922ac5f0ffffa20fc3efe3b8f1a","infoHashBuffer":{"type":"Buffer","data":[211,83,120,242,184,175,9,34,172,95,15,255,250,32,252,62,254,59,143,26]},"announce":[],"urlList":[]}}