{"title":"The Art of Drawing Dragons, Mythological Beasts, ","uid":8350902,"size":106101497,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d366308c78f369d60636c2e6c64e8b300e2222d4&amp;dn=The+Art+of+Drawing+Dragons%2C+Mythological+Beasts%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365343457,"description":"\nThe Art of Drawing Dragons, Mythological Beasts, and Fantasy Creatures: Discover Simple Step-by-Step Techniques for Drawing Fantastic Creatures of Folklore and Legend\nWalter Foster | Michael Dobrzycki | 2007 | HQ PDF | ISBN: 1600580122 | 145 pages | 101 Mb\n\nEasy-to-follow instructions for drawing a variety of creatures, from an Eastern dragon to a hairy troll.\n\nThe ever-increasing popularity of mythological and fantasy creatures in film, graphic novels, and television creates high demand for instruction books on drawing these fantastic beasts. In this newest addition to our Collector's series, aspiring artists will find 144 pages of clear, step-by-step instructions for drawing everything from fire-breathing dragons to seven-headed monsters and magical fairies. Information on the origin and history of mythological creatures gives this book an extra-special appeal. The author's helpful tips on shading and drawing techniques show readers everything they need to know to create their own impressive beasts.\n\nAlthough there are fantasy-themed drawing books on the market, this book is unique because it features a wide range of fantasy subjects rather than focusing on only one type of creature (such as dragons or fairies). It also sets itself apart from similar books with its helpful information on combining graphite pencil with other media, such as charcoal and black watercolor paint or ink. In addition, this extraordinary book features dragons and other mythological creatures from around the world, including those originating in Egyptian, Irish, Norse, and Greek mythology-whereas most other fantasy books include generic, non-regional subjects. ","torrent":{"xt":"urn:btih:d366308c78f369d60636c2e6c64e8b300e2222d4","amp;dn":"The+Art+of+Drawing+Dragons%2C+Mythological+Beasts%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d366308c78f369d60636c2e6c64e8b300e2222d4","infoHashBuffer":{"type":"Buffer","data":[211,102,48,140,120,243,105,214,6,54,194,230,198,78,139,48,14,34,34,212]},"announce":[],"urlList":[]}}