{"title":"Total Recorder Professional V7.0 (Including  Add-ons)","uid":4199953,"size":8993610,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d3875e6479fec84d18892d3acf9b487b031fd7fb&amp;dn=Total+Recorder+Professional+V7.0+%28Including++Add-ons%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Harleyviper","files":12,"time":1211445320,"description":"Total Recorder Professional V7.0 (Including  Add-ons)\n\n &lt;a href=&quot;\nhttp://www.totalrecorder.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.totalrecorder.com/&lt;/a&gt;\n\n\nThe Professional Edition is the main edition from the Total Recorder product family.\nThis edition provides many powerful functions for the recording, converting, editing,and processing of sound. With the Video Add-on, \nyou can record from any combination of video and audio sources.\n\nWith Total Recorder Professional Edition, you can do the following: \n\nRecord local audio files or Internet broadcasts reproduced by other programs, such as RealPlayer, Windows Media Player, iTunes, \nMusicmatch Jukebox, WinAmp, and many others. These recordings are performed without the need for special lines for your sound board and \nwithout a loss of quality due to redundant conversions from digital to analog to digital. Many additional options are available. For example, \nyou can use accelerated recording to increase the recording speed or you can choose to suppress Internet transmission gaps. For more \ninformation, see the Recording an Internet Broadcast Tutorial. \n\nRecord both parties of Internet-telephony conversations when using programs like Skype, Google Talk, etc.\n\nUse the time shift feature to listen to the recorded sound while a recording is being made. While listening, you can move anywhere \nwithin the recorded part of the sound stream and start playback.  \n\nRecord any sound passing through any line of your sound card. For example, you can record sound being played back by an external program, \nor sound from a microphone, an external LP, cassette, CD/DVD player, AM/FM/Satellite radio, etc. For more information, see the Recording \nfrom an External Device tutorial.\n\nBackground record (i.e. capture) an Internet-broadcast in MP3, WMA and Ogg Vorbis formats. This feature allows you to do the following: \n   ? Record Internet broadcasts in their original format without decoding and re-encoding.\n   ? Record without using an external player. \n   ? Extract track information from a stream.\nYou can also play back an Internet broadcast.  \n\nRecord, edit and play video in AVI and WMV formats with Video Add-on. Video can be recorded from a hardware device plugged into your computer,\nsuch as a camera, or captured video from your screen. You can also background record Internet video streams in WMV format. The program can \nbe scheduled to record video from your favourite video services and websites. Click here to learn about this functionality.  \n\nUse Cue-sheet files. Now Total Recorder lets you create cue-points, which can be used for splitting a file afterwards. These cue-points \ncan be created manually, for example to make a bookmark in a sound file. Or they can be created automatically during a recording session \n(based on pause reduction, changes of the clip information in an external player, etc.) or while capturing an Internet transmission and \ninformation about a track changes.   \n\nUse the Recording Wizard to help you customize Total Recorder settings based on the sound you are going to record.\n\nRecord directly in any supported sound format. PCM, MP3, WMA, Ogg Vorbis, FLAC and any format provided by a system codec are supported. \nProfessional Edition also provides support for a number of high-quality stereo formats (PCM - up to 192kHz 24bit and float, FLAC - up to \n192kHz 24bit, WMA Lossless - up to 96kHz 24bit, and formats provided by the Windows Media Audio Professional codec). For more information, \nsee the Selecting an Optimal Recording Format Tutorial.\n\nConvert files between any of the supported sound formats. For more information, see the Sound Format Conversion Tutorial.\n\nCreate and edit file tags. You can create and edit ID3v1 and ID3v2 tags for MP3 files and tags for WMA, WAV, Ogg Vorbis, and FLAC files.\n\nEdit sound files using a built-in sound editor. This built-in sound editor allows you to cut, trim, and join your recordings. Editing can be \nperformed using a visual representation of the sound or using clipboard operations. All editing functions are performed without \ndecompressing/recompressing to preserve sound quality and save time. \n\nNormalize recordings to adjust the level of sound. Such processing for MP3 files is performed without re-encoding or loss of quality.\n\nApply fading effects. Applying fading effects to MP3 files is performed without re-encoding or loss of quality.\n\nSchedule playbacks or recordings using Total Recorder&amp;#039;s powerful built-in scheduler. For example, you can schedule a recording and use a stop \ncondition such as an absolute time, a duration, the absence of a sound signal, and so on. The scheduler includes many other options. For \nmore information, see Using the Scheduler Tutorial.\n\nExport/import configuration settings and scheduled jobs is useful if you need to reinstall your system, move Total Recorder from one \ncomputer to another, or as a backup.  \n\nUse a command line interface to start playback or recording and specify associated parameters.\n\nPerform general operations on playlists, such as merge multiple files in a playlist, rename files from a playlist using tag information, \nsave a playlist, etc.\n\nSplit recordings on separate clips. You can indicate that the sound being recorded will be split on separate clips during the recording. \nFile tags can be created automatically.\n\nSplit recordings on separate files. You can indicate that the sound being recorded will be split into separate files during recording based \non different conditions (size, duration, low sound level, etc.). Splitting an existing recording can also be done. For more information, see \nthe Splitting and Tagging Files Tutorial.\n\nUse the pause reduction feature. You can choose to remove pauses during a recording or remove pauses in an existing file.\n\nCustomize the Total Recorder interface. You can choose to show or hide some parts of Total Recorder&amp;#039;s main window and select different modes. \nAll main functions can be performed with simple mouse clicks or hot-key combinations. \n\nRegulate the playing volume and recording levels directly from the Total Recorder interface.\n\nCustomize shortcuts. You can assign a shortcut key to any function provided by Total Recorder. Special keys for multimedia keyboards are \nalso supported.\n\nCustomize global hot keys. You can assign a global hot key to any function provided by Total Recorder. Special keys for multimedia keyboards \nare also supported.\n\nChange the look and feel of Total Recorder&amp;#039;s main window using a skin. For more information on skins, refer to the Skins page.\n\nPerform batch processing. You can use batch processing to convert, normalize, split, rename, tag, apply add-ons, or perform other operations \non multiple files. For more information, see the Batch Processing Tutorial.\n\nExecute a command line after a file has been recorded or after a recording session has completed. This feature is available when recording in \nsplit mode and for a scheduling recording. \n\nPut your computer in standby or hibernate mode when an automatic job completes. \n\nSave a stereo file as a mono file with channel mixing. This can be used, for example, to save the left and right channels of a stereo file to \nseparate mono files. \n\nMerge multiple files into a single file. A period of silence can be inserted between the files or a fading effect can be applied to the files \nduring a merge. \n\nUse add-ons. Total Recorder supports add-ons that can be used for video recording, sound enhancements, mixing operations, integration with \niTunes/iPod, and for other purposes. Refer to the Add-ons page for information on the add-ons available.\n","torrent":{"xt":"urn:btih:d3875e6479fec84d18892d3acf9b487b031fd7fb","amp;dn":"Total+Recorder+Professional+V7.0+%28Including++Add-ons%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3875e6479fec84d18892d3acf9b487b031fd7fb","infoHashBuffer":{"type":"Buffer","data":[211,135,94,100,121,254,200,77,24,137,45,58,207,155,72,123,3,31,215,251]},"announce":[],"urlList":[]}}