{"title":"Living Colour - Cult Of Personality","uid":4841232,"size":171216900,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d42bf04b80a1c03f9f7143f7a0050701a385fafb&amp;dn=Living+Colour+-+Cult+Of+Personality&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"2nafish","files":-1,"time":1239512335,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Cult of Personality&quot; is a song by the funk metal band Living Colour and the lead single from their debut album, Vivid. The lyrics and melody were written by guitarist Vernon Reid, who wrote most of their songs. Its music video earned two MTV Video Music Awards for Best Group Video and Best New Artist. Released in 1989, &quot;Cult of Personality&quot; reached #13 on the Billboard Hot 100 and #9 on the Billboard Album Rock Tracks chart. It also won the Grammy award for &quot;Best Hard Rock Performance&quot; in 1989. The song was named the 69th best hard rock song of all time by VH1.\n\nThe song begins with an edited quote from the beginning of &quot;Message to the Grass Roots&quot;, a speech by Malcolm X. As it appears in the song, the quote is:\n\n    &quot;. . . And during the few moments that we have left, . . . We want to talk right down to earth in a language that everybody here can easily understand.&quot;\n\nThe unabridged beginning of the speech is:\n\n    &quot;...And during the few moments that we have left, we want to have just an off-the-cuff chat between you and me -- us. We want to talk right down to earth in a language that everybody here can easily understand.&quot;\n\nAt 4:35, John F. Kennedy is quoted, saying&quot;Ask not what your country can do for you,&quot; and the song ends with Franklin D. Roosevelt saying &quot;The only thing we have to fear is fear itself.&quot;\n\n&quot;Cult of Personality&quot; was performed live during the April 1, 1989 edition of Saturday Night Live with host Mel Gibson. It was also performed on The Arsenio Hall Show that same year.\n\nWWE wrestler CM Punk used this as one of his entrance themes while wrestling for Ring of Honor.\n\nIn 2004, a shortened version was featured in Grand Theft Auto: San Andreas soundtrack on Radio X.\n\nIn 2007, Living Colour re-recorded the song for the video game Guitar Hero III: Legends of Rock, with the re-recorded guitar solos being higher in tempo than on the original recording.\n\nIn 2009, the song was used by the WWE in a video promoting Stone Cold Steve Austin's induction into the WWE Hall of Fame.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:d42bf04b80a1c03f9f7143f7a0050701a385fafb","amp;dn":"Living+Colour+-+Cult+Of+Personality","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d42bf04b80a1c03f9f7143f7a0050701a385fafb","infoHashBuffer":{"type":"Buffer","data":[212,43,240,75,128,161,192,63,159,113,67,247,160,5,7,1,163,133,250,251]},"announce":[],"urlList":[]}}