{"title":"FIFA14.Middle.East.PAL.Xbox360.Biryani","uid":9032124,"size":8247390492,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:d4308ce811f98a2dcfac827b87c91485434f7926&amp;dn=FIFA14.Middle.East.PAL.Xbox360.Biryani&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"birbir","files":-1,"time":1381452072,"description":"Fifa 14 Middle east Edition!\n\nEnjoy playing fotball with the awesome commentary of Issam Chaouali.\n\nThis rip has full topology data!\n\nPlease run the iso in abgx360 Before you burn it on dvd!\n\n\n\nFIFA 14 comes fully loaded with all-new tweeks and enhanced engines to ensure that this years entry will be the most intuative and realistic to date.\nPure Shot: Shooting has been transformed. Players have the intelligence to adjust their stride and approach angle to find the best position for hitting the back of the net. Well-hit balls feel satisfying and goals are rewarding. As well as quality strikes, players can now shoot while off balance or rushed.\nReal Ball Physics: Strike the ball with more force and finesse. Realistic ball physics now determines the trajectories of balls in game, enabling players to strike the ball with force from distance, drill low rising shots with accuracy, and blast dipping or swerving shots, just like real footballers.\nProtect The Ball: Dominate midfield and dictate the tempo of a match. Fend-off and block defenders from the ball while dribbling at any speed. Protect the ball from opponents to control play through midfield and dictate the pace of the match. Plus, out-muscle opponents for position before receiving the ball, then turn defenders to carve out opportunities.\nTeammate Intelligence: Better decision-making delivers tighter, smarter marking and improved run tracking. Defenders recognize opportunities to provide support and win back possession. Attacking players have new ways to outsmart their opponents and break down tighter, more intelligent defences by creating space for themselves, running along the backline and checking their pace.\nSprint Dribble Turns: Utilize quick, explosive cuts and turns to beat defenders one-on-one while sprinting with the ball. Players can move in any direction, preserving their natural momentum and maintaining possession of the ball.\nVariable Dribble Touches: The First Touch Control of dribbling varies a player's touch when dribbling with pace. Skilled players have the touch and control to stand out while less skilled players will experience fewer perfect touches and more uncertainty dribbling, creating opportunities for defenders to win back possession, and placing emphasis on building play through midfield.\n2nd Chance Tackles: The tackling zone has been extended to enable defenders to combine different types of tackles, recover from missed tackles quickly, and have a second chance to compete for the ball in any tackling situation.\nCurling Lofted Through Balls: Players have the ability to curl the ball around opponents to deliver precision passes to teammates or send the ball into space.\nSkill Games: A competitive practice mode that enable players to learn or master the fundamental skills necessary to compete at FIFA 14. Become a better player, faster, no matter what your skill level, competing against yourself or friends in all-new mini-games.\nCareer Mode: Search for talent year-round with the new Global Scouting Network that brings the world of professional scouting to life. Develop and refine your own scouting network. Evaluate footballers to uncover the attributes of players who could bolster your squad during the transfer windows. A new hub delivers easy navigation, fewer interruptions and live scouting reports.\nComplete Authenticity: All the authenticity EA SPORTS is known for with officially licensed clubs, leagues and more than 15,000 players.\n\nEnjoy the game\n\n-Biryani!","torrent":{"xt":"urn:btih:d4308ce811f98a2dcfac827b87c91485434f7926","amp;dn":"FIFA14.Middle.East.PAL.Xbox360.Biryani","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4308ce811f98a2dcfac827b87c91485434f7926","infoHashBuffer":{"type":"Buffer","data":[212,48,140,232,17,249,138,45,207,172,130,123,135,201,20,133,67,79,121,38]},"announce":[],"urlList":[]}}