{"title":"Academy by Chad Leito - sam2085","uid":9038769,"size":409799,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d43529aa70367f516cac575b5508bf4c9921971e&amp;dn=Academy+by+Chad+Leito+-+sam2085&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"sam2085","files":-1,"time":1381571174,"description":"Academy by Chad Leito\n\nReview\nDo yourself a favor and buy this book! It is absolutely amazing! Best book I have read in a REALLY long time. I don't even know where to begin. It starts off sounding like it's going to be an apocalyptic type of novel. But, then it turns into something so strange and magical. I don't want to give a lot away, but let's just say that it involves angels, demons, sentient animals, people transforming into animals and maybe vice versa. There are a LOT of unknowns at this point, as this is only the first book in the series. The book says at the end that the next installment will be released on April 19th. I will be first in line to get it!!!\nThis book left me always on the edge of my seat, wanting more. The end was extremely suspenseful, and I am actually feeling bit of anxiety that I will have to wait a few weeks for the next one. I HIGHLY recommend this book to anyone. Normally, I would say to anyone who likes suspense, or anyone who likes fantasy, etc.. But with this book, I really mean ANYONE! OH! I almost forgot to tell you... The author gives all of his proceeds to a non-profit called Doctors Without Borders. They provide medical supplies to people in need. So, by purchasing this book, everyone wins! You get an amazing book to read, and people in need get the medical supplies they need to get better. Win-Win!\n\n &lt;a href=&quot;\nhttps://www.goodreads.com/book/show/17788404-the-academy&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.goodreads.com/book/show/17788404-the-academy&lt;/a&gt;\n\n\ngoogle sam2085 kickass to find my other torrents\n\nTo quicky convert between formats like MOBI, EPUB, AZW3, TXT or PDF\nuse http://calibre-ebook.com/download or http://www.online-convert.com/\n\nComment if you cannot find seeds! I'm always seeding my uploads unless my pc is off.","torrent":{"xt":"urn:btih:d43529aa70367f516cac575b5508bf4c9921971e","amp;dn":"Academy+by+Chad+Leito+-+sam2085","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d43529aa70367f516cac575b5508bf4c9921971e","infoHashBuffer":{"type":"Buffer","data":[212,53,41,170,112,54,127,81,108,172,87,91,85,8,191,76,153,33,151,30]},"announce":[],"urlList":[]}}