{"title":"Lo-Fang - Blue Film (2014) [FLAC]","uid":9659401,"size":246710542,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d468cb636d35540745232a292b177f87143e4bd9&amp;dn=Lo-Fang+-+Blue+Film+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1393247271,"description":"\n  Lo-Fang - Blue Film (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Pop, Singer/Songwiter\n  Source: WEB\n  Codec: FLAC\n  Bitrate: ~ 900 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 KHz\n\n  01 Look Away \n  02 Boris \n  03 When We're Fire \n  04 Light Year \n  05 Blue Film \n  06 Interlude \n  07 #88 \n  08 Intro\n  09 Animal Urges \n  10 Confusing Happiness \n  11 You're the One That I Want \n  12 Permutations \n\n  Blue Film, Matthew Hemerlein's intense, intimate debut album as Lo-Fang, was inspired by a mixtape, and the free-flowing blend of sounds on these songs retains some of that feel. Encompassing R&amp;B, synth-pop, orchestral and folk music -- sometimes within the same song -- Hemerlein loves and excels at striking juxtapositions. He makes ukulele and heavy synth bass sound not just natural but seductive on the album's title track, and peppers the set with string-laden interludes that reflect his classical training. Blue Film expands on Lo-Fang's singles, which are still highlights: &quot;Look Away&quot;'s claustrophobic voyeurism morphs from sleek to earthy to refined effortlessly, setting the tone for the rest of the album; &quot;#88,&quot; a symphonic, seven-minute epic, is even more ambitious. Meanwhile, the bubbling, R&amp;B-inspired &quot;Light Year&quot; and &quot;Animal Urges,&quot; which boasts a chorus that could grace a top 40 hit, only feel like singles. Hemerlein uses the rest of Blue Film to expand on his songwriting voice, which is just as unique as the way he combines sounds. \n\n  True to the album's title, Hemerlein doesn't shy away from the more lurid side of human nature. His songs often reside in unsettling grey areas, whether it's &quot;Confusing Happiness&quot;' obsessions (&quot;I can dream you in detail&quot;) or the distance that can creep into even the most intimate moments on &quot;When We're Fire.&quot; However, Blue Film's most striking example of this might be a cover: Lo-Fang's version of &quot;Boris,&quot; first done by the female singer-songwriter duo BOY, may be more disturbing than the original; having a man sing the predatory come-ons that inspired the song in the first place blurs the lines between flirting and harassment even more chillingly. As dark as the album gets, Hemerlein manages to preserve the humanity of his songs -- there's a warmth to his voice and a brightness to his music that makes the disturbing places he explores a little more relatable. Blue Film's other cover, a somber rendition of the Grease favorite &quot;You're the One That I Want,&quot; narrowly avoids parody and serves as a reminder that there's a fine line between ambition and indulgence. Even so, Blue Film is an often unforgettable introduction.","torrent":{"xt":"urn:btih:d468cb636d35540745232a292b177f87143e4bd9","amp;dn":"Lo-Fang+-+Blue+Film+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d468cb636d35540745232a292b177f87143e4bd9","infoHashBuffer":{"type":"Buffer","data":[212,104,203,99,109,53,84,7,69,35,42,41,43,23,127,135,20,62,75,217]},"announce":[],"urlList":[]}}