{"title":"Parliament - Funkentelechy Vs. the Placebo Syndrome 320cbr (Big ","uid":9475271,"size":107204193,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d4904ca6c4803468e698b44ee110f1ea744f585b&amp;dn=Parliament+-+Funkentelechy+Vs.+the+Placebo+Syndrome+320cbr+%28Big+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1389679254,"description":"Source: 1980 CD\n\nThe review below by Patrick brings tears to Big Papi's eyes. That guy knows music. He ain't no tourist. Please seed in honor of that guy - Big Papi\n\n\n\n\n\nBy Patrick\nIn 1983, at 11 years old, music was already a major part of my life. In Jr. High School everyone was either listening to Culture Club, Huey Lewis, or Lionel Richie, while I was in the dusty stacks pulling stuff like U-Roy, Fatback Band and Trouble Funk from my childhood Mecca, the KLAATU record shop in Heidelberg, Germany.\n\nThen one day at the Library (of all places), I uncovered the craziest album I'd ever seen or heard; whacked-out pimpadelic alien motherfletchers brandishing Bop Guns at Sir Nose (D'Void of Funk? What the Fu-?). Man, I had no idea I was about to be recruited to be a soldier in the Army for Uncle Jam.\n\nBut there it was, from the massive horns, to the heart puncturing bass, building up and breaking down all the preconcieved notions I had about music. Now, 23-years later, we all know that this is one of the definitive dance records, so I won't even bother to go into tracks like Bop-Gun and Flashlight, because if you're here looking this album up, you've probably already heard those tracks. &quot;Wizard of Finance&quot;, my second favorite track, feels like it jumped over from a Funkadelic album, and no matter where you are, or what you're doing, you MUST sing along when it comes on.\n\nBut, through all the dance-able tracks, the one that really got me was that swampy groove of &quot;Placebo Syndrome&quot;. This, to me, was the hamhock in my cornflakes. This was the template that I would later require of all my &quot;lay-back, smoke-some-sheeba and ut-the-headphones-on-ten&quot; jams like Bootsy's &quot;Sacred Flower&quot; &amp; &quot;I'd Rather Be With You&quot;, or Funkadelic's &quot;I'll Stay&quot; and &quot;Maggot Brain&quot;. The sweet Parlet harmony crossed with the rasp of Gary and that Synth whine still strikes a chord with me.\n\nSo there you have it, when it comes to the party, there is none better, but when the party's over, and your girl's passed out next to you, put on the phones and groove to Placebo one last time before drifting off to visit the Mother Ship.","torrent":{"xt":"urn:btih:d4904ca6c4803468e698b44ee110f1ea744f585b","amp;dn":"Parliament+-+Funkentelechy+Vs.+the+Placebo+Syndrome+320cbr+%28Big+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4904ca6c4803468e698b44ee110f1ea744f585b","infoHashBuffer":{"type":"Buffer","data":[212,144,76,166,196,128,52,104,230,152,180,78,225,16,241,234,116,79,88,91]},"announce":[],"urlList":[]}}