{"title":"A Library of Gnosticism","uid":4713939,"size":29418921,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d51f728c5ffe1c86273b7e4044bbe17009fbdfdb&amp;dn=A+Library+of+Gnosticism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"timnehguy","files":11,"time":1234189643,"description":"A Library of Gnosticism\n\nThe gnostics - religious thinkers engaged in the quest for wisdom and knowledge - believed salvation could be found through mystical knowledge and intuition. Gnosticism's Christian form grew to prominence in the 2nd century A.D. Ultimately denounced as heretical by the early church, Gnosticism proposed a revealed knowledge of God (&quot;gnosis&quot; meaning &quot;knowledge&quot; in Greek), held as a secret tradition of the apostles. There has been a revival of interest in Gnosticism (yes, the g is silent) in recent years, thanks largely to the work of Elaine Pagels.\n\nI decided to put several works together in a library of solid reference materials which even a layperson such as I can enjoy. Take what you want, seed as you can.\n\n*****\n\nThe Gnostic Bible\nEdited by Willis Barnstone and Marvin Meyer\n871 pp., PDF\n\nThis book may well be the most comprehensive collection of Gnostic materials ever gathered in one volume. The bulk of the text is taken up with primary sources, which are drawn from three continents and span thirteen centuries, organized into various schools of Gnostic tradition: Sethian, Valentinian, Syrian, Hermetic, Mandaean, Manichaean, and--in an unusual move--relatively late Islamic and Cathar texts. \nEach grouping of texts is preceded by a brief introduction to that particular section's brand of Gnosticism. What is clear from this sourcebook is the tremendous diversity of thought that exists under the &quot;Gnostic&quot; umbrella, including Christian, Jewish, Muslim, pagan, Zoroastrian and Greco-Roman themes. Many of the texts are published in this book in English for the first time, making this a valuable resource for students and scholars. \n\n*****\n\nThe Gnostic Gospels\nby Elaine Pagels\n224 pp., PDF\n\nElaine Pagels suggests that Christianity could have developed quite differently if Gnostic texts had become part of the Christian Bible. Gnosticism celebrates God as both Mother and Father, shows a very human Jesus's relationship to Mary Magdalene, suggests the Resurrection is better understood symbolically, and speaks to self-knowledge as the route to union with God. Pagels argues that Christian orthodoxy grew out of the political considerations of the day, to legitimize and consolidate early church leadership. Her contrast of orthodoxy with Gnostic teachings presents an intriguing trajectory on a world faith as it &quot;might have been.&quot; The Gnostic Gospels provides engaging reading for those seeking a broader perspective on the early development of Christianity.\n\n*****\n\nThe Nag Hammadi Library\nby James M. Robinson\n297 pp., PDF\n\nUnearthed in 1945 near the town of Nag Hammadi in Upper Egypt, these texts literally begin where the Dead Sea Scrolls end. Their discovery is equally significant, bringing to light a long-hidden well of new information, sources, and insights into early Judaism and the roots of Christianity. Each text is accompanied by a new and expanded introduction. Also included are a revised general introduction and an afterword discussing the modern relevance of Gnosticism, from Voltaire and Blake through Melville and Yeats to Jack Kerouac and science fiction writer Philip K. Dick. \nIncluded in these texts are The Gospel of Thomas, The Gospel of Philip, The Gospel of Truth, The Gospel of Mary and other gospel contenders (alas, in fragmentary form--the translation in this volume however is the complete Nag Hammadi text). The Gospel of Thomas has perhaps been the highest profile text from Nag Hammadi; it has been translated and commented upon extensively, particularly in modern scholarship which discusses gospel development. \n\n*****\n\nThe Apostolic Fathers with Justin Martyr and Irenaeus\nby Philip Schaff\n\n1079 pp., PDF\n\nSt Irenaeus's best-known book is Against Heresies, a detailed attack on Gnosticism, which was then a serious threat to the Church, and especially on the system of the Gnostic Valentinus. As the first great apologist and theologian, he emphasized that the only way for Christians to retain unity was to humbly accept one doctrinal authority--councils of bishops. Unfortunately, this enemy of the Gnostics is our best (in some instances, only) source of information.\n\n*****\n\nThe Challenges of the Gnostics\n13 pp., PDF\n\nAn introduction to Gnosticism (and the author's necktie) that I found years ago. Strangely, it seems to come from a Sunday school lesson.\n\n*****\n\nGospel of Thomas\n16 pp., PDF\nThe text of the Gospel of Thomas\n\n*****\n\nGospel of Thomas audiobook\nThomas 1, Thomas 2, Thomas 3\nAn MP3 audiobook of the Gospel of Thomas. Each of the three files is about nine minutes long.\n\nCheck my torrents for other reference works on religion and spirituality. ","torrent":{"xt":"urn:btih:d51f728c5ffe1c86273b7e4044bbe17009fbdfdb","amp;dn":"A+Library+of+Gnosticism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d51f728c5ffe1c86273b7e4044bbe17009fbdfdb","infoHashBuffer":{"type":"Buffer","data":[213,31,114,140,95,254,28,134,39,59,126,64,68,187,225,112,9,251,223,219]},"announce":[],"urlList":[]}}