{"title":"Kopanito All-Stars Soccer v0.5.0","uid":13381065,"size":296162922,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d533ccde09a13a4cef9d114067c0009edb172ad9&amp;dn=Kopanito+All-Stars+Soccer+v0.5.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dauphong","files":1,"time":1454278921,"description":"Skill-based gameplay\r\nIt may not look serious, but we guarantee, that it is. Kopanito's match engine is well-balanced. Use slide tackle to intercept passes or knock-down opponents (or even score a goal!). Pass the ball straight to your teammates (ground or air) or pass the ball between opponents. Score goals using chip shots or by swerving the ball using slow-motion shots. There are various set pieces, like corner kicks or throw-ins too, but no rules apart from that! Don’t forget, it is a fast-paced game - it might be funny and cartoonish, but it’s not that easy. Try it yourself!\r\nTry it with your friends\r\nThere is support for up to 5 controllers (4 gamepads + keyboard). Try the game with your buddies in a friendly match in various game modes – in any desired combination including 5 vs AI game or play in cooperation through a tournament.\r\nCrush your opponent with a super-move\r\nIf you play well-enough, you will be awarded with a super-move. Then you can pull the ball using a super-strong magnet (because why not) or teleport into a different spot on the field, activate a big windmaker to blow things out of your goal-line or perform a super-shot and knockout opponents down on the path of the ball. Oh, more crazy super-moves are coming!\r\nAI won’t let you rest\r\nFour different difficulty levels. The easiest one is a child's play, while the last one... you'll pull your hair out trying to beat the game. Also, there’s a practice mode if you just want to learn basic moves.\r\nMany competitions to complete and teams to unlock\r\nWe focus on diversity. Complete 16 tournaments and leagues in different parts of the world with regional national teams. A tournament consist of a group stage and knockout stage. In a league we apply a round-robin system. Depending on the type of event, there can be 12, 16, 24 or more teams competing. You can choose from 100+ national teams (even the most exotic ones) from all over the world and play on 7 stadiums.\r\nModders are welcome\r\nWe've opened stadiums, balls and teams for modding. You can add a new stadium or ball by just editing one of the built-in ones. Steam Workshop support coming soon!\r\nBringing back memories\r\nWe want to bring back memories. Kick Off, Sensible Soccer and Nintendo World Cup – we all remember times when we played these games and these titles were our inspiration. Motives from these games were seasoned with a solid dose of incredibility, just to add some flavor and – most of all – joy","torrent":{"xt":"urn:btih:d533ccde09a13a4cef9d114067c0009edb172ad9","amp;dn":"Kopanito+All-Stars+Soccer+v0.5.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d533ccde09a13a4cef9d114067c0009edb172ad9","infoHashBuffer":{"type":"Buffer","data":[213,51,204,222,9,161,58,76,239,157,17,64,103,192,0,158,219,23,42,217]},"announce":[],"urlList":[]}}