{"title":"Yoga Adjustments (ePUB,Retail){32Skulls}","uid":10884584,"size":29812153,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d54959f453c65cdc9430cc2ab3ac882227736583&amp;dn=+Yoga+Adjustments+%28ePUB%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"32Skulls","files":-1,"time":1409068070,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\n\n\n\n\nThe quintessential guide to yoga assisting and hands-on teaching, Yoga Adjustments introduces the art and practice of providing yoga assists to yoga students. Addressing one of the most important topics in the yoga field, expert yoga instructor and best-selling author Mark Stephens covers the philosophy of yoga practice, the sensibilities of touch in teaching yoga and improving alignment, the seven principles of hands-on yoga teaching, and the twenty-five most effective methods of tactile cueing. An invaluable resource for all yoga teachers, teacher trainers, and serious yoga students, this book includes a foreword by yoga star Shiva Rea as well as over 850 unique instructional photos and explanatory captions demonstrating precise ways of guiding a variety of flowing sequences.\n\nOpening with an in-depth discussion of the philosophy of yoga assisting, Part I--Foundations describes the methods and techniques of giving yoga assistance, with detailed discussions of all of the elements of yoga assisting including communicating with students, qualities of touch, the five basic steps of providing hands-on cues, hands-on positioning and stance. \n\nPart II--Applications demonstrates how to assist students in each of over 100 postures in the seven families of asanas (poses). Each chapter begins with background on an asana family and close consideration of its foundation asana. Each asana is presented in a two-page spread with photos that show how to give students effective guidance and support. Part III--Evolution offers thoughts on the further development of yoga in the twenty-first century.\n\n\nBy Mark Stephens\nPublished by North Atlantic Books in 2014\nEPUB, Retail, 400 pages, English \n","torrent":{"xt":"urn:btih:d54959f453c65cdc9430cc2ab3ac882227736583","amp;dn":"+Yoga+Adjustments+%28ePUB%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d54959f453c65cdc9430cc2ab3ac882227736583","infoHashBuffer":{"type":"Buffer","data":[213,73,89,244,83,198,92,220,148,48,204,42,179,172,136,34,39,115,101,131]},"announce":[],"urlList":[]}}