{"title":"Clean Rail Transportation Options - Ibrahim Dincer et al.","uid":15357700,"size":18496391,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d58e767db72706d5c5a5bf132b4950a2fecb7416&amp;dn=Clean+Rail+Transportation+Options+-+Ibrahim+Dincer+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1468995464,"description":"Clean Rail Transportation Options - Ibrahim Dincer et al. (Springer, 2016).pdf\r\n\r\nISBN 978-3-319-21725-3\r\n\r\nThis book will assess and compare several options for ammonia co-fueling of diesel locomotives with integrated heat recovery, multigeneration (including on-board hydrogen fuel production from ammonia), and emission reduction subsystems from energy, exergy, and environmental perspectives. Economic considerations will be presented to compare the cost of the proposed systems for different scenarios such as carbon-tax rates, diesel fuel cost and ammonia cost.\r\n\r\nFossil fuel consumption and the associated negative environmental impact of their combustion is a significant global concern that requires effective, practical, and sustainable solutions. From a Canadian perspective, the Transportation Sector contributes more than 25% of national greenhouse gas emissions due to fossil fuel combustion, largely due to road vehicles (cars, light and heavy duty trucks). This is a complex and critical challenge to address, particularly in urban areas with high population density. There is a need to develop alternative energy solutions for mass passenger and freight transportation systems that will reduce both the traffic-volume of road vehicles as well as the emissions from the mass transportation systems. The book will be helpful to students in senior-level undergraduate and graduate level courses related to energy, thermodynamics, thermal sciences, combustion, HVAC&amp;R, etc. The quantitative comparative assessment of such alternative energy systems provided by this book will be useful for researchers and professionals interested sustainable development","torrent":{"xt":"urn:btih:d58e767db72706d5c5a5bf132b4950a2fecb7416","amp;dn":"Clean+Rail+Transportation+Options+-+Ibrahim+Dincer+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d58e767db72706d5c5a5bf132b4950a2fecb7416","infoHashBuffer":{"type":"Buffer","data":[213,142,118,125,183,39,6,213,197,165,191,19,43,73,80,162,254,203,116,22]},"announce":[],"urlList":[]}}