{"title":"Mindy Kaling - Why Not Me? - Audiobook MP3","uid":12425438,"size":143207397,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d5ff0f6fa867ac67fbfb8bdf2cde16d57ed21782&amp;dn=Mindy+Kaling+-+Why+Not+Me%3F+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Squiddy82","files":5,"time":1442367119,"description":"Android users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\n\nWhy Not Me?\n\nWritten by: Mindy Kaling\nNarrated by: Mindy Kaling, Greg Daniels, B.J. Novak\nLength: 4 hrs and 57 mins\nUnabridged Audiobook\nRelease Date:09-15-15 \n\nIn Why Not Me? Kaling shares her ongoing journey to find contentment and excitement in her adult life, whether it's falling in love at work, seeking new friendships in lonely places, attempting to be the first person in history to lose weight without any behavior modification whatsoever, or, most important, believing that you have a place in Hollywood when you're constantly reminded that no one looks like you.\n\nIn &quot;How to Look Spectacular: A Starlet's Confessions&quot;, Kaling gives her tongue-in-cheek secrets for surefire on-camera beauty (&quot;Your natural hair color may be appropriate for your skin tone, but this isn't the land of appropriate - this is Hollywood, baby. Out here, a dark-skinned woman's traditional hair color is honey blonde&quot;). &quot;Player&quot; tells the story of Kaling being seduced and dumped by a female friend in LA (&quot;I had been replaced by a younger model. And now they had matching bangs&quot;). In &quot;Unlikely Leading Lady&quot;, she muses on America's fixation with the weight of actresses (&quot;Most women we see onscreen are either so thin that they're walking clavicles or so huge that their only scenes involve them breaking furniture&quot;). And in &quot;Soup Snakes&quot;, Kaling spills some secrets on her relationship with her ex-boyfriend and close friend B. J. Novak (&quot;I will freely admit: my relationship with B. J. Novak is weird as hell&quot;).\n\nMindy turns the anxieties, the glamour, and the celebrations of her second coming of age into a laugh-out-loud funny collection of essays that anyone who's ever been at a turning point in their life or career can relate to. And those who've never been at a turning point can skip to the parts where she talks about meeting Bradley Cooper","torrent":{"xt":"urn:btih:d5ff0f6fa867ac67fbfb8bdf2cde16d57ed21782","amp;dn":"Mindy+Kaling+-+Why+Not+Me%3F+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5ff0f6fa867ac67fbfb8bdf2cde16d57ed21782","infoHashBuffer":{"type":"Buffer","data":[213,255,15,111,168,103,172,103,251,251,139,223,44,222,22,213,126,210,23,130]},"announce":[],"urlList":[]}}