{"title":"Historical Dictionary of the Vikings - Katherine Holman [2003]","uid":9972992,"size":4525307,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d67617fe95e582935b05be6923d981ef05ae7ef0&amp;dn=Historical+Dictionary+of+the+Vikings+-+Katherine+Holman+%5B2003%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"RUSuser","files":1,"time":1397653500,"description":"The Historical Dictionary of the Vikings traces Viking activity in Europe, North America, and Asia for over three centuries. During this period people from Scandinavia used their longships to launch lightning raids upon their European neighbors, to colonize new lands in the east and west, and to exchange Scandinavian furs for eastern wine and spices and Arab silver. The Viking age also saw significant changes at home in Scandinavia - kings extended their power, Norse paganism lost ground to christianity, and new towns and ports thrived as a result of increased contact with the wider world. This book provides a comprehensive work of reference for people interested in the Vikings, including entries on the main historical figures involved in this dramatic period, important battles and treaties, significant archaeological finds, and key works and sources of information on the period. It also summarizes the impact the Vikings had on the areas where they traveled and settled. There is a chronological table, detailed and annotated bibliographies for different themes and geographical locations, and an introduction discussing the major events and developments of the Viking age.","torrent":{"xt":"urn:btih:d67617fe95e582935b05be6923d981ef05ae7ef0","amp;dn":"Historical+Dictionary+of+the+Vikings+-+Katherine+Holman+%5B2003%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d67617fe95e582935b05be6923d981ef05ae7ef0","infoHashBuffer":{"type":"Buffer","data":[214,118,23,254,149,229,130,147,91,5,190,105,35,217,129,239,5,174,126,240]},"announce":[],"urlList":[]}}