{"title":"Doctor Who - Season 10 - (1972-73) - 26 Episodes","uid":9086679,"size":2194656098,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d6b194feb5ce0b94a218908a2e4b20b429d56b69&amp;dn=Doctor+Who+-+Season+10+-+%281972-73%29+-+26+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"bnaron","files":26,"time":1382504010,"description":"The tenth season of British science fiction television series Doctor Who began on 30 December 1972 with the 10th anniversary special The Three Doctors, and ended with Katy Manning's final serial The Green Death on 23 June 1973. Jon Pertwee continues his role as the Third Doctor, and Jo Grant played by Katy Manning makes her final appearance in The Green Death. Previous Doctors William Hartnell and Patrick Troughton return to play the First Doctor and the Second Doctor. Nicholas Courtney, John Levene and Richard Franklin continue their roles of Brigadier Lethbridge-Stewart, Sergeant Benton and Captain Mike Yates respectively. Roger Delgado makes his final appearance as the The Master in Frontier in Space. Delgado died in a car crash in Turkey shortly after the story's transmission.\n\nAt the conclusion of The Three Doctors, the Doctor is finally released from his sentence of exile by the Time Lords, enabling him to travel through time and space once again. This ends the cycle of mostly Earth-bound stories where the Doctor was stranded that began at the conclusion of The War Games in 1969. The serials Frontier in Space and Planet of the Daleks both feature the Daleks and lead directly from the first into the second, forming a rough twelve-part epic.\n\n1.  Carnival of Monsters - Four Episodes\n\n    Synopsis: Gallifrey, home planet of the Time Lords is under\n    siege, by an unknown force. The only person who can help\n    them is the Doctor, but even he will need assistance from\n    his previous incarnations. \n\n2.  Carnival of Monsters - Four Episodes\n\n    Synopsis: The TARDIS materializes on the SS Bernice, a ship\n    that suddenly disappeared while traveling the Indian Ocean. \n\n3.  Frontier in Space - Six Episodes\n\n    Synopsis: Materializing on an Earth cargo spaceship, the\n    Doctor is caught up in the tensions between the Earth and\n    Draconian Empires. \n\n4.  Planet of the Daleks - Six Episodes\n\n    Synopsis: The Time Lords have landed the TARDIS on the\n    planet Spiridon, where the Daleks are awakening the biggest\n    Dalek army the galaxy has ever seen.\n\n5.  The Green Death - Six Episodes\n\n    Synopsis: Mutated giant maggots are appearing all over the\n    Welsh countryside, could Global Chemicals be behind it? \n","torrent":{"xt":"urn:btih:d6b194feb5ce0b94a218908a2e4b20b429d56b69","amp;dn":"Doctor+Who+-+Season+10+-+%281972-73%29+-+26+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6b194feb5ce0b94a218908a2e4b20b429d56b69","infoHashBuffer":{"type":"Buffer","data":[214,177,148,254,181,206,11,148,162,24,144,138,46,75,32,180,41,213,107,105]},"announce":[],"urlList":[]}}