{"title":"JAZZ-Terence Blanchard- Flow","uid":3345884,"size":175713059,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d6b8cadfa464c171cb7ea166d93f892cfa283e15&amp;dn=JAZZ-Terence+Blanchard-+Flow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"sirithanan","files":12,"time":1119079729,"description":"Lame 3.96, vbr 320, 167 mb total\n\nPersonnel: \nTerence Blanchard: trumpet, synth programming; \nBrice Winston, tenor and soprano saxophone, Yamaha WX5; \nLionel Loueke: guitar, vocals; \nAaron Parks: piano (#2,3,5,8,9,11); \nHerbie Hancock: piano (#4,7); \nDerrick Hodge: bass; \nKendrick Scott: drums; \nHoward Drossin: synth programming (#11); \nGretchen Parlato: vocals (#8,9)\n\n\n\n\nTwo years ago, Terence Blanchard documented his jump from Sony Classical to Blue Note with an album titled Bounce. This year's sequel is just as aptly and succinctly named: Flow not only flows but also shows what's possible when a band &quot;has&quot; flow. Blanchard has crafted a stirring and soulful contemporary outing and one of the strongest albums of his distinguished career.\n\nFlow is, start to finish, an ensemble effort. Each of Blanchard's musicians plays a critical role in the group's expansive sound, and each contributes a song or two. Lionel Loueke, Blanchard's former charge at the Thelonious Monk Institute, delivers the session's most distinctive number, a nearly 15-minute long &quot;Wadagbe&quot; that convincingly bridges the gap between West African folk forms, spacious postbop and 21st-century groove. The most purely evocative piece comes from the pen of bassist Derrick Hodge: &quot;Over There&quot; begins as a quiet lament and gradually builds to a fever pitch, its cinematic cadence provoking a monumental and expressive solo from Blanchard. Saxophonist Brice Winston provides the most intricate theme, a Herbie Hancock ode called &quot;Child's Play.&quot;\n\nHancock is more than a spectre here. The pianist sits in on Loueke's &quot;Benny's Tune&quot; and, more spectacularly, on drummer Kendrick Scott's &quot;The Source.&quot; He also produced the album, which explains its occasional Mwandishi vibe. But make no mistake: Blanchard runs this show. What's even more impressive than his stalwart musicianship is his evident leadership. Flow announces the maturation of a real band-now one of the finest on the scene. \n\n\n\nTrack Listing: \n1. Flow part I \n2. Wadagbe (intro) \n3. Wadagbe \n4. Benny's Tune \n5. Wandering Wonder \n6. Flow part II \n7. The Source \n8. Over There \n9. Child's Play \n10. Flow part III \n11. Harvesting Dance","torrent":{"xt":"urn:btih:d6b8cadfa464c171cb7ea166d93f892cfa283e15","amp;dn":"JAZZ-Terence+Blanchard-+Flow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6b8cadfa464c171cb7ea166d93f892cfa283e15","infoHashBuffer":{"type":"Buffer","data":[214,184,202,223,164,100,193,113,203,126,161,102,217,63,137,44,250,40,62,21]},"announce":[],"urlList":[]}}