{"title":"OfficeSuite Pro 7 (PDF &amp; HD) v7.2.1336 - Cyclonoid","uid":8823306,"size":27541049,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:d6ebad2157f168566275bd43615efd30fe71a67b&amp;dn=OfficeSuite+Pro+7+%28PDF+%26amp%3B+HD%29+v7.2.1336+-+Cyclonoid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"cyclonoid","files":-1,"time":1376759090,"description":"OfficeSuite Pro 7 (PDF &amp; HD) v7.2.1336\n\nRequirements: 2.2 and up\n\nThe world's No. 1 mobile office today!\n\n\n# Installed on over 100 million devices in more than 205 countries\n# Over 40,000 registrations per day\n# No. 1 app in Google Play Business category\n\nMade by MobiSystems, OfficeSuite Pro allows you to view, create, edit, print and share Word, Excel and PowerPoint files on the go. You can also open attachments and see PDF files on an Android based phone or tablet with our feature-rich mobile office solution.\n\nOfficeSuite Pro includes a File Browser and integration with Cloud service leaders: Box, DropBox, Google Drive, SkyDrive and SugarSync to give users a multitude of options on how to manage files and attachments.\n\n---OfficeSuite Pro 7 Out Now! New Features---\n\n* New and improved UI\n* Side bar navigation in the File Browser for quick access to different folders and remote third party cloud services\n* Templates - OfficeSuite Pro 7 users can benefit from a wide range of templates, from Resume and Invoice templates to Travel Planner and Weight Loss Tracker templates, among others\n* Extended Cloud support - now compatible with Microsoft SkyDrive. Google Drive support has been improved, by adding folder support, thus allowing for optimized document view\n\nDocs Editor:\n* Styles - apply MS Word styles or styles used in the document\n* Table design - ability to fashion an inserted table as per our library of tailor-made designs\n* Formulas (display only)\n* Format painter \n\nSpreadsheet Editor:\n* Improved selection of parameters in functions\n\nSlides Editor:\n* Animations \n\nPDF Viewing:\n* A new PDF engine using library from Adobe, providing instant opening of large PDF files\n* Find/Find Next \n\n--File Formats Supported--\n* Text format - DOC, DOCX, DOCM, RTF, TXT, LOG\n* Spreadsheet - XLS, XLSX, XLSM, CSV \n* Presentation - PPT, PPTX, PPS, PPSX, PPTM, PPSM\n* Other formats - PDF, EML, ZIP\n\n--Easy File Access and Sharing--\n* With the integrated File Browser you can easily access, modify and share your local or Cloud stored files. OfficeSuite integrates with Google Drive, DropBox, Box, SugarSync and SkyDrive\n* Easily open email attachments \n* Work with Outlook EML files\n* Share documents via Email or Bluetooth\n\n--Intuitive and Intelligent Design--\n* OfficeSuite 7 comes with new intuitive design and user experience allowing quick and intuitive workflow while you manage your files or create and modify documents.\n* New side bar gives instant access to local and cloud stored files.\n* Two-finger zoom, multi-touch support, context toolbars and popup menus make your work with OfficeSuite quick and fun.\n\n--OfficeSuite Extensions--\n* QuickSpell - fully integrated with OfficeSuite Pro QuickSpell will help you dramatically improve your typing accuracy.\n* Font Pack - allows you to use Microsoft most used fonts in OfficeSuite text documents.\n* Note that OfficeSuite Extensions are sold separately. Purchasing any of the extensions is optional.\n\nCompatible with Sony Ericsson LiveDockT Multimedia station.\ncom.sonyericsson.extras.ATTACHED\n\n\nWhat's in this version:\nVersion 7.2.1336(Updated : Aug 16, 2013)\n\n* Support for DOCM, XLXM and PPTM attachments\n* Optimized saving after document recovery\n* Encrypted documents thumbnail not allowed in OfficeSuite widget\n* Updated PDF engine\n* Annotations in PDF files\n* OfficeSuite users will be able to create Evernote notes with document attachments     and to look up Evernote notes for a text selection\n* Ability to insert shapes in Word\n* Export spreadsheets to PDF\n* Digital keyboard in Excel\n* Ability to insert shapes\n* Printing to HP printers (requires HP ePrint)\n\n\nMore Info:\n  &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.mobisystems.editor.office_registered&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.mobisystems.editor.office_registered&lt;/a&gt;","torrent":{"xt":"urn:btih:d6ebad2157f168566275bd43615efd30fe71a67b","amp;dn":"OfficeSuite+Pro+7+%28PDF+%26amp%3B+HD%29+v7.2.1336+-+Cyclonoid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6ebad2157f168566275bd43615efd30fe71a67b","infoHashBuffer":{"type":"Buffer","data":[214,235,173,33,87,241,104,86,98,117,189,67,97,94,253,48,254,113,166,123]},"announce":[],"urlList":[]}}