{"title":"Astrud Gilberto - A Certain Smile, A Certain Sadness (1965)","uid":5500168,"size":71610764,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d70830732b8ffc42831255037dfde9310992341e&amp;dn=Astrud+Gilberto+-+A+Certain+Smile%2C+A+Certain+Sadness+%281965%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"artpepper","files":-1,"time":1271496081,"description":"Astrud Gilberto &amp; Walter Wanderly - A Certain Smile, A Certain Sadness (1965)\n\n\n\n\n\n\n\nAstrud Gilberto, The Girl From Ipanema, needs little introduction. She single-handedly brought the nonchalant 'Vaga' vocal style of the Brasilian New Wave to international attention and launched a thousand indie-girl records and fantasies.\n\nMany consider this her finest album (although @artpepper thinks it's a toss-up between this and her work with Stan Getz). \n\nHere we have a collaboration with the Space Age, Jetsons-go-Bossa sound of Walter Wanderley, Brasil's finest organist/arranger and his excellent trio, augmented by American percussionist Bobby Rosengarden (of Miles Davis fame) and Bossa Nova master Joao Gilberto on guitar.\n\n\nThe wonderfully erotic vaga stylings of the timeless Astrud whisper over the Sci-Fi bachelor party soundscapes and laid-back arrangements of Walter Wanderley and his Trio, which featured the talents of Wanderley on organ &amp; piano; Claudio Slon--drums, Jose Marino--bass. Astrud Gilberto, vocals; Bobby Rosengarden, percussion and last but not least, Joao Gilberto (who, along with his friend Antonio Carlos Jobim, virtually invented Bossa Nova) on guitar. ","torrent":{"xt":"urn:btih:d70830732b8ffc42831255037dfde9310992341e","amp;dn":"Astrud+Gilberto+-+A+Certain+Smile%2C+A+Certain+Sadness+%281965%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d70830732b8ffc42831255037dfde9310992341e","infoHashBuffer":{"type":"Buffer","data":[215,8,48,115,43,143,252,66,131,18,85,3,125,253,233,49,9,146,52,30]},"announce":[],"urlList":[]}}