{"title":"Evaluation Beyond Exams in Nursing Education [PDF] [StormRG]","uid":11141835,"size":3300882,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d72271bdfe3ac5ef54ab7b766f105ef1ec55eb39&amp;dn=Evaluation+Beyond+Exams+in+Nursing+Education+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"0xmovva","files":2,"time":1412182272,"description":"Author: Robin Donohoe Dennison , John Rosselli, Anita Dempsey\nPaperback: 240 pages\nPublisher: Springer Publishing Company; 1 edition (July 29, 2014)\nLanguage: English\nISBN-10: 0826127088\nISBN-13: 978-0826127082\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds forthe seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nHelps educators to design assignments and rigorous rubrics that truly measure student learning objectives\n\nThe ability of students to pass an examination does not necessarily reflect or guarantee their ability to apply knowledge in practice, nor are traditional exams a sufficient means to evaluate all learning objectives. Written for both new and seasoned nurse educators, this book is unique in its provision of rigorous rubrics that fully take into account learning objectives and the teaching-learning process, and promote objective grading. It examines a variety of time-tested, alternative evaluation methods, discusses how to design them, and includes best practices for using them.\n\nThe book provides an overview of how evaluation and rubrics play an integral part within the larger nursing education teaching-learning process. It helps educators clearly define learning objectives and desired outcomes, and how to evaluate them. The book describes how to formulate a variety of teaching strategies, design effective assignments, and examine in detail specific evaluation methods including best practices for their use and exemplar analytic scoring rubrics. Also available are detailed, modifiable grading rubric templates for each assignment presented. Evaluation methods covered include papers, presentations, participation, discussion boards, concept maps, case studies, reflective journals, and portfolios. The book will assist both new and seasoned nurse educators in their quest to graduate competent, safe nurses at all levels of nursing education.\n\nKey Features:\nProvides rigorous, modifiable rubrics for learning objective grading\nIncludes time-tested alternative evaluation methods\nDescribes best practices for designing a variety of teaching-learning evaluation tools\nIncludes guidelines for writing clear assignment descriptions\nDiscusses papers, presentations, concept maps, case studies, portfolios, and more","torrent":{"xt":"urn:btih:d72271bdfe3ac5ef54ab7b766f105ef1ec55eb39","amp;dn":"Evaluation+Beyond+Exams+in+Nursing+Education+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d72271bdfe3ac5ef54ab7b766f105ef1ec55eb39","infoHashBuffer":{"type":"Buffer","data":[215,34,113,189,254,58,197,239,84,171,123,118,111,16,94,241,236,85,235,57]},"announce":[],"urlList":[]}}