{"title":"Peter Lindemann -- Electric Motor Secrets.divx","uid":8529919,"size":1587403228,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d771f7a3b202089bec7dc2c825d9eaeb62ce53ba&amp;dn=Peter+Lindemann+--+Electric+Motor+Secrets.divx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":null,"files":-1,"time":1370119422,"description":"Peter Lindemann -- Electric Motor Secrets.divx: RIFF (little-endian) data, AVI, \n720 x 400, 29.97 fps, video: DivX 5, audio: MPEG-1 Layer 3 (stereo, 48000 Hz)\n\n--\n\nYou've probably seen the claims - companies saying that you can eliminate your electric bill by building some goofy, $200 gizmo with parts you can get from Wal-Mart. Some say they learned how to do this from Edison. Others site Nikola Tesla, or Howard Johnson, or Lester Hendershot. Some say they figured it out for themselves. The problem is, none of these products teach you anything about how you can really power your home with a fuelless, &quot;off-grid&quot; power system.\n\nNow I've been involved in &quot;free energy&quot; research for over 35 years and I have seen my share of working systems. So, the first thing I want to tell you is that the technology DOES exist to do this. I designed my first &quot;free energy&quot; electric generator in 1980. It operated at about 120% efficiency. It was enough to prove to me that the Laws of Physics could be manipulated under certain circumstances, but it wasn't enough extra energy to be commercially practical.\n\nThis sent me off on a life-time search for a practical method to produce the &quot;home power plant&quot; that wasn't just a solar panel or a wind generator. Now, 30 years later, I have found the way. Remarkably, the answer lies in the electric motor.Bob Teal - Magnipulsion\n\nRemarkably, the modern electric motor has a deep, dark secret. For the last 176 years, that secret has held the electric motor to its present level of performance. In 1970, that secret started coming unravelled. In that year, an American inventor named Bob Teal discovered something extraordinary. He discovered that the amount of mechanical energy an electric motor produces is only INDIRECTLY related to the amount of electricity it consumes!\n\nEven today, modern electric motor theory says that the amount of electricity used by an electricMagnipulsion - Bob Teal motor is DIRECTLY related to the amount of mechanical energy it can produce. But Teal's Magnipulsion Engine produced large amounts of mechanical energy using way less electricity than expected. Even the LA Times published a short article about it titled &quot;Impossible Engine Invented for Real&quot;.\n","torrent":{"xt":"urn:btih:d771f7a3b202089bec7dc2c825d9eaeb62ce53ba","amp;dn":"Peter+Lindemann+--+Electric+Motor+Secrets.divx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d771f7a3b202089bec7dc2c825d9eaeb62ce53ba","infoHashBuffer":{"type":"Buffer","data":[215,113,247,163,178,2,8,155,236,125,194,200,37,217,234,235,98,206,83,186]},"announce":[],"urlList":[]}}