{"title":"Best Service - EthnoWorld 5 Pro [KONTAKT] (Torrent)","uid":9001425,"size":254521,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d837fe9626a0bb3bab192c0d348c41c22184b928&amp;dn=Best+Service+-+EthnoWorld+5+Pro+%5BKONTAKT%5D+%28Torrent%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"NewSky006","files":-1,"time":1380947663,"description":"Torrent Info:\n==============\n\nThis torrent contains another torrent, which contains EthnoWorld 5 Pro. Why? TPB doesn't allow torrents over 200KB, or something like that (all I know is that it wouldn't allow me to upload this torrent).\n\nAll this being said, the torrent contained is not my own torrent, however, I've edited it to add more trackers.\n\n\nTorrent Contents:\n==================\n\nA torrent, which contains 2 Kontakt 5 libraries\n\n\nInstallation:\n==============\n\nAdd &quot;EthnoWorld.5 Instruments&quot; and &quot;Ethno World.5 Voices&quot; as libraries to (cracked) Kontakt 5.\n\n\nProduct Info:\n==============\n\nEthno World 5 Professional &amp; Voices contains more than 240 professionally recorded ethnic instruments in the following categories: Bowed Instruments, Stringed Instruments, Woodwind &amp; Brass, Key Instruments, Bell Type Instruments, Metal Type Instruments, World Drums, World Percussion, Gongs &amp; Bowls and the new category of Voices &amp; Choirs.\n\nEthno World 5 Professional &amp; Voices contains the entire library &quot;Ethno World 4 Professional&quot; and an additional 10 GB of new samples. Ethno World 5 Professional &amp; Voices with its 20 GB of content and more than 800 patches is one of the largest ethnic sample libraries in the world.\n\nThe latest addition to Ethno World 5 Professional &amp; Voices are 25 professionally recorded solo-voices from all over the world and an Ethnic Chamber Choir with over 3,800 new samples and phrases. You will find voices from North America, Cameroon, Guinea, China, Iran, Turkey, Bulgaria, Ukraine, North Africa and Peru.\n\nWith the highly improved Legato-Mode in combination with several voice-articulations you now have the possibility to record realistic vocal lines.\n\nAnother highlight for all film composers are the new Taiko Drums and Big Ethnic Tom Drums, consisting of individual samples (left and right hand) and hundreds of inspiring loops. In the category woodwinds you will find the famous Ney flute (Iran), the Pivana &amp; Tenor Pivana flute (Corsica), the very meticulously recorded pan flute and human whistling. The category Metal Type Instruments there is an all new large selection of Hi-End Crash, Splash, Ride &amp; China Cymbals with Hits, Swells and Loops, the Big Feng Gong and fine glistening Windchimes. The string instruments category has been updated with a Bandura from the Ukraine.\n\nEthno World 5 Professional &amp; Voices has tapped into a new dimension with Kontakt 4 and outstanding programming. A new instrument interface allows you via the new quick edit page to directly access all the essential parameters and thereby offers a more intuitive handling of ethno world instruments. By integration of the convolution reverb the instruments sound more natural. The realtime automation has been greatly simplified. Furthermore elastic audio Time Machine II lets you transpose any instrument phrase and playing style. With sample start-shift you can determine when a lick should begin. All drum &amp; percussion loops and every solo loop can be synchronized by Beatmachine II to any tempo or by the host sequencer. Also every loop is individually programmable. For solo instruments there is the new legato mode. With the humanize mode every note has a slightly different tone. And micro-tuning allows any type of tuning and ethnic scales.\n\nAll Ethno World 5 Professional &amp; Voices instruments and voices are played by renowned musicians &amp; singers under the direction of Andreas Hofner and Marcel Barsotti.","torrent":{"xt":"urn:btih:d837fe9626a0bb3bab192c0d348c41c22184b928","amp;dn":"Best+Service+-+EthnoWorld+5+Pro+%5BKONTAKT%5D+%28Torrent%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d837fe9626a0bb3bab192c0d348c41c22184b928","infoHashBuffer":{"type":"Buffer","data":[216,55,254,150,38,160,187,59,171,25,44,13,52,140,65,194,33,132,185,40]},"announce":[],"urlList":[]}}