{"title":"Oliver Smolders - Black Night (2005) - Freakyflicks","uid":4131562,"size":1013946011,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d887090f463f29742642b56c4de576227e1a0fbe&amp;dn=Oliver+Smolders+-+Black+Night+%282005%29+-+Freakyflicks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clownmonkey","files":9,"time":1208055635,"description":"AKA &quot;Nuit Noire&quot;\n\nFor screenshots, please see the NEW RELEASES thread in the Freakyflicks forum.\n\nExcerpted from the Twitchfilms review:\n\nNuit Noire is about night's enveloping embrace. It honors the sheen on a beetle's jet black carapace. Set in an alternate reality where the world has been plunged into darkness because of an eternal eclipse -- which allows only a fleeting 15 seconds of sunshine in each 24-hour period -- Nuit Noire inherits a night logic of surrealistically-interpreted dream images (twinning abounds) and purposely contaminated chronologies (trajectories bifurcate). Polarities are staged and layered one upon the other: darkness and light, black and white, youth and adulthood, male and female, sex and death, desire and fear, blood and milk, history and memory. Memory itself is configured as either a theatrically staged enactment replete with arched proscenium or cinematically captured in grainy black and white by a voyeuristic Super8 camera. As night watchman, Smolders flips a coin whose two sides spin endlessly throughout the film, glinting in dim light. Heads or tails, either way; it's the flip of the coin that truly matters.\n\nHandsome repressed protagonist Oscar (Fabrice Rodriguez) works obsessively as an entomologist in a Natural History Museum hauntingly pervaded by a taxidermic spirit. He delights a bit too much and gains a little too much purpose in chloroforming and pinning beetles to the page. He's also having trouble with traumatic childhood memories that involve the death of his younger sister but its not quite clear if these &quot;memories&quot; aren?t just his disturbed imaginings. He's undergoing Jeunet-esque therapy where the doctor looks into his mind through a cone in his ear. While awaiting recovery, the ghosts of his imagined yesteryear contaminate and readjust his daily life. One day at the museum he encounters an African woman who seems to whisper telepathically to him in an incommunicable language. Before he can make it home, she sneaks into his apartment evading his crazed Russian landlady, climbs into his bed, proceeds to become pregnant and eventually pupates. That's right, pupates. Need I add that being an experienced entomologist comes in quite handy at this juncture? As Variety's Derek Elley describes it: &quot;What finally emerges from the pupa is supposedly linked to his own childhood memories of himself, his sister and white-hunter father in colonial Africa (seen in B&amp;W home movie footage), and sparks a longer spell of bright daylight outside.&quot; One might say consciousness is linked to daylight, as it has been in mythologies immemorial. \n\n\n===\n\nNot my rip.  Originally uplaoded by KamuiX to Usenet (thus the filenames).  Thanks, KamuiX!\n\nIn addition to the film, this torrent includes: external English subs; deleted scene; two featurettes; and an interview with director Oliver Smolders.\n\n===\n\n--- File Information ---                                                                \nFile Size (in bytes):                           734,167,040                     \n                                                                                \n--- Container Information ---                                                   \nBase Type (e.g &quot;AVI&quot;):                          AVI(.AVI)                 \nSubtype (e.g &quot;OpenDML&quot;):                        OpenDML (AVI v2.0),                   \nInterleave (in ms):                             42          \nPreload (in ms):                                504       \nAudio alignment(&quot;split across interleaves&quot;):    Aligned         \nTotal System Bitrate (kbps):                    0            \nBytes Missing (if any):                         0            \nNumber of Audio Streams:                        1       \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Type(e.g. &quot;DIV3&quot;):                  xvid            \nDuration (hh:mm:ss):                            01:28:57                \nFrame Count:                                    127951             \nFrame Width (pixels):                           608                  \nFrame Height (pixels):                          336                 \nDisplay Aspect Ratio (&quot;DAR&quot;):                   1.810                     \nFrames Per Second:                            25                  \nVideo Bitrate (kbps):                           961                 \nMPEG-4 (&quot;MPEG-4&quot; or &quot;&quot;):                        MPEG-4                   \nB-VOP (&quot;B-VOP&quot; or &quot;&quot;):                          B-VOP         \n                                                                                \n--- Audio Information ---                            \nAudio Codec (e.g. &quot;AC3&quot;):                       0x0055(MP3, ISO) MPEG-1 Layer 3                   \nAudio Codec Status (e.g. &quot;Codec Is Installed&quot;): Codec(s) are Installed            \nAudio Sample Rate (Hz):                         48000             \nAudio Bitrate(kbps):                            131                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):            VBR            \nAudio Channel Count (e.g. &quot;2&quot; for stereo):      2           \n\n\n\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyFlicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n   &lt;a href=&quot; http://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com/&lt;/a&gt;\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:d887090f463f29742642b56c4de576227e1a0fbe","amp;dn":"Oliver+Smolders+-+Black+Night+%282005%29+-+Freakyflicks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d887090f463f29742642b56c4de576227e1a0fbe","infoHashBuffer":{"type":"Buffer","data":[216,135,9,15,70,63,41,116,38,66,181,108,77,229,118,34,126,26,15,190]},"announce":[],"urlList":[]}}