{"title":"Farlight Explorers - Early Access","uid":12146356,"size":1342512387,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d889559281828e99a441c0dd98689440db8e5c90&amp;dn=Farlight+Explorers+-+Early+Access&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dauphong","files":1,"time":1437439445,"description":"About This Game\nFarlight Explores is a 3D space-sandbox game, made for space exploration, science fiction, resource management and action fans. In this game you can build your base or spaceship, explore the galaxy, extract unique ores in each planet or asteroids, craft new products, transport goods from one planet to another and more...\nFarlight Explorers is focused and supported on three pillars:\n\nAuxiliary systems: Design and maintenance of all the elements that your base or spaceship need to be operative (water, food, oxygen, energy).\n\nAutomatization: Manage and automate the extraction of ores and production of elements that are essential to grow your base.\n\nTransport of goods: Build spaceships in order to transport the goods is vital in order to produce all the possible elements of the game because each planet will have unique characteristics.\n\nWhen you start the game you choose a planet to start from the hundreds out there in the galaxy map. Once on the planet you have to extract resources to begin building a base that provides you with the items to survive like food and oxygen. If the base is secure, you can start building your spaceship to go to other planets to extract unique resources that you need to develop new technologies, or you can also use your spaceship to explore","torrent":{"xt":"urn:btih:d889559281828e99a441c0dd98689440db8e5c90","amp;dn":"Farlight+Explorers+-+Early+Access","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d889559281828e99a441c0dd98689440db8e5c90","infoHashBuffer":{"type":"Buffer","data":[216,137,85,146,129,130,142,153,164,65,192,221,152,104,148,64,219,142,92,144]},"announce":[],"urlList":[]}}