{"title":"Wizards, Aliens, and Starships: Physics in Science Fiction(2014)","uid":9861107,"size":2194175,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d8b97f5b4d684a8b3aef4bfa671dbea0a00a6872&amp;dn=Wizards%2C+Aliens%2C+and+Starships%3A+Physics+in+Science+Fiction%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"bookzilla","files":1,"time":1396299498,"description":"Wizards, Aliens, and Starships: Physics and Math in Fantasy and Science Fiction\n\n\n\nFrom teleportation and space elevators to alien contact and interstellar travel, science fiction and fantasy writers have come up with some brilliant and innovative ideas. Yet how plausible are these ideas--for instance, could Mr. Weasley's flying car in the Harry Potter books really exist? Which concepts might actually happen, and which ones wouldn't work at all? \n\n Wizards, Aliens, and Starships delves into the most extraordinary details in science fiction and fantasy--such as time warps, shape changing, rocket launches, and illumination by floating candle--and shows readers the physics and math behind the phenomena.\n\n With simple mathematical models, and in most cases using no more than high school algebra, Charles Adler ranges across a plethora of remarkable imaginings, from the works of Ursula K. Le Guin to Star Trek and Avatar, to explore what might become reality. Adler explains why fantasy in the Harry Potter and Dresden Files novels cannot adhere strictly to scientific laws, and when magic might make scientific sense in the muggle world. He examines space travel and wonders why it isn't cheaper and more common today. Adler also discusses exoplanets and how the search for alien life has shifted from radio communications to space-based telescopes. He concludes by investigating the future survival of humanity and other intelligent races. Throughout, he cites an abundance of science fiction and fantasy authors, and includes concise descriptions of stories as well as an appendix on Newton's laws of motion.\n","torrent":{"xt":"urn:btih:d8b97f5b4d684a8b3aef4bfa671dbea0a00a6872","amp;dn":"Wizards%2C+Aliens%2C+and+Starships%3A+Physics+in+Science+Fiction%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8b97f5b4d684a8b3aef4bfa671dbea0a00a6872","infoHashBuffer":{"type":"Buffer","data":[216,185,127,91,77,104,74,139,58,239,75,250,103,29,190,160,160,10,104,114]},"announce":[],"urlList":[]}}