{"title":"Linkin Park - Meteora (2003) WMA320","uid":6269688,"size":93417783,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d929b25f7c0b2280e0d39a66d23511fcf11a7917&amp;dn=Linkin+Park+-+Meteora+%282003%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1301035644,"description":"Some general impressions:\nThe second studio album by Linkin Park was released two years after the ground breaking album 'Hybrid Theory'. If people like it or not, 'Hybrid Theory' was setting the standards for nu-metal, rap-metal or whatever you want to call it. I adored the album back in the days, and though I know today that there is a lot more out there that is a lot better, I like to listen to it every now and then again. The line was set high with the major success of 'Hybrid Theory', but when the highly anticipated release was there, it was a disapointment to me. \n\nThat Warner Music is mikling this cow until the udder glows is clear. Four (!!!!!) different versions of this album in my local record store. Sadly, the band follows this and does all to keep the sells high you could think. The successfull schemes of the 'Hybrid Theory' hit singles were taken to the next level. Without really changing anything. What one realises pretty fast is the same structure of almost all songs. Sampled intro, Verse, Chorus, Verse, Chorus, Outro. Next song it's the same. Examples for this are &quot;Somewhere I belong&quot;, &quot;Easier to run&quot; or &quot;Figure 9&quot;. But about 10 of the 13 songs have this schematic. \n\nThe instrumental aspects have not changed a lot as well. The bass is still pretty simple, the guitar riffs lay down a simple but effective base for the songs, complemented by the drums. Practically no change with Chesters and Mikes vocals. The new thing are different sounds and loops used by Joseph Hahn, but that's about it. \n\nOverall, that is quite sad. The band has a very good sense for melodies, and catchy hooks etc. But on this album, it's almost too catchy, the melodies always worked in the same way. It enters your right ear, and as soon as the song is over, it's out of the left ear. Fast food, if you want to say. The only slightly differen songs are 'Faint' and 'Nobody's listening'. The first suprises with unusal drumming (breakbeats, nice). Not so mid-tempo as the other stuff. But that's about it. The latter is new in terms of the strange sound, and it has a much more hip-hop-ish appeal. That's about it. \n\nWhat was good:\nWell, one could never complain about the production quality of Linkin Park. The sound is good, the overall mix good. Catchiness was never a problem for LP as well, the songs just invade your brain. Songs like Numb or Don't stay are quite good and fine for a relisten. Unfortunately, that is already about it...\n\nWhat was not so good:\nWhen I went into the record store, I did not want another Hyrid Theory in differen clothes. Where HT set new standards for the genre, I would have expected something new here. But &quot;in the end, it doesn't matter&quot;, to say it with Linkin Parks own words. &quot;Standing still is regress&quot; like my dad always uses to say. And here nothing changed at all. Well, the hardcore fan, that fears progression and change like the devil holy water, will be happy with this stuff. But someone who's musical taste somewhat evolved after listeing to the first album (like it is in my case), can only wonder if the creative potential is not there, or the band was forced/did not want to change because of certain reasons. What those reasons are, I leave that to personal judgment and discussion.\n\n\nSummary:\nExcellent production and catchiness, as well as some quite good songs (Numb, Don't stay, Faint, Session) on the pro site, the major lack of creativity and new impulses on the contra side. In teh end, it will be up to personal judgement if the record is good or not. The hardcore LP fan will be happy as hell with it I persume, but anyone who has an expanding musical taste will make a big leap around this one after then first few listens. Apart from the songs listed above, nothing realy motivates to buy the album or listen to it.\n\nIf I ever wasted money on a CD, it was in this case... No inovation, no effort to set this album apart from Hybrid Theory, a realy poor effort. A very weak\n\nby Damrod\n\nTRACKLIST:\n\n01 - Foreword.wma                                           \n02 - Don't Say.wma                                          \n03 - Somewhere I Belong.wma                                 \n04 - Lying From You.wma                                     \n05 - Hit The Floor.wma                                      \n06 - Easier To Run.wma                                      \n07 - Faint.wma                                              \n08 - Figure.09.wma                                          \n09 - Breaking The Habit.wma                                 \n10 - From The Inside.wma                                    \n11 - Nobody's Listening.wma                                 \n12 - Session.wma                                            \n13 - Numb.wma     \n\nWMA 320Kbp 44100Hz STEREO\n\nFollow Me On Facebook Pages: MarcelodrgzTPB","torrent":{"xt":"urn:btih:d929b25f7c0b2280e0d39a66d23511fcf11a7917","amp;dn":"Linkin+Park+-+Meteora+%282003%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d929b25f7c0b2280e0d39a66d23511fcf11a7917","infoHashBuffer":{"type":"Buffer","data":[217,41,178,95,124,11,34,128,224,211,154,102,210,53,17,252,241,26,121,23]},"announce":[],"urlList":[]}}