{"title":"Words Will Break Cement  (2014) Masha Gessen (multi)","uid":9540357,"size":3414749,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d938c0873bd43c58e8a7498416919ffacffa0e08&amp;dn=+Words+Will+Break+Cement++%282014%29+Masha+Gessen+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"7","files":-1,"time":1391031052,"description":"Words Will Break Cement: The Passion of Pussy Riot by Masha Gessen\n\n\nFormat: mobi/epub/azw3\nLength: 144 pages\nGenre: Non-Fiction/Russia\nDate: 9 January 2014\n\nThe heroic story of Pussy Riot, who resurrected the power of truth in a society built on lies.\n\nOn February 21st 2012, five members of an obscure feminist post-punk collective called Pussy Riot staged a performance in Moscow's Cathedral of Christ the Saviour. Dressed in their trademark brightly coloured dresses and balaclavas, the women performed their song 'Punk Prayer - Mother of God, Chase Putin Away!' in front of the altar. The performance lasted only 40 seconds but it resulted in two-year prison sentences for three of the performers - and has turned Pussy Riot into one of the most well-known and important protest movements of the last five years.\n\nThis necessary and timely book is an account of the Pussy Riot protest, the ensuing global support movement, and the tangled and controversial trial of the band members. It explores the status of dissent in Russia, the roots of the group and their adoption - or appropriation - by wider collectives, feminist groups and music icons. Masha Gessen has unique access to the band and those closest to them. Her unrivalled understanding of the Russian protest movement makes her the ideal writer to document and explain the rage, the beauty and the phenomenon that is Pussy Riot.\n\nPart psychological profile, part conspiracy study. As a Moscow native who has written perceptively for both Russian and Western publications, Gessen knows the cultures and pathologies of Russia. A fiercely independent journalist, Gessen's armchair psychoanalysis of Putin is speculative. But it is a clever and sometimes convincing speculation, based on a close reading of Putin's own inadvertently revealing accounts of his life, and on interviews with people who knew Putin before he mattered.\n--The New York Times Book Review\n\nAuthor:\n\nMasha Gessen is a Russian-American journalist who is the author of several books, including the national bestseller The Man without a Fac. Her work has appeared in Vanity Fair, the New York Times, Newsweek, Slate, and many other publications, and has received numerous awards, most recently the 2013 Media for Liberty Award. She has served as the editor of several publications and as director of Radio Liberty's Russia Service. She lives in Moscow. ","torrent":{"xt":"urn:btih:d938c0873bd43c58e8a7498416919ffacffa0e08","amp;dn":"+Words+Will+Break+Cement++%282014%29+Masha+Gessen+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d938c0873bd43c58e8a7498416919ffacffa0e08","infoHashBuffer":{"type":"Buffer","data":[217,56,192,135,59,212,60,88,232,167,73,132,22,145,159,250,207,250,14,8]},"announce":[],"urlList":[]}}