{"title":"***Isaac_Asimov-The_Robot_Series*** [3 unabr. books]","uid":4340187,"size":860999242,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d9694165f82658a4d5b110c0de960276712e37bb&amp;dn=%2A%2A%2AIsaac_Asimov-The_Robot_Series%2A%2A%2A+%5B3+unabr.+books%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"VJ_Me_2008","files":1,"time":1218553437,"description":"MASTERS OF SCI-FI\n\n\n\t\n      ISAAC ASIMOV\n*** CAVES OF STEEL***\n\n\n\n\tA millennium into the future two advancements have altered the course of human history:  the colonization of the galaxy and the creation of the positronic brain.  Isaac Asimov's Robot novels chronicle the unlikely partnership between a New York City detective and a humanoid robot who must learn to work together.  Like most people left behind on an over-populated Earth, New York City police detective Elijah Baley had little love for either the arrogant Spacers or their robotic companions.  But when a prominent Spacer is murdered under mysterious circumstances, Baley is ordered to the Outer Worlds to help track down the killer.  The relationship between Life and his Spacer superiors, who distrusted all Earthmen, was strained from the start.  Then he learned that they had assigned him a partner:  R. Daneel Olivaw.  Worst of all was that the &quot;R&quot; stood for robot--and his positronic partner was made in the image and likeness of the murder victim!\t\n\n**********************************************************************************\n\n***THE NAKED SUN***\n \n\tOn the beautiful Outer World planet of Solaria, a handful of human colonists lead a hermit-like existence, their every need attended to by their faithful robot servants.  To this strange and provocative planet comes Detective Elijah Baley, sent from the streets of New York with his positronic partner, the robot R. Daneel Olivaw, to solve an incredible murder that has rocked Solaria to its foundations.  The victim had been so reclusive that he appeared to his associates only through holographic projection.  Yet someone had gotten close enough to bludgeon him to death while robots looked on.  Now Baley and Olivaw are faced with two clear impossibilities:  Either the Solarian was killed by one of his robots--unthinkable under the laws of Robotics--or he was killed by the woman who loved him so much that she never came into his presence! \n\n\n***********************************************************************************\n\n***THE ROBOTS OF DAWN***\n\n\n\tA puzzling case of roboticide sends New York Detective Elijah Baley on an intense search for a murderer. Armed with his own instincts, his quirky logic, and the immutable Three Laws of Robotics, Baley is determined to solve the case. But can anything prepare a simple Earthman for the psychological complexities of a world where a beautiful woman can easily have fallen in love with an all-too-human robot...?\n\n***************************************Sci-Fi*************************************\n\n\n*one mp3 (64 &amp; 32 kbps) file per CD - 3 folders compressed in one open-source .7z format - not password protected*\n\n\n","torrent":{"xt":"urn:btih:d9694165f82658a4d5b110c0de960276712e37bb","amp;dn":"%2A%2A%2AIsaac_Asimov-The_Robot_Series%2A%2A%2A+%5B3+unabr.+books%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9694165f82658a4d5b110c0de960276712e37bb","infoHashBuffer":{"type":"Buffer","data":[217,105,65,101,248,38,88,164,213,177,16,192,222,150,2,118,113,46,55,187]},"announce":[],"urlList":[]}}