{"title":"Schooled 1_2_3 Bret Rassmussen and Chris Burandt","uid":6841335,"size":1680286115,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d9bd83e818db5f3c5602f1197f1130661d40e3be&amp;dn=Schooled+1_2_3+Bret+Rassmussen+and+Chris+Burandt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"leblancchris","files":7,"time":1322174027,"description":"Schooled:\nBret Rassmussen and Chris Burandt are on the leading edge of a revolution in technical mountain riding. They have developed innovative techniques for tackling the steep and deep by combining their individual strengths, learned both on the hillclimb circuit and from years of freeriding. This new style has allowed them to take full advantage of the capabilities of today's mountain snowmobiles and execute maneuvers impossible just a few years ago. For the first time, Rasmussen and Burandt have made their secrets available to you, join them as they give you a guided tour through their arsenal of tips and tricks.\nSCHOOLED demonstrates precision riding skills with detailed narration, super slow-motion shots, and instructional camera angles to break down tech riding moves like never before. Rasmussen and Burandt cover instructional breakdowns and challenging drills designed to build confidence and balance for riding even the most challenging terrain with ease. This video is ideal for all levels of riders, beginner to expert, and is designed to help you get the most out of your machine and have fun doing it. If you are serious about mountain riding, this video is essential to take your skills to the next level!\n\nSchooled Again:\nThe Revolution continues as the world's top backcountry riders open there playbooks once again and reveal the secrets that will allow YOU to ride even the most daunting terrain. Schooled Again builds on last years Breakthrough Instructional video, and expands your understanding of Rider Position, Throttle Control and Line Choice. Alternating Instructional, pure action segments and step by step slow motion breakdowns, Schooled Again is purely a one of a kind experience. Watch Chris Burandt put the 2011 RMK-Pro through its paces, while Bret Rasmussen rides half the day on one ski. Pack your Lunch, gather your books, you're about to get SCHOOLED AGAIN.\nFeaturing Bret Rasmussen, Chris Burandt, Sahen Skinner and Wyatt Young. Filmed on location in Colorado, Wyoming, Idaho and Montana. Turbo's not required, but strongly recommended! Edited for all ages.\n\nSchooled Detention:\nBret Rasmussen and Chris Burandt reach deep into their portfolio once again to demonstrate the newest and most technical back-country riding ever captured on film.Detention will expand your arsenal with highly effective technical sled handling techniques. Step up your mountain riding ability with new moves like the &quot;ZERO TURN&quot;. Achieve your greatest potential by getting SCHOOLED, the only snowmobile action series that will entertain you for hours and help you ride like the pros.\nFeaturing Bret Rasmussen, Chris Burandt, Sahen Skinner and Wyatt Young. Filmed on private property in Colorado, Wyoming, Idaho and Montana. Turbo's not required, but strongly recommended! Edited for all ages.\n\nSled, Snowmobile, Skidoo, Polaris","torrent":{"xt":"urn:btih:d9bd83e818db5f3c5602f1197f1130661d40e3be","amp;dn":"Schooled+1_2_3+Bret+Rassmussen+and+Chris+Burandt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9bd83e818db5f3c5602f1197f1130661d40e3be","infoHashBuffer":{"type":"Buffer","data":[217,189,131,232,24,219,95,60,86,2,241,25,127,17,48,102,29,64,227,190]},"announce":[],"urlList":[]}}