{"title":"Pilla - IRS, Taxes and the Beast - How to Survive IRS' New Age ","uid":4339948,"size":1047356,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9f8419772d8945ebb40a5b7abdccdbc1cb68689&amp;dn=Pilla+-+IRS%2C+Taxes+and+the+Beast+-+How+to+Survive+IRS%5C%27+New+Age+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"red_gonzo","files":1,"time":1218539529,"description":"This is Daniel J. Pilla&amp;#039;s explosive book IRS, Taxes and the Beast - How to Survive IRS&amp;#039; New Age Audit Invasion (1996) which exposes IRS&amp;#039; secret Strategic Plan to audit every citizen each year and take control over the amount of tax you pay. Claiming citizens now cheat more by underreporting income. IRS has set out to show that only by tracking all financial transactions can it effectively police the income you report on your return. In its quest to prove millions of citizens underreport income, IRS has begun to invade the financial privacy of all citizens. It has turned the typical IRS audit into a criminal investigation designed to uncover hoards of unreported earnings. IRS has also set out to eliminate deductions and cash, number all citizens and gain the ability to track all financial transactions. This book chronicles the progress IRS has made toward that end. Now, but one hurdle remains: the ability to track all financial transactions. Only when IRS knows all you earn and spend can it gain total taxing power. In this fascinating book learn how to: Preserve Financial Privacy; Keep IRS Out Of Your Home; Audit - Proof Your Business; Counter 13 IRS Audit Bluffs; Cancel Penalties &amp; Notices; Avoid SSNs For Kids and finally WIN YOUR AUDIT. IRS, Taxes and the Beast is a chilling expose of an IRS plan that intends to control every citizen of America on excuse they are probably not paying as much as tax as they should and are therefore to be considered criminals to be persecuted. 220 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:d9f8419772d8945ebb40a5b7abdccdbc1cb68689","amp;dn":"Pilla+-+IRS%2C+Taxes+and+the+Beast+-+How+to+Survive+IRS%5C%27+New+Age+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9f8419772d8945ebb40a5b7abdccdbc1cb68689","infoHashBuffer":{"type":"Buffer","data":[217,248,65,151,114,216,148,94,187,64,165,183,171,220,205,188,28,182,134,137]},"announce":[],"urlList":[]}}