{"title":"Nginx Essentials (2015) (Pdf, Epub and Mobi) Gooner","uid":12626682,"size":5853584,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:da65339d1e9731d0abfbae4e7e8c1812edafc08e&amp;dn=Nginx+Essentials+%282015%29+%28Pdf%2C+Epub+and+Mobi%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1445783128,"description":"Publisher: Packt Publishing - ebooks Account (July 2015)\r\nLanguage: English\r\nISBN-10: 1785289535\r\nISBN-13: 978-1785289538\r\n\r\nExcel in Nginx quickly by learning to use its most essential features in real-life applications\r\n\r\nAbout This Book\r\n\r\nLearn how to set up, configure, and operate an Nginx installation for day-to-day use\r\nExplore the vast features of Nginx to manage it like a pro, and use them successfully to run your website\r\nExample-based guide to get the best out of Nginx to reduce resource usage footprint\r\n\r\nWho This Book Is For\r\n\r\nThis book is ideal for skilled web masters and site reliability engineers who want to switch to Nginx or solidify their knowledge of Nginx. Knowledge of Unix and webmaster skills are required.\r\n\r\nWhat You Will Learn\r\n\r\nGet started with an Nginx installation from scratch in various environments and customize it for your purposes\r\nStart and stop a basic Nginx installation, discover the basics of process management, and learn how to set up Nginx to serve static data\r\nCreate highly-maintainable configuration files to perform the most critical Nginx maintenance tasks\r\nSet up Nginx as a reverse proxy and learn to use the Nginx caching feature\r\nDiscover how to benefit from the Nginx rewrite engine and how to use access restrictions in Nginx\r\nUse various Nginx features to manage inbound traffic and understand how to use Nginx load balancing and fault tolerance features\r\nUnderstand advanced feature-independent performance tuning strategies and optimizations\r\nManage inbound and outbound traffic and configure access control\r\n\r\nIn Detail\r\n\r\nNginx is an open source and cross-platform reverse proxy server designed for low memory usage and high performance and concurrency.\r\n\r\nThis book provides both basic and in-depth knowledge to help you effectively solve challenges with Nginx, or comfortably go through a transition period when switching to Nginx.\r\n\r\nStarting with the basics, you will learn by example how to set up, configure, and operate an Nginx installation and use features of Nginx to elegantly solve challenges you experience every day when running your website. You will learn to use the rewrite engine to solve day-to-day tasks and be able to configure access restrictions in Nginx. You will also be able to manage inbound traffic using a number of Nginx features and use Nginx for load balancing and fault-tolerance features. Finally, you will learn how to solve common performance problems and apply a number of performance-tuning strategies.\r\n\r\nThrough easy exploration of the most intricate topics, this book aims to bring you to the next level in your Nginx experience","torrent":{"xt":"urn:btih:da65339d1e9731d0abfbae4e7e8c1812edafc08e","amp;dn":"Nginx+Essentials+%282015%29+%28Pdf%2C+Epub+and+Mobi%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da65339d1e9731d0abfbae4e7e8c1812edafc08e","infoHashBuffer":{"type":"Buffer","data":[218,101,51,157,30,151,49,208,171,251,174,78,126,140,24,18,237,175,192,142]},"announce":[],"urlList":[]}}