{"title":"Discovery Ch Prehistoric Predators of the Past 3of3 Rise of the ","uid":6917387,"size":669576883,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dac2ffb486a3f859f65d04a8d690bbb13368fbea&amp;dn=Discovery+Ch+Prehistoric+Predators+of+the+Past+3of3+Rise+of+the+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MVGroup","files":-1,"time":1325078960,"description":"Prehistoric: Predators of the Past\n\nScience Documentary hosted by Terry McDonald, published by Discovery Channel in 2011 - English narration\n\n\nInformation\n------------------------------\n\nPrehistoric: Predators of the Past\nSorry, &quot;Jurassic Park,&quot; but T. rexes and Velociraptors weren't the only meat-eating monsters on the prehistoric horizon. Three Discovery Channel programs bring you up close to some of the fastest, fiercest, and hungriest denizens of the ancient land, seas, and skies. Included are &quot;What Killed the Mega-Beasts?,&quot; &quot;Rise of the Feathered Dragon,&quot; and the &quot;Prehistoric Assassins&quot; episode &quot;Blood in the Water\n\n\n1)  What Killed the Mega Beasts \nIt s one of the most enduring mysteries of modern science. For sixty five million years, a vast array of fantastic creatures had roamed the prehistoric world. They were the Mega Beasts. The Mega Beasts had inherited the Earth from the dinosaurs. And, like the dinosaurs, they were every bit as fearsome and every bit as bizarre. But then the Beasts began to die; and no one knows why. In a brief moment of geological time at the end of the last Ice Age, hundreds of species simply disappeared: seventeen foot tall ground Sloths; giant woolly Mammoths; Madagascan Lemurs the size of gorillas; ferocious predators like Australia s Marsupial Lion. Some scientists say that what killed the Mega Beasts was Man; early human hunters could have made light work of these huge creatures using primitive but deadly weapons. Others disagree. They say that climate was the killer: at the end of the Ice Age, huge floods and devastating droughts could have wiped out an army of giant mammals. And eminent paleo-ecologist Dr David Burney takes us on a journey to Madagascar to uncover the fate of the huge gorilla-sized lemur. Virologists and vets from Africa to Australia also join this global quest to discover What killed the Mega Beasts?\n\n2)  Blood in the Water \nMillions of years ago, the earth s vast oceans were home to some of the fiercest and strangest creatures to ever roam the planet. Among them were a giant bone-jawed beast with a bite force three times that of a Great White shark, a monstrous six-foot sea scorpion with as many killing tools as a Swiss Army knife, and a massive marine predator whose neck, several times the length of a giraffe's, let it ambush and pick off whole schools of fish. While these terrifying monsters no longer rule the seas, the weapons they pioneered still show up in unexpected places.\n\n3)  Rise of the Feathered Dragon \nPerhaps the most significant paleontological discovery of the last 25 years hails from the famed &quot;feathered dinosaur&quot; quarries of Liaoning, China. This site has produced and abundance of specimens that link the evolution of dinosaurs and birds.\n\nScreenshots\n------------------------------ &lt;a href=&quot;\nhttp://img854.imageshack.us/img854/227","torrent":{"xt":"urn:btih:dac2ffb486a3f859f65d04a8d690bbb13368fbea","amp;dn":"Discovery+Ch+Prehistoric+Predators+of+the+Past+3of3+Rise+of+the+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dac2ffb486a3f859f65d04a8d690bbb13368fbea","infoHashBuffer":{"type":"Buffer","data":[218,194,255,180,134,163,248,89,246,93,4,168,214,144,187,177,51,104,251,234]},"announce":[],"urlList":[]}}