{"title":"The Comfort of Lies by Randy Susan Meyers","uid":9701374,"size":2704864,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db1530827c8521fac1bd9925e305a98731afe14d&amp;dn=The+Comfort+of+Lies+by+Randy+Susan+Meyers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"PirateBook","files":2,"time":1394001170,"description":"\nFive years ago, Tia fell into obsessive love with a man she could never have. Married, and the father of two boys, Nathan was unavailable in every way. When she became pregnant, he disappeared, and she gave up her baby for adoption.\n\nFive years ago, Caroline, a dedicated pathologist, reluctantly adopted a baby to please her husband. She prayed her misgivings would disappear; instead, she's questioning whether she's cut out for the role of wife and mother.\n\nFive years ago, Juliette considered her life ideal: she had a solid marriage, two beautiful young sons, and a thriving business. Then she discovered Nathan's affair. He promised he'd never stray again, and she trusted him.\n\nBut when Juliette intercepts a letter to her husband from Tia that contains pictures of a child with a deep resemblance to her husband, her world crumbles once more. How could Nathan deny his daughter? And if he's kept this a secret from her, what else is he hiding? Desperate for the truth, Juliette goes in search of the little girl.\n\nAnd before long, the three women and Nathan are on a collision course with consequences that none of them could have predicted. Riveting and arresting, The Comfort of Lies explores the collateral damage of infidelity and the dark, private struggles many of us experience but rarely reveal.\n\nGenre: General Fiction/Classics","torrent":{"xt":"urn:btih:db1530827c8521fac1bd9925e305a98731afe14d","amp;dn":"The+Comfort+of+Lies+by+Randy+Susan+Meyers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db1530827c8521fac1bd9925e305a98731afe14d","infoHashBuffer":{"type":"Buffer","data":[219,21,48,130,124,133,33,250,193,189,153,37,227,5,169,135,49,175,225,77]},"announce":[],"urlList":[]}}