{"title":"Miles Davis - Big Fun CD1 of 2 (1974) [Jazz][mp3 320][schon55]","uid":5609146,"size":118440750,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:db2c26b46f687173176bf8cc0c857f09844d3b0e&amp;dn=Miles+Davis+-+Big+Fun+CD1+of+2+%281974%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"schon55","files":7,"time":1275757411,"description":"Miles Davis - Big Fun CD1\nYear: 1974\nJapan Import\nQuality: 320 kbps\n\nBig Fun reflects three different phases from Miles Davis's early-seventies &quot;electric&quot; period.\n\nSides one and four (&quot;Great Expectations/Orange Lady&quot; and &quot;Lonely Fire&quot;) were recorded three months after the Bitches Brew sessions and incorporate sitar, tambura, tabla, and other Indian instruments.  They also mark the first time since the beginning of Miles Davis's electric period that he played his trumpet with the Harmon mute which had been one of his hallmarks, making it sound much like the sitar.  This contributed to creating a very clear and lean sound, highlighting both the high and low registers, as opposed to the busier sound of Bitches Brew which placed more emphasis on the medium and low registers.\n\nRecorded slightly later, &quot;Go Ahead John&quot; used a sparser line-up and was a major step towards the 1970 Tribute to Jack Johnson sessions.\n\n&quot;Ife&quot; was recorded after the 1972 On the Corner sessions, and the framework is similar to tracks from that record.  It has a drum and electric bass groove (which in fact at one point breaks down due to mistiming) and a plethora of musicians improvising individually and in combinations over variations on the hypnotic bassline. ~ Wikipedia\n\nIf the idea of listening to an album featuring tracks that clock in at least 20 minutes doesn't appeal to you, &quot;Big Fun&quot; may not be your type of groove.  This is not an album for those who suffer from a short attention span.  It's not for those who still have conservative notions about what jazz should sound like.  And it's certainly not for those who aren't open-minded enough to appreciate Miles Davis' era called the &quot;electric&quot; period.  &quot;Big Fun&quot; ranks up there with &quot;Bitches Brew&quot; and &quot;Get Up With It&quot; as another double-CD fusion masterpiece.  Miles's trumpeting is still in exceptional form, but on this album, he incorporates rock, funk, and a dash of blues into the mix.  Many of the players that appeared on the &quot;Bitches Brew&quot; album return here, as well as Herbie Hancock. &quot;Go Ahead John,&quot; which is the opening track on disc two, defies categorization: for nearly 30 minutes, the track swings stylishly between rock, soul and jazz featuring fierce electric guitars, great drum work, fine trumpeting from Davis, and nice sax from Steve Grossman.  &quot;Lonely Fire&quot; is a seductive, near-ambient work of minimalism showing Davis on trumpet, Bernie Maupin on bass, as well as some light percussion.  &quot;Ife,&quot; which was written while Davis was working on his &quot;On the Corner&quot; album, is a suave and funky number with &quot;1970s&quot; written all over it, featuring a great bassline from Michael Henderson.  While other musicians were settling into their comfort zones, Miles Davis continued to push boundaries and defy musical traditions.  &quot;Big Fun&quot; is an incredible work of fusion that's almost guaranteed to get heavy rotation on your CD player. ~ The Groove\n\nI bought this album in London earlier this summer, where it has been available for some time, and is actually quite popular.  This sales clerk nodded and said he thought it was an excellent album (or, I believe more accurately &quot;that's a good one, there&quot;).  I also think it is an excellent album, though a bit scattered and disorganized in the arrangement of the songs and especially in the personnel and set information, and if you are interested in Miles Davis' funk 70s period (from Bitches Brew to Pangea) then I suggest buying this album.  Like much of Miles Davis' music of this period, the interest doesn't lie in the melodies, or in the individual solos, but in two things; the overall buildup and cataclysmic weight of the songs themselves (all over 20 minutes), and the short sections where the whole band just seems to catch the groove (as Miles would say) and you feel it pass over you as well.  It's a hard feeling to describe, and not everyone can catch it, but it's really what music is all about - and you can find it on this album.  The music of this period has been described as 'seismic' or 'earth-shattering'; perhaps a bit overwinded, but accurate nonetheless.  ~ Mr. Walker\n\nPersonnel:\nMiles Davis  - Trumpet\nJoe Zawinal  - Electric Piano, Organ\nJohn McLaughlin  - Guitar\nHerbie Hancock , Chick Corea  - Electric Piano\nWayne Shorter , Steve Grossman  - Saxophone\nDave Holland, Michael Henderson  - Bass\nJack Dejohnette  - Drums \n\nMiles Davis - Big Fun CD1 Tracks:\n1. Great Expectations (Orange Lady) 27:23\n2. Ife  21:34\n\nMiles Davis - Big Fun CD2 Tracks:\n3. Go Ahead John  28:27\n4. Lonely Fire  21:21","torrent":{"xt":"urn:btih:db2c26b46f687173176bf8cc0c857f09844d3b0e","amp;dn":"Miles+Davis+-+Big+Fun+CD1+of+2+%281974%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db2c26b46f687173176bf8cc0c857f09844d3b0e","infoHashBuffer":{"type":"Buffer","data":[219,44,38,180,111,104,113,115,23,107,248,204,12,133,127,9,132,77,59,14]},"announce":[],"urlList":[]}}