{"title":"Nicholas Pileggi - Wiseguy - NL Ebook epub","uid":9737485,"size":1615448,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db31605ebbfd76fd9784b9c09c429c7f61bd582f&amp;dn=Nicholas+Pileggi+-+Wiseguy+-+NL+Ebook+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Deadeye_Duck","files":-1,"time":1394463190,"description":"Nicholas Pileggi - Wiseguy - NL Ebook epub\n\n'Toen ik twaalf was, was mijn ambitie: gangster worden, een wiseguy. Het was beter een wiseguy te zijn dan de president van Amerika. Een wiseguy zijn betekende: de wereld bezitten.' - Henry Hill\n\nWiseguy vertelt het fascinerende en gewelddadige verhaal van Henry Hill, een voormalig topgangster van de maffia. Op ontnuchterende wijze beschrijft Pileggi diens leven, een leven vol geweld, brasserijen, vrouwen en codes of honor. Henry Hill weet waar lijken begraven liggen, en onderging het getuigenbeschermingsprogramma om zijn eigen leven te redden. \n\nDe maffia was niet blij met hetgeen Hill opbiechtte in Wiseguy: afpersing, brandstichting, gijzeling, moord en de overval op het John F. Kennedy Airport op 11 december 1978, waarbij Hill betrokken was, en die op dat moment het grootste geldbedrag buitgemaakt op Amerikaanse bodem opleverde: vijf miljoen dollar in cash en een miljoen in juwelen. Hill wordt nog altijd door de mob gezocht.\n\nWiseguy werd door Martin Scorsese verfilmd als Goodfellas. Goodfellas werd voor zes oscars genomineerd (onder andere beste regie en beste scenario) maar alleen Joe Pesci won een oscar, voor beste bijrol. Goodfellas werd voor vijf Golden Globes genomineerd (maar won er geen een) en werd door de British Academy of Film and Television Arts met vijf prijzen bekroond.","torrent":{"xt":"urn:btih:db31605ebbfd76fd9784b9c09c429c7f61bd582f","amp;dn":"Nicholas+Pileggi+-+Wiseguy+-+NL+Ebook+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db31605ebbfd76fd9784b9c09c429c7f61bd582f","infoHashBuffer":{"type":"Buffer","data":[219,49,96,94,187,253,118,253,151,132,185,192,156,66,156,127,97,189,88,47]},"announce":[],"urlList":[]}}