{"title":"Aaron West and The Roaring Twenties - We Don't Have Each Other","uid":10535657,"size":255278519,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:db653a6abd06a5f5d6cbb0e90498f6b55b347d2a&amp;dn=Aaron+West+and+The+Roaring+Twenties+-+We+Don%27t+Have+Each+Other&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"politux","files":-1,"time":1405164886,"description":"\n  Aaron West and The Roaring Twenties - We Don't Have Each Other\n\n  Released: 2014\n  Genre: Rock\n  Style: Singer/Songwriter, Acoustic, Emo\n  Source: Scene CD (forsaken)\n  Codec: FLAC\n  Bitrate: ~ 900 kbps \n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Our Apartment \n  02 Grapefruit \n  03 St. Joe Keeps Us Safe \n  04 Runnin' Scared \n  05 Divorce And The American South \n  06 The Thunderbird Inn \n  07 Get Me Out Of Here Alive \n  08 You Ain't No Saint \n  09 Carolina Coast \n  10 Going To Georgia (Bonus Track) (02:33)\n\n  Philadelphia-based singer/songwriter and Wonder Years frontman Dan &quot;Soupy&quot; Campbell tries his hand at Americana storytelling with the debut of his new solo project Aaron West &amp; the Roaring Twenties. After four albums and countless tours with his hardworking pop punk band, stripping down for a more organic, acoustic approach seems like a natural move for a maturing artist in a genre known for its youthful angst and snarkiness. He's certainly not the first to trade in his Vans for some well-worn hobo boots, but while the instrumentation has changed from power chords to banjos and harmonica, Campbell's new, subdued approach still takes a decidedly emo bent as he delivers a sort of concept album which paints a portrait of the character Aaron West, a sad Brooklynite in a dead-end relationship trying to bust out. Produced by the Early November's Ace Enders, We Don't Have Each Other is broad in its scope as Campbell tries to fully inhabit West's life and subsequent escape, delivering the lyrics in third person with a sensitive, toned-down croon that still rings with punk affectation. The story itself is compelling, but musically the album hovers somewhere between bland acoustic roots pop and overly earnest alt-rock. When Campbell braces for mightily screamed emo choruses on tracks like &quot;The Thunderbird Inn&quot; and &quot;You Ain't No Saint,&quot; you can see them coming from miles away. It's as if he couldn't quite commit to the acoustic aesthetic, settling instead on a waffling middle ground of watered-down heaviness and aggro folkiness. If Aaron West's story continues beyond this album, hopefully it will be attended to with a clearer vision.","torrent":{"xt":"urn:btih:db653a6abd06a5f5d6cbb0e90498f6b55b347d2a","amp;dn":"Aaron+West+and+The+Roaring+Twenties+-+We+Don%27t+Have+Each+Other","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db653a6abd06a5f5d6cbb0e90498f6b55b347d2a","infoHashBuffer":{"type":"Buffer","data":[219,101,58,106,189,6,165,245,214,203,176,233,4,152,246,181,91,52,125,42]},"announce":[],"urlList":[]}}