{"title":"US Income Tax Law - Originalintent.org","uid":4410593,"size":671340,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db6f91674182efcc65ace1549d85b3fbb21b1bc7&amp;dn=US+Income+Tax+Law+-+Originalintent.org&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"demuffinman","files":18,"time":1222224997,"description":"****************************************\nALL AMERICANS MUST READ THIS INFORMATION\n****************************************\n\nMission Statement\n\nOriginal Intent is an organization dedicated to restoring this nation to its republican roots. Our children, neighbors, family and community can no longer even identify our fundamental God-given &quot;inalienable rights&quot;. If our inalienable rights cannot be identified, the liberty that stems from them is lost. Our liberty can be revitalized, but only by the Citizens of the states of the Union learning and understanding what their inalienable rights are, and standing up boldly and decisively when government threatens those rights. This website is but one resource to assist Citizens in identifying their rights and how to protect them. In short, our goal is, &quot;Restoring the Republic...one Citizen at a time&quot;.\n\nPolicy Statement\n\nIt is the policy of Original Intent to post the most legally accurate information that we can identify on the various subjects addressed in this website, and to present that information in a straightforward, non-legalistic, style. Although we attempt to be meticulous in all that we post, we cannot guarantee that every shred of information is accurate. The voluminous amount of information involved makes that impossible. Due to the evolutionary nature of the national research being performed on many of the topics addressed in this website, information will be updated as results dictate.\n\nAcknowledgements\n\nWhile this site is the product of Original Intent, there are literally thousands of people (if not ten's of thousands) who have contributed to the information database of the modern Patriot movement. The earliest Patriot in modern memory cropped up about 1952. The movement has been growing ever since and the research of the last 50 years has essentially been condensed to the legal positions contained within this site. Original Intent wishes to acknowledge all of those who fight for liberty today, as well as all those who have come before us; many of those paying dearly for the lessons that have been passed on to us today.\n\n\n****************************************\n\nINCLUDED: PDF files of the dducational index as of September 2008.\n\nConstitutions\nThe Law\nCitizenship\n14th Amendment Clarified\nFederal Subject Matter Jurisdiction\n\nConstitutional Taxation\nFederal Income Tax\nEmployment Tax\nState Sales Tax\n\nInternal Revenue Districts\nThe Misapplication of Form I-9\nDebunking IRS Lies\nWillful Failure to File Scam\n\nFederal Firearms Law\n\nWhat is the United States Code?\nWhat are Federal Regulations?\n \nCommon Law Marriage\nCommon Law Trusts\n\nWhat is the Patriot Movement?\n\nJury Summons Response Letter\n\n****************************************\n\nYOU MAY NOT BE LIABLE FOR INCOME TAXES\n\n*** From Federal Income Tax Page:\n\nLearn how you keep making yourself liable - AND STOP DOING IT\n\n*** From Dubunking IRS Lies:\n\nIRS Lie #2\n\n&quot;The IRS and Treasury have issued a notice warning taxpayers that if they file returns under the theory that U.S. citizens and residents aren't subject to tax on their wages and other income earned or derived within the United States, they may be subject to penalties.&quot;\n\nTruth - This is an excellent example of IRS &quot;word-smithing&quot;. First, note that the IRS has warned &quot;taxpayers&quot; (not the public generally). This is because the federal courts have ruled that Congress makes no tax laws that apply to nontaxpayers!\n\n    &quot;The revenue laws are a code or system in regulation of tax assessment and collection. They relate to taxpayers, and not to nontaxpayers. The latter are without their scope. No procedure is prescribed for nontaxpayers, and no attempt is made to annul any of their rights and remedies in due course of law. With them [nontaxpayers] Congress does not assume to deal, and they are neither of the subject nor of the object of the revenue laws&quot;. [emphasis added]\n    Economy Plumbing and Heating Co. v. US, 470 F. 2d 585 (1972)\n\nIn so far as the IRS statement applies exclusively to &quot;taxpayers&quot;, it is correct because a &quot;taxpayer&quot; is defined in the IRC as &quot;a person liable for any internal revenue tax&quot;. So, to claim to be a taxpayer, and then to claim that you're not liable for taxes that apply to taxpayers is silly. The true question that needs to be asked is, &quot;Who is a taxpayer and who is not?&quot; [See Federal Income Tax and State Income Tax to assist you in determining if you are a taxpayer.] \n\n&quot;The next bit of sophistry is the use of the &quot;legal term&quot; (not a &quot;word&quot;) &quot;wages&quot;. Under the IRC definitions of &quot;wages&quot; [within Chapters 21 &amp; 24], the term is limited to the payroll of the following persons:\n\n   1. Officers and employees of the United States.\n   2. Officers and employees of a State government that has agreed to participate in Social Security.\n   3. Persons working in federal possessions or territories.\n   4. Citizens of the states of the Union, working within a state of the Union, who have declared their pay to be &quot;wages&quot; by executing a Form W-4.\n   5. Aliens working in the United States. &quot;\n\nFor these people, &quot;wages&quot; do constitute income that is subject to State and Federal taxing authority. However, you should know that the pay of a Citizen of the state of the Union, while working within a state of the Union, for a private firm, who has not executed a Form W-4 is not &quot;wages&quot; (as defined in the IRC). [See Federal Income Tax and Federal Employment Taxes for more on these issues.] \n\n****************************************\n\nAll material taken from http://www.originalintent.org/ Available here for sharing and education of your fellow citizens","torrent":{"xt":"urn:btih:db6f91674182efcc65ace1549d85b3fbb21b1bc7","amp;dn":"US+Income+Tax+Law+-+Originalintent.org","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db6f91674182efcc65ace1549d85b3fbb21b1bc7","infoHashBuffer":{"type":"Buffer","data":[219,111,145,103,65,130,239,204,101,172,225,84,157,133,179,251,178,27,27,199]},"announce":[],"urlList":[]}}