{"title":"Dear Boy: The Life Of Keith Moon (Updated Edition) ","uid":8859612,"size":4363784,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db94e809c787bacce759b80a5012192955ee3718&amp;dn=Dear+Boy%3A+The+Life+Of+Keith+Moon+%28Updated+Edition%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"livhre","files":-1,"time":1377741067,"description":"RECORD COLLECTOR BOOK OF THE YEAR 1998: The Epic biography of rock's wildest superstar. Keith Moon was more than just rock's greatest drummer he was also its greatest character...and wildest party animal. Fuelled by vast quantities of drink drugs insecurities and confusion Moon destroyed everything with gleeful abandon: drum kits houses cars hotels relationships and finally himself. In Dear Boy Tony Fletcher has captured lightning in a bottle - the essence of a totally incorrigible yet uniquely generous boy who never grew up and who changed the lives of all who knew him. From a life distorted by myths of debauchery and comic anarchy Fletcher has created a searingly personal portrait of Keith Moon. From over 100 first-hand interviews he traces with deadly accuracy Moon's remarkable journey from his working-class Northwest London childhood through the Who's glory years to the California high-life and a sad premature death. Here too are fascinating insights into the history of the Who and the emergent British pop culture revolution of post-war years. Keith Moon was one of the shock troops of that revolution: the world's greatest rock drummer a phenomenal character and an extravagant hell-raiser who - in a final uncharacteristic act of grace - actually did die before he got old. Illustrated with many photos from personal and Who archives. This is the 2005 Updated version with a new and extended afterword. ","torrent":{"xt":"urn:btih:db94e809c787bacce759b80a5012192955ee3718","amp;dn":"Dear+Boy%3A+The+Life+Of+Keith+Moon+%28Updated+Edition%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db94e809c787bacce759b80a5012192955ee3718","infoHashBuffer":{"type":"Buffer","data":[219,148,232,9,199,135,186,204,231,89,184,10,80,18,25,41,85,238,55,24]},"announce":[],"urlList":[]}}