{"title":"A Mental Healthcare Model for Mass Trauma Survivors: Control-Foc","uid":8642806,"size":1958256,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dbcbcaf3bee7818f07549a095fdb623508d6e755&amp;dn=A+Mental+Healthcare+Model+for+Mass+Trauma+Survivors%3A+Control-Foc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"blackatk","files":-1,"time":1372911289,"description":"Publication Date: March 31, 2011 | ISBN-10: 0521880009 | ISBN-13: 978-0521880008 | Edition: 1\n\nMass trauma events, such as natural disasters, war and torture, affect millions of people every year. Currently, there is no mental health care model with the potential to address the psychological needs of survivors in a cost-effective way. This book presents such a model, along with guidance on its implementation, making it invaluable for both policy-makers and mental health professionals. Building on more than twenty years of extensive research with mass trauma survivors, the authors present a model of traumatic stress to aid understanding of mass trauma and how its psychological impact can be overcome with control-focused behavioral treatment. This text offers a critical review of various controversial issues in the field of psychological trauma in light of recent research findings. Including two structured manuals on earthquake trauma, covering treatment delivery and self-help, the book will be of use to survivors themselves as well as care providers.\n\n\nBook Description\nGlobally, mass trauma events affect millions of people every year. Currently, there is no mental health care model to address survivors' psychological needs. This book presents such a model, along with guidance on cost-effective implementation, making it invaluable for both policy-makers and mental health professionals.\nAbout the Author\nMetin Basoglu, MD, PhD and Professor of Psychiatry, is currently the head of Trauma Studies at the Institute of Psychiatry, King's College London and the director of the Istanbul Centre for Behaviour Research and Therapy, Istanbul. He is internationally recognised as one of the most prominent authorities on torture, war and earthquake trauma. In 1992 he published the edited volume Torture and Its Consequences: Current Treatment Approaches, which defined a scientific discipline at the crossroads of human rights, medicine and social sciences and established itself a classic reference book on torture. His subsequent work focussed on the development of an evidence-based mental health care model for mass trauma survivors based on brief, effective and largely self-help behavioural treatments. In recent years he published to international acclaim research articles demonstrating that the widely presumed distinction between torture and cruel, inhuman and degrading treatments (or 'light torture') is not supported by empirical evidence and that the latter cause more psychological damage than physical torture. His work, pointing to the need for a broader and evidence-based definition of torture, received wide attention in the fields of human rights, mental health, social sciences and law, as well as from the world media.\n\nEbru ÅžalcÄ±oÄŸlu is Co-Director of the Istanbul Centre for Behaviour Research and Therapy (ICBRT/DABATEM), Istanbul, Turkey and Visiting Research Associate in Trauma Studies, Department of Psychological Medicine, Institute of Psychiatry, King's College London, UK. \n\n\nHardcover: 294 pages\nPublisher: Cambridge University Press; 1 edition (March 31, 2011)\nLanguage: English\nISBN-10: 0521880009\nISBN-13: 978-0521880008\n &lt;a href=&quot;\nhttp://www.amazon.com/Mental-Healthcare-Model-Trauma-Survivors/dp/0521880009/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1372903684&amp;sr=1-1&amp;keywords=A+Mental+Healthcare+Model+for+Mass+Trauma+Survivors%3A+Control-Focused+Behavioral+Treatment+of+Earthquake%2C+War+and+Torture+Trauma&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Mental-Healthcare-Model-Trauma-Survivors/dp/0521880009/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1372903684&amp;sr=1-1&amp;keywords=A+Mental+Healthcare+Model+for+Mass+Trauma+Survivors%3A+Control-Focused+Behavioral+Treatment+of+Earthquake%2C+War+and+Torture+Trauma&lt;/a&gt;\n","torrent":{"xt":"urn:btih:dbcbcaf3bee7818f07549a095fdb623508d6e755","amp;dn":"A+Mental+Healthcare+Model+for+Mass+Trauma+Survivors%3A+Control-Foc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbcbcaf3bee7818f07549a095fdb623508d6e755","infoHashBuffer":{"type":"Buffer","data":[219,203,202,243,190,231,129,143,7,84,154,9,95,219,98,53,8,214,231,85]},"announce":[],"urlList":[]}}