{"title":"Story of the Eye","uid":4709643,"size":732971008,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dc35362ccc981ad5578b376616fba5c71716eb88&amp;dn=Story+of+the+Eye&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"becausebecause","files":1,"time":1233967798,"description":"TPB: http://thepiratebay.se/torrent/4709536\nIMDB: http://www.imdb.com/title/tt0379797/\n\nGEORGES BATAILLE'S STORY OF THE EYE\n\nInspired by the notorious 1928 pornographic novel by Georges Bataille, the patron saint of postmodernism, Andrew Repasky McElhinney's &quot;Georges Bataille's Story of the Eye&quot; is a genuine independent film, with no commercial prospects and no economic reason for being. It is a strange, beautiful, disturbing and at times literally painful work, an original and distinctive expression by a gifted young Philadelphia-based filmmaker who here confirms the talent he displayed in his 2001 film, &quot;A Chronicle of Corpses.&quot;\n\nIf Bataille's novel was an attempt to write that which should not be written - it is his work that introduced the notion of transgression, the violent, ecstatic breaking of taboos that became so important to postmodern thinkers like Michel Foucault and Susan Sontag - Mr. McElhinney's film is an attempt to show that which should not be shown. That means hard-core sex, performed in all the possible permutations by a fearless young cast.\n\nShot on digital video, &quot;Story of the Eye&quot; takes place largely in an old, abandoned house, where the sexual partners get together wordlessly, performing their couplings in a dreamlike daze, as if they were hypnotized by the acts in which they are engaged. The lighting is bright, the colors highly saturated, giving the film an almost clinical look (and indeed, it begins with a long clip of childbirth, apparently lifted from a medical film).\n\nThough a narrator briefly intones a few sentences about Bataille and his work, there is no dialogue among the principals. Words have been banished from this privileged space, where, true to the work's title, the eye is the protagonist. We look, but we also look away, and Mr. McElhinney wants to make us aware of our conflicting impulses. Every spectator will have his or her own limits, and when we instinctively glance away, we learn where those limits are.\n\nMr. McElhinney has also presented &quot;Story of the Eye&quot; as a video installation in art galleries, with monitors positioned so that spectators watching one screen can also watch the spectators watching another. Something similar happens even in the screening room, as eyes diverted from the screen encounter other eyes, also looking away in the dark.\n\nDarkness finally settles over the film itself, when, after a dramatic climax that is also a sexual one, the screen goes black and the soundtrack swells with an electronic whine. At this point, Mr. McElhinney dares to attack his audience physically, bringing the whine up to mildly painful levels, as if he were trying to drive spectators from the theater (an invitation that many audience members will immediately accept). This is transgression in a literal sense, an act of aggression that Bataille would no doubt have appreciated. This is not a movie for passive consumption, but a film that bites back.\n\nThe final image in &quot;Story of the Eye,&quot; which opens today at the Pioneer Two Boots Theater in the East Village, is a simple set of color bars: the test pattern used by technicians to balance color values. It is a reminder that for all the aggressive, almost physical power of these images, they are, after all, patterns of light bouncing off a blank screen. In the terms established by &quot;Story of the Eye,&quot; the bars represent a happy ending. We have survived, and now we can see clearly, the eye reposing in a glowing field of color without content, light without shadow.\n\nWITH: Melissa Elizabeth Forgione, Querelle Haynes, Sean Timothy Sexton, Courtney Shea, Claude Barrington White and Kevin Mitchell Martin (Narrator). \n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyFlicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n   &lt;a href=&quot; http://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com/&lt;/a&gt;\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:dc35362ccc981ad5578b376616fba5c71716eb88","amp;dn":"Story+of+the+Eye","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc35362ccc981ad5578b376616fba5c71716eb88","infoHashBuffer":{"type":"Buffer","data":[220,53,54,44,204,152,26,213,87,139,55,102,22,251,165,199,23,22,235,136]},"announce":[],"urlList":[]}}