{"title":"Harmony Improvisator","uid":4858039,"size":5678624,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dc56490db2b8cb74973ed5c1f654398104696254&amp;dn=Harmony+Improvisator&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"schmooster2006","files":2,"time":1240102512,"description":"This is NOT the Demo, this is the FULL VERSION\n\nJust add the .dll file to your VST folder and import to your DAW in the normal way - that's it. Enjoy!!\n\nPlease Note: This does not make any sound itself, you must route the output from the Improvisator to the input of your sound source VST, i.e.:\n\nIn Fruity Loops for example:\n1. Add Improvisator in one channel and your sound source in another.\n2. Open each Plugin and click on the Plugin's drop down menu (under the wrapper menu on the top left)\n3. For Improvisator select 'Show MIDI Output Port' - this is displayed in the right-hand-corner of the wrapper window (where it says Port) - change this to 1 for example by clicking on it and dragging the mouse (or whatever Port you want from 1-255)\n4. Open the same menu on your sound source channel and select 'Show MIDI Input Port' and change this to the same number as above (1 in this case).\n5. Job done - select Improvisator Plugin and click away with the mouse, the Midi keyboard keys play the current progression or an arpeggiated version of it, make your selections with the mouse and 'record' the progressions by clicking where it says 'No Capturing' and select 'Insert' - any you don't want can be deleted leaving behind a very professional sounding sequence of chords. You can also split the keyboard if you really know what you're doing (which I don't). - Hope this helps.\n\nWebsite contains all the help you'll need if you're still struggling - \nwww.improvisator.de\n","torrent":{"xt":"urn:btih:dc56490db2b8cb74973ed5c1f654398104696254","amp;dn":"Harmony+Improvisator","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc56490db2b8cb74973ed5c1f654398104696254","infoHashBuffer":{"type":"Buffer","data":[220,86,73,13,178,184,203,116,151,62,213,193,246,84,57,129,4,105,98,84]},"announce":[],"urlList":[]}}