{"title":"Grand Designs Australia S03E01 Mansfield Indoor Outdoor avi","uid":7760875,"size":503699306,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dc5af3f9f5ae89913f0bf16b473cee871458cc12&amp;dn=Grand+Designs+Australia+S03E01+Mansfield+Indoor+Outdoor+avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"FatFreddy638","files":1,"time":1351223142,"description":"Victoria's high country is the idyllic location of Pamela &amp; Stuart's quaint little weekender but with a permanent move here looming, it's time to up-size. Will their new outward focusing house, have the same charm?For ten years Pamela and Stuart have relished weekends in a tiny, unpowered hut on their cattle property in Victoria's high country - but with retirement around the corner feel it's time to upgrade. Limited only by materials that have to suit the rugged conditions - what emerges is bold and unique. Pamela and Stuart clearly embrace their architect's avaunt-garde approach - but will they manage to transfer the charm of their old hut - with its fabulous bush character, into this brand new rural retreat?\n\nA big thank you to all original cappers and posters\n\nI will gladly upload this whole series on the one condition that people do not nag me for the next episode in the comments.I will upload them as soon as they are available to me. I do this for free in my own time and demanding more from me really erodes my good nature.thanks and enjoy the program","torrent":{"xt":"urn:btih:dc5af3f9f5ae89913f0bf16b473cee871458cc12","amp;dn":"Grand+Designs+Australia+S03E01+Mansfield+Indoor+Outdoor+avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc5af3f9f5ae89913f0bf16b473cee871458cc12","infoHashBuffer":{"type":"Buffer","data":[220,90,243,249,245,174,137,145,63,11,241,107,71,60,238,135,20,88,204,18]},"announce":[],"urlList":[]}}