{"title":"Revolution.Under.Siege-SKIDROW","uid":5988858,"size":998076573,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dd012b3fbb6fb5096c3ed4b14b5d33735236a82f&amp;dn=Revolution.Under.Siege-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"rlf-rls","files":22,"time":1290827671,"description":"Revolution Under Siege / SEP REDS\n\nRELEASE DATE: 27-11-2010 PROTECTION: Serial\nGAME TYPE: Strategy DISKS: 1 DVD\n\nRelease Notes:\n\nThe Skid Rowdies are looking new blood to fill up the ranks\nWe're a professional team of dedicated sceners with big mark\nunder sceners. We believe on the ground idealism of the root\nof the real old school scene. We do all this for fun and\nnothing else. We don't earn anything on our hobby, as we do\nthis for the competition and the heart of what got the scene\nstarted in the mid eighties\n\nIf you think you got something to offer, then don't hold back\non contacting us as soon as possible\n\nOn with the game release information:\n\nRevolution Under Siege (RUS) is a simultaneous turn based\nhistorical wargame that puts you in charge of one of the\nfactions that fought the Russian Civil War (1917-1923). From a\nragtag group of volunteers create the powerful Red Army, using\nall the weaponry and equipment at your disposal: planes\ntanks, armored trains, Cheka troops and the Konarmia (the\nfamous Red Cavalry). Or, on the opposite side, gather all\npatriots and reform the elite divisions that shall save Holy\nMother Russia. Can you succeed in crushing the Bolshevik\nhydra? Or will the People's Revolution prevail? Several sides\nare playable: Trotsky's Red Army, Denikin's white\ncounter-revolutionary forces of Southern Russia, Kolchak's\nSiberians, Finnish from both sides, or the newly independent\nPolish troops led by Marshal Pilsudski. The game uses the AGE\nengine, famous from titles such as AGEOD's American Civil War\nor Wars in America, renown and awarded wargames\n\nA map of unrivalled precision from Poland to the Pacific\nOcean\n\nMeet again our know-how for historical realism: hundreds of\nofficers and units are faithfully transcript in the game\n\nPolitics, requisitions, revolts, repression: Gain support of\nthe population or pressure them with your political police\n\nCleverly use the brand new weapons of the time: tanks\narmored trains and aircrafts\n\nRecruitment, organization: Create massive armies from groups\nof volunteers and send them to ambitious maneuvers and\nvictory\n\nCan you capture Lenin or eliminate the different White\nleaders?\n\nUse diplomacy to trigger foreign nations entry in the war\nNew allies will endlessly change the course of your games!\n\nFind out unique campaigns covering each one of the years of\nthe war in Russia, as well as the Finnish Civil War ( 1918 ) or\nthe Russian-Polish war ( 1920 ). Or rewrite history with an\nambitious &quot;what if&quot; scenario\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Copy the cracked content from the SKIDROW folder on the DVD\nto the main installation folder and overwrite\n5. Enter anything at the serial screen\n6. Play the game\n\nSupport the companies, which software you actually enjoy!\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS","torrent":{"xt":"urn:btih:dd012b3fbb6fb5096c3ed4b14b5d33735236a82f","amp;dn":"Revolution.Under.Siege-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd012b3fbb6fb5096c3ed4b14b5d33735236a82f","infoHashBuffer":{"type":"Buffer","data":[221,1,43,63,187,111,181,9,108,62,212,177,75,93,51,115,82,54,168,47]},"announce":[],"urlList":[]}}