{"title":"Mercedes-Benz parade and staff cars of the Third Reich, 1933-45 ","uid":9952998,"size":17209442,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd0b7f365315c699ac89b8b22d0ec234487c773e&amp;dn=Mercedes-Benz+parade+and+staff+cars+of+the+Third+Reich%2C+1933-45+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"STBGD","files":-1,"time":1397430924,"description":"Mercedes-Benz parade and staff cars of the Third Reich, 1933-45: an illustrated history\n1998 / English / ISBN:\t0938289934, 9780938289937 / 16 MB / epub\n\nMercedes-Benz automobiles were popular in Germany and were naturally taken into use by the various agencies of the Third Reich. Many of these automobiles appear in famous photographs of the era, from pre-war Party rallies to the entry into Austria, Czechoslovakia and Poland to Hitler's departure from Rastenburg after the assassination attempt upon him.The author traces the early history and insignia of the various predecessors of Mercedes-Benz, culminating in the merger of Mercedes and Benz in 1926.Since Mercedes-Benz automobiles were seen as symbols of the prosperous Germany promised by the Nazis, they were often displayed by Party leaders during the years of struggle, with G?ring's 1931 roadster being the most famous example. The cars were also speedy and sturdy, allowing Hitler and his top associates to campaign throughout Germany at a speed that caught his political opponents unprepared.State power brought almost infinite resources into the hands of the Nazi Party, and liberal use of luxury automobiles were part of the spoils of victory. Again, a vehicle belonging to Hermann G?ring typifies the era, in this case his massive Grosser Mercedes six-seat touring car.The early war brought the automobile's most colorful moment, as part of Hitler's personal Grey (or F?hrer) Column, which toured parts of Poland even as fighting was still in progress. Allied air supremacy soon made such operations too hazardous, but Mercedes cars soldiered on with important state duties, often with bullet-proof windows and low-visibility headlights and occasionally with anti-aircraft machine guns mounted.Mercedes-Benz Staff Cars covers in detail all of the models, personalities and important events in the automotive history of the Third Reich. Blaine Taylor's fascinating text is supplemented by an extraordinary array of illustrations, from retro-futuristic paintings of the 1930s to unpublished photographs from the Hermann G?ring, Joachim von Ribbentrop, Eva Braun, and Heinrich Hoffmann archives.","torrent":{"xt":"urn:btih:dd0b7f365315c699ac89b8b22d0ec234487c773e","amp;dn":"Mercedes-Benz+parade+and+staff+cars+of+the+Third+Reich%2C+1933-45+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd0b7f365315c699ac89b8b22d0ec234487c773e","infoHashBuffer":{"type":"Buffer","data":[221,11,127,54,83,21,198,153,172,137,184,178,45,14,194,52,72,124,119,62]},"announce":[],"urlList":[]}}