{"title":"The Beatles - Yellow Submarine (1969) WMA320","uid":6283787,"size":107290691,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dd6a00e98da2625dbbb1a0bf2fcd5d834a645ec4&amp;dn=The+Beatles+-+Yellow+Submarine+%281969%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1301540459,"description":"Makes me laugh when I read bad reviews about any Beatles album. \n\nAlthough the original Soundtrack to &quot;Yellow Submarine&quot; may not rank at the top of my fave Beatles albums list, it is more representative of the original movie than the more recent re-release that came out with the DVD release. \n\nTrue, the title track and &quot;All You Need Is Love&quot; WERE previously available on other albums. But the four new tracks were fantastic additions to The Beatles' catalog.... with the exception of MAYBE Paul's silly &quot;Altogether Now&quot;. But, as the official review stated, &quot;Beatles throw-aways are any other band's greatest hits!&quot; (paraphrased). \n\nGeorge gets to shine on the Yellow Sub soundtrack. &quot;Only A Northern Song&quot; has a similar melody line and structure as his song from two years prior, &quot;If I Needed Someone&quot;, but with a much more psychadelic flavor. &quot;It's All Too Much&quot; is one of Harrison's best tracks ever - with The Beatles or solo. On this track, you can detect the influence his buddy Eric Clapton was having on him by 1968. \n\nJohn's &quot;Hey, Bulldog&quot; is another one of those Lennon masterpieces that somehow got over-looked, much like &quot;Across The Universe&quot; has always been. It contains one of the most recognizable and iconic guitar/piano/bass licks ever recorded. It also features some of Paul McCartney's best bass work. \n\n&quot;Altogether Now&quot; is a fun song. Not the best Beatles track, but one that is such a part of the whole &quot;Yellow Sub&quot; vibe that it's shortfalls are more than forgiven. As a some-time songwriter myself, I'd have been proud to be able to say that I wrote it! \n\nThe instrumentals are just that - instrumentals used as background music for the movie. They are classic George Martin and, just as he worked so well with The Beatles, they work well along side The Beatles' songs. \n\nNo Beatles record collection is complete without &quot;Yellow Submarine&quot;. \n\nby J. C. Darling\n\nTRACKLIST:\n\n01 - Yellow Submarine.wma                              \n02 - Only A Northern Song.wma                          \n03 - All Together Now.wma                              \n04 - Hey Bulldog.wma                                   \n05 - It's All Too Much.wma                             \n06 - All You Need Is Love.wma                          \n07 - Pepperland.wma                                    \n08 - Sea Of Time.wma                                   \n09 - Sea Of Holes.wma                                  \n10 - Sea Of Monsters.wma                               \n11 - March Of The Meanies.wma                          \n12 - Pepperland Laid Waste.wma                         \n13 - Yellow Submarine In Pepperland.wma \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!","torrent":{"xt":"urn:btih:dd6a00e98da2625dbbb1a0bf2fcd5d834a645ec4","amp;dn":"The+Beatles+-+Yellow+Submarine+%281969%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd6a00e98da2625dbbb1a0bf2fcd5d834a645ec4","infoHashBuffer":{"type":"Buffer","data":[221,106,0,233,141,162,98,93,187,177,160,191,47,205,93,131,74,100,94,196]},"announce":[],"urlList":[]}}