{"title":"Elder Scrolls V Skyrim [ISO] + Crack","uid":7178446,"size":5500668564,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dd7d366c77319c00a4a35b9a5d0ac1e6df42838c&amp;dn=Elder+Scrolls+V+Skyrim+%5BISO%5D+%2B+Crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"korzak20","files":-1,"time":1334190899,"description":"Skyrim, the fifth - and apparently final - entry in The Elder Scrolls saga is one of the year's biggest gaming releases, and a highly awaited one for RPG fans. Set 200 years after the events of Oblivion, Skyrim takes place in the eponymous frozen north of Tamriel, where snowstorms rage against a backdrop of impending civil war. Meanwhile, dragons, thought to be a long-dead legend, have taken to the skies.\n\nIn fact, you're confronted with one within a few minutes of starting the game. In a trope that'll be familiar to players of previous Elder Scrolls games, you begin as a prisoner, this time in the process of being unceremoniously carted to the executioner's block. Before long, you're running for your life as gouts of dragon-fire sear the ground behind you. From the very beginning, the path you take can split dramatically, as you're helped to safety by either soldiers of the Cyrodillic Empire or Stormcloak rebels.\n\nNeedless to say, the presence of dragons is in no way incidental to the plot - you're soon thrust into combat with the creatures, discovering in the process that you are endowed with some unique abilities that entwine your fate with theirs. It's hard to go into further detail without destroying some of the joy of discovery as the main thread of the game's epic story arc becomes apparent.\n\n\n","torrent":{"xt":"urn:btih:dd7d366c77319c00a4a35b9a5d0ac1e6df42838c","amp;dn":"Elder+Scrolls+V+Skyrim+%5BISO%5D+%2B+Crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd7d366c77319c00a4a35b9a5d0ac1e6df42838c","infoHashBuffer":{"type":"Buffer","data":[221,125,54,108,119,49,156,0,164,163,91,154,93,10,193,230,223,66,131,140]},"announce":[],"urlList":[]}}