{"title":"Historical And Geographical Study Guide Of Israel - A. Fruchten","uid":11728325,"size":8873436,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd7dc51194f7cea6fcd3fb199ea4a44d3bf5feac&amp;dn=Historical+And+Geographical+Study+Guide+Of+Israel+-+A.+Fruchten&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"starxteel","files":1,"time":1425169165,"description":"\n This comprehensive reference guide will illuminate your understanding of the Old Testament and the gospels through examining virtually every place in Israel in relation to biblical events and themes and studying Jewish history, especially the history of the State of Israel. A new format makes this study guide an excellent traveling companion on all Israel tours as well as an essential resource for any believer's ongoing study. As an added bonus, we've included information on Jordan. This revised edition includes an update on the current state of Israel (since 2008), vivid new art work including the cover and chapter heading pages, a glossary, subject index and scriptural index.\n\nAbout the author:\nUpon graduating from high school, Arnold was forced by his father to leave home because of his faith. In 1962, he began undergraduate education at Shelton College in New Jersey. Transferring to Ohio's Cedarville College, he graduated with a Bachelor of Arts degree in Hebrew and Greek in 1966. He then moved to Israel, where he studied archaeology, ancient history, historical geography, and Hebrew at the American Institute of Holy Land Studies and the Hebrew University in Jerusalem. During this time, he witnessed the historic Six-Day War in 1967. Later that year, Arnold returned to the U.S. and entered Dallas Theological Seminary for studies in Hebrew and Old Testament. He also began working as a missionary with ABMJ (today, Chosen People Ministries)","torrent":{"xt":"urn:btih:dd7dc51194f7cea6fcd3fb199ea4a44d3bf5feac","amp;dn":"Historical+And+Geographical+Study+Guide+Of+Israel+-+A.+Fruchten","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd7dc51194f7cea6fcd3fb199ea4a44d3bf5feac","infoHashBuffer":{"type":"Buffer","data":[221,125,197,17,148,247,206,166,252,211,251,25,158,164,164,77,59,245,254,172]},"announce":[],"urlList":[]}}