{"title":"Audio Power Amplifier Design Handbook, 5th Ed - (Malestrom)","uid":5614820,"size":4214014,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd9e44c54d156c9aaeaf6d21eba563b706b598b3&amp;dn=Audio+Power+Amplifier+Design+Handbook%2C+5th+Ed+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"malestrom_HH","files":2,"time":1276027363,"description":"\n\nDouglas Self, &quot;Audio Power Amplifier Design Handbook, 5 Ed&quot;\nFocal Press | 2009 | ISBN: 0240521625 | 608 pages | PDF\n\nThis book is the essential reference for audio power amplifier designers and engineers. Author Douglas Self covers all the issues of distortion and linearity, power supplies, protection, reliability and layout. He also tackles unusual forms of compensation and unexpected sources of distortion such as capacitors and fuses.\nThis much expanded and updated Fifth Edition includes four NEW chapters, one of them dedicated to the XD crossover-displacement principle, invented by the author, and used by Cambridge Audio. The book has a wealth of new material on four-stage amplifier architectures, current-mirrors, power transistors with internal sensing diodes, amplifier bridging, subtle distortion mechanisms, input stage common-mode distortion, double input stages, amplifier stability, output stages with gain, transformers and hum fields, inrush current suppression, DC servo design, thermal protection, the subtleties of cooling fan control, advanced line input stages, ultra-low-noise design, high and low-pass filtering, testing and safety, infra-red control, signal activation, 12V trigger, level indication and much more. There is significantly expanded material on professional power amplifiers as used in sound reinforcement and PA applications.\nThis book is a must-have for audio power amplifier professionals and audiophiles, amateur constructors and anyone with intellectual curiosity about the struggle towards technical excellence.\n\n*Provides everything you want to know in one volume, offering an essential guide to design principals and practice\n*Includes numerous graphs and an easy to read layout to illustrate points and aid complete understanding.\n*Includes the author's own amplifier designs for readers to build upon and adapt ","torrent":{"xt":"urn:btih:dd9e44c54d156c9aaeaf6d21eba563b706b598b3","amp;dn":"Audio+Power+Amplifier+Design+Handbook%2C+5th+Ed+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd9e44c54d156c9aaeaf6d21eba563b706b598b3","infoHashBuffer":{"type":"Buffer","data":[221,158,68,197,77,21,108,154,174,175,109,33,235,165,99,183,6,181,152,179]},"announce":[],"urlList":[]}}