{"title":"The Titfield Thunderbolt 1952 DVDrip DX50 Ealing Comedy 1953","uid":3711940,"size":689490384,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dfc64d9f9b04f7feb58e15908abb70a65ec4adcf&amp;dn=The+Titfield+Thunderbolt+1952+DVDrip+DX50+Ealing+Comedy+1953&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mike18xx","files":15,"time":1181647624,"description":"An underestimated film that has aged very well, 4 January 2005\nAuthor: alexanderhughesreplies from United Kingdom\n\nThis is a comedy with many of the traditional Ealing attributes - whimsy, cheerfulness, small-versus-big storyline - but it has aged far better than many of its sister titles from Ealing. This is because the film was made in rural England just before it changed forever. It features beautiful locations (around Bath in Somerset) and a stereotypical village of characters which must have seemed very normal in 1953, but which hardly exist today. I have seen this film many many times, but I have never got bored by it. It has taken on a new power over the last twenty years and it has undoubtedly grown in popularity. Why? It is a portrait of a lost world, where people greeted each other in the street, where trains ran (on time) through villages, where cars did not rule every road. The Titfield Thunderbolt, of all films, predicted back in 1953 what would happen if we got rid of our railways - and look how tragically it has been proved right. Watch this film as a window on that lost world, but don&amp;#039;t forget to laugh! It is a great little comedy: fast paced, energetically acted, beautifully shot by Douglas Slocombe and directed with brio by Charles Crichton. Recommended to all.\n\nFor what it&amp;#039;s worth, here are my top 8 Ealing Comedies. Pole position was easy, thereafter was hard: 1) Kind Hearts and Coronets 2) The Lavender Hill Mob 3) Whisky Galore 4) The Titfield Thunderbolt 5) The Man in the White Suit 6) The Ladykillers 7) Passport to Pimlico 8} Hue and Cry ","torrent":{"xt":"urn:btih:dfc64d9f9b04f7feb58e15908abb70a65ec4adcf","amp;dn":"The+Titfield+Thunderbolt+1952+DVDrip+DX50+Ealing+Comedy+1953","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfc64d9f9b04f7feb58e15908abb70a65ec4adcf","infoHashBuffer":{"type":"Buffer","data":[223,198,77,159,155,4,247,254,181,142,21,144,138,187,112,166,94,196,173,207]},"announce":[],"urlList":[]}}