{"title":"Syracuse 415-413 BC: Destruction of the Athenian Imperial Fleet","uid":11794939,"size":40524602,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfed4c579c6f397b3f8979fdcb0e6a00df44aa5c&amp;dn=Syracuse+415-413+BC%3A+Destruction+of+the+Athenian+Imperial+Fleet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1428101994,"description":"Osprey's study of one of the most important battles of the Peloponnesian War (431 - 404 BC). In 415 BC Athens launched a large expeditionary force, its goal the rich, grain-producing island of Sicily. This was in response to a call for help in a minor war from an old ally but the true objectives were the powerful city of Syracuse, suspected of supporting Athens' Peloponnesian enemies, and imperial expansion. The Athenians won an inconclusive victory over the Syracusans late in the year and renewed their attack in the spring of 414. After a period of energetic siege warfare and a series of large-scale battles on land and sea, the Syracusans gained the upper hand and the expedition ended in total disaster with grave consequences for the future of Athens.\n\nNic Fields explores the background of this foolhardy venture in which Athens took on a nation that was militarily and financially strong and over 700 miles distant. Then, following the narrative of Thucydides, the chronicler of the Peloponnesian War, he describes and explains the long and violent campaign that pitted the two largest democracies of the Greek world against each other","torrent":{"xt":"urn:btih:dfed4c579c6f397b3f8979fdcb0e6a00df44aa5c","amp;dn":"Syracuse+415-413+BC%3A+Destruction+of+the+Athenian+Imperial+Fleet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfed4c579c6f397b3f8979fdcb0e6a00df44aa5c","infoHashBuffer":{"type":"Buffer","data":[223,237,76,87,156,111,57,123,63,137,121,253,203,14,106,0,223,68,170,92]},"announce":[],"urlList":[]}}