{"title":"Hitler's Economy: Nazi Work Creation Programs, 1933-1936","uid":11822336,"size":967482,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e0081c9607e94862f8c85ce832f76c14cacba97c&amp;dn=Hitler%27s+Economy%3A+Nazi+Work+Creation+Programs%2C+1933-1936&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429310498,"description":"When Hitler assumed the German chancellorship in January 1933, 34 percent of Germany's work force was unemployed. By 1936, before Hitler's rearmament program took hold of the economy, most of the jobless had disappeared from official unemployment statistics. How did the Nazis put Germany back to work? Was the recovery genuine? If so, how and why was it so much more successful than that of other industrialized nations? Hitler's Economy addresses these questions and contributes to our understanding of the internal dynamics and power structure of the Nazi regime in the early years of the Third Reich.\n\nDan Silverman focuses on Nazi direct work creation programs, utilizing rich archival sources to trace the development and implementation of these programs at the regional and local level. He rigorously evaluates the validity of Nazi labor market statistics and reassesses the relative importance of road construction, housing, land reclamation, and resettlement in Germany's economic recovery, while providing new insights into how these projects were financed. He illuminates the connection between work creation and Nazi race, agriculture, and resettlement policies. Capping his work is a comparative analysis of economic recovery during the 1930s in Germany, Britain, and the United States.\n\nSilverman concludes that the recovery in Germany between 1933 and 1936 was real, not simply the product of statistical trickery and the stimulus of rearmament, and that Nazi work creation programs played a significant role. However, he argues, it was ultimately the workers themselves, toiling under inhumane conditions in labor camps, who paid the price for this recovery. Nazi propaganda glorifying the &quot;dignity of work&quot; masked the brutal reality of Hitler's &quot;economic miracle.&quot;","torrent":{"xt":"urn:btih:e0081c9607e94862f8c85ce832f76c14cacba97c","amp;dn":"Hitler%27s+Economy%3A+Nazi+Work+Creation+Programs%2C+1933-1936","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0081c9607e94862f8c85ce832f76c14cacba97c","infoHashBuffer":{"type":"Buffer","data":[224,8,28,150,7,233,72,98,248,200,92,232,50,247,108,20,202,203,169,124]},"announce":[],"urlList":[]}}