{"title":"Steelhaven series by Richard Ford (01-02)","uid":9770506,"size":1688550,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e073181005454f4ba67f9c64ee67f794a34015b1&amp;dn=Steelhaven+series+by+Richard+Ford+%2801-02%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":2,"time":1394943398,"description":"\nRichard Ford originally hails from Leeds in the heartland of Yorkshire, but now resides in the Wiltshire countryside, where he can be found frolicking in the Thames, drinking cider and singing songs about combine harvesters.\n\nGenre: Fantasy\n\n\nHerald of the Storm by Richard Ford (Steelhaven #01)\n\nWelcome to Steelhaven.....\n\nAn unbalanced veteran, a disillusioned assassin, a hapless apprentice, a drunken swindler, a desperate thief...during times of crisis, you don't get to choose your heroes.\n\nUnder the reign of King Cael the Uniter, this vast cityport on the southern coast has for years been a symbol of strength, maintaining an uneasy peace throughout the Free States. But now a long shadow hangs over the city, in the form of the dread Elharim warlord, Amon Tugha. When his herald infiltrates the city, looking to exploit its dangerous criminal underworld, and a terrible dark magick that has long been buried once again begins to rise, it could be the beginning of the end.\n\nThe Shattered Crown by Richard Ford (Steelhaven, #2)\n\nHeroes must rise... The King is dead. His daughter, untested and alone, now wears the Steel Crown. And a vast horde is steadily carving a bloody road south, hell-bent on razing Steelhaven to the ground...or the city will fall. Before the city faces the terror that approaches, it must crush the danger already lurking within its walls. But will the cost of victory be as devastating as that of defeat?","torrent":{"xt":"urn:btih:e073181005454f4ba67f9c64ee67f794a34015b1","amp;dn":"Steelhaven+series+by+Richard+Ford+%2801-02%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e073181005454f4ba67f9c64ee67f794a34015b1","infoHashBuffer":{"type":"Buffer","data":[224,115,24,16,5,69,79,75,166,127,156,100,238,103,247,148,163,64,21,177]},"announce":[],"urlList":[]}}