{"title":"Introduction to Quantitative Methods for Financial Markets","uid":10092214,"size":2606813,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e0d514dc6802d43cf91b733bc8b6c3f58e7a86e4&amp;dn=Introduction+to+Quantitative+Methods+for+Financial+Markets&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1399223244,"description":"ABOUT THIS BOOK\n- First volume of a new series\n- Self-contained and compact introduction to financial mathematics and quantitative modeling of financial markets\n- Covers a broad area, from a basic introduction to financial markets, products and concepts, via model development, up to the calibration of models to market data and implementation of pricing algorithms\n- Leads the reader from standard derivatives to quite advanced recent exotic products\n- Practical aspects and benefits of implementation techniques are discussed and illustrated using Mathematica and UnRisk (software available to readers)\n- Ready for classroom use or self-study\n- Provides many illustrative examples and exercises, some with solutions\nSwaps, futures, options, structured instruments - a wide range \nof derivative products is traded in today's financial markets. \nAnalyzing, pricing and managing such products often requires \nfairly sophisticated quantitative tools and methods. This book \nserves as an introduction to financial mathematics with special \nemphasis on aspects relevant in practice. In addition to numerous \nillustrative examples, algorithmic implementations are demonstrated \nusing &quot;Mathematica&quot; and the software package &quot;UnRisk&quot; (available \nfor both students and teachers). The content is organized in 15 \nchapters that can be treated as independent modules.\n\n\nAUTHORS &amp; EDITORS\nHansjoerg Albrecher is Professor of Actuarial Science at the Faculty of Business and Economics, University of Lausanne, as well as a Faculty Member of the Swiss Finance Institute. Previous affiliations include the Johann Radon Institute for Computational and Applied Mathematics of the Austrian Academy of Sciences in Linz, the University of Linz, the University of Aarhus, K.U. Leuven and Graz University of Technology. The author has ample experience in connecting the academic world with practitioners' views and problems, and has been advising banks and insurance companies.\n\nAndreas Binder is CEO of MathConsult GmbH and head of MathConsult's computational finance group, who have been developing the UnRiskÂ® software suite for valuation and risk management of financial instruments. He is an experienced adviser of banks, auditors, regulators and capital management firms.\n\nVolkmar Lautscham has graduated in Technical Mathematics and Financial/Industrial Management from Graz University of Technology and Karl-Franzens University, respectively, with longer academic stays abroad in Sheffield, London and Stockholm. From 2006 to 2009, he was working for a major investment bank in London focusing on credit underwriting/structuring and real estate. The author currently holds a position at the University of Lausanne, where he pursues a PhD degree and teaches within the MSc Actuarial Science programme.\n\nPhilipp Mayer obtained his PhD in financial mathematics from Graz University of Technology. He then held amongst others a post-doc position at the Radon Institute of the Austrian Academy of Sciences in Linz, before returning to Graz as an assistant professor, where he carried out research in financial mathematics and taught both bachelor and master level courses. In 2010 he joined the Financial Markets department of a major financial institution in Brussels, where he is responsible for modeling equity, commodity and hybrid instruments.","torrent":{"xt":"urn:btih:e0d514dc6802d43cf91b733bc8b6c3f58e7a86e4","amp;dn":"Introduction+to+Quantitative+Methods+for+Financial+Markets","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0d514dc6802d43cf91b733bc8b6c3f58e7a86e4","infoHashBuffer":{"type":"Buffer","data":[224,213,20,220,104,2,212,60,249,27,115,59,200,182,195,245,142,122,134,228]},"announce":[],"urlList":[]}}