{"title":"InfiniteSkills Learning C++","uid":8784113,"size":1448105318,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e0f2c289c0952e5608dd18680dc177c5d34aa588&amp;dn=InfiniteSkills+Learning+C%2B%2B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"EliteBeast","files":-1,"time":1375784156,"description":"Duration 10 hours\n\nIn this Learning C++ training course, Professor and expert instructor Mike McMillan introduces you to the basics of programming in C++. With over 25 years of programming experience, 13 years of experience teaching programming, and authoring 6 textbooks on programming, you can be well assured that you will be taught the correct way, the first time!\n\nStarting with the basics of the C++ programming language, this video tutorial covers all of the basic operations you need to start building your own C++ programs. You will learn about standard data types, variables, arithmetic expressions, flow control, functions, classes, arrays, pointers, and much much more. Throughout this computer based training DVD, you will not only be shown the various operations, but you will actually get a chance to follow along with the author and practice what you learned with exercises that build on what you were just taught.\n\nBy the completion of this C++ training video, you will understand that basics of what C++ is, the basic language constructs, and how to utilize them to create a fully functioning C++ program. Included are working files to allow you to follow along with exactly what the author is teaching you.","torrent":{"xt":"urn:btih:e0f2c289c0952e5608dd18680dc177c5d34aa588","amp;dn":"InfiniteSkills+Learning+C%2B%2B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0f2c289c0952e5608dd18680dc177c5d34aa588","infoHashBuffer":{"type":"Buffer","data":[224,242,194,137,192,149,46,86,8,221,24,104,13,193,119,197,211,74,165,136]},"announce":[],"urlList":[]}}