{"title":"Food, Diet and Obesity - David J. Mela","uid":15308820,"size":2979009,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1078638959dbc202674abcce73c8b9676efae02&amp;dn=Food%2C+Diet+and+Obesity+-+David+J.+Mela&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1468552199,"description":"Food, Diet and Obesity - David J. Mela (WP, 2005).pdf\r\n\r\nISBN 978-1-85573-958-1\r\n\r\nThe global obesity epidemic is arguably the most serious health issue facing the food industry today. Food manufacturers are under increasing pressure over both the degree to which they are seen as contributing to the problem, and the role they should play in solving it. Drawing on the expertise of many of the world’s leading experts in this area, Food, diet and obesity summarises the key research on the links between obesity and diet. Topics discussed include trends in obesity, the evidence behind popular diets and meal replacers, the effectiveness of fat and sugar replacers in food, emerging issues such as the value of the glycemic index, protein content and calcium in weight control, and potential functional food targets and ingredients for weight control.\r\n\r\nAfter an introductory chapter on global trends in obesity, part one looks at the range of contributing factors to obesity, from nutrient-gene interactions, energy metabolism and physical activity to sensory responses to food, portion size and the psychology of overeating. Part two looks at macronutrients and their role in weight gain or loss, with chapters on topics such as energy density, dietary fat, carbohydrates, protein and dietary fibre. The final part of the book discusses issues in developing effective strategies for weight control, from gaining consumer acceptance of weight-control food products, through functional food ingredients, to community-based public health approaches in preventing obesity.\r\n\r\nWith its distinguished editor and contributors, Food, diet and obesity is a standard work for health professionals, nutritionists and R&amp;D staff throughout the food industry, as well as all those concerned with understanding and reducing obesity.\r\n\r\nSummarises key research which links diet and obesity\r\nTrends in obesity are examined\r\nContributory factors to obesity are investigated, including lifestyle and genetics","torrent":{"xt":"urn:btih:e1078638959dbc202674abcce73c8b9676efae02","amp;dn":"Food%2C+Diet+and+Obesity+-+David+J.+Mela","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1078638959dbc202674abcce73c8b9676efae02","infoHashBuffer":{"type":"Buffer","data":[225,7,134,56,149,157,188,32,38,116,171,204,231,60,139,150,118,239,174,2]},"announce":[],"urlList":[]}}