{"title":"TTC - America and the World -- A Diplomatic History","uid":4501002,"size":534710978,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e182999cc975ad375b08e60424f99ee7d7ce2a08&amp;dn=TTC+-+America+and+the+World+--+A+Diplomatic+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"BhangWalla","files":26,"time":1226396494,"description":"TTC - The Teaching Company\n\nAmerica and the World: A Diplomatic History\n(24 lectures, 30 minutes/lecture)\nCourse No. 8598\n\nTaught by Mark A. Stoler\nThe University of Vermont\nPh.D., University of Wisconsin Madison\n &lt;a href=&quot;\nhttp://www.teach12.com/ttcx/coursedesclong2.aspx?cid=8598&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.teach12.com/ttcx/coursedesclong2.aspx?cid=8598&lt;/a&gt;\n\t\n\nIt was a transformation unprecedented in global history. In barely more than two centuries, the United States evolved from a sparsely settled handful of colonies whose very survival was in grave doubt into the most powerful nation the world has ever known - militarily, economically, technologically, culturally, politically, and even ideologically.\n\nHow could such an implausible metamorphosis have occurred? In a world where power and the willingness to wield it had always determined the fate of nations, what factors enabled our young nation to so successfully navigate the corridors of diplomacy and foreign policy from the very outset, ensuring not only America's survival but also its eventual status as a superpower?\n\nAmerica and the World: A Diplomatic History addresses these and other penetrating questions. In 24 insightful lectures, award-winning Professor Mark A. Stoler of the University of Vermont - a scholar acknowledged for his expertise in U.S. diplomatic and military history - offers you a fresh view of America's shift from the periphery of international politics to its very center.\n\nEnhance Your Understanding of the History Taking Place Right Now\n\nAlthough the specifics naturally change as time advances, the basic elements of diplomacy are always in place. Throughout history, diplomacy has resolved international disputes and helped chart new directions for political, economic, and cultural growth.\n\nStudying how the machinery of American diplomacy works not only strengthens your understanding of why the nation's history turned out the way it did but also adds immeasurably to your interpretation of present-day events. Whether reading a newspaper, listening to a news broadcast, or evaluating the assertions of a political leader or candidate, you will find that the story told in America and the World will enhance your perspectives on the history taking place right now.\n\nAs he guides you along the timeline of America's ascendancy, Professor Stoler shows you that causal machinery at work as he explores the key components of American diplomatic history:\n\n    * The origins of American beliefs about our &quot;mission&quot; and proper place in the world\n    * The expansion of the original United States across the North American continent through war and treaty\n    * The acquisition of a formal overseas empire in the late 19th century and the subsequent addition of an informal empire\n    * The achievement of victory in two world wars and participation in limited but bloody conflicts in Korea and Vietnam\n    * The course of - and victory in - the 45-year cold war with the Soviet Union\n    * The origins and evolution of famous or significant pronouncements and policies, including Washington's Farewell Address, the idea of &quot;Manifest Destiny,&quot; the Monroe Doctrine, the Open Door policy, isolationism, the Marshall Plan, and the &quot;containment&quot; of Communism\n\nOf course, policies and actions are decided by the people whose decisions unleash them, and these lectures bring into clear focus the leaders whose judgments shaped America's path.\n\nLearn How and Why Diplomatic History Happens\n\nPresenting history's events as only a single part of a much broader whole, Professor Stoler adds the &quot;how&quot; and &quot;why&quot; to the &quot;what&quot; of American diplomatic history.\n\nYou learn:\n\n    * how America's influence has been shaped and expanded by events and ideas;\n    * how key personalities - whether America's own national leaders or those of other nations - have influenced American diplomacy and its practice in the international arena;\n    * the key beliefs Americans have developed about international relations and their role on the world stage; and\n    * how those beliefs have shaped America's actions through both war and peace.\n\nIt's an approach that enhances your grasp of not only the substance of events and their multiple causes but also the implications for the next potential sequence of events.\n\n\nThe course offers an excellent perspective on the many lines of causality that converged to create those historical moments and consequences, including the backgrounds and personalities of foreign policy decision makers, national beliefs, geopolitical strategies, and military situations.\n\nFresh Perspectives - Even on Familiar Names\n\nEven when the names are familiar, the new perspectives and fascinating episodes offered by Professor Stoler deepen your insight into the careers of these diplomats:\n\n    * John Quincy Adams: Considered by many historians to have been America's greatest secretary of state, Adams was responsible for an extraordinary series of major foreign policy successes - including primary authorship of what came to be known as the Monroe Doctrine, which asserted the independence of the Western Hemisphere from further European colonization or interference.\n    * John Jay: One of the three authors of the Federalist and the nation's first chief justice, Jay was also a major diplomatic figure. The treaty he negotiated with Great Britain in 1794 aroused so much controversy that Jay claimed he could have traveled the entire coastline by night, navigating by the light of the burning effigies of him.\n    * James K. Polk: One of the least known of America's presidents, Polk was also one of the most important in the history of the country's expansion - and one of the most controversial.\n    * Woodrow Wilson: Although tremendously respected across the political spectrum, Wilson failed to achieve his most important foreign policy goals.\n\nAn Engaging, Informative Instructor\n\nProfessor Stoler has devoted more than 30 years to the study of U.S. diplomatic and military history. A prolific author of books on American foreign policy and the recipient of numerous teaching awards from the University of Vermont, Professor Stoler imbues these lectures with an enlightening depth and breadth.\n\nProfessor Stoler's expertise makes America and the World an engaging look at a unique facet of American history. Weaving together events and personalities, he shows you how and why America gained its current station.\n\nWhether exploring events as diverse as the impressment of American seamen by the British in the early 19th century, the development and execution of the Marshall Plan, or the Cuban Missile Crisis, America and the World presents watershed moments in history through the perspective of foreign policy and diplomacy.\n\nThe result is an entertaining course that will not only deepen your outlook on American history but will also prove that not all history is made on the battlefield.\n\n\n01. Achieving Independence.mp3\n02. Confederation and the Constitution.mp3\n03. The Great Debate - Jefferson versus Hamilton.mp3\n04. From the Farewell Address to the Quasi War.mp3\n05. Jefferson and the &quot;Empire of Liberty&quot;.mp3\n06. The &quot;Second War for Independence&quot;.mp3\n07. John Quincy Adams &amp; American Continentalism.mp3\n08. &quot;Manifest Destiny&quot; and the War with Mexico.mp3\n09. Causes and Diplomacy of the Civil War.mp3\n10. The &quot;New Empire&quot; of Overseas Imperialism.mp3\n11. Informal Empire - Roosevelt to Wilson.mp3\n12. &quot;The War to End All Wars&quot;.mp3\n13. The Peace Treaty and Wilson's Heritage.mp3\n14. Interwar Isolationism and Internationalism.mp3\n15. U.S. Entry into World War II.mp3\n16. World War II Diplomacy and the FDR Legacy.mp3\n17. Origins of the Cold War.mp3\n18. Cold War Turns Hot - Asia and the Korean War.mp3\n19. Eisenhower and the Global Cold War.mp3\n20. Kennedy and the Ultimate Cold War Crisis.mp3\n21. Vietnam and the War at Home.mp3\n22. The Nixon-Kissinger &quot;Grand Design&quot;.mp3\n23. Ideology Anew and the End of the Cold War.mp3\n24. The United States and the World Since 1991.mp3\n\nGuidebook.pdf\n\n\nMore related material:  &lt;a href=&quot;\nhttp://thepiratebay.se/user/BhangWalla&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/BhangWalla&lt;/a&gt;\n","torrent":{"xt":"urn:btih:e182999cc975ad375b08e60424f99ee7d7ce2a08","amp;dn":"TTC+-+America+and+the+World+--+A+Diplomatic+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e182999cc975ad375b08e60424f99ee7d7ce2a08","infoHashBuffer":{"type":"Buffer","data":[225,130,153,156,201,117,173,55,91,8,230,4,36,249,158,231,215,206,42,8]},"announce":[],"urlList":[]}}