{"title":"The Last Story [MULTI5][PAL][REPACK]","uid":7056384,"size":8511160320,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:e24dd4d680e5ea94c57f3bdea3458ceef43882e1&amp;dn=The+Last+Story+%5BMULTI5%5D%5BPAL%5D%5BREPACK%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"webchella","files":1,"time":1330135389,"description":"Plataforma: WII\nIdioma: MULTI5\nRegion: PAL\nGenero: RPG\nComprimido: WII-Scrubber\nRelease: SUSHi\nFormato: ISO\nTamaÃƒÂ±o: 7.88 GB\n\n\n\nIMPORTANTE: The Last Story REPACK PAL WII-SUSHi &quot;CLEAN RIP&quot;\n\nThe Last Story es un tÃƒÂ­tulo que aÃƒÂºna unos preciosos grÃƒÂ¡ficos con un innovador sistema de batallas en tiempo real y unos cautivadores relatos de camaraderÃƒÂ­a. Los jugadores tendrÃƒÂ¡n que explorar distintos lugares, plagados de secretos, en la Isla LÃƒÂ¡zulis, corazÃƒÂ³n de todo un imperio y escenario de un drama que acabarÃƒÂ¡ enfrentando a dos antiguas razas. Entre la banda de mercenarios bajo tu tutela, se encuentra Zael, un guerrero que posee unos raros poderes y que estÃƒÂ¡ fascinado con la idea de convertirse en un honorable caballero. Pero cuando Zael y el resto de mercenarios llegan a la capital de la isla y se ven arrastrados a participar en varios asuntos oficiales, pronto quedarÃƒÂ¡ claro que el honor es una cualidad que no puede darse por supuesta.\n\nPieza clave de The Last Story es el sistema de combates que requiere que los jugadores pongan en prÃƒÂ¡ctica el mejor y mÃƒÂ¡s tÃƒÂ¡ctico trabajo de equipo. Utilizando el magnetismo, un tipo de habilidad, el personaje al que estÃƒÂ©s controlando se volverÃƒÂ¡ el foco de atenciÃƒÂ³n de los ataques enemigos, lo que permitirÃƒÂ¡ que el resto del equipo realice las tareas o ataques necesarios o que recupere su energÃƒÂ­a. Un buen equilibrio en el uso del magnetismo es fundamental.\n\nThe Last Story te irÃƒÂ¡ adentrando en el drama de cada batalla gracias a la perfecta combinaciÃƒÂ³n de escenas cinematogrÃƒÂ¡ficas y combates. AdemÃƒÂ¡s, las conversaciones de los personajes sobre aspectos fundamentales de la partida consiguen que la historia avance sin que la acciÃƒÂ³n se vea ralentizada. La opciÃƒÂ³n de utilizar un sistema de ataque manual o automÃƒÂ¡tico garantiza que jugadores con distintos grados de experiencia puedan adaptar el juego a sus habilidades. Y una vez que le hayas cogido el tranquillo, siempre puedes acudir a la arena en la que poner a prueba tu destreza en batalles cooperativas y competitivas en lÃƒÂ­nea en las que participarÃƒÂ¡n de dos a seis jugadores.\n\nExclusivo para Wii, The Last Story te sitÃƒÂºa en un mundo lleno de detalles y de acciÃƒÂ³n y te invita a formar parte de una banda de amigos que viven una inolvidable aventura.","torrent":{"xt":"urn:btih:e24dd4d680e5ea94c57f3bdea3458ceef43882e1","amp;dn":"The+Last+Story+%5BMULTI5%5D%5BPAL%5D%5BREPACK%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e24dd4d680e5ea94c57f3bdea3458ceef43882e1","infoHashBuffer":{"type":"Buffer","data":[226,77,212,214,128,229,234,148,197,127,59,222,163,69,140,238,244,56,130,225]},"announce":[],"urlList":[]}}