{"title":"Van Halen - 1984 [1984][2000][320 KBPS][JAPAN RMSTD]","uid":8979134,"size":97734350,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e2599cca0655fac03429cc5f7165b574ffa107af&amp;dn=Van+Halen+-+1984+%5B1984%5D%5B2000%5D%5B320+KBPS%5D%5BJAPAN+RMSTD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"LameDuck69","files":17,"time":1380514818,"description":"Van Halen - 1984 [1984][2000][Japan Remaster]\n\n\n\n\n \n01. 1984  \n02. Jump  \n03. Panama  \n04. Top Jimmy  \n05. Drop Dead Legs  \n06. Hot For Teacher  \n07. I'll Wait  \n08. Girl Gone Bad  \n09. House Of Pain  \n\n\n\n\n\n320 KBPS \n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nVan Halen is an American hard rock band formed in Pasadena, California in 1972. From 1974 until 1985 the band was composed of guitarist Eddie Van Halen, vocalist David Lee Roth, drummer Alex Van Halen and bassist Michael Anthony. This line-up was changed when David Lee Roth was replaced as vocalist by Sammy Hagar. Critics and fans alike consider their 1978 self-titled debut album Van Halen to be one of the most &quot;original and revolutionary albums to change rock and roll.&quot;\n\nThe band went on to further success, and by the early 1980s they were one of the most successful rock acts of the time. 1984 was their most successful album. The lead single, &quot;Jump&quot;, became an international hit and their only single to reach number one on the Billboard Hot 100. The following singles, &quot;Panama&quot; and &quot;I'll Wait&quot;, both hit number 13 on the US charts. The album went on to sell over 12 million copies in the US alone. In 1985, the band replaced current lead singer David Lee Roth with ex-Montrose lead vocalist Sammy Hagar. With Hagar, the group would release four US number-one albums over the course of 11 years. Hagar left the band in 1996 shortly before the release of the band's first greatest hits collection, Best Of, Volume I. Ex-Extreme frontman Gary Cherone was quickly recruited as lead singer to replace Hagar, and Van Halen III was released in 1998. Cherone left the band in frustration in 1999 after the tour due to the poor commercial performance of the album.\n\nVan Halen went on hiatus until 2003 when they reunited with Hagar for a worldwide tour. The reunited band released a second greatest hits collection the following year, The Best of Both Worlds. Like Volume I before it, The Best of Both Worlds included material from both the Roth and Hagar eras but omitted any Cherone era tracks. The album featured three brand new tracks recorded by the reunited band, two of which were released as singles. Hagar again left Van Halen in 2005 and in 2006, Roth returned as lead vocalist for their highest-grossing tour, and one of the highest-grossing tours of that year. Anthony was not invited to participate in the tour and was essentially fired from the band, replaced by Wolfgang Van Halen, Eddie's son. In 2012, the band released the commercially and critically successful, A Different Kind of Truth, with Roth as lead vocalist. According to the RIAA, Van Halen is the 19th-best-selling band/artist in United States history, selling 56 million albums in the U.S. and 96.5 million albums worldwide.  They were also revealed at number 4 on the Billboard's top money makers list in 2013. Van Halen is one of only five rock bands that have had two studio albums sell more than 10 million copies in the U.S. Additionally, Van Halen charted the most number-one hits in the history of Billboard's Mainstream Rock chart.\n\nVan Halen achieved worldwide fame for their many popular songs and larger-than-life stage performances; unfortunately, they also became known for the drama surrounding the departures of former members. Controversy surrounded the band following the exits of Roth, Hagar and Cherone; this controversy often included numerous conflicting press statements between the former singers and the band. In 2007, Van Halen were inducted into the Rock and Roll Hall of Fame. VH1 ranked them 7th on their list of the top 100 hard rock artists of all time.\n\n-----------------------------------------------------------------------------------\n\n1984 (written as MCMLXXXIV on the album's front cover) is the sixth studio album by American hard rock band Van Halen. 1984 remains one of Van Halen's most popular albums in terms of sales (with 12 million copies sold in the U.S. alone), Billboard chart performance (reaching #2 on the Billboard Top 200 Album Charts and remaining there for 5 weeks, behind Michael Jackson's mega-selling Thriller, on which Eddie Van Halen played guitar) and in terms of memorable singles - including the #1 Billboard Pop hit &quot;Jump&quot;, Top #13 hits &quot;Panama&quot; and &quot;I'll Wait&quot; and the MTV sensation, &quot;Hot for Teacher&quot;. 1984 was the last, full-length Van Halen album to feature the band's iconic frontman David Lee Roth until 2012's A Different Kind of Truth and the final full-length album with all four original members.\n\n\n\n\n\n","torrent":{"xt":"urn:btih:e2599cca0655fac03429cc5f7165b574ffa107af","amp;dn":"Van+Halen+-+1984+%5B1984%5D%5B2000%5D%5B320+KBPS%5D%5BJAPAN+RMSTD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2599cca0655fac03429cc5f7165b574ffa107af","infoHashBuffer":{"type":"Buffer","data":[226,89,156,202,6,85,250,192,52,41,204,95,113,101,181,116,255,161,7,175]},"announce":[],"urlList":[]}}