{"title":"Anthony Trollope - The Chronicles of Barsetshire 01 to 06.mobi","uid":9381556,"size":4348233,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e26d5f801a43e40686c8e353779ac9c89be42bd1&amp;dn=Anthony+Trollope+-+The+Chronicles+of+Barsetshire+01+to+06.mobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1387722733,"description":"The &quot;Chronicles of Barsetshire&quot; is a series of six novels by English author Anthony Trollope, set in the west-country Cathedral city of Barchester.\n\nThe beautifully-written epic saga concerns the dealings of the clergy and the gentry, and the political, amatory, and social maneuverings that go on among and between them. \n\nBarsetshire is the county in which the novels take place. The county town and cathedral town is Barchester. Other towns mentioned in the novels include Silverbridge, Hogglestock and Greshamsbury.\n\nIncluded in this volume:\nBook One: The Warden -- Mr Septimus Harding, elderly warden of Hiram's Hospital and Precentor of Barchester Cathedral. The story concerns the impact upon Harding and his circle when a zealous young reformer, John Bold, launches a campaign to expose the disparity in the apportionment of the charity's income between its object, the bedesmen, and its officer, Mr Harding. John Bold embarks on this campaign out of a spirit of public duty despite his romantic involvement with Eleanor and previously cordial relations with Mr Harding...\n\nBook Two: Barchester Towers -- The much loved bishop having died, all expectations are that his son, Archdeacon Grantly, also a clergyman, will gain the office in his place. Instead, owing to the passage of the power of patronage to a new Prime Minister, a newcomer, Bishop Proudie, gains the see. His wife, Mrs Proudie, exercises an undue influence over the new bishop, making herself unpopular with right-thinking members of the clergy and their families...\n\nBook Three: Doctor Thorne -- The romantic problems of Mary Thorne, niece of Doctor Thomas Thorne (a member of a junior branch of the family of Mr Wilfred Thorne who appeared in the previous novel), and Frank Gresham, the only son of the local squire. Major themes of the book are the social pain and exclusion caused by illegitimacy, the nefarious effects of the demon drink, and the difficulties of romantic attachments outside one's social class...\n\nBook Four: Framley Parsonage -- Mark Robarts is a young vicar, newly arrived in the village of Framley in Barsetshire. This &quot;living&quot; has come into his hands through Lady Lufton, the mother of his childhood friend Ludovic, Lord Lufton. Mark has ambitions to further his career and begins to seek connections in the county's high society. He is soon preyed upon by local Member of Parliament Mr Sowerby...\n\nBook Five: The Small House at Allington -- Lily has for a long time been secretly loved by John Eames, a junior clerk at the Income Tax Office, while Bell is in love with the local doctor, James Crofts. The handsome and personable, somewhat mercenary Adolphus Crosbie is introduced into the circle by the squire's nephew, Bernard Dale...\n\nBook Six: The Last Chronicle of Barset -- An indigent but learned clergyman, the Reverend Josiah Crawley, the curate of Hogglestock, as he stands accused of stealing. It also features the courtship of the Rev. Mr Crawley's daughter, Grace, and Major Henry Grantly, son of the wealthy Archdeacon Grantly. The Archdeacon, although allowing that Grace is a lady, doesn't think her of high enough rank or wealth for his widowed son; his position is strengthened by the Reverend Mr Crawley's apparent crime. Almost broken by poverty and trouble, the Reverend Mr Crawley hardly knows himself if he is guilty or not...\n\nThese are wonderful, well-written thrilling and vigorous novels!","torrent":{"xt":"urn:btih:e26d5f801a43e40686c8e353779ac9c89be42bd1","amp;dn":"Anthony+Trollope+-+The+Chronicles+of+Barsetshire+01+to+06.mobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e26d5f801a43e40686c8e353779ac9c89be42bd1","infoHashBuffer":{"type":"Buffer","data":[226,109,95,128,26,67,228,6,134,200,227,83,119,154,201,200,155,228,43,209]},"announce":[],"urlList":[]}}