{"title":"Six Amendments - John Paul Stevens - Audiobook MP3","uid":10326967,"size":99616471,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e2b3eb9731692598470073ced6c198c3a678212c&amp;dn=Six+Amendments+-+John+Paul+Stevens+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1402368114,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Smart AudioBook Player or Listen Audiobook Player.\n\niTunes users - Add this to your iTunes collection, and change &quot;Media Kind&quot; to &quot;Audiobook.&quot; Right-click the track or album, and select &quot;Get Info&quot; from the context menu. You will find &quot;Media Kind&quot; under &quot;Options.&quot; This will allow you to transfer the book to your iOS while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nSix Amendments: How and Why We Should Change the Constitution\n\nWritten by: John Paul Stevens\nNarrated by: Daniel Hagen\nLength: 3 hrs and 26 mins\nFormat: Unabridged\nRelease Date:04-22-14\nProgram Type: Audiobook\n\nFor the first time ever, a retired Supreme Court Justice offers a manifesto on how the Constitution needs to change.\n\nBy the time of his retirement in June 2010, John Paul Stevens had become the second-longest-serving Justice in the history of the Supreme Court. Now he draws upon his more than three decades on the Court, during which he was involved with many of the defining decisions of the modern era, to offer a book like none other. Six Amendments is an absolutely unprecedented call to arms, detailing six specific ways in which the Constitution should be amended in order to protect our democracy and the safety and wellbeing of American citizens.\n\nWritten with the same precision and elegance that made Stevens's own Court opinions legendary for their clarity as well as logic, Six Amendments is a remarkable work, both because of its unprecedented nature and, in an age of partisan ferocity, its inarguable common sense.","torrent":{"xt":"urn:btih:e2b3eb9731692598470073ced6c198c3a678212c","amp;dn":"Six+Amendments+-+John+Paul+Stevens+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2b3eb9731692598470073ced6c198c3a678212c","infoHashBuffer":{"type":"Buffer","data":[226,179,235,151,49,105,37,152,71,0,115,206,214,193,152,195,166,120,33,44]},"announce":[],"urlList":[]}}