{"title":"Dietary Supplements (3rd Edition)","uid":8509944,"size":3584760,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e32e1fc2fc1ae08a658358bc2e0ffa0abec36251&amp;dn=Dietary+Supplements+%283rd+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1369544089,"description":"\nPamela Mason - Dietary Supplements (3rd Edition)\nPublished: 2007-05-01 | ISBN: 0853696535 | PDF | 387 pages | 3 MB\n\n\nThe use of dietary supplements has continued to increase steadily in recent years with, for example, 40 per cent of UK adults said to be taking such supplements on a regular basis. Although they are widely used, the use of dietary supplements is controversial in relation to their efficacy and safety and much recent research has been published considering these questions. This comprehensive new edition of &quot;Dietary Supplements&quot; has been completed revised and updated to include the latest findings on the most commonly used dietary supplements. This edition contains 82 regularly structured monographs with information on: uses, action, safety (adverse effects, pregnancy, interactions), efficacy, and dosage; full revised and updated with findings from the recent literature on common supplements such as: aloe vera, calcium, creatine, glucosamine, selenium, and vitamin C; includes 10 monographs new to this edition on: methylsulfonylmethane (MSM), nickel, pcynogenol, phytosterols, psyllium, quercetin, resveratrol, silicon, tin and vanadium; considers regulations relating to dietary supplements in UK, Europe and the USA; and useful appendices include a summary of interactions with conventional medicines.","torrent":{"xt":"urn:btih:e32e1fc2fc1ae08a658358bc2e0ffa0abec36251","amp;dn":"Dietary+Supplements+%283rd+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e32e1fc2fc1ae08a658358bc2e0ffa0abec36251","infoHashBuffer":{"type":"Buffer","data":[227,46,31,194,252,26,224,138,101,131,88,188,46,15,250,10,190,195,98,81]},"announce":[],"urlList":[]}}