{"title":"Open Season-1-3[Trilogy]in xvids+covers- by winker@kidzcorner-13","uid":6199249,"size":2523422904,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e3ffb783d0df60281deec003d9fd453fb5180da3&amp;dn=Open+Season-1-3%5BTrilogy%5Din+xvids%2Bcovers-+by+winker%40kidzcorner-13&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":6,"uploader":"alanwatson","files":-1,"time":1298553752,"description":"Open Season: Boog (Martin Lawrence), a domesticated grizzly bear with no survival skills, has his perfect world turned upside down when he meets Elliot (Ashton Kutcher), a scrawny, fast-talking mule deer. They join forces to unite the woodland creatures and take the forest back into nature's control!\n\nOpen Season 2: After falling head over hooves in love with Giselle, Elliot's road to the altar takes a slight detour when Mr. Weenie is kidnapped by a group of pampered pets determined to return him to his owners. Boog, Elliot, McSquizzy, Buddy and the rest of the woodland creatures launch a full-scale rescue mission for their sausage-shaped friend and soon find themselves in enemy camp: the world of the pets. Led by a toy poodle named Fifi, the pets do not plan to let Mr. Weenie go without a fight. Can a toy poodle REALLY bring down a 900-pound grizzly bear? Will Elliot ever marry Giselle? Find out in Open Season 2.\n\nOpen Season 3: Boog, Elliot and all their forest friends return with an all-new adventure that is their fastest and furriest yet - this time in a Big Top Circus! When Boog's buddies can't make their annual guys-only getaway, he decides to take a trip by himself. Stumbling across a visiting circus, Boog switches places with a look-alike circus grizzly and takes over his part in the act. But when the circus decides to go back to Russia, it's a race against time for Elliot, McSquizzy, Mr. Weenie and the gang to rescue Boog before it's too late! ","torrent":{"xt":"urn:btih:e3ffb783d0df60281deec003d9fd453fb5180da3","amp;dn":"Open+Season-1-3%5BTrilogy%5Din+xvids%2Bcovers-+by+winker%40kidzcorner-13","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3ffb783d0df60281deec003d9fd453fb5180da3","infoHashBuffer":{"type":"Buffer","data":[227,255,183,131,208,223,96,40,29,238,192,3,217,253,69,63,181,24,13,163]},"announce":[],"urlList":[]}}