{"title":"Lucretia Grindle - De verloren dochter. NL Ebook. DMT","uid":8929001,"size":1068163,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e422a1d7948641f2edad658b86cd7c7ee1bb1b81&amp;dn=Lucretia+Grindle+-+De+verloren+dochter.+NL+Ebook.+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"BiWild","files":-1,"time":1379429695,"description":"Lucretia Grindle - De verloren dochter. NL Ebook. DMT\n\nAfbeelding\n\nAuteur: Lucretia Grindle \nPagina's: 307\nTaal: Dutch/Nederlands\nUitgever: Bruna Uitgevers B.V\nJaar van uitgifte: 2013\nGenre: Roman\n\nSamenvatting\n\nIn Florence vertrekt een jonge Amerikaanse studente, Kristen Carson, voor een paar dagen vakantie met haar vriend. Ze laat een briefje achter \nvoor haar kamergenote. Een paar dagen later vliegen haar vader en stiefmoeder voor haar achttiende verjaardag naar Florence. Kristen komt \nechter niet op de afgesproken tijd in het restaurant opdagen en haar ouders slaan alarm. Kristens vader kent belangrijke mensen en zorgt dat \neen politieteam onder leiding van Allesandro Pallioti en zijn inspecteur Enzo Saenz, de zaak onderzoekt. Aanvankelijk zijn noch Pallioti, noch \nSaenz erg bezorgd. Maar al snel ontdekken de beide mannen tot hun afschuw dat de man waar Kristen mee omging Antonio Tomaselli is, \neen lid van de notoire Rode Brigade, een extreem-linkse terroristische organisatie. Voordat de politie zich goed en wel in de zaak heeft kunnen \nverdiepen, verdwijnt ook Kristens stiefmoeder Anna. Enzo raakt verstrikt in een web van valse identiteiten, verraad en wraak. De hele zaak lijkt \nte draaien om Anna, tot wie hij zich steeds meer voelt aangetrokken maar die hij niet kan vertrouwen. Terwijl de gruwelijkheden van het verleden \nboven komen drijven en het leven van beide vrouwen op het spel staat, bevindt Enzo zich op onbekend terrein \nen speelt hij het dodelijkste spel van zijn leven. \n\nDeze review wordt u aangeboden door\n\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:e422a1d7948641f2edad658b86cd7c7ee1bb1b81","amp;dn":"Lucretia+Grindle+-+De+verloren+dochter.+NL+Ebook.+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e422a1d7948641f2edad658b86cd7c7ee1bb1b81","infoHashBuffer":{"type":"Buffer","data":[228,34,161,215,148,134,65,242,237,173,101,139,134,205,124,126,225,187,27,129]},"announce":[],"urlList":[]}}