{"title":"40 year old virgin.mov","uid":3602415,"size":739228643,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e42ce69748d5933ae02e496a06954112a7849e29&amp;dn=40+year+old+virgin.mov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"mandel15","files":1,"time":1169587193,"description":"Drivers: The movie was ripped with the 3ivx driver which you can download from http://www.3ivx.com/download/index.html. After you have installed the driver you can watch the movie as well as add it to iTunes, you can also convert it to iPod format using the conversion tool in iTunes (how-to can be found here: http://mp3.about.com/od/mp3players/ht/itunes_to_ipod.htm)\n\nPlot:\n40-year-old Andy Stitzer has done quite a few things in his life. He&amp;#039;s got a cushy job stamping invoices at an electronics superstore, a nice apartment with a proud collection of action figures and comic books, good friends, a nice attitude. But there&amp;#039;s just one little thing he hasn&amp;#039;t quite gotten around to doing yet--something most people have done by his age. Done a lot. Andy&amp;#039;s never, ever, ever had sex--not even by accident. So is that such a big deal? Well, for Andy&amp;#039;s buds at the store, it sure is. Although they think he&amp;#039;s a bit of an oddball, there&amp;#039;s certainly a planet full of stranger (and homelier) guys who&amp;#039;ve at least had one go at having a go. They consider it their duty to help Andy out of his dire situation and go to great lengths to help him. But nothing proves effective enough to lure their friend out of lifelong chastity until he meets Trish (Catherine Keener), a 40-year-old mother of three. Andy&amp;#039;s friends are psyched by the possibility that &quot;it&quot; may finally happen...until they hear that Andy and Trish have begun their relationship based on a mutual no-sex policy.\n\nEnjoy and plese seed.","torrent":{"xt":"urn:btih:e42ce69748d5933ae02e496a06954112a7849e29","amp;dn":"40+year+old+virgin.mov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e42ce69748d5933ae02e496a06954112a7849e29","infoHashBuffer":{"type":"Buffer","data":[228,44,230,151,72,213,147,58,224,46,73,106,6,149,65,18,167,132,158,41]},"announce":[],"urlList":[]}}