{"title":"Seif &amp; Paula - Mashups Of The Year (Inspiron)","uid":10935555,"size":576919075,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e4ad11d8c7688228ce1d401f99707781a9a3d2ff&amp;dn=Seif+%26amp%3B+Paula+-+Mashups+Of+The+Year+%28Inspiron%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"-inspiron-","files":-1,"time":1409430523,"description":"=======================================================\nSite: &lt;a href=&quot; http://inspiron-trance.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://inspiron-trance.com&lt;/a&gt;\n=======================================================\n\n\n=======================================================\nF B Page: Inspiron Trance \n=======================================================\n\n\n=======================================================\nTWITTER : inspiron22\n=======================================================\t\n\n\n\n\nTracklist:\n\n\n\nCD.1\n\n1-Markus Schulz &amp; Departure Vs. Orjan Nilsen - Without LA Guitarra (Megalanic Mashup) \n2-Above and Beyond feat. Alex Vargas vs ilan Bluestone - Sticky Sinai (Amer Ezz Mashup)\n3-Andrew rayel &amp; Armin van buuren Vs AirBase (Andrew Rayel Intro Mix) - Eiforya Vs Modus Operandi ( Seif and paula Vs Xandro Mashup )\n4-Orjan Nilsen Vs Andrew Rayel Vs Afrojack Vs Alexander Popov - Hold On To Your Love qauntum anthem ( Seif and paula Vs Ahmed essa Mashup )\n5-Andrew Rayel vs. Cosmic Gate - So Get Up Dark Warrior (Amer Ezz Mashup)\n6-Armin Van Buuren - Shivers of Aisha (Youssef Chen' Mashup)\n7-Armin van buuren - We are here to make some noise Vs ping pong ( Seif and paula Vs Waleed el sadat Mashup ) \n8-Armin van buuren Pres.Gaia Vs MaRLo and Fisherman &amp; Hawkins - Force de toi ( Seif and paula Vs Carlos alberto mashup )\n9-Armin van buuren Vs Gaia - Save my night Vs Je Envie de toi ( seif and paula vs youssef chena mashup )\n10-Armin van buuren Vs Tiesto - Ping Pong Vs Maximal Crazy\n11-Christina Novielli (Fabio XB &amp; Yves De Lacroix Remix Vs David Gravell - Back to melbuorne\n12-Elements (A.S. Jekso Intro Edit) Vs Nova Zembla Vs Man On The Run (seif and paula Vs Jekso Mashup)\n13-Armin van Buuren &amp; Arty vs Tiesto vs Nadia ali - Rapture of just nehalennia ( seif and paula mashup )\n14-Markus Schulz Vs. ZEDD ft Hayley Williams - Reloaded The Night (Youssef Chen' Mashup)\n15-Omnia &amp; Ira - The fusion of tomorrow people ( Seif and paula Vs MZ mashup )\n16- Protoculture Vs. Above &amp; Beyond - A thing called Talisman (Youssef Chen' Mashup)\n17-Refuge Forever ( Seif and paula Vs Amer Ezz )\n18-Tiesto Vs Dash berlin - Adiago for surrender ( Seif and Paula Vs Samer Said Mashup )\n19- Oxygen's Satellite ( seif and paula vs Khalid al sharif Mashup )\n \n\n\nCD.2\n\n20- Aly and fila Vs Two &amp; One With Denis Kenzo Ft. Sveta B - laily of sitorya  ( Seif and paula Mashup )  \n21-aly and fila Vs Fady and mina Vs Luke bond feat roxanne emery I'am not gonna Laily behind fire ( Seif and paula Vs Amer Ezz Mashup )\n22-Abstract Vision &amp; Elite Electronic Vs Faruk Sabanci -  rising and falling blossom ( Youssef Chen Vs Megalanic Mashup )\n23-Angry Man vs Markus Schulz - Lunatic Inception - (Seif and paula Vs Dirty Sanchez 2014 Rework) \n24-Harmonic Rush Vs Askew - Giving Your Mechanism Ghost to become one (Seif and paula Vs Ellez Ria Blackshop)\n25-Harmonic Rush Vs Emma Hewitt - Lasting Rush (Youssef Chen Mashup)\n26-John Askew vs Mass Distortion - Gangsta Mechanism (seif and paula Vs Aldo Henrycho Mashup)\n27-Neelix vs Phax - Expect Angels of Destruction (Lesad Mashup)\n28-Neptune project vs simon patterson and jordan suckly - Lost all my vanillia ( Seif and paula Vs NavidN2M Mashup )\nbouns Tracks\n29-Simon Patterson Vs John Askew - bruch mechanism ( seif and paula mashup )\n30-XGenic vs Abstract Vision ( photographer remix ) -  Ignition Rocket ( Seif and Paula Mashup )\n\nbounce Track\n\nAlexandre Bergheau Vs. Conjure One - Persia From The Moon (Inspiron Mashup)\n\n\n\n\nEnjoy\n(Inspiron)","torrent":{"xt":"urn:btih:e4ad11d8c7688228ce1d401f99707781a9a3d2ff","amp;dn":"Seif+%26amp%3B+Paula+-+Mashups+Of+The+Year+%28Inspiron%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4ad11d8c7688228ce1d401f99707781a9a3d2ff","infoHashBuffer":{"type":"Buffer","data":[228,173,17,216,199,104,130,40,206,29,64,31,153,112,119,129,169,163,210,255]},"announce":[],"urlList":[]}}