{"title":"SwitchResX 4.4.1","uid":11305413,"size":3371329,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:e4d8f2a24a5b1039f35a3f6c02687a853561d1c7&amp;dn=SwitchResX+4.4.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Jenson100","files":-1,"time":1414467166,"description":"\nSwitchResX gives you unparalleled control over your monitor's resolution.Whether you prefer to use the menu bar or nested contextual menus, SwitchResX gives you constant, simplified access to the resolution management options you need.\n\n\n\nControls include:\n* Monitor Resolution\n* Color Depth\n* Video Mirroring\n* Display Rotation\n* Display Overscan\n* Bountiful Features\n* Save your desktop layout, locking and maintaining icon and window positions for all of your open applications every time you start up your Mac. SwitchResX lets you instantly restore your desktop even after resolution-altering events like connecting or disconnecting your external monitor.\n* Disable or deactivate a monitor without physically unplugging it, allowing you to use your MacBook in clamshell mode with an external monitor, keyboard and mouse\n* Link your monitor settings with system events: Key shortcuts, Apple Scripts, Application launches and more.\n* Take complete control over your display resolution: Advanced features let you create and enable new resolutions for your monitor, HDTV, Plasma or LCD screen or Video Projector.\n\nWhat's New Version 4.4.1:\n* Corrects a drawing bug when showing the menu with a huge resolution list\n* Displays the key shortcut assigned to a display set in the menus, if any\n* Added more information in exported EDID\n* Corrected preliminary issues with Yosemite, in particular in Menu appearance with Dark Theme\n* Corrected some graphical issues in the Preferences when defining a custom more","torrent":{"xt":"urn:btih:e4d8f2a24a5b1039f35a3f6c02687a853561d1c7","amp;dn":"SwitchResX+4.4.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4d8f2a24a5b1039f35a3f6c02687a853561d1c7","infoHashBuffer":{"type":"Buffer","data":[228,216,242,162,74,91,16,57,243,90,63,108,2,104,122,133,53,97,209,199]},"announce":[],"urlList":[]}}