{"title":"Un amour a  taire  (eng subs) (TV) [2005] Christian Faure","uid":6867951,"size":778970309,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e58fec8db57c48539b2fc0f3ee1d6c6ee80a3df3&amp;dn=Un+amour+a++taire++%28eng+subs%29+%28TV%29+%5B2005%5D+Christian+Faure&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1323172266,"description":" &lt;a href=&quot;http://bayimg.com/jalAEaADe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/jalAEaADe&lt;/a&gt;\n\nA Love to Hide (TV 2005) \n\nUn amour ÃƒÂ  taire (original title) \n \nFrench language with English subtitles\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0444518/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0444518/&lt;/a&gt;\n\nA Love to Hide (French title: Un amour ÃƒÂ  taire) is a French film made for television, directed by Christian Faure, which aired in 2005. It is loosely based on the book Moi, Pierre Seel, dÃƒÂ©portÃƒÂ© homosexuel by Pierre Seel.\n\nSarah - Louise Monot \nJean - JÃƒÂ©rÃƒÂ©mie Renier \nPhilippe - Bruno Todeschini \nJacques - Nicolas Gob \nMarcelle Lavandier - Charlotte de Turckheim \nArmand Lavandier - Michel Jonasz \n\nCaring for a refugee, is a humane act. Only when it is during World War II and the girl in question is Jewish, such an act is all the more compassionate given the risk involved for all in sheltering Sara; an orphan by way of the Gestapo killing machine. Yet even in the face of the raw reality of Nazi rule, Jean somehow manages to hold onto his upbeat approach to life, finding former sweetheart Sara work in the family run launderette; albeit under a new name and with forged ID papers to match, courtesy of his partner Philippe, whose official printing press equally turns out 'specialised paperwork.' Yet knowing that the man she loves is in love with another man, is the least of Sara's concerns, given the return of Jean's troublesome brother Jacques is destined to set in motion a deadly sequence of events. Welcome then to France, 1942, where the only way to stay open for business is to hang a 'no Jews' sign over your door! \n\nThe scenario of a Jewish girl being sheltered by a gay couple with a sideline in forged documents in the capital of war torn France, is one in which clearly something, somewhere has to give. Yet for many a reel Juste une question d'amour director Christian Faure succeeds in putting off the inevitable, along the way creating a world filled with seemingly carefree bike rides in the countryside, alongside sexual openness Parisian cafÃƒÂ© style. Such is however but a celluloid bubble, one that is guaranteed to burst and when it does, the horrific reality of how homosexuals, considered the lowest of the low by the Nazis, ranking below Jews, were treated during the Holocaust, is laid bare for all to see in graphic Bent fashion. \n\nTo that end, the cast give their all to the emotional roller coaster of a script by Pascal Fontanille and Samantha Mazeras, with the stunningly handsome JÃƒÂ©rÃƒÂ©mie RÃƒÂ©nier as Jean, Bruno Todeschini as boyfriend Philippe and Nicolas Gob as bad boy Jacques on fine form throughout, as too is Olivier Saladin as Breton, the corrupt collaborating Inspector of the piece. Yet it is Louise Monot as Sara aka Yvonne who binds the narrative together, her character both opening and closing the film with profoundly moving and poignant scenes. \n\nAs a cinematic testament to the persecution of Jews and homosexuals during World War II, this engrossing tale of homosexual love in occupied France puts the by-the-numbers network productions of America, to shame. For this is a telemovie at its most powerful. That of a historically accurate work that speaks of the brutal deportation of gays to Germany for re-education purposes. Yet this is also a film ingrained with the themes of unrequited love, jealousy and ultimately of a family steeped in tragedy. Yes the end result is sombre by nature, but it equally remains compelling from start to finish, an emotional piece that will tug at the heartstrings\n","torrent":{"xt":"urn:btih:e58fec8db57c48539b2fc0f3ee1d6c6ee80a3df3","amp;dn":"Un+amour+a++taire++%28eng+subs%29+%28TV%29+%5B2005%5D+Christian+Faure","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e58fec8db57c48539b2fc0f3ee1d6c6ee80a3df3","infoHashBuffer":{"type":"Buffer","data":[229,143,236,141,181,124,72,83,155,47,192,243,238,29,108,110,232,10,61,243]},"announce":[],"urlList":[]}}