{"title":"Nicholas Humphrey - Seeing Red. A Study in Consciousness [2009][","uid":10303206,"size":2177920,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5c48b4c24481aa2ffaac4ab6ebf0555d3fb95e6&amp;dn=Nicholas+Humphrey+-+Seeing+Red.+A+Study+in+Consciousness+%5B2009%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Anette14","files":-1,"time":1401998946,"description":"Description\nProduct Details\nBook Title: Seeing Red: A Study in Consciousness (Mind/Brain/Behavior Initiative)\t\nBook Author: Nicholas Humphrey\nSeries: Mind/Brain/Behavior Initiative (Book 5)\nPaperback: 160 pages\nPublisher: Belknap Press (March 30, 2009)\nLanguage: English\nISBN-10: 0674030540\nISBN-13: 978-0674030541\n\n===================================================================================\nBook Description\nRelease date: March 30, 2009 | ISBN-10: 0674030540 | ISBN-13: 978-0674030541\n&quot;Consciousness matters. Arguably it matters more than anything. The purpose of this book is to build towards an explanation of just what the matter is.&quot;\nNicholas Humphrey begins this compelling exploration of the biggest of big questions with a challenge to the reader, and himself. What's involved in &quot;seeing red&quot;? What is it like for us to see someone else seeing something red?\nSeeing a red screen tells us a fact about something in the world. But it also creates a new fact--a sensation in each of our minds, the feeling of redness. And that's the mystery. Conventional science so far hasn't told us what conscious sensations are made of, or how we get access to them, or why we have them at all. From an evolutionary perspective, what's the point of consciousness?\nHumphrey offers a daring and novel solution, arguing that sensations are not things that happen to us, they are things we do--originating in our primordial ancestors' expressions of liking or disgust. Tracing the evolutionary trajectory through to human beings, he shows how this has led to sensations playing the key role in the human sense of Self.\nThe Self, as we now know it from within, seems to have fascinating other-worldly properties. It leads us to believe in mind-body duality and the existence of a soul. And such beliefs--even if mistaken--can be highly adaptive, because they increase the value we place on our own and others' lives.\n&quot;Consciousness matters,&quot; Humphrey concludes with striking paradox, &quot;because it is its function to matter. It has been designed to create in human beings a Self whose life is worth pursuing.&quot;\n\n===================================================================================\nEditorial Reviews\nFrom Publishers Weekly\nIn this extended answer to the question, &quot;Can one's consciousness survive after one dies?&quot;-asked by philosopher Thomas Reid in 1775 and Joe King, a disabled country singer, in 2003-Humphrey concedes he is working to &quot;develop a concept of consciousness which we, as theorists, can do business with.&quot; He argues perception is neither solely nor necessarily a product of sensation, and, in fact, the two may exist independently of one another. Humphrey simplifies these intellectually rigorous discussions by returning to a central example of a person staring at a red screen. (Thus creating a &quot;red sensation.&quot;) Humphrey's conversational prose-the book is based on his lectures-is an odd fit for the scholarly material, but his approach makes his 30 years of experience in &quot;consciousness studies&quot; accessible to casual readers.\n\nFrom Booklist\nHumphrey's History of the Mind: Evolution and the Birth of Consciousness (1992) elaborates the ideas distilled in this digestible precis. Based on the author's Harvard University lectures, it directly addresses the reader as a fellow contemplator of consciousness. That every person knows what it is but cannot give a convincing description of it, is the nettle Humphrey grasps as he explains his view of the problem. Figuratively seating the reader in his darkened lecture hall, Humphrey illuminates a monochromatic screen--red in this case. By what psychological pathway does the viewer experience the redness of the screen? Humphrey classifies the experience of initial stimulation as a subjective &quot;sensation,&quot; which through internal feedback loops becomes an objective &quot;perception&quot; of the screen as red. Holding that this cognitive process may be the origin of self-awareness, Humphrey parries criticisms of the theory, and follows the allusion to the academic debate with a narrative of his sensation/perception mechanism evolving from microbe to mankind. Illustrating his argument with the musings of poets and painters, Humphrey stylishly inspires curiosity about consciousness. Gilbert Taylor\n\n===================================================================================\nReviews\nSeeing Red is a brief, brilliant, and wonderfully lucid contribution to consciousness studies. By combining empirical scientific method, evolutionary theory, and a sensitive appreciation of the arts, Nicholas Humphrey argues plausibly that the &quot;hard problem&quot; of consciousness--the difficulty of explaining the connection between the material brain and the phenomenon of individual selfhood--may itself be the answer to a bigger question: what makes us human? (David Lodge, author of Consciousness and the Novel: Connected Essays)\n\nThis book is a wonderful amalgam of science, philosophy, and art. It is based on deep knowledge of visual processing by the brain and poetic understanding of human experience. This is a remarkable achievement. (Richard Gregory, Emeritus Professor of Neuropsychology at the University of Bristol and editor of The Oxford Companion to the Mind)\n\nIllustrating his argument with the musings of poets and painters, Humphrey stylishly inspires curiosity about consciousness. (Gilbert Taylor Booklist 2006-03-15)\n\nDeeply interesting. (Steven Poole The Guardian 2006-04-29)\n\nHumphrey has published several graceful philosophical works on consciousness, but none as intimate or compelling as Seeing Red...His sensitivity and intellectual probity make for magnificent debate. Seeing Red is a book to be savoured--ruminative, fluent and daring to the end. (Antonella Gambotto-Burke South China Morning Post 2006-05-14)\n\nSince [the late 1960s], Humphrey has written extensively and insightfully about consciousness. His most recent work, a slim and elegant volume entitled Seeing Red, provides a charming, if brief, summary of his current views, blending themes culled from psychology, philosophy, and even art and poetry. It also offers intriguing speculations on the evolutionary function of consciousness...The strength of Humphrey's book lies in its skilful blending of ideas from varied sources to stimulate new ways of thinking about consciousness. In effectively doing so, while presenting a fascinating window on the thought of a distinguished consciousness researcher, Seeing Red is a wonderful success. (Josh Weisberg Nature)\n\n&quot;Consciousness is a fascinating but elusive phenomenon; it is impossible to specify what it is, what it does, or why it evolved. Nothing worth reading has ever been written about it,&quot; so wrote Stuart Sutherland that stalwart defender of scientific purity...In this delightful little book, Nicholas Humphrey turns the tables by arguing that fascination and elusiveness is the whole point of consciousness...The book is based on a series of lectures Humphrey gave at Harvard in 2004, and has been meticulously edited and updated. It's short--in fact can be read at one sitting--but packs a lot in...The story is both appealing and valuable. (Chris Nunn Journal of Consciousness Studies)\n\nHumphrey's latest book, a sequel to his 1992 book, A History of the Mind, is based on a series of lectures he gave at Harvard in 2004 to the Mind/Brain/Behavior Initiative Distinguished Lecture Series, and is written in a style intended to re-create as nearly as possible the informal give-and-take of those lectures, in which the audience sat bathed for much of the time in the intense red light reflected from a giant screen behind the lecturer. It is very much Humphrey's purpose to get readers to set aside what they think they know about seeing red and to experience seeing red anew, so they can reflect on their experience and not just on some remembered or imagined episode of seeing red in the past. He is attempting to resurrect and sharpen a suitably hard-to-credit claim made by the brilliant 18th century Scots philosopher Thomas Reid: our mind--our brains--are equipped with two very different and surprisingly independent &quot;provinces,&quot; or systems, sensation and perception, and contrary to all appearances, it is not the case that sensation provides the raw material out of which perceptions are then refined...There is no doubt that his methods have already made a large contribution to our understanding of consciousness. In fact, a price he pays for his impressionistic methods is that he influences other thinkers almost subliminally; more than a few theorists have absorbed major elements of his message and then innocently reworked them and presented them as their own pet ideas. If that is a projectible pattern, we can anticipate that this book will be regarded as a somewhat eccentric and dismissible foray by many whose own work will subsequently bear the stamp of his thinking, whether they realize it or not. Among philosophers, unwitting reinvention rivals denunciation as candidates for the sincerest form of flattery, and by those measures, Humphrey has had more than his share of deserved accolades. (Daniel C. Dennett Brain 2007-01-01)\n\nThere are few scientists who think so originally, provoke so consistently or write so elegantly as Humphrey. Seeing Red...is a wonderful introduction to his iconoclastic thinking...Seeing Red is less about what consciousness is than about how we might go about thinking about it. And for that there are few better guides than Nicholas Humphrey. (Kenan Malik Sunday Telegraph 2006-07-23)\n\n[Seeing Red is] a collection of small and unexpectedly lucid thought experiments on a topic that has universal appeal...Humphrey provides a refreshing take on this ancient topic...One of the key merits of Seeing Red is its multi-disciplinary approach to defining something that has eluded definition for centuries. Humphrey draws upon philosophy, art, and psychology in turn, producing a holistic narrative that almost seems a microcosm of human experience. And this is part of Humphrey's particular gift: he demonstrates a poetic understanding of the human psyche, its desires and insecurities...[This is] a book that is, above all, written for the sake of asking questions rather than answering them. (Nancy Yang Harvard Book Review 2006-05-01)\n\nIt's a delight to read, beautifully clear and concise, while packing lots of good sense...[An] intellectual tour de force...Few contemporary writings on consciousness achieve half as much. (Chris Nunn New Scientist 2006-06-24)\n\nI like short books. Better still, I like short books so packed with ideas that I have to stop and think on every page. Seeing Red is that sort of book...In Seeing Red Humphrey brings together all his previous research and theorising to give us a counterintuitive and distinctly uncomfortable way of thinking about the nature of seeing...A book that makes me think so hard, in just 150 pages, is one I must recommend. (Susan Blackmore Times Higher Education Supplement 2006-09-29)\n\nWhy are we conscious in the subjective way we are, when other creatures get along perfectly well without this particular capacity?...Seeing Red tackles this task with a directness and dignity seemingly not often achieved in current technical writing...The book is completely engaging and comfortably authoritative. Humphrey draws on decades of study and reflection on mind, self, and consciousness. Readers of his earlier works will recognize Humphrey's insightful premises, and will be yet again impressed with the robustness of his positions and ideas. (Keith Harris Metapsychology Online)\n\nIf ever the phrase &quot;in our end is our beginning&quot; applied appositely, it does so here. The benign circle of Nicholas Humphrey's argument is that the explanation of why and how we have conscious experience, phenomenal consciousness, is also the explanation of why we find it so hard to understand why and how we can have it--to the point where some think such understanding unattainable. It is a very neat argument. Once we start reflecting on why we might find an understanding of phenomenal consciousness so elusive, we have taken a major step towards understanding it--what it is, what it does, and why it evolved. In Seeing Red, much argument lies between Humphrey's description of our initial bafflement about sensations or &quot;qualia&quot;--i.e., the phenomenon of there being 'something it is like' to experience, say, red--and his rather brilliant explanation. The argument accessibly interweaves empirical research and philosophical analysis, to produce a most important little book. (John Shand Times Literary Supplement)\n\nSeeing Red is a brilliantly inventive account of the evolution of consciousness, the best yet. (Paul Broks Prospect Magazine 2007-04-01)\n\n===================================================================================\nAbout the Author\nNicholas Humphrey is School Professor in the Centre for Philosophy of Natural and Social Science at the London School of Economics.\n===================================================================================","torrent":{"xt":"urn:btih:e5c48b4c24481aa2ffaac4ab6ebf0555d3fb95e6","amp;dn":"Nicholas+Humphrey+-+Seeing+Red.+A+Study+in+Consciousness+%5B2009%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5c48b4c24481aa2ffaac4ab6ebf0555d3fb95e6","infoHashBuffer":{"type":"Buffer","data":[229,196,139,76,36,72,26,162,255,170,196,171,110,191,5,85,211,251,149,230]},"announce":[],"urlList":[]}}