{"title":"Olen Steinhauer - All the Old Knives","uid":14675425,"size":157638004,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e601c6cb1a0b2a2f556b60d5f174a4e7721ae4c9&amp;dn=Olen+Steinhauer+-+All+the+Old+Knives&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cybotage","files":22,"time":1463942494,"description":"Six years ago in Vienna, terrorists took over a hundred hostages, and the rescue attempt went terribly wrong. The CIA's Vienna station was witness to this tragedy, gathering intel from its sources during those tense hours, assimilating facts from the ground and from an agent on the inside. So when it all went wrong, the question had to be asked: Had their agent been compromised, and how?\r\n\r\nTwo of the CIA's case officers in Vienna, Henry Pelham and Celia Harrison, were lovers at the time, and on the night of the hostage crisis Celia decided she'd had enough. She left the agency, married and had children, and is now living an ordinary life in the idyllic town of Carmel-by-the-Sea. Henry is still a case officer in Vienna, and has traveled to California to see her one more time, to relive the past, maybe, or to put it behind him once and for all.\r\n\r\nBut neither of them can forget that long-ago question: Had their agent been compromised? If so, how? Each also wonders what role tonight's dinner companion might have played in the way the tragedy unfolded six years ago.\r\n\r\nAll the Old Knives is New York Times bestseller Olen Steinhauer's most intimate, most cerebral, and most shocking novel to date.\r\n\r\n\r\nRead by Ari Fliakos, Juliana Francis Kelly\r\nFormat: MP3","torrent":{"xt":"urn:btih:e601c6cb1a0b2a2f556b60d5f174a4e7721ae4c9","amp;dn":"Olen+Steinhauer+-+All+the+Old+Knives","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e601c6cb1a0b2a2f556b60d5f174a4e7721ae4c9","infoHashBuffer":{"type":"Buffer","data":[230,1,198,203,26,11,42,47,85,107,96,213,241,116,164,231,114,26,228,201]},"announce":[],"urlList":[]}}