{"title":"Echo &amp; The Bunnymen - Crystal Days Box 4 cds NMR","uid":4601861,"size":2029642215,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e69bfe4916441026ce4ef23d8c6c695688f1f0d1&amp;dn=Echo+%26+The+Bunnymen+-+Crystal+Days+Box+4+cds+NMR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"sradams777","files":72,"time":1230252441,"description":"Crystal Days Box Set 4cds\n\nThese are not my rips (NMR) since someone was bitching about what that stands for.\nThese sound great to me, but if you don't want them or need some kind of log or bullshit sorry...enjoy and seed please.\n \n\nReview\tby Andy Kellman\n\nThe answer is a resounding yes -- Echo &amp; the Bunnymen's Crystal Days: 1979-1999, a four-disc set boasting a great built-in book with a biography and track-by-track commentary, is worth every penny. Through 71 tracks, it does an excellent job by catering to the longtime fan and merely curious, running through all the hits and selecting standout album tracks, rarities, and unreleased curiosities, all worthwhile. The very fact that compilation producer Andy Zax was driven to put this project into motion after realizing he just had to find a way to get stellar B-sides like the Velvets-meets-Byrds heaven of &quot;Angels and Devils&quot; and the Peel Session version of the experimental &quot;No Hands&quot; into circulation tells you right off that you're in good hands. If this great-sounding box proves anything, it's that the Bunnymen don't deserve to be merely regarded as an excellent '80s band; sure, they've had some bumps along the road, but despite having thrived in a decade known for plasticity and fad crazes, this collection establishes that their legacy exists apart from the negative connotations the &quot;'80s band&quot; tag carries. And by carefully selecting songs from their '90s incarnation, they throw a pie in the face of those who believe all reunions are artistic no-nos. The first three discs run chronologically through the band's first 20 years, occasionally throwing surprises into the mix with alternative versions and outtakes. The only gripe one might have is the favoring of the &quot;All Night Version&quot; of &quot;The Killing Moon&quot; over the original, which would be nitpicky. The final disc is chiefly occupied by live covers, including a great set-closing combo of the Velvets' &quot;Heroin&quot; and their own &quot;Do It Clean.&quot; This is no mere nostalgia kick -- it's just solid, ageless rock &amp; roll with attitude and brains.","torrent":{"xt":"urn:btih:e69bfe4916441026ce4ef23d8c6c695688f1f0d1","amp;dn":"Echo+%26+The+Bunnymen+-+Crystal+Days+Box+4+cds+NMR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e69bfe4916441026ce4ef23d8c6c695688f1f0d1","infoHashBuffer":{"type":"Buffer","data":[230,155,254,73,22,68,16,38,206,78,242,61,140,108,105,86,136,241,240,209]},"announce":[],"urlList":[]}}