{"title":"Poison The Well - discography (4 studio albums + 1 EP)","uid":4472059,"size":243480494,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e724e8caf07d7e6cc36224386a925fc08d89a4c4&amp;dn=Poison+The+Well+-+discography+%284+studio+albums+%2B+1+EP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"phrozin1","files":-1,"time":1225174886,"description":"  Poison the Well (commonly abbreviated as PTW) is a post-hardcore/experimental band from Miami, Florida currently signed to Ferret Music. Guitarist Ryan Primack and drummer Chris Hornbrook are the only remaining members of the band who have been involved since their first album, although vocalist Jeffrey Moreira has been the singer on all four full length albums. These three are considered the core members of the band.\n  Poison the Well was originally named &quot;An Acre Lost&quot; and was started by original singer Aryeh Lehrer and original guitarist Ryan Primack. Shortly after their first release as &quot;An Acre Lost&quot;, a 12&quot; split with Promise No Tomorrow on Ohev Records, the name of the band was changed to Poison the Well. Poison the Well released their first album Distance Only Makes The Heart Grow Fonder in 1998. The album gained them the attention of Trustkill Records who signed them to a multi-album deal. PTW released their first album with Trustkill in 1999, The Opposite of December... A Season of Separation. Trustkill has a strong underground following in the United States, and popularity and some success was achieved. To this day, Guitar World magazine still dubs The Opposite of December one of the greatest hardcore albums of all-time, ranking number 8.\n  The Opposite of December... A Season of Separation gained the attention of some major labels. The album was successful enough that in 2001 the band re-released Distance Makes The Heart Grow Fonder on Undecided Records with two live bonus tracks and a slightly different title (they dropped the &quot;Only&quot;). Afterward, the band released one more album on Trustkill, Tear From the Red, and released a video for the song &quot;Botchla&quot;. The popularity of the album grew and the band was signed by Atlantic Records. In 2003, a year after the release Tear From the Red, the band made their major label debut with You Come Before You.\n  Although the band had experienced success being signed with a major label, on June 13, 2006, Poison the Well announced that they parted ways with Atlantic Records after only one album because of &quot;creative differences&quot;. On November 16, 2006 Poison the Well officially joined independent label Ferret Music.\nPoison the Well released &quot;Letter Thing&quot; as a digital-only single on March 13, 2007. The single is available via iTunes and all other download platforms. A video has also been released, with Roboshobo (The Blood Brothers, Mates of State) handling directorial duties. Poison the Well&amp;#039;s Versions was released on Ferret Music on April 2, 2007 in Europe and April 3, 2007 worldwide. On February 22, 2007 they began touring in support of the album. As of mid 2008, Poison the Well are taking a break from major touring, with scattered shows in Alaska, Canada, South America, and Florida planned. They plan on using the rest of the year to write a follow-up to Versions\n\n\n=================================================================\nArtist    -  Poison The Well        \nAlbum     -  Various                                          \nGenre     -  post-hardcore                                              \nLabel     -  Ohev, Good Life Recordings, Trustkill, Undecided, Atlantic, Ferret\nYear      -  1997 - present                                            \nTracks    -  n/a                                               \nPlaytime  -  n/a\nFile Type -  .mp3\nSize      -  232.20 MB\nkbps      -  VBR / 256 avg\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/phrozin1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/phrozin1&lt;/a&gt; \n\nEnjoy. Please seed for others. Thanks.        \n=================================================================\n\nPoison the Well discography:\n\n1999 The Opposite of December Trustkill\n2002 Tear From the Red\n2003 Ghostchant EP\n2003 You Come Before You\n2007 Versions\n","torrent":{"xt":"urn:btih:e724e8caf07d7e6cc36224386a925fc08d89a4c4","amp;dn":"Poison+The+Well+-+discography+%284+studio+albums+%2B+1+EP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e724e8caf07d7e6cc36224386a925fc08d89a4c4","infoHashBuffer":{"type":"Buffer","data":[231,36,232,202,240,125,126,108,195,98,36,56,106,146,95,192,141,137,164,196]},"announce":[],"urlList":[]}}