{"title":"RocketsRocketsRockets (Rockets Rockets Rockets) Module 4","uid":11620628,"size":99546139,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e74bebd856947dbdc6ce112228fdc87da3aa2e2c&amp;dn=RocketsRocketsRockets+%28Rockets+Rockets+Rockets%29+Module+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Lamasu","files":-1,"time":1417542750,"description":"&quot;ROCKETS fire ROCKETS at ROCKETS in this action-arcade, arena-combat festival-of-fireworks! It's dogfighting meets figure-skating in space with multiplayer and single-player fast-paced combat modes plus a ZEN MODE where ROCKETS learn to LOVE.&quot;\n\n-= Module 4 changelog (30.11.2014) =-\n&quot;BALLOONS\nOne of the biggest complaints we've been getting from the fans (especially when showcasing the game at conventions) is that the scoring system is confusing to new players. Our old Tug-of-War mechanic wasn't working quite as well as we had expected, so for Module 4 were doing something a bit crazy: Changing up the core scoring mechanic.\nModule 4 is introducing per-rocket &quot;health&quot; as represented by balloons. Can you really call a ROCKET without balloons a rocket? We didn't think so either! (Also maybe we like MarioKart's Battle Mode a little bit.)\nHere's how it works:\n- Each ROCKET begins with 3 balloons that orbit it.\n- Shooting another ROCKET will steal one of their balloons and add it to your own collection.\n- You cannot have more balloons than you started with; if you have 3 balloons and you steal a fourth, it gets popped permanently.\n- Once a player is out of balloons, they are out of the running -- they lose the ability to shoot, and the camera stops tracking them (But they can still fly around and run interference, sorta like a ghost).\nFor those of you that loved the tug-of-war-mode: It's not gone forever! It is still an active option for the ROCKET WORKSHOP.\nZEN MODE\nWe uploaded a new &quot;Zen&quot; workshop item that allows you to play by yourself (or with others), that enforces no game-over state and allows you to play to your heart's content. I'll be tweaking this workshop item over time until it reflects the actual zen mode that we want to ship with -- it'll allow you to play with colours and remove the firing abilities, so what you see right now isn't really representative, but we wanted to give you a window into our development there.\nRIBBONS\nTaking inspiration from Goldeneye, Super Smash Brothers, and Towerfall, we have added the ability to win ribbons at the end of the match!\nWe currently have a dozen or two different things you can win, and we report back on things such as Accuracy statistics. We'll be adding more and more ribbons over time, we hope you have fun figuring them all out!\nBALANCE CHANGES\nWe also made some changes to overall gameplay that might alter your strategies:\n- We lowered the burstfire timer from 1.8 seconds to 1.0 seconds. We found that the burstfire was almost never being used, as it was superior to simply button-mash. This change makes burstfire fire more projectiles-per-second than button-mashing can, but you still lose the ability to use shields for a second during the burst so there is a tradeoff in strategies there.\n- You are now allowed to have up to 4 different teams per match.\n- You are now allowed to have up to 4 AI players per match.\nOther changes:\n- We tweaked the default camera speeds, which should make spectating a little less sickness inducing now.\n- 10 new achivements to collect!\n- Some modding fixes and changes.\n- Fixed progression achievements.\n- New default map starting placements\n- Fixed a bug with keyboard controls not responding properly in the customization menu\n- Added a &quot;reset achievements&quot; button to the settings menu\n- Changed how the camera zooms in on the victor during game over.\n- Added versioning numbers to Workshop items. This has the unfortunate side effect of breaking all existing mods (many just have to be re-uploaded by the authors to work), but the advantage of you no longer having to play game modes that were designed with Module 1 variables that no longer exist.\n- Added the ability to select between Zen / TugOfWar / Bubble modes in modding files.\n- Where applicable, you can now view high score tables from the Workshop menu.\n- Lots of performance tweaks. Our development benchmark machine went from 55FPS to 80FPS!\n- New shielding graphics that match your ship colours.\n- Fixed a big pile of bugs.&quot;\n\nIf you like the game, support the developer, buy it! &lt;a href=&quot;\nhttp://store.steampowered.com/app/289760/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/289760/&lt;/a&gt;","torrent":{"xt":"urn:btih:e74bebd856947dbdc6ce112228fdc87da3aa2e2c","amp;dn":"RocketsRocketsRockets+%28Rockets+Rockets+Rockets%29+Module+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e74bebd856947dbdc6ce112228fdc87da3aa2e2c","infoHashBuffer":{"type":"Buffer","data":[231,75,235,216,86,148,125,189,198,206,17,34,40,253,200,125,163,170,46,44]},"announce":[],"urlList":[]}}