{"title":"The Longevity Project by Howard S Friedman","uid":9642720,"size":863836,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e805e173e926e326dd51bc68d8cebb9e1dbbfb25&amp;dn=The+Longevity+Project+by+Howard+S+Friedman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"PirateBook","files":3,"time":1392949391,"description":"\nThis landmark study--which Dr. Andrew Weil calls &quot;a remarkable achievement with surprising conclusions&quot;--upends the advice we have been told about how to live to a healthy old age.\n\nWe have been told that the key to longevity involves obsessing over what we eat, how much we stress, and how fast we run. Based on the most extensive study of longevity ever conducted, The Longevity Project exposes what really impacts our lifespan-including friends, family, personality, and work.\n\nGathering new information and using modern statistics to study participants across eight decades, Dr. Howard Friedman and Dr. Leslie Martin bust myths about achieving health and long life. For example, people do not die from working long hours at a challenging job- many who worked the hardest lived the longest. \n\nGetting and staying married is not the magic ticket to long life, especially if you're a woman. And it's not the happy-go-lucky ones who thrive-it's the prudent and persistent who flourish through the years.\n\nWith questionnaires that help you determine where you are heading on the longevity spectrum and advice about how to stay healthy, this book changes the conversation about living a long, healthy life.\n\nGenre: Non Fiction | Psychology | Self Help","torrent":{"xt":"urn:btih:e805e173e926e326dd51bc68d8cebb9e1dbbfb25","amp;dn":"The+Longevity+Project+by+Howard+S+Friedman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e805e173e926e326dd51bc68d8cebb9e1dbbfb25","infoHashBuffer":{"type":"Buffer","data":[232,5,225,115,233,38,227,38,221,81,188,104,216,206,187,158,29,187,251,37]},"announce":[],"urlList":[]}}