{"title":"Midnight Rider by Diana Palmer (epub, mobi)","uid":7844878,"size":672495,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e87c54312ec80bed824b9192fd79e01f4207aaab&amp;dn=Midnight+Rider+by+Diana+Palmer+%28epub%2C+mobi%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"motleycat","files":2,"time":1353442863,"description":" &lt;a href=&quot;http://www.goodreads.com/book/show/15800770-midnight-rider&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.goodreads.com/book/show/15800770-midnight-rider&lt;/a&gt;\n\nSavor the magic of New York Times bestselling author Diana Palmer in a dazzlingly sensual story of turn-of-the-century Texas, of a man as enigmatic and forbidding as the sun-drenched land--and the woman who dares to cross into the uncharted territory of his heart.\n\nTo Bernadette Barron, Eduardo Cortes was the enemy. A noble count with a sprawling ranch in the grand state of Texas, Cortes challenged her with dark, penetrating eyes that seemed to pierce her very soul. Could he see the burning truth: that she loved him? It is a secret Bernadette vows to keep--especially now that she is to become his wife. For theirs is a marriage bargain, pure and simple. He needs a rich wife to save his ranch; she needs a titled husband.\n\nYet desire will turn a marriage of convenience into a passionate battle of wills, and change an innocent girl into a woman aware of her own powers of attraction. For it is love's fiery initiation that will make Bernadette aware of her own capacity for pleasure as well as her husband's skill at providing it. And it is the sheer force of her own love that will give her newfound strength to battle against the odds to claim a man and a love she will not be denied. . . .","torrent":{"xt":"urn:btih:e87c54312ec80bed824b9192fd79e01f4207aaab","amp;dn":"Midnight+Rider+by+Diana+Palmer+%28epub%2C+mobi%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e87c54312ec80bed824b9192fd79e01f4207aaab","infoHashBuffer":{"type":"Buffer","data":[232,124,84,49,46,200,11,237,130,75,145,146,253,121,224,31,66,7,170,171]},"announce":[],"urlList":[]}}