{"title":"Writing on the Wall - The Architectural Context of Late Assyrian","uid":9799173,"size":12929036,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e928ce2a69b6b2330b9f17df38a3290475f91c58&amp;dn=Writing+on+the+Wall+-+The+Architectural+Context+of+Late+Assyrian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"STBGD","files":-1,"time":1395357769,"description":"Writing on the Wall: The Architectural Context of Late Assyrian Palace (Mesopotamian Civilizations, 9) by John Malcolm Russell\nEnglish | 1999 | ISBN: 0931464951 | ISBN-13: 9780931464959 | 348 pages | PDF | 12,3 MB\n\nIt is too often forgotten that every Assyrian &quot;historical&quot; inscription functioned in a very specific context. This context influenced its content and the way in which it was perceived by ancient viewers and readers. Russell's goal is to address the reconstruction of the context of these inscriptions in order to elucidate their original impact.\n\nIn the past, the palace inscriptions, including Assyrian palace inscriptions, have been published in composite editions with little or no reference to the provenience of the individual exemplars; in addition, the original excavation reports often were more interested in the content of the inscriptions than in their locations. To achieve the objective of placing these inscriptions in their original contexts and thereby provide a base for further study of them, and stimulated by two seasons of renewed excavations at Nineveh during which he studied many inscriptions in situ, Russell returned to the British Museum and Layard's original, handwritten notes from the 19th century excavations at Nineveh--the goal being to catalogue fully and as completely as possible the individual inscriptions and their locations.\n\nThe results of Russell's labors are here published, including the first publication of several shorter inscriptions. The book is lavishly illustrated, both with museum photos and with photos by the author of many of the inscriptions in situ. The book will no doubt be the basis of all further study of the relationship between inscription and context in the palaces of the Assyrian kings.","torrent":{"xt":"urn:btih:e928ce2a69b6b2330b9f17df38a3290475f91c58","amp;dn":"Writing+on+the+Wall+-+The+Architectural+Context+of+Late+Assyrian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e928ce2a69b6b2330b9f17df38a3290475f91c58","infoHashBuffer":{"type":"Buffer","data":[233,40,206,42,105,182,178,51,11,159,23,223,56,163,41,4,117,249,28,88]},"announce":[],"urlList":[]}}