{"title":"My Autobiography - Alec Ferguson.epub","uid":9106441,"size":3159575,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9ebeaeedb38e52e8a683bef279395efdbb7fa1a&amp;dn=My+Autobiography+-+Alec+Ferguson.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"420weedman","files":1,"time":1382888143,"description":"The celebratory, revealing, inspiring, and entertaining autobiography of the greatest manager in the history of British soccer\n\nOver the past four years, Alex Ferguson has been reflecting on and jotting down the highlights of his extraordinary career, and here he reveals his amazing story as it unfolded, from his very early days in the tough shipyard areas of Govan. Sir Alex announced his retirement as manager of Manchester United after 27 years in the role. He has gone out in a blaze of glory, with United winning the Premier League for the 13th time, and he is widely considered to be the greatest manager in the history of British soccer. Over the last quarter of a century there have been seismic changes at Manchester United, with the only constant element the quality of the manager's league-winning squad and United's run of success, which includes winning the Champions League for a second time in 2008. Sir Alex created a purposeful, but welcoming, and much envied culture at the club, which has lasted the test of time. He discusses managing these enormous changes and the growth of Man U as a global sports power. He shares the farewells to Roy Keane and David Beckham, describes the process of building a new Champions League side around Ronaldo and Rooney, and ruminates upon the great rivalries with Liverpool, Arsenal, Chelsea, and City. He also shares his thoughts on the psychology of management and his passions and interests outside of the game.\nGenre: General","torrent":{"xt":"urn:btih:e9ebeaeedb38e52e8a683bef279395efdbb7fa1a","amp;dn":"My+Autobiography+-+Alec+Ferguson.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9ebeaeedb38e52e8a683bef279395efdbb7fa1a","infoHashBuffer":{"type":"Buffer","data":[233,235,234,238,219,56,229,46,138,104,59,239,39,147,149,239,219,183,250,26]},"announce":[],"urlList":[]}}