{"title":"The Storied Life of A. J. Fikry - Gabrielle Zevin","uid":11658942,"size":954085,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9fbfe78787b0c6f7d684b846c8645d3fdac16c7&amp;dn=The+Storied+Life+of+A.+J.+Fikry+-+Gabrielle+Zevin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1417965758,"description":"In the spirit of The Guernsey Literary and Potato Peel Pie Society and The Unlikely Pilgrimage of Harold Fry, Gabrielle Zevin's enchanting novel is a love letter to the world of books -- and booksellers -- that changes our lives by giving us the stories that open our hearts and enlighten our minds.\n\nOn the faded Island Books sign hanging over the porch of the Victorian cottage is the motto &quot;No Man Is an Island; Every Book Is a World.&quot; A. J. Fikry, the irascible owner, is about to discover just what that truly means.\n\nA. J. Fikry's life is not at all what he expected it to be. His wife has died, his bookstore is experiencing the worst sales in its history, and now his prized possession, a rare collection of Poe poems, has been stolen. Slowly but surely, he is isolating himself from all the people of Alice Island--from Lambiase, the well-intentioned police officer who's always felt kindly toward Fikry; from Ismay, his sister-in-law who is hell-bent on saving him from his dreary self; from Amelia, the lovely and idealistic (if eccentric) Knightley Press sales rep who keeps on taking the ferry over to Alice Island, refusing to be deterred by A.J.'s bad attitude. Even the books in his store have stopped holding pleasure for him. These days, A.J. can only see them as a sign of a world that is changing too rapidly.\n\nAnd then a mysterious package appears at the bookstore. It's a small package, but large in weight. It's that unexpected arrival that gives A. J. Fikry the opportunity to make his life over, the ability to see everything anew. It doesn't take long for the locals to notice the change overcoming A.J.; or for that determined sales rep, Amelia, to see her curmudgeonly client in a new light; or for the wisdom of all those books to become again the lifeblood of A.J.'s world; or for everything to twist again into a version of his life that he didn't see coming.\n\nAs surprising as it is moving, The Storied Life of A. J. Fikry is an unforgettable tale of transformation and second chances, an irresistible affirmation of why we read, and why we love","torrent":{"xt":"urn:btih:e9fbfe78787b0c6f7d684b846c8645d3fdac16c7","amp;dn":"The+Storied+Life+of+A.+J.+Fikry+-+Gabrielle+Zevin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9fbfe78787b0c6f7d684b846c8645d3fdac16c7","infoHashBuffer":{"type":"Buffer","data":[233,251,254,120,120,123,12,111,125,104,75,132,108,134,69,211,253,172,22,199]},"announce":[],"urlList":[]}}