{"title":"Rubber as a Construction Material for Corrosion Protection {BBS}","uid":6907647,"size":13772390,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea346cbd35fde53013106d65199d38b6a2a45f27&amp;dn=Rubber+as+a+Construction+Material+for+Corrosion+Protection+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1324658378,"description":"                                 ___ _          _     _                       \n  /\\/\\   ___ _ __ _ __ _   _    / __\\ |__  _ __(_)___| |_ _ __ ___   __ _ ___ \n /    \\ / _ \\ '__| '__| | | |  / /  | '_ \\| '__| / __| __| '_ ` _ \\ / _` / __|\n/ /\\/\\ \\  __/ |  | |  | |_| | / /___| | | | |  | \\__ \\ |_| | | | | | (_| \\__ \\\n\\/    \\/\\___|_|  |_|   \\__, | \\____/|_| |_|_|  |_|___/\\__|_| |_| |_|\\__,_|___/\n                       |___/                                                  \n\n*******************************************************************************\n\nFirst book on rubber used as a construction material dedicated to the chemical process industry\n\nDespite the long history of rubber as a construction material, this book is a unique publication as it comprehensively looks at the material with respect to the anti-corrosion requirements of the multitude of industries where rubber is used, both on land and offshore. This guide documents how rubber reliably meets the threats of corrosion and contributes to the longevity of the equipment. Chapters on ebonite, natural, and synthetic rubbers, examine their relevant properties and chemical resistance.\n\nThe book details the practical aspects and handling of rubber lined equipment: thin-walled structures, vacuum vessels, ducts, large diameter tanks, agitators, and fully lined pipes (both inside and outside). Molded and fabricated products of ebonite and soft rubber as well as hand-made rubber products are shown along with vulcanization technology, testing and inspections, measurements and standards. Several case studies are included demonstrating the preferential choice of rubber as a construction material as well as practical applications and techniques of its usage in the chlor-alkali, fertilizer, mineral processing and other core chemical processing industries, which are the largest consumers of rubber as a material of construction. The volume ends with a section on aging and prediction of service life.\n\nRubber as a Construction Material for Corrosion Protection will be used by chemical engineers, rubber technologists, students, research workers worldwide in the rubber industry and process industries such as fertilizer, mining and ore, oil &amp; gas, paper and pulp, steel plants, as well as people engaged in corrosion protection. The book will also be very useful to the construction industry.\n\n\n# Hardcover: 297 pages\n# Publisher: Wiley-Scrivener; 1 edition (June 8, 2010)\n# Language: English\n# ISBN-10: 0470625945\n# ISBN-13: 978-0470625941","torrent":{"xt":"urn:btih:ea346cbd35fde53013106d65199d38b6a2a45f27","amp;dn":"Rubber+as+a+Construction+Material+for+Corrosion+Protection+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea346cbd35fde53013106d65199d38b6a2a45f27","infoHashBuffer":{"type":"Buffer","data":[234,52,108,189,53,253,229,48,19,16,109,101,25,157,56,182,162,164,95,39]},"announce":[],"urlList":[]}}