{"title":"Marvel NOW! Week 72 (4/2/2014) {darkhomr) [ALL]","uid":9878215,"size":349694992,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ea9dac18753291f67ec1e13280b2fdab567936ee&amp;dn=Marvel+NOW%21+Week+72+%284%2F2%2F2014%29+%7Bdarkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"dadrkhomr","files":10,"time":1396502583,"description":"Welcome to the 2014 version of Marvel NOW!  Week after week I will be bringing you the latest in comics in the Marvel NOW universe as well as the All-New Marvel NOW stories.  Can you believe we are 70 weeks in the Marvel NOW and they are putting out an ALL NEW version of the titles?  What will NOT be included is Disney stuff, TV stuff, and the kids books. Those will be included (when available) in my Total Marvel pack.\n\nThis weeks' release (March 26, 2014) includes 2 issues with 4 new #1's (Inhuman and What IF...Age of Ultron)  \n\nMy release packs are as follows: \n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\n\n[IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/blackwidow5_zps495a6f8b.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/newwarriors3_zps26a99a61.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/moonknight2_zpsfe8f849d.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/inhuman1_zps60d6780f.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/whatifultron1_zpse368dc30.jpg[/IMG] \n\n\n\n\n\nBlack Widow #5 (CBR 4/2/2014)\n\nParis, London, Montenegro. Natasha is in a race against time, under the shadow of the hammer . . . A dark plot threatens Europe, and even SHIELD doesn't know who's behind it . . . With nowhere to turn for answers, Natasha has no choice but to ask THE RAVEN for help . . . \n\nCaptain America #19 (CBR 4/2/2014)\n\nThe story that will change the life of Captain America forever! S.H.I.E.L.D.'S ultimate weapon hass fallen into the hands of The Iron Nail! Cap trapped in the twisted mindscape of Dr. Mindbubble! Jet Black and Falcon must make a horrible choice! \n\nInhuman #1 (CBR 4/2/2014)\n\nThe newest super heroes of the Marvel Universe are born! A cloud of Terrigen mist is moving around the world turning regular people into Inhumans with amazing powers. But not everyone thinks this is a good thing. Discover the secret history of the Marvel Universe and get in at the ground floor of the next big Marvel franchise! \n\nLoki Agent Of Asgard #3 (CBR 4/2/2014)\n\nLoki heads back to the dawn of Asgard to join its greatest heroes on a quest for an otter-skin of gold, the heart's-blood of a dragon . . . and a certain magical sword. Meanwhile, Loki does not appear in this issue. Both these statements are, for once, true. \n\nMagneto #2 (CBR 4/2/2014)\n\nHorrors from Magneto's past inform his decisions in the present as he hunts down the source of the newest threat to mutantkind. Meanwhile, S.H.I.E.L.D. catches a glimpse of Magneto's new band of followers . . . \n\nMoon Knight #2 (CBR 4/2/2014)\n\nThe best new comic of 2014 continues with a story that has to be experienced to be believed! \n\nNew Warriors #3 (CBR 4/2/2014)\n\nTHE KIDS ARE ALL FIGHT! The all-new NOVA has tea with the High Evolutionary as a world-wide genocide approaches. Why does the High Evolutionary want to kill anything that's not human? Is he a hero or villain? The answers are here! PLUS! As the New Warriors gather in New York, a captured SCARLET SPIDER meets Nova, and one of them REALLY annoys the other. Guess. \n\nPunisher #4 (CBR 4/2/2014)\n\nThe Punisher, captured by the Dos Sols gang, is caught in the metaphorical lion's den. Tough luck, metaphorical lions. The 131 get the call: Take down the Punisher with extreme prejudice. A new player tosses her hat in the ring, and Frank's gotta ask himself a question: &quot;Do I feel lucky?&quot; Well . . . do ya, Frank? \n\nShe-hulk #3 (CBR 4/2/2014)\n\nWe the people find you DOOM! When the son of Victor Von Doom seeks extradition, Jen Walters will go to the ends of the earth for Justice! All this, and Matt Murdock too as Charles Soule (THUNDERBOLTS) and Javier Pulido (HAWKEYE) continue 2014's sleeper hit! \n\nWhat If Age Of Ultron #1 (of 5) (CBR 4/2/2014)\n\nTHE ENDLESS AGE OF ULTRON! In Age of Ultron, a time-travelling Wolverine killed Hank Pym before he could create the world-conquering Ultron. What would the Marvel Universe look like if another founding Avenger had been killed instead? A world without the Wasp brings a world where Hank Pym created an Ultron even more heinous than the one we know! \n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:ea9dac18753291f67ec1e13280b2fdab567936ee","amp;dn":"Marvel+NOW%21+Week+72+%284%2F2%2F2014%29+%7Bdarkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea9dac18753291f67ec1e13280b2fdab567936ee","infoHashBuffer":{"type":"Buffer","data":[234,157,172,24,117,50,145,246,126,193,225,50,128,178,253,171,86,121,54,238]},"announce":[],"urlList":[]}}