{"title":"Sharon Lee, Steve Miller - Fledgling (Liaden Universe #12)","uid":12398600,"size":205156015,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:eaa60e0308a46b0e5afd30c5429981114e4a8a7a&amp;dn=Sharon+Lee%2C+Steve+Miller+-+Fledgling+%28Liaden+Universe+%2312%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Cybotage","files":1,"time":1441987475,"description":"\nTheo Waitley has lived all her young life on Delgado, a Safe World that is home to one of the galaxy's premier institutions of higher learning. Both Theo's mother, Kamele, and Kamele's onagrata Jen Sar Kiladi, are professors at the university, and they all live comfortably together, just like they have for all of Theo's life, in Jen Sar's house at the outskirts of town. Suddenly, though, Theo's life changes. Kamele leaves Jen Sar and moves herself and Theo back into faculty housing, which is not what Theo is used to.\n\nOnce settled back inside the Wall, Kamele becomes embroiled in faculty politics, and is appointed sub-chair of her department. Meanwhile, Theo who has a notation in her file indicating that she is &quot;physically challenged,&quot; has a series of misadventures, including pulling her best friend down on the belt-ride to class, and hurting a teammate during a savage game. With notes piling up in her file, Theo only wants to go &quot;home&quot;, to the house in the suburbs, and have everything just like it used to be.\n\nThen, Kamele uncovers evidence of possible dishonest scholarship inside of her department. In order to clear the department, she and a team of senior professors must go off-world to perform a forensic document search. Theo hopes this will mean that she'll be left in the care of the man she calls &quot;Father&quot;, Professor Kiladi, and is horrified to learn that Kamele means to bring Theo with her!\n\n\n\nNarrated by: Eileen Stevens\nLength: 13 hrs and 21 mins \nFormat: M4A\nBitrate: 32 Kbps\nUnabridged Audiobook\nRelease Date:09-04-12\nPublisher: Audible Studios","torrent":{"xt":"urn:btih:eaa60e0308a46b0e5afd30c5429981114e4a8a7a","amp;dn":"Sharon+Lee%2C+Steve+Miller+-+Fledgling+%28Liaden+Universe+%2312%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eaa60e0308a46b0e5afd30c5429981114e4a8a7a","infoHashBuffer":{"type":"Buffer","data":[234,166,14,3,8,164,107,14,90,253,48,197,66,153,129,17,78,74,138,122]},"announce":[],"urlList":[]}}