{"title":"Marvel Mystery Comics","uid":3937797,"size":1226132862,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:eac0c011fd1c936b72e2633ca47deeb3e4348171&amp;dn=Marvel+Mystery+Comics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"citaltras","files":67,"time":1197936373,"description":"\t\n\tMarvel Mystery Comics\nTimely-Atlas 1939\n\n\n\nIn 1939, pulp magazine publisher Martin Goodman expanded into the newly emerging comic book field by buying content from comics package Funnies, Inc.. His first effort, Marvel Comics #1 (Oct. 1939), featured the first appearances of writer-artist Carl Burgos&amp;#039; android superhero, the Human Torch, and Paul Gustavson&amp;#039;s costumed detective The Angel who was to last to issue 79, even gaining the power of flight for a few issues. As well, it contained the first generally available appearance of Bill Everett&amp;#039;s mutant anti-hero Namor the Sub-Mariner, created for the unpublished movie-theater giveaway comic, Motion Picture Funnies Weekly earlier that year, with the eight-page original story now expanded by four pages.\n\nAlso included was Al Anders&amp;#039; Western hero the Masked Raider; the jungle lord Ka-Zar the Great, with Ben Thompson adapting over the first five issues the story &quot;King of Fang and Claw&quot; by Bob Byrd in Goodman&amp;#039;s eponymous pulp magazine Ka-Zar #1; the non-continuing-character story &quot;Jungle Terror,&quot; featuring an adventurer named Ken Masters, written by the quirkily named Tohm Dixon[1]; &quot;Now I&amp;#039;ll Tell One&quot;, five single-panel, black-and-white gag cartoons by Fred Schwab, on the inside front cover; and a two-page prose story by Ray Gill, &quot;Burning Rubber&quot;, about auto racing. A painted cover by veteran science fiction pulp artist Frank R. Paul featured the Human Torch, looking much different than in the interior story.\n\nThe Ka-Zar here, who would appear in every issue through Marvel Mystery Comics #27 (Jan. 1942) is unrelated to the Marvel Comics jungle lord Ka-Zar introduced in The X-Men (March 1965).\n\nThat initial comic, cover-dated October 1939, quickly sold out 80,000 copies, prompting Goodman to produce a second printing, cover-dated November 1939 and identical except for a black bar in the inside-front-cover indicia over the October date, and the November date added at the end. That sold approximately 800,000 copies.[2] With a hit on his hands, Goodman began assembling an in-house staff, hiring Funnies, Inc. writer-artist Joe Simon as editor. Simon brought along his collaborator, artist Jack Kirby, followed by artist Syd Shores.\n\nAs Marvel Mystery Comics\n\nThe Torch and the Sub-Mariner would continue to star in the long-running title even after receiving their own solo comic-book series shortly afterward. The Angel, who was featured on the covers of #2 &amp; 3, would appear in every issue through #79 (Dec. 1946).\n\nOther characters introduced in the title include the aviator the American Ace (#2, Dec, 1939), with part one of his origin reprinted, like the first part of the Sub-Mariner&amp;#039;s, from Motion Picture Funnies Weekly #1; the Ferret; and writer-artist Steve Dahlman&amp;#039;s robot hero Electro (appearing in every issue from #4-19, Feb. 1940 - May 1941). Issue #13 saw the first appearance of the Vision, the inspiration for the same-name Marvel Comics superhero created in 1968. The original Vision appeared in solo stories through Marvel Mystery Comics #48.\n\nAs Marvel Tales\n\nIn 1949, with the popularity of superheroes having waned, the book was converted into the horror anthology Marvel Tales from issue #93-159 (Aug. 1949 - Aug. 1957), when it ceased publication. Note: This is a different Marvel Tales than that published by Marvel in starting in the 1960s and primarily reprinting Spider-Man stories.\n\n(From Wikipedia)\n\nEnjoy and seed","torrent":{"xt":"urn:btih:eac0c011fd1c936b72e2633ca47deeb3e4348171","amp;dn":"Marvel+Mystery+Comics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eac0c011fd1c936b72e2633ca47deeb3e4348171","infoHashBuffer":{"type":"Buffer","data":[234,192,192,17,253,28,147,107,114,226,99,60,164,125,238,179,228,52,129,113]},"announce":[],"urlList":[]}}