{"title":"Thunder and Lightning series by John Varley","uid":8842180,"size":3489258,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebcacba182d85c638a9468a084a18eb4463eba59&amp;dn=Thunder+and+Lightning+series+by+John+Varley&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"420weedman","files":12,"time":1377277709,"description":"Red Thunder (Thunder and Lightning #1) : Seven suburban misfits are constructing a spaceship out of old tanker cars. The plan is to beat the Chinese to Mars--in under four days at three million miles an hour. It would be history in the making if it didn't sound so insane.\n\nRed Lightning (Thunder and Lightning #2): The son of one of the first men to fly to Mars and back, Ray Garcia-Strickland is now a disgruntled Martian, tired of the Red Planet's overdevelopment and the gravity-dependent tourist Earthies. But that doesn't stop him from fearing the worst when Earth is struck by an unknown object, causing a massive tsunami. Living high on his father's glory was okay, but now Ray must literally come down to Earth-and solve one of its greatest mysteries.\n\nRolling Thunder (Thunder and Lightning #3) : Lieutenant Patricia Kelly Elizabeth Strickland-otherwise known as Podkayne-is a third-generation Martian. Her grandfather, Manny, was one of the first men to set foot on Mars. So Poddy has some planet-sized shoes to fill. That's why she's joined the Music, Arts, and Drama Division of the Martian Navy. Though some may say her voice is a weapon in itself, Poddy passed the audition. And now she's going to Europa, one of Jupiter's many moons, to be an entertainer. But she's about to learn that there's plenty of danger to go around in the Martian Navy, even if you've just signed on to sing","torrent":{"xt":"urn:btih:ebcacba182d85c638a9468a084a18eb4463eba59","amp;dn":"Thunder+and+Lightning+series+by+John+Varley","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebcacba182d85c638a9468a084a18eb4463eba59","infoHashBuffer":{"type":"Buffer","data":[235,202,203,161,130,216,92,99,138,148,104,160,132,161,142,180,70,62,186,89]},"announce":[],"urlList":[]}}