{"title":"Tori Amos - Wel Sunny Florida (DVDrip x264 AC3).mkv","uid":6359790,"size":943720994,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ebe17284d6d70fd2c44d5b42e10161e15171b75a&amp;dn=Tori+Amos+-+Wel+Sunny+Florida+%28DVDrip+x264+AC3%29.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"opalever","files":1,"time":1304292368,"description":"Tori Amos's first concert-length live DVD, Welcome to Sunny Florida, is a riveting showcase for the artist's formidable vocal and instrumental chops and preciously off-kilter pop music. Taped on a wet day in September 2003 at West Palm Beach (the final stop on Amos's Lottapianos tour), the show was well performed, stunningly recorded, and lusciously lensed, if too frantically cut. Session ace Matt Chamberlain on drums and the nimble-fingered Jon Evans on bass provide just enough firepower to flesh out Amos's moody micro-epics while leaving sufficient space to keep her voice and keyboards the focus of our attention. Most songs feature brilliantly reworked arrangements, and the band uses the venue's acoustics to heighten the music's magic. Amos, a vital 40, enjoys a reputation as a great live act, and it's easy to see why as she loses herself in song, head thrown back, one hand on the keys of her BÃƒÂ¶sendorfer grand and the other on an accompanying Wurlitzer.\n\nBe warned: &quot;Professional Widow&quot; suffers from repeated vocal muting on potentially offensive words, which happens to wreck the effect of this particular song. (&quot;Precious Things&quot; is, thankfully, intact.) \n\n\nVIDEO\nCodec: AVC (x264)\nBitrate: 437 Kbps\nResolution: 720x410\nFramerate: 29.97\n\nAUDIO\nCodec: AC-3\nBitrate: 448 Kbps\nChannels: 6\n\nNote: The audio track is the original, untouched Dolby Digital 5.1 Surround Sound track copied bit-for-bit from the DVD. Only the video has been recompressed for this release.","torrent":{"xt":"urn:btih:ebe17284d6d70fd2c44d5b42e10161e15171b75a","amp;dn":"Tori+Amos+-+Wel+Sunny+Florida+%28DVDrip+x264+AC3%29.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebe17284d6d70fd2c44d5b42e10161e15171b75a","infoHashBuffer":{"type":"Buffer","data":[235,225,114,132,214,215,15,210,196,77,91,66,225,1,97,225,81,113,183,90]},"announce":[],"urlList":[]}}