{"title":"Josh Garrels - Over Oceans [2006] [FLAC]","uid":8217328,"size":368138738,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ec21f168361dce1b0229b76d0e9030a60047a865&amp;dn=Josh+Garrels+-+Over+Oceans+%5B2006%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"dickspic","files":13,"time":1362370811,"description":"Artist: Release: Over Oceans\nMusicBrainz: 5e3d04d2-35eb-4c7a-a2fb-186ae7a2d6d4\nReleased: 2006\nLabel: Small Voice\nCountry: US\nFLAC / Lossless / WEB\n\nTracklisting:\n\n01. Fire by Night (04:49)\n02. Over Oceans (06:02)\n03. Decision (03:53)\n04. SISU (05:55)\n05. My Child (05:57)\n06. Break Bread (06:13)\n07. Sweet River Roll (05:40)\n08. Songbird (04:38)\n09. Good Friday (06:49)\n10. YHWH (05:20)\n11. Train Song (07:17)\n12. Creation Song (05:37)\n\nAs much as most of us might want to avoid feelings of paralyzing helplessness and vulnerability, there's still something intoxicating and dangerously appealing about drinking from those inebriating vials through music. And for those moments when it's us singing our own melancholic folk song, hanging our head and feeling the weight of the world on the heart, Over Oceans is one of those albums to get us through it, to let us feel &quot;heard,&quot; an assuaging balm made from the very ingredients of generic, human heartbreak. With echoes of Ben Harper, Digable Planets and Sufjan Stevens, Josh Garrels captures a thick yet efficiently-constructed, understated style that fluidly encompasses not only lo-fi bred, beautifully-dreary folk but threads of hip hop and electronic phraseology. As you wander the deserted, dusty old roads with night falling over your heart, Josh is the man to turn to and this is the album that will let you &quot;go there,&quot; giving you a nudge now and then to keep you from sinking too far. --Tamara Turner - CDBaby\n\nIf any sliver of criticism could be drawn from such honesty in a musician, it would be the inability to walk with him along every fault line and see the experiences that inspire his poetry. However, my mind could not help but imagine the possibilities, and perhaps therein lies Garrels' triumph as a musician: Our hope and joy may come from the same source, but the nuances are beautifully different. Over Oceans requires the listener to engage the imagination, to carry through whatever semblance of emotion Garrels exudes through his vocal and instrumental tone. The ability to accomplish such a weighty task, or even attempt to do so, is a fleeting characteristic in the artists of today.","torrent":{"xt":"urn:btih:ec21f168361dce1b0229b76d0e9030a60047a865","amp;dn":"Josh+Garrels+-+Over+Oceans+%5B2006%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec21f168361dce1b0229b76d0e9030a60047a865","infoHashBuffer":{"type":"Buffer","data":[236,33,241,104,54,29,206,27,2,41,183,109,14,144,48,166,0,71,168,101]},"announce":[],"urlList":[]}}