{"title":"Cycle of Lies: Fall of Lance Armstrong - Juliet Macur Audiobook ","uid":10817990,"size":332330177,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:eccc9c1563e25ee487b2ba97c4094f6b0ce2878a&amp;dn=Cycle+of+Lies%3A+Fall+of+Lance+Armstrong+-+Juliet+Macur+Audiobook+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1408484998,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nCycle of Lies: The Fall of Lance Armstrong\n\nWritten by: Juliet Macur\nNarrated by: Carrington MacDuffie\nLength: 11 hrs and 31 mins\nFormat: Unabridged\nRelease Date:03-18-14\n\nThe definitive account of Lance Armstrong's spectacular rise and fall.\n\nIn June 2013, when Lance Armstrong fled his palatial home in Texas, downsizing in the face of multimillion-dollar lawsuits, Juliet Macur was there - talking to his girlfriend and children and listening to Armstrong's version of the truth. She was one of the few media members aside from Oprah Winfrey to be granted extended one-on-one access to the most famous pariah in sports.\n\nAt the center of Cycle of Lies is Armstrong himself, revealed through face-to-face interviews.\n\nBut this unfolding narrative is given depth and breadth by the firsthand accounts of more than 100 witnesses, including family members whom Armstrong had long since turned his back on - the adoptive father who gave him the Armstrong name, a grandmother, an aunt. Perhaps most damning of all is the taped testimony of the late J. T. Neal, the most influential of Armstrong's many father figures, recorded in the final years of Neal's life as he lost his battle with cancer just as Armstrong gained fame for surviving the disease.\n\nIn the end, it was Armstrong's former friends, those who had once occupied the precious space of his inner circle, who betrayed him. They were the ones who dealt Armstrong his fatal blow by breaking the code of silence that shielded the public from the grim truth about the sport of cycling - and the grim truth about its golden boy, Armstrong.\n\nThreading together the vivid and disparate voices of those with intimate knowledge of the private and public Armstrong, Macur weaves a comprehensive and unforgettably rich tapestry of one man's astonishing rise to global fame and fortune and his devastating fall from grace. ","torrent":{"xt":"urn:btih:eccc9c1563e25ee487b2ba97c4094f6b0ce2878a","amp;dn":"Cycle+of+Lies%3A+Fall+of+Lance+Armstrong+-+Juliet+Macur+Audiobook+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eccc9c1563e25ee487b2ba97c4094f6b0ce2878a","infoHashBuffer":{"type":"Buffer","data":[236,204,156,21,99,226,94,228,135,178,186,151,196,9,79,107,12,226,135,138]},"announce":[],"urlList":[]}}