{"title":"John Frusciante- (2013) Outsides EP  Projeto Chernobyl","uid":8838152,"size":60469546,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ed82ddc65ce3f05f428fb864cb539b3c0bd6e11e&amp;dn=John+Frusciante-+%282013%29+Outsides+EP++Projeto+Chernobyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"klinho","files":5,"time":1377179023,"description":"Frusciante says:\n&quot;Outsides consists of a 10 minute guitar solo and 2 abstract 'out' pieces of music,&quot; the former Red Hot Chili Peppers guitarist reveals. &quot;It's a modern approach to the concepts of harmony found in some late 50s/early 60s free jazz and some 20th century classical. I don't employ any aspects of rock or pop harmony, and that was basically the approach, just to make music that is not reliant on the center that, on PBX, was provided by my songwriting style... [The last two] songs have my style of drums and guitar solos, but nevertheless I think of them as my version of modern classical music. They started as just orchestra, but I go wherever music takes me, and I use any instrument to express my feelings, just as I use aspects of any style.&quot; \nThe six-string virtuoso, who reissued several of his solo albums late last year, also devoted four full paragraphs to the record's opening track, the 10-minute solo mentioned earlier. &quot;The 1st song... is a new approach to the form of the extended solo,&quot; he explains. &quot;Throughout the last few minutes of the solo, the guitar is being treated by my modular synthesizer and its 64 step sequencer, receiving many triggers from a modded 606 drum machine... Rock music is electronic music, dependent entirely on electronic circuitry and amplification. This song gives new life to the long ago popularly discarded form of the extended rock guitar solo, and is also progressive synth pop, just the same.&quot;\n\nOutsides EP track list: \n\n01 Same \n02 Breathiac \n03 Shelf \n04 Sol (bonus track)","torrent":{"xt":"urn:btih:ed82ddc65ce3f05f428fb864cb539b3c0bd6e11e","amp;dn":"John+Frusciante-+%282013%29+Outsides+EP++Projeto+Chernobyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed82ddc65ce3f05f428fb864cb539b3c0bd6e11e","infoHashBuffer":{"type":"Buffer","data":[237,130,221,198,92,227,240,95,66,143,184,100,203,83,155,60,11,214,225,30]},"announce":[],"urlList":[]}}