{"title":"Lost.In.Beijing.(Pingguo).2007.DVDRip.SiGoTuri","uid":4178399,"size":732308244,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ed9dc0a304c3ac10c78399903a00e14835f3d225&amp;dn=Lost.In.Beijing.%28Pingguo%29.2007.DVDRip.SiGoTuri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"maini4ka","files":31,"time":1210266148,"description":"Plot: Massage girl Pingguo (Apple) (The stunning Fan Bingbing) lives in a cramped apartment with her bad-tempered window cleaner husband Kun (Tong Dawei), barely eking by on their miniscule pay. When Pingguo gets raped by her boss Lin (Tony Leung) one afternoon, Kun, who is washing the windows of the building, witnesses the act. The enraged Kun tries to get even first by (unsuccessfully) blackmailing Lin, then by sleeping with Lin's wife (Elaine Kam). The relationships get even more tangled when Pingguo discovers she's pregnant. With the paternity of the baby up in the air, Kun, who is eager for money, strikes a deal with Lin, who is eager for a son.\n\nTrivia: The film is banned in China, despite the heavily censored effort from the filmmaker. The producers have been banned from making movies in China for the next 2 years.\n\nRevue: Lost in Beijing is a very decent film about people lost in a system and culture characterized by a strong, sometimes brutal, sense of pragmatism and hierarchy.\n\nWhen it comes down to power and status, wealth and gender play an important role in most countries - but this is especially true in China, where men are traditionally revered in the family (from the moment that they're conceived) and money/authority are distributed so unevenly. In the film, the contrast between people from wealthy and humble backgrounds, and between males and females, is put into evidence by the two married couples that take center stage in the story (one of them is well-off while the other one is underprivileged). Typically, the wealthy, male character (owner of a massage parlor) places himself at the very top of the hierarchical pyramid, while the poor, female character (a masseuse and migrant worker) immediately finds herself at the very bottom, where she is manipulated and handled as a commodity. Since all four of these characters want or need something from one another, it is interesting to see how they each play their cards and do everything within their power to protect their own interests.\n\nBeijing, the bustling capital of China, brings together people of all different backgrounds and parts of the country, as they transform and build together one of the largest and most influential nations of the 21st century. What kind of nation it will become will much depend on the values of its people and the decisions that they make, day by day. (Curiously, this is suggested by a male name which was especially popular in the earlier decades of old-fashioned Communism: &quot;Jianguo&quot;, which translates into English as &quot;building a country&quot;.) The selfish attitude that is often witnessed in Beijing poses as much of a problem to the future of this budding country (sometimes described as a 'giant child') as it does to the uncertain destiny of the baby in this film.\n\nOverall, it's a very engaging movie. While some parts of its plot are rather implausible, one should give credit to the filmmakers for providing entertainment, an inside look at the social politics of their country and some food for thought. It's also nice to watch an ambitious, yet down-to-earth film from the Chinese mainland which doesn't solely rely on an expensive and opulent production.","torrent":{"xt":"urn:btih:ed9dc0a304c3ac10c78399903a00e14835f3d225","amp;dn":"Lost.In.Beijing.%28Pingguo%29.2007.DVDRip.SiGoTuri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed9dc0a304c3ac10c78399903a00e14835f3d225","infoHashBuffer":{"type":"Buffer","data":[237,157,192,163,4,195,172,16,199,131,153,144,58,0,225,72,53,243,210,37]},"announce":[],"urlList":[]}}