{"title":"CreativeLIVE - Small Business Finance Basics: QuickBooks and Bey","uid":9533918,"size":17056516965,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:edbb4de0c84fddbcf19bdcd930a1556ec6605725&amp;dn=CreativeLIVE+-+Small+Business+Finance+Basics%3A+QuickBooks+and+Bey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":7,"uploader":"kr33","files":3,"time":1390889191,"description":"Small Business Finance Basics: QuickBooks and Beyond with Ken Boyd\n\nAccounting can be easy if you know how to use the right tools. Join creativeLIVE instructor Ken Boyd for a three-day introduction to the accounting and QuickBooks skills that are the foundation of every thriving small business.\n\nKen will cover everything you need to know about understanding and managing your business's cash flow, to ensure that your business stays profitable and that you have the right amount of money at the right time. You'll explore the principles of making sound business decisions that both grow your company and protect your bottom line. Ken will also cover best practices for integrating QuickBooks as an accounting tool, from setting up payment and invoicing systems to generating accounting reports to paying your company's bills, and much more.\n\nWhether you're a first-time entrepreneur ready to learn the basics or a long-time business owner looking to sharpen your skills, this course will give you the tools you need to confidently manage your company's finances -- no stress or guesswork required. ","torrent":{"xt":"urn:btih:edbb4de0c84fddbcf19bdcd930a1556ec6605725","amp;dn":"CreativeLIVE+-+Small+Business+Finance+Basics%3A+QuickBooks+and+Bey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edbb4de0c84fddbcf19bdcd930a1556ec6605725","infoHashBuffer":{"type":"Buffer","data":[237,187,77,224,200,79,221,188,241,155,220,217,48,161,85,110,198,96,87,37]},"announce":[],"urlList":[]}}