{"title":"Robert Crais - The Promise (Elvis Cole #16) (Joe Pike #5)","uid":13117643,"size":266122614,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ede39bb2f0f73cfc2fd9df9a515b2cba9d91f118&amp;dn=Robert+Crais+-+The+Promise+%28Elvis+Cole+%2316%29+%28Joe+Pike+%235%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Cybotage","files":4,"time":1451628543,"description":"Elvis Cole and Joe Pike are joined by Suspect heroes Scott James and his K-9 partner, Maggie, in the new masterpiece of suspense from the number one New York Times bestselling author. Loyalty, commitment, the fight against injustice - these are the things that have always driven Elvis Cole and Joe Pike. If they make a promise, they keep it. Even if it could get them killed. When Elvis Cole is hired to locate a woman who may have disappeared with a stranger she met online, it seems like an ordinary case - until Elvis learns the missing woman worked for a defense contractor and was being blackmailed to supply explosives components for a person or persons unknown. Meanwhile, in another part of the city, LAPD officer Scott James and his patrol dog, Maggie, enter an abandoned building to locate an armed and dangerous thief, only to discover far more than they expected: The fugitive is dead, the building is filled with explosives, and Scott and Maggie are assaulted by a hidden man who escapes in the chaos, all as a bloodied Joe Pike watches from the shadows. Soon, Scott and Maggie find themselves targeted by that man, and, as their case intertwines with Elvis and Joe's, joining forces to follow the trail of the missing woman as well. From inner-city drug traffickers to a shadowy group of Afghan war veterans with ties to a terrorist cell, the people they encounter on that trail add up to ever-increasing odds, and soon the four of them are fighting to find the woman not only before she is killed...but before the same fate happens to one of them. \r\n\r\n\r\n\r\nRead by Luke Daniels\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:ede39bb2f0f73cfc2fd9df9a515b2cba9d91f118","amp;dn":"Robert+Crais+-+The+Promise+%28Elvis+Cole+%2316%29+%28Joe+Pike+%235%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ede39bb2f0f73cfc2fd9df9a515b2cba9d91f118","infoHashBuffer":{"type":"Buffer","data":[237,227,155,178,240,247,60,252,47,217,223,154,81,91,44,186,157,145,241,24]},"announce":[],"urlList":[]}}