{"title":"The Ornatrix - Kate Howard [EN EPUB MOBI] [ebook] [p_s]","uid":15788285,"size":1653522,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:edf60130cb60604ba5c6c2ca91452cffc119cb9f&amp;dn=The+Ornatrix+-+Kate+Howard+%5BEN+EPUB+MOBI%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"perfect_stan","files":2,"time":1473353860,"description":"The Ornatrix: A Novel by Kate Howard\r\nEnglish | 2016 | Historical Fiction | 2.1 MB\r\n\r\n\r\nIn this beautifully written debut, novelist Kate Howard proves herself to be a talent to watch, spinning a striking historical yarn packed with suspense and period detail worthy of Kate Mosse, Jessie Burton, or Tracy Chevalier.\r\nFlavia was born with a birthmark covering her face, in the shape of a bird in flight. A cloth dyer’s daughter, she grows up in a little house in the woods where her mother–ashamed of her mark–can keep her far away from prying eyes. But on the night before her younger sister’s wedding, Flavia does something drastic, something that will draw her into a much wider and stranger world than she could have imaged from her secluded family cottage. Flavia finds herself at the convent of Santa Giuliana, just outside the city walls of Perugia.\r\nThere she meets Ghostanza, a courtesan-turned-widow, whose white-lead painted face entrances Flavia, and whose beauty is matched only by her cruelty. Flavia becomes her ornatrix: her hairdresser and personal maid. But as white-lead paint rots the flesh below it, so Perugia, and Santa Guiliana, is rotting below the shimmer of wealth and privilege. And Flavia is drawn into a world of desire and jealousy that has devastating consequences.\r\nRich in description and character, Kate Howard’s stunning debut novel is painted against a vivid historical landscape with themes and characters relevant today, tackling issues of belonging, female identity, and the perception of beauty. It cannot fail to move.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:edf60130cb60604ba5c6c2ca91452cffc119cb9f","amp;dn":"The+Ornatrix+-+Kate+Howard+%5BEN+EPUB+MOBI%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edf60130cb60604ba5c6c2ca91452cffc119cb9f","infoHashBuffer":{"type":"Buffer","data":[237,246,1,48,203,96,96,75,165,198,194,202,145,69,44,255,193,25,203,159]},"announce":[],"urlList":[]}}