{"title":"A Survival Guide for Working with Humans Dealing with Whiners, B","uid":8679424,"size":4045100,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee837ee24d0cfae4bcea2832ec2b7ba66535efa7&amp;dn=A+Survival+Guide+for+Working+with+Humans+Dealing+with+Whiners%2C+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"R0thschild","files":4,"time":1373664306,"description":"              ***********************************************\n\n                PublicHash - Largest Bittorrent Community\n      \n                         &lt;a href=&quot; http://publichash.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://publichash.com/&lt;/a&gt;\n\n          Crystal Clean files - Fast Speed! No Virus! No Fake! Enjoy!\n    \n              ***********************************************\nA Survival Guide for Working with Humans Dealing with Whiners, Back-Stabbers, Know-It-Alls, and Other Difficult People\n\nDetails:\n\nA Survival Guide for Working with Humans: Dealing with Whiners, Back-Stabbers, Know-It-Alls, and Other Difficult People\nEnglish | 176 pages | ISBN-10: 0814472052 | EPUB, PDF |4.92 MB \n\n&quot;The relationships you have with your coworkers can determine not just how pleasant your 9-to-5 life is, but also your ability to get your job done, and even your long-term career success. Packed with real-life strategies for engaging even the most difficult people, &quot;A Survival Guide for Working with Humans&quot; includes interactive quizzes, true-to-life problem and conflict scenarios, and helpful profiles of common personality types.\n\nCovering everything from knowing when to speak up (and how), to gracefully navigating through uncomfortable but necessary confrontations, this book is an essential guide no human should be without. &quot;This book goes way beyond counting to ten before you say something you regret! Dr. Scott offers a treasure trove of no-nonsense ways to deal with difficult people and situations in the workplace&quot;. (Susan Urquhart-Brown, Career and Business Coach, Principal, Career Steps Consulting in Oakland, CA). &quot;Gini has done it again ...she's identified many of the all-too-common workplace situations (and people) that make us crazy, and come up with thoughtful, practical solutions based on long experience. Her book provides new insights for all of us who occasionally have days when we'd rather stay in bed than face our coworkers' behaviors&quot;. (Shari Dunn, Managing Principal, CompAnalysis)&quot;. ","torrent":{"xt":"urn:btih:ee837ee24d0cfae4bcea2832ec2b7ba66535efa7","amp;dn":"A+Survival+Guide+for+Working+with+Humans+Dealing+with+Whiners%2C+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee837ee24d0cfae4bcea2832ec2b7ba66535efa7","infoHashBuffer":{"type":"Buffer","data":[238,131,126,226,77,12,250,228,188,234,40,50,236,43,123,166,101,53,239,167]},"announce":[],"urlList":[]}}