{"title":"Sheena Easton - The Best Of Sheena Easton (1990) mp3@320","uid":6355919,"size":93345269,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eff4584fed2dfbd90a15aa6265b2cb1098016e4d&amp;dn=Sheena+Easton+-+The+Best+Of+Sheena+Easton+%281990%29+mp3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1304151372,"description":"Sheena Easton\nThe Best Of Sheena Easton (1990)\n\n\n\n80s pop diva Sheena Easton was born Sheena Shirley Orr in Bellshill, Scotland on April 27, 1959. Inspired to pursue a singing career after seeing Barbra Streisand in The Way We Were, she later attended the Royal Scottish Academy of Music and Drama while moonlighting with the group Something Else. Exposure on the BBC television production The Big Time: Pop Singer not only resulted in a record deal with EMI but also pushed Easton's 1980 debut singles, &quot;Modern Girl&quot; and &quot;9 to 5,&quot; into the U.K. Top Ten, and she became the first female artist to score two simultaneous Top Ten hits. Her self-titled debut LP followed in 1981, while &quot;9 to 5&quot; was reissued in America under the title &quot;Morning Train&quot; to avoid confusion with Dolly Parton's recent hit of the same name; regardless, the single topped the U.S. pop charts, with &quot;Modern Girl&quot; cracking the Top 20 a few months later. After earning a Grammy as Best New Artist, Easton was tapped to sing the title theme of the latest James Bond film, For Your Eyes Only; in 1983, she duetted with Kenny Rogers on the smash &quot;We've Got Tonight,&quot; returning to the Top Ten later that year with &quot;Telefone (Long Distance Love Affair.&quot; However, with 1984's A Private Affair, Easton retooled her squeaky clean image, following the sassy &quot;Strut&quot; with the salacious &quot;Sugar Walls,&quot; written and produced by one Alexander Nevermind (a.k.a. Prince, to whose &quot;U Got the Look&quot; she contributed vocals in 1987). She followed a stint as Don Johnson's ill-fated TV wife on Miami Vice by scoring the number two smash &quot;The Lover in Me&quot; in 1989; however, 1991's &quot;What Comes Naturally&quot; proved to be Easton's last chart entry, and after starring in a musical revival of Man of La Mancha she spent much of the decade on stage, also appearing in a revival of Grease as well as on the seasonal tour The Colors of Christmas.\n\n\nFormat:\t\t\tMp3\nBit Rate:\t\t320 kbps\nContains:\t\tAlbum Art &amp; ID Tags\nM3U Playlist:\t\tYes\nGenre:\t\t\tPop/Rock\n\n\nTrack List:\n\n01.Modern Girl\n02.Strut\n03.Wind Beneath My Wings\n04.Morning Train (Nine To Five)\n05.For Your Eyes Only (Title Song From James Bond Film)\n06.I Wouldn't Beg For Water\n07.When He Shines\n08.Sugar Walls\n09.Telefone (Long Distance Love Affair)\n10.Almost Over You\n\n\n\n\n\n\n\n\n\n\n                ****Support the artists &amp; buy it if you like it.****\n\n                    ****Enjoy &amp; please don't forget to seed!****\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:eff4584fed2dfbd90a15aa6265b2cb1098016e4d","amp;dn":"Sheena+Easton+-+The+Best+Of+Sheena+Easton+%281990%29+mp3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eff4584fed2dfbd90a15aa6265b2cb1098016e4d","infoHashBuffer":{"type":"Buffer","data":[239,244,88,79,237,45,251,217,10,21,170,98,101,178,203,16,152,1,110,77]},"announce":[],"urlList":[]}}