{"title":"Ludmilla Petrushevskaya - Stories &amp; Novellas (3 books)","uid":11594224,"size":2891123,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f168954da5b494072b567bc66b1f4f627f1f8da8&amp;dn=Ludmilla+Petrushevskaya+-+Stories+%26amp%3B+Novellas+%283+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"workerbee","files":-1,"time":1417220332,"description":"\nLUDMILLA STEFANOVNA PETRUSHEVSKAYA (b. 1938) is a Russian writer, novelist and playwright.  After her work was suppressed for many years, she won wide recognition for capturing the experiences of everyday Russians with profound pathos and mordant wit.  Today she is regarded as one of Russia's finest and most prominent contemporary writers, whose writing combines postmodernist trends with the psychological insights and parodic touches of writers such as Anton Chekhov.\n\nHer works have been published in more than 30 languages and she is the recipient of the 2003 Pushkin Prize in Russian literature, the Russian State Prize for arts (2004), the Stanislavsky Award (2005), and the Triumph Prize (2006).\n\nThe first major translation of her work in English, THERE ONCE LIVED A WOMAN WHO TRIED TO KILL HER NEIGHBOR'S BABY (2009), became a New York Times Book Review bestseller and won the World Fantasy Award for Best Collection.  Blending the miraculous with the macabre, and leavened by a mischievous gallows humor, the stories illuminate bleak Soviet and post-Soviet living conditions.\n\nThis was followed in 2013 by THERE ONCE LIVED A GIRL WHO SEDUCED HER SISTER'S HUSBAND, AND HE HANGED HIMSELF.  By turns sly and sweet, burlesque and heartbreaking, these realist fables of women looking for love are the stories that Petrushevskaya is best known for in Russia.\n\nHer most recent collection, THERE ONCE LIVED A MOTHER WHO LOVED HER CHILDREN, UNTIL THEY MOVED BACK IN (2014), contains three of her most famous and controversial works: &quot;The Time Is Night&quot;, &quot;Chocolates with Liqueur&quot;, and &quot;Among Friends&quot;.  Together they confirm the genius of an author with a gift for turning adversity into art.\n\n\nThe following books are in ePUB format:\n\n* THERE ONCE LIVED A GIRL WHO SEDUCED HER SISTER'S HUSBAND, AND HE HANGED HIMSELF: Love Stories (Penguin, 2013).  Translated by Anna Summers.\n\n* THERE ONCE LIVED A MOTHER WHO LOVED HER CHILDREN, UNTIL THEY MOVED BACK IN: Three Novellas About Family (Penguin, 2014).  Translated by Anna Summers.\n\n* THERE ONCE LIVED A WOMAN WHO TRIED TO KILL HER NEIGHBOR'S BABY: Scary Fairy Tales (Penguin, 2009).  Translated by Anna Summers and Keith Gessen.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                             &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!","torrent":{"xt":"urn:btih:f168954da5b494072b567bc66b1f4f627f1f8da8","amp;dn":"Ludmilla+Petrushevskaya+-+Stories+%26amp%3B+Novellas+%283+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f168954da5b494072b567bc66b1f4f627f1f8da8","infoHashBuffer":{"type":"Buffer","data":[241,104,149,77,165,180,148,7,43,86,123,198,107,31,79,98,127,31,141,168]},"announce":[],"urlList":[]}}