{"title":"Night Moves ( Smith, Andrea)","uid":9242813,"size":2938721,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f1edb42b824d3715c374dca902b324f2915bfe21&amp;dn=Night+Moves+%28+Smith%2C+Andrea%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"420weedman","files":8,"time":1385312248,"description":"Darcy Nicole Sheridan, is 22 years-old, beautiful, single, spirited, sexy and - spoiled. She knows that about herself. Raised by wealthy (and doting) parents as an only child, Darcy pretty much coasts through life until her heart is inexplicably broken by her G-Man, Darin. Darcy doesn't handle rejection well; she isn't used to it. To ease the pain, Darcy flies to Belize over the Christmas holiday fully intending to wallow in self-pity and distance herself from D.C. and the pain that originated there. Her pity party is short-lived however, after observing a very handsome, very intriguing man on the beach with a beautiful blonde. The blond gets ditched and it's Darcy that becomes the focus of the smokin' hot, wealthy and somewhat mysterious 'E.J.' Some very interesting things happen in Belize, but it doesn't end there. Once back in D.C., there are even more surprises in store for Darcy, including a new male roommate, her best friend Lindsey's wedding, and a surprise encounter with &quot;E.J.&quot; that leaves Darcy confused in more ways than one! Shortly thereafter, surprising changes are in store for Darcy's career, love life and even a repentant Darin shows up in the mix. \n","torrent":{"xt":"urn:btih:f1edb42b824d3715c374dca902b324f2915bfe21","amp;dn":"Night+Moves+%28+Smith%2C+Andrea%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1edb42b824d3715c374dca902b324f2915bfe21","infoHashBuffer":{"type":"Buffer","data":[241,237,180,43,130,77,55,21,195,116,220,169,2,179,36,242,145,91,254,33]},"announce":[],"urlList":[]}}