{"title":"Nat King Cole - Where Did Everyone Go? (2011 Hybrid SACD) (FLAC)","uid":7066835,"size":253182422,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f244c796a25e360bd8c2b17deabf4592e0f63bb6&amp;dn=Nat+King+Cole+-+Where+Did+Everyone+Go%3F+%282011+Hybrid+SACD%29+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"tiddler222","files":19,"time":1330543994,"description":"\nFull Title:  Where Did Everyone Go?: Songs Of Love And Loneliness By Nat King Cole.\n\nRecorded May 1963. This release 2011 on Analogue Productions/Capital.\n\nReview by Lindsay Planer (AMG):\nThis is the third and final collection to feature the team of Nat King Cole and Gordon Jenkins (arranger). Their earlier collaborations yielded the uniformly superior chart-topper Love Is the Thing (1957) and follow-up The Very Thought of You (1958). As the moniker suggests, there is a perceptible poignancy and longing weaved throughout Jenkins' arrangements. The opener &quot;Where Did Everyone Go?&quot; possesses a solitude accentuated by responsive instrumentation that supports, yet never intrudes. Cole's practically conversational delivery of pop standards -- such as Irving Berlin's &quot;Say It Isn't So&quot; or Johnny Mercer's &quot;When the World Was Young&quot; -- become musical soliloquies with the score as a sonic subtext. His rich and cozy baritone carries the ache of &quot;Am I Blue?&quot; and the slinky &quot;I Keep Goin' Back to Joe's&quot; into an understated, almost plaintive blues. Here he perfectly demonstrates a boundless capacity as a melodic interpreter of song. &quot;No, I Don't Want Her&quot; finds Cole's voice gilded with an intimacy that virtually takes the listener into the singer's confidence. As he had done on his previous outings with Cole, Jenkins supplies one selection. Suitably &quot;That's All There Is, There Isn't Any More&quot; is the last track on the album and certainly provides a lovely contrast to Judy Garland's arguably more familiar reading. \n\nTracks 12 &amp; 13 are bonus tracks not on the original issue.\n\n01. Where Did Everyone Go?    \n02. Say It Isn't So    \n03. If Love Ain't There    \n04. (Ah, The Apple Trees) When The World Was Young   \n05. Am I Blue?    \n06. Someone To Tell It To    \n07. The End Of A Love Affair   \n08. I Keep Goin' Back To Joe's    \n09. Laughing On The Outside (Crying On The Inside)    \n10. No, I Don't Want Her   \n11. Spring Is Here   \n12. That's All There Is  \n13. A Farewell To Arms   \n14. Happy New Year  \n\n\n","torrent":{"xt":"urn:btih:f244c796a25e360bd8c2b17deabf4592e0f63bb6","amp;dn":"Nat+King+Cole+-+Where+Did+Everyone+Go%3F+%282011+Hybrid+SACD%29+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f244c796a25e360bd8c2b17deabf4592e0f63bb6","infoHashBuffer":{"type":"Buffer","data":[242,68,199,150,162,94,54,11,216,194,177,125,234,191,69,146,224,246,59,182]},"announce":[],"urlList":[]}}