{"title":"Bryan Magee - The Great Philosophers (pdf)","uid":10161595,"size":12007762,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f268aa7c55f60ab1c6892606c6d8b3a5fa95db05&amp;dn=Bryan+Magee+-+The+Great+Philosophers+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"pharmakate","files":-1,"time":1400302355,"description":"Bryan Magee - The Great Philosophers: An Introduction to Western Philosophy (Oxford UP, 1987). 352 pp.\n\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nBryan Magee was the interviewer for a BBC television series in the history of philosophy. For each episode in the series the series he interviewed a major scholar on one or more of the major philosophers in the Western tradition. This book is the edited transcripts of those interviews. Readable, accessible, fascinating.\n\n\ndescription:\n\nWestern philosophy remains one of the greatest glories of world civilization, yet surprisingly few people have any real knowledge of it. Based on fifteen dialogues between Bryan Magee and some of today's internationally-known scholars and philosophers, The Great Philosophers presents an accessible, intellectually stimulating history of philosophy from Plato to the present day.\nBeginning with the death of Socrates in 399 B.C. and the subsequent writings of Plato--the first Western philosopher whose works have survived--they carry the story through the work of Aristotle and the medieval philosophers; the writings of Descartes and other seventeenth-century philosophers including Spinoza, Leibniz, and Locke; the work of Berkeley and the eighteenth-century thinkers, Hume and Kant; the theories of the nineteenth-century encompassed in the writings of Hegel, Marx, Schopenhauer, and Nietzsche; to the twentieth-century ideas included in the works of Husserl, Heidegger and the modern existentialists, Frege, Russell, Wittgenstein, and the American pragmatists. The contributors include such influential figures as Martha Nussbaum, Bernard Williams, Anthony Quinton, Michael Ayers, Geoffrey Warnock, Peter Singer, Hubert Dreyfus, Sidney Morgenbesser, and John Searle, all who offer lively and clear discussions of difficult philosophical concepts. The Great Philosophers provides an absorbing introduction to the concepts of Western philosophy and to its greatest thinkers.\n\nAbout the Author:\n\nBryan Magee is a writer, critic, and broadcaster whose books include Men of Ideas and Modern British Philosophy.","torrent":{"xt":"urn:btih:f268aa7c55f60ab1c6892606c6d8b3a5fa95db05","amp;dn":"Bryan+Magee+-+The+Great+Philosophers+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f268aa7c55f60ab1c6892606c6d8b3a5fa95db05","infoHashBuffer":{"type":"Buffer","data":[242,104,170,124,85,246,10,177,198,137,38,6,198,216,179,165,250,149,219,5]},"announce":[],"urlList":[]}}