{"title":"(PSX-PSP) Clock Tower 1 &amp; 2 converted properly (Kingdom-games by","uid":4536541,"size":403242132,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:f2d763f27c8da858f02c9b636c09d45cd52baf39&amp;dn=%28PSX-PSP%29+Clock+Tower+1+%26+2+converted+properly+%28Kingdom-games+by&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"toxicjuggalo","files":3,"time":1227758489,"description":"CLOCK TOWER 1:\n\nScissorman is loose. He has a deformed face wrapped in gauze, a nasty limp, and wields a sharp pair of three foot long scissors. Eleven people have come face to face with Scissorman only one has ever escaped. The carnage cannot continue. Who can unmask the crazed killer and bring him to justice? Take control of psychiatrist Helen Maxwell, or the only person to escape from Scissorman, Jennifer Simpson. The character you choose matters, as each one has a unique approach to the mystery, and how well you play the game determines which of each character&amp;#039;s five different endings you see. Guide either character with a point and click interface as they gather clues and solve puzzles in effort to discover the identity of Scissorman and put an end to the slaughter. Play CLOCK TOWER, and try to capture Scissorman.\n\nCLOCK TOWER 2 - THE STRUGGLE WITHIN:\n\nAlyssa has always had strange thoughts: she has flashes of violent acts involving her friends. These visions always end with her friends&amp;#039; deaths, and Alyssa holding a knife. After undergoing intense psychotherapy, Alyssa has learned that an apparition named Mr. Bates (residing in her mind) causes these thoughts. Luckily, an amulet protects Alyssa and keeps Mr. Bates at bay. Hoping to take a vacation, Alyssa travels to Salinas to visit a family friend. When she arrives, she learns that her host has disappeared under mysterious circumstances. You, as Alyssa and her alternate personality, will use a point-and-click interface to solve puzzles and arrive at one of the game&amp;#039;s 13 different endings. Will Alyssa be able to figure out what happened? Play Clock Tower 2: The Struggle Within and find out.","torrent":{"xt":"urn:btih:f2d763f27c8da858f02c9b636c09d45cd52baf39","amp;dn":"%28PSX-PSP%29+Clock+Tower+1+%26+2+converted+properly+%28Kingdom-games+by","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2d763f27c8da858f02c9b636c09d45cd52baf39","infoHashBuffer":{"type":"Buffer","data":[242,215,99,242,124,141,168,88,240,44,155,99,108,9,212,92,213,43,175,57]},"announce":[],"urlList":[]}}