{"title":"Culpa Innata [PC] RELOADED","uid":7452658,"size":1650613256,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f44a7261b721fcd02f8029c9d11591693e00f777&amp;dn=Culpa+Innata+%5BPC%5D+RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"luksonije","files":36,"time":1342564166,"description":"Had to scrape half the Internet to get it. Older torrent lost seeds. Enjoy! (full NFO is inside).\n\n     \n                        Culpa Innata (c) Strategy First\n                       \n       10/2007 :..... RELEASE.DATE .. PROTECTION .......: Serial\n             1 :.......... DISC(S) .. GAME.TYPE ........: Adventure\n    \n    \n\n   \n  Adrianopolis - 2047\n\n  It is the golden age in mankind's evolution. For the first time in history,\n  countries with significant resources have united under one World Union.\n  In this utopian society, &quot;survival of the fittest&quot; takes its next inevitable\n  step. Only the elite are deemed worthy to live under the World Union banner\n  - the smartest, healthiest, and wealthiest. Forsaking the altruistic\n  tendencies that have crippled individual development and economic progress\n  in the past, the World Union has ushered in an unprecedented era of\n  self-interest and fulfillment. Prosperity is a science, sex is\n  entertainment, disease and capital crime are non-existent, and the future\n  has never looked better.\n\n  But beneath a perfect world lies an unspeakable truth. That truth is ready\n  to surface.\n\n  A World Union citizen is murdered in Russia, one of the few remaining Rogue\n  States. This murder oddly coincides with the accidental death of a prominent\n  professor in Adrianopolis, an important border town between the World Union\n  and Russia. Peace Officer Phoenix Wallis is assigned to lead the\n  investigation of the murder. Still young and inexperienced, she will soon\n  make discoveries beyond her wildest imagination, as skilled hackers and\n  subversive characters begin taking an inexplicable interest in Phoenix.\n  Her investigation reveals enigmatic clues that lead her deeper and deeper\n  into a mystery that challenges not only her case, but her very beliefs in\n  the worldview she has sworn to protect.\n\n  Join Phoenix in her exciting 3D adventure. Culpa Innata welcomes you to the\n  World Union.\n   \n    \n  1. Unrar.\n  2. Burn or mount with Daemon tools.\n  3. Install the game.\n  4. Play the game. Use the following serial when prompted: 1111-1111-1KLQW\n\n","torrent":{"xt":"urn:btih:f44a7261b721fcd02f8029c9d11591693e00f777","amp;dn":"Culpa+Innata+%5BPC%5D+RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f44a7261b721fcd02f8029c9d11591693e00f777","infoHashBuffer":{"type":"Buffer","data":[244,74,114,97,183,33,252,208,47,128,41,201,209,21,145,105,62,0,247,119]},"announce":[],"urlList":[]}}