{"title":"Hitler and the Nazi Darwinian Worldview - Dr. Jerry Bergman","uid":11757312,"size":2833372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f47782c1792a06b8edba5571497895a964683dd6&amp;dn=Hitler+and+the+Nazi+Darwinian+Worldview+-+Dr.+Jerry+Bergman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1426450846,"description":"More uploads at starxteel dott tk\n\nHitler and the Nazi Darwinian Worldview: How the Nazi Eugenic Crusade for a Superior Race Caused the Greatest Holocaust in World History\n\nThis book takes a fresh look at Germany's most influential Nazi leaders, examining their backgrounds, education and convictions. It provides compelling evidence that the rising influence of Darwinism, eugenics and race theory in early-twentieth century society set the foundation for the Nazi pursuit of engineering a German &quot;master race&quot;-and exterminating European Jews, Gypsies, Blacks, most Slavs and the Christian religion in the ensuing madness of the Holocaust of World War II. The effect of social Darwinism, eugenics and anti-Semitism, and their relative acceptance in the scientific and medical communities of Germany and many other countries worldwide, opened the door to mass murder, medical experimentation and military conquest. This title examines the roots of Nazi ideology and unmasks the Darwinian &quot;survival of the fittest&quot; theory behind it.\n\nAbout the author:\nJerry Bergman (Ph.D.) has taught biology, genetics, chemistry, biochemistry, anthropology, geology and microbiology at the college/university level for over forty years. Dr. Bergman has taught at the University of Toledo Medical School and Bowling Green State University in Ohio. He was selected by his students for Who's Who Among America's Teachers in 2000 and 2005. Dr. Bergman has over 900 science publications to his credit, in twelve languages, has published thirty books and monographs and has been a consultant for over twenty science textbooks. He has spoken frequently about his research on American radio and television programs and at conferences throughtout the world","torrent":{"xt":"urn:btih:f47782c1792a06b8edba5571497895a964683dd6","amp;dn":"Hitler+and+the+Nazi+Darwinian+Worldview+-+Dr.+Jerry+Bergman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f47782c1792a06b8edba5571497895a964683dd6","infoHashBuffer":{"type":"Buffer","data":[244,119,130,193,121,42,6,184,237,186,85,113,73,120,149,169,100,104,61,214]},"announce":[],"urlList":[]}}