{"title":"Judas Priest - Redeemer Of Souls (Deluxe Edition) (2014)","uid":10511311,"size":201955531,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f50e1297329743a2e1c13d62ae89cacbda1afdc2&amp;dn=Judas+Priest+-+Redeemer+Of+Souls+%28Deluxe+Edition%29+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Billman3","files":-1,"time":1404847270,"description":"&quot;Welcome to my world of steel&quot; sneers Rob Halford on the punchy, surprisingly spartan &quot;Dragonaut,&quot; the opening salvo of the venerable New Wave of British Heavy Metal legends' 17th studio long-player, and their first outing without founding guitarist K.K. Downing, who left the group in 2011. The antithesis to 2008's overblown Nostradamus, Redeemer of Souls feels quaint in comparison, eschewing the largely fantasy-driven conceptual style of the ambitious, yet undeniably cumbersome, two-disc set in favor of a more refined, classic rock approach that edges closer to the group's late-'70s offerings like Sin After Sin and Stained Class. New guitarist Richie Faulkner, with his golden mane and tight, controlled riffing, suggests a wax Downing just sprung to life and simply walked out of Madam Tussaud's museum and into the band's rehearsal space, and his tasteful, yet undeniably meaty playing alongside Glenn Tipton goes a long way in helping to restore some of the classic Judas Priest luster, especially on standout cuts like the aforementioned &quot;Dragonaut,&quot; the nervy and propulsive &quot;Metalizer,&quot; and the rousing title track. Still, this is a band that's well into its fifth decade of being &quot;Hell Bent for Leather&quot;; they've explored, both successfully and occasionally at great cost, nearly every shadowy nook and suspicious looking crevice of the genre, and the album's stalwart yet shopworn 13 tracks reflect that journey. That said, Redeemer of Souls is also the loosest (attitude-wise), leanest (arrangement-wise), and most confident-sounding collection of new material the band has released in ages, and while it will forever tread beneath high-water marks like British Steel and Sad Wings of Destiny, it most certainly deserves to be ranked alongside albums from that era.\n\nDISC 1\n\n1. Dragonaut\n2. Redeemer Of Souls\n3. Halls Of Valhalla\n4. Sword Of Damocles\n5. March Of The Damned\n6. Down In Flames\n7. Hell &amp; Back\n8. Cold Blooded\n9. Metalizer\n10. Crossfire\n11. Secrets Of The Dead\n12. Battle Cry\n13. Beginning Of The End\n\nDISC 2\n\n14. Snakebite\n15. Tears Of Blood\n16. Creatures\n17. Bring It On\n18. Never Forget","torrent":{"xt":"urn:btih:f50e1297329743a2e1c13d62ae89cacbda1afdc2","amp;dn":"Judas+Priest+-+Redeemer+Of+Souls+%28Deluxe+Edition%29+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f50e1297329743a2e1c13d62ae89cacbda1afdc2","infoHashBuffer":{"type":"Buffer","data":[245,14,18,151,50,151,67,162,225,193,61,98,174,137,202,203,218,26,253,194]},"announce":[],"urlList":[]}}