{"title":"Hand to Mouth: .. Bootstrap America - Linda Tirado Audiobook MP3","uid":11196669,"size":127366856,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f5741af3fa4422e9f106a988845d71a4219a53a0&amp;dn=Hand+to+Mouth%3A+..+Bootstrap+America+-+Linda+Tirado+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1413100925,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nHand to Mouth: Living in Bootstrap America\n\nWritten by: Linda Tirado\nNarrated by: Linda Tirado\nLength: 4 hrs and 24 mins\nUnabridged Audiobook\nRelease Date:10-02-14\n\nFrom the author of the eye-opening and controversial essay on poverty that was read by millions comes the real-life Nickel and Dimed, as Linda Tirado explains what it's like to be working poor in America, and why poor people make the decisions they do.\n\nWe in America have certain ideas of what it means to be poor. Linda Tirado, in her signature brutally honest yet personable voice, takes all of these preconceived notions and smashes them to bits. She articulates not only what it is to be working poor in America (yes, you can be poor and live in a house and have a job, even two), but what poverty is truly like - on all levels. In her thought-provoking voice, Tirado discusses how she went from lower-middle class, to sometimes middle class, to poor and everything in between, and in doing so reveals why &quot;poor people don't always behave the way middle-class America thinks they should.&quot;","torrent":{"xt":"urn:btih:f5741af3fa4422e9f106a988845d71a4219a53a0","amp;dn":"Hand+to+Mouth%3A+..+Bootstrap+America+-+Linda+Tirado+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5741af3fa4422e9f106a988845d71a4219a53a0","infoHashBuffer":{"type":"Buffer","data":[245,116,26,243,250,68,34,233,241,6,169,136,132,93,113,164,33,154,83,160]},"announce":[],"urlList":[]}}