{"title":"Five For Fighting - Message for Albert","uid":4760326,"size":116330304,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f5ae50400a62ca598f2bbe41b55f89bb4c1e23e8&amp;dn=Five+For+Fighting+-+Message+for+Albert&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Douchey","files":12,"time":1236670149,"description":"Five For Fighting's first (and best) album. \n\nCapitol Records re-released this album after the success of America Town, but it has since gone out-of-print again. I had to visit several indie record stores before wrangling myself a used copy!\n\n\n1. Bella's Birthday Cake\n2. Day by Day\n3. The Garden\n4. Ocean\n5. Happy\n6. Love Song\n7. Wise Man\n8. White Picket Fence\n9. 2 Frogs\n10. 10 Miles from Nowhere\n11. Last Great American\n12. (European B-Side)\n\nAll Music Guide Review:\n\nLed by child prodigy and multi-instrumentalist, singer/songwriter John Ondrasik, Five for Fighting's debut album Message for Albert is an intelligent, well-crafted collection of brooding mid-tempo songs. Delving deep into Billy Joel meets Ben Folds meets Satchel territory, Ondrasik has the uncanny ability to take beautiful melodies like the simple piano phrasing of &quot;Day By Day&quot; and weave them into stunning, multi-layered vocal arrangements replete with gorgeous string crescendos, each playing off each other like a well-oiled machine. &quot;The Garden,&quot; undeniably Message for Albert's epic, is yet another impressive heavily orchestrated show piece that rises above its humble lyrics escalating into a full-blown &quot;New York State of Mind&quot; type of arrangement sprinkled with religious metaphors. &quot;Happy&quot; is one of those odd time signature ditties that eerily resembles Steely Dan's &quot;Reelin' in the Years.&quot; And finally, there's the remarkable &quot;Love Songs.&quot; Lamentful, charming, and urgent, &quot;Love Songs&quot; hints at Ondrasik's ability to completely envelop songs with his voice (later developed on the band's sophomore offering). A promising debut that sadly lost its shot when EMI spontaneously combusted after the record's release. ~ John Franck, All Music Guide\n","torrent":{"xt":"urn:btih:f5ae50400a62ca598f2bbe41b55f89bb4c1e23e8","amp;dn":"Five+For+Fighting+-+Message+for+Albert","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5ae50400a62ca598f2bbe41b55f89bb4c1e23e8","infoHashBuffer":{"type":"Buffer","data":[245,174,80,64,10,98,202,89,143,43,190,65,181,95,137,187,76,30,35,232]},"announce":[],"urlList":[]}}