{"title":"Jesus Before the Gospels (Unabridged) - Bart D. Ehrman","uid":13724135,"size":359979220,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f5e1745ca9797f827acb0661b46592dcf7266c69&amp;dn=Jesus+Before+the+Gospels+%28Unabridged%29+-+Bart+D.+Ehrman&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"twp6045","files":1,"time":1456961329,"description":"The bestselling author of Misquoting Jesus, one of the most renowned and controversial Bible scholars in the world today examines oral tradition and its role in shaping the stories about Jesus we encounter in the New Testament—and ultimately in our understanding of Christianity.\r\n\r\nThroughout much of human history, our most important stories were passed down orally—including the stories about Jesus before they became written down in the Gospels. In this fascinating and deeply researched work, leading Bible scholar Bart D. Erhman investigates the role oral history has played in the New Testament—how the telling of these stories not only spread Jesus’ message but helped shape it.\r\n\r\nA master explainer of Christian history, texts, and traditions, Ehrman draws on a range of disciplines, including psychology and anthropology, to examine the role of memory in the creation of the Gospels. Explaining how oral tradition evolves based on the latest scientific research, he demonstrates how the act of telling and retelling impacts the story, the storyteller, and the listener—crucial insights that challenge our typical historical understanding of the silent period between when Jesus lived and died and when his stories began to be written down.\r\n\r\nAs he did in his previous books on religious scholarship, debates on New Testament authorship, and the existence of Jesus of Nazareth, Ehrman combines his deep knowledge and meticulous scholarship in a compelling and eye-opening narrative that will change the way we read and think about these sacred texts.\r\n\r\nThis is the Audible file. It's DRM free and converted to mp3","torrent":{"xt":"urn:btih:f5e1745ca9797f827acb0661b46592dcf7266c69","amp;dn":"Jesus+Before+the+Gospels+%28Unabridged%29+-+Bart+D.+Ehrman","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5e1745ca9797f827acb0661b46592dcf7266c69","infoHashBuffer":{"type":"Buffer","data":[245,225,116,92,169,121,127,130,122,203,6,97,180,101,146,220,247,38,108,105]},"announce":[],"urlList":[]}}