{"title":"Advanced Health Assessment of Women, 3E- Carcio [PDF] [StormRG]","uid":11328003,"size":8981288,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f63a7b8c1dfe91d10354982875ca95cc79e6441a&amp;dn=Advanced+Health+Assessment+of+Women%2C+3E-+Carcio+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"0xmovva","files":2,"time":1414643634,"description":"TITLE/EDITION Advanced Health Assessment of Women, Third Edition (Advanced Health Assessment of Women: Clinical Skills and Pro)\nAuthor: Helen MS, RN, CS, ANP Carcio (Author), Mimi MS, MEd, FNP-BC, FAANP Secor (Author)\nPrint Length: 640 pages\nPublisher: Springer Publishing Company; 3 edition (October 25, 2014)\nLanguage: English\nISBN-10: 0826123082\nISBN-13: 978-0826123084\nASIN: B00OW4P4XI\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nThis is the only truly comprehensive advanced text for the assessment of women's health, written for such primary care providers as NPs, PAs, and CNMs. It encompasses both foundational and cutting-edge physical and psychosocial information in a clear and concise outline format, and is unique in its presentation of more advanced techniques and procedures not addressed in standard graduate assessment texts. Keeping pace with the expanding scope of advanced practice, the third edition provides several completely new chapters authored by renowned specialists, expanded chapters, and updates. This includes new information on Health Guidelines, Contraception, Domestic Violence, Health History of Special Populations, Lesbian Health, Evaluation of the Pelvic Floor, Aging and Menopause, Bleeding Irregularities, Infertility, Skin/Aesthetics, and Pelvic Pain.\n\nWith an integrated approach to treatment, the authors delineate the expanded roles of advanced health care providers, including guidance for situations where a practitioner must decide whether to act independently, co-manage, consult, or refer. They provide in-depth descriptions-enhanced by plentiful tables and figures--of each assessment skill and technique along with its underlying rationale. Basic techniques are augmented by the inclusion of possible alterations for a particular procedure. On a continuum from simple to complex, the text is divided into nine units that cover basic women's health assessment down to the cellular level, health history, prenatal assessment, investigative procedures including sonohysteroscopy and simple cystometrogram, and several chapters on specific women's health concerns. A special chapter on urinary incontinence includes diagnosis of bladder dysfunction. Sample assessment forms are integrated throughout, as are comprehensive lists of equipment required for each procedure along with information on patient preparation and follow-up. Power point slides are included.\n\nNew to the Third Edition:\n\nUpdated assessment guidelines\nNew chapter on lesbian health\nNew chapter on dysfunctional uterine bleeding\nNew chapter on polycystic ovarian syndrome\nNew chapter on skin/aesthetics\nNew chapter on pelvic pain\nInformation on new contraception devices\nNew information on domestic violence\nNew information on health history of special populations\nExpanded information on evaluation of pelvic floor\nExpanded information on aging and menopause\nUpdates on infertility\nNew information on bleeding irregularities\nUpdated information on BRCA gene testing\nNew information on vaginal microscopy\nKey Features:\n\nProvides detailed descriptions of advanced assessment techniques enhanced with plentiful tables and figures\nPresents the rationale for all assessments and procedures\nDelineates clinical procedures on the leading edge of the expanded role of the advanced practice clinician\nIncludes unique chapters about selection and insertion of the vaginal pessary, intrauterine insemination procedure, and donor insemination\nCovers such advanced skills as vulvar exam and biopsy, endometrial biopsy, acrochordonectomy, polypectomy, and colposcopy","torrent":{"xt":"urn:btih:f63a7b8c1dfe91d10354982875ca95cc79e6441a","amp;dn":"Advanced+Health+Assessment+of+Women%2C+3E-+Carcio+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f63a7b8c1dfe91d10354982875ca95cc79e6441a","infoHashBuffer":{"type":"Buffer","data":[246,58,123,140,29,254,145,209,3,84,152,40,117,202,149,204,121,230,68,26]},"announce":[],"urlList":[]}}