{"title":"Organic Synthesis 3rd ed - Michael B. Smith","uid":15577068,"size":15821430,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f660a8d1cfcdb3ded2681a41549c2c3d13979852&amp;dn=Organic+Synthesis+3rd+ed+-+Michael+B.+Smith&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"clouderone","files":1,"time":1471355646,"description":"Organic Synthesis 3rd ed - Michael B. Smith (AP, 2011).pdf\r\n\r\nA reactions oriented course is a staple of most graduate organic programs, and synthesis is taught either as a part of that course or as a special topic. Ideally, the incoming student is an organic major, who has a good working knowledge of basic reactions, stereochemistry and conformational principles. In fact, however, many (often most) of the students in a first year graduate level organic course have deficiencies in their undergraduate work, are not organic majors and are not synthetically inclined.\r\n\r\nTo save students much time catching up this text provides a reliable and readily available source for background material that will enable all graduate students to reach the same high level of proficiency in organic chemistry. Produced over many years with extensive feedback from students taking an organic chemistry course this book provides a reaction based approach. The first two chapters provide an introduction to functional groups; these are followed by chapters reviewing basic organic transformations (e.g. oxidation, reduction). The book then looks at carbon-carbon bond formation reactions and ways to ‘disconnect’ a bigger molecule into simpler building blocks.\r\n\r\nMost chapters include an extensive list of questions to test the reader’s understanding. There is also a new chapter outlining full retrosynthetic analyses of complex molecules which highlights common problems made by scientists.\r\n\r\nThe book is intended for graduate and postgraduate students, scientific researchers in chemistry\r\n\r\nNew publisher, new edition; extensively updated and corrected\r\nOver 950 new references with more than 6100 references in total\r\nOver 600 new reactions and figures replaced or updated\r\nOver 300 new homework problems from the current literature to provide nearly 800 problems to test reader understanding of the key principles\r\nFree molecular modeling software to explore 60 new synthesis-oriented molecular modeling problems; designed to aid visualisation and understanding of organic synthesis","torrent":{"xt":"urn:btih:f660a8d1cfcdb3ded2681a41549c2c3d13979852","amp;dn":"Organic+Synthesis+3rd+ed+-+Michael+B.+Smith","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f660a8d1cfcdb3ded2681a41549c2c3d13979852","infoHashBuffer":{"type":"Buffer","data":[246,96,168,209,207,205,179,222,210,104,26,65,84,156,44,61,19,151,152,82]},"announce":[],"urlList":[]}}