{"title":"Brief History of Martinist Order(masonic-rosicrucian order)","uid":4531138,"size":2926151,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6b0ecac1f46519b57cbbdbad72841474db49202&amp;dn=Brief+History+of+Martinist+Order%28masonic-rosicrucian+order%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227558393,"description":"This is the rare and amazing manuscript A Brief History of the Martinist Order which reveals the most secret rituals and philosophy of this masonic/rosicrucian secret society operating worldwide. Obtained from a disillusioned member who claimed these were &quot;top secret&quot;, it contains the complete descriptions of various rituals, degrees and the underlying philosophy which its member have to believe in. The origin of the Ordre Martiniste et Synarchique is found in the work and teaching of Martinez Pasquales (1727-1774), a French mystic, adept and theurgist. His work was carried on by his pupil, Louis-Claude de Saint-Martin, a French nobleman, in an independent way - evolving a distinctive philosophy. His &quot;Of Errors and Truth&quot; has been regarded as his most searching work and most fruitful contribution to the literature of mysticism. Like all his writing, it was issued under the pseudonym of the Unknown Philosopher (le Philosophe Inconnu). Among his numerous writings there were also excellent translations of the writings of Jacob Boehme - the Teutonic Philosopher. The philosophical writings of Louis-Claude de Saint-Martin met with an immediate interest and wide approval. Groups were formed to study his teachings, calling themselves Societies of the Unknown Philosopher. These groups and Lodges, established by Jean Baptiste Willermoz - also an Initiate of Martinez Pasquales - evolved eventually into Temples of Martinism. After a long period of relative stagnancy that followed the Napoleanic era, the Order was revitalised by the formation, in 1890, of a Supreme Council of the Martinist Order. Under the brilliant and indefatigable leadership of the renowned French mystic Papus (Dr. Gerard Encausse), the Order grew rapidly but again, the World War I (1914 - 1918) curtailed its activities. Papus died in 1916 and had been succeeded by Charles Detre (Teder), whose Deputy Grand Master was Victor Blanchard. Teder had considered that the Ordre Martiniste would survive better if connected with a Masonic Obedience, of which the Ancient and Primitive Rite of Memphis-Misraim was the most esoteric. Throughout the 1939 - 45 war, many of the secret societies in Europe were persecuted by the Nazis, including Martinism. It is interesting to note that the Ordre Martiniste et Synarchique continued to operate in Switzerland (a neutral country) throughout these troublesome years. Victor Blanchard remained as Grand Master until his death in 1953, when he was succeeded by Dr. Edward Bertholet (Sar Alkmaion) of Switzerland. It is from Sar Alkmaion that the Brittanic Grand Lodge received its Charter 1967, entrusted to Sar Gulion who is still Grand Master at the present time (1986). Find out how the legacy of Francis Bacon&amp;#039;s Rosicrucian order is continuing today and how the Martinist order fits into the whole scheme. People like science fiction TV producer Gene Roddenberry were obviously members of this or similar group, because the whole original Star Trek TV series was organized according to Rosicrucian lessons. There is actually a place in the monograph where they mention the roles such as &quot;Chief Engineer&quot; implying that the whole TV series is one big occult interplay which only a selected few can really understand. But not anymore. 340 pages, many pictures. A must read for everyone.\n\nMore info: &lt;a href=&quot;\nhttp://freemasonry.bcy.ca//texts///////////////////////////martinist.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freemasonry.bcy.ca//texts///////////////////////////martinist.html&lt;/a&gt; &lt;a href=&quot;\nhttp://www.amorc.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amorc.org&lt;/a&gt; &lt;a href=&quot;\nhttp://www.canadiancontent.net/dir/Top/Society/Religion_and_Spirituality/Esoteric_and_Occult/Martinism&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.canadiancontent.net/dir/Top/Society/Religion_and_Spirituality/Esoteric_and_Occult/Martinism&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f6b0ecac1f46519b57cbbdbad72841474db49202","amp;dn":"Brief+History+of+Martinist+Order%28masonic-rosicrucian+order%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6b0ecac1f46519b57cbbdbad72841474db49202","infoHashBuffer":{"type":"Buffer","data":[246,176,236,172,31,70,81,155,87,203,189,186,215,40,65,71,77,180,146,2]},"announce":[],"urlList":[]}}