{"title":"Dvorak, Sarasate: Violin Works - Akiko Suwanai (2001)","uid":13538578,"size":304454721,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f75cc41244ad45b33f6b1cfd4761faff2130ece2&amp;dn=Dvorak%2C+Sarasate%3A+Violin+Works+-+Akiko+Suwanai+%282001%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Scheheraz","files":29,"time":1455459243,"description":"Dvorák: Violin Concerto\r\nSarasate: Carmen Fantasy\r\n\r\nGramophone [5/2001]:\r\n&quot;No one could doubt the virtuoso flair of Akiko Suwanai the moment she starts playing Sarasate's Zigeunerweisen. This is just the sort of persuasive playing that this sequence of Liszt-inspired gypsy doodlings demands, if it is not to seem too long and self-indulgent. In 1990 Suwanai was the youngest-ever winner of the Tchaikovsky Competition in Moscow, and though the catalogue still only lists two earlier discs of hers, she plainly has just the qualities to make her a magnetic recording artist.\r\nAs in Zigeunerweisen, so in the parallel Sarasate Fantasy based on Bizet's themes in Carmen, she uses the most daring dynamic and tonal range, in extreme pianissimos seeming to be communing with herself. In a big concert hall such an extreme would hardly project, but recording is different, and the result is magical, with the boldness of her rhythmic attack just as impressive.\r\nDvorak's dance-based Mazurek makes an apt and colourful link to the main work, more and more attracting young artists to give outstanding performances on disc. Suwanai is even more daring, urgent and volatile, than Maxim Vengerov on his powerful new Teldec version. None of the artists on this disc may be Slavonic, but this is a version which, at speeds on the fast side, notably in the finale, brings out the Slavonic flavours more vividly than I can ever remember, with Fischer and his superb Hungarian orchestra matching the fiery energy of the soloist.\r\nAgain this is a performance marked by daringly extreme pianissimos, notably in the opening statement of the main theme in the slow movement, a hushed meditation no less intense for being taken at a naturally flowing speed, bringing an overall timing a full two minutes less than in Vengerov's weightier version. The finale is marked Allegro non troppo, where you could well argue that Suwanai's very fast speed is a genuine Presto, relating the movement to the hectic fling of Dvorak's G minor Slavonic Dance. A marginally more relaxed speed – with Vengerov and others – allows more spring in the furiant rhythms, but the excitement of such a daring approach as Suwanai's is undeniable.\r\nThe recording is excellent, as we have come to expect of Philips issues from this source, with the soloist only marginally spotlit.&quot;\r\n\r\nPablo de Sarasate (1844-1908)\r\n1. Zigeunerweisen, op.20 (7.16)\r\n2. Carmen Fantasy, op.25 (11.37)\r\nAntonín Dvorák (1841-1904)\r\n3. Mazurek, op.49 (6.00)\r\nViolin Concerto in A minor, op.53\r\n4. I. Allegro ma non troppo (11.03)\r\n5. II. Adagio ma non troppo (9.12)\r\n6. III. Finale: Allegro giocoso, ma non troppo (9.17)\r\nTotal timing: 55.27\r\n\r\nAkiko Suwanai, violin\r\nBudapest Festival Orchestra\r\nIván Fischer\r\n\r\nRecording location: Italian Institute, Budapest, 7 —10 December 1999\r\nExecutive producer: Clive Bennett\r\nRecording producer: Hein Dekker\r\nBalance engineer: Hein Dekker\r\nRecording engineers: Erdo Groot, Jan Wesselink\r\n® 2000 Philips Classics, a division of the Decca Music Group limited\r\n© 2001 Philips Classics\r\n464 531-2","torrent":{"xt":"urn:btih:f75cc41244ad45b33f6b1cfd4761faff2130ece2","amp;dn":"Dvorak%2C+Sarasate%3A+Violin+Works+-+Akiko+Suwanai+%282001%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f75cc41244ad45b33f6b1cfd4761faff2130ece2","infoHashBuffer":{"type":"Buffer","data":[247,92,196,18,68,173,69,179,63,107,28,253,71,97,250,255,33,48,236,226]},"announce":[],"urlList":[]}}