{"title":"James McMurtry...Just Us Kids(2008)[FLAC]","uid":6933757,"size":416854146,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f7bbe905b09863c5c9ac64e7c4e3f9a0be10d044&amp;dn=James+McMurtry...Just+Us+Kids%282008%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"dickspic","files":16,"time":1325754312,"description":"[img]http://img264.imageshack.us/img264/143/justuskids300x300gv5.jpg[/img]\n[color=Green]Just Us Kids [2008] Lightning Rod Records / LNR-95022[/color]\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n01. Bayou Tortous 4:50\n02. Just Us Kids 5:08\n03. God Bless America (Pat MacDonald Must Die) 5:01\n04. Cheney's Toy 5:49\n05. Freeway View 3:38\n06. Hurricane Party 5:56\n07. Ruby and Carlos 6:36\n08. Brief Intermission 2:51\n09. Fireline Road 5:30\n10. The Governor 5:10\n11. Ruins of the Realm 4:25\n12. You'd a' Thought (Leonard Cohen Must Die) 5:15\n\n\nThe further James McMurtry gets from the big leagues of the music business, the better it seems to be for his music. McMurtry was still finding his feet as a recording artist with his first three albums for Columbia, and just began hitting a groove when he signed with the independent Sugar Hill label. Now recording for a renegade start-up label called Lightning Rod Records, McMurtry has cut what may well be his best and most consistently interesting album to date, Just Us Kids, a dozen songs clearly informed by the American malaise of the first few years of the 21st century and the disillusion over the ongoing war in Iraq. While the war is rarely mentioned by name, there's no disguising the source behind the bitter, mordant wit of &quot;Cheney's Toy&quot; and &quot;God Bless America,&quot; just as &quot;Hurricane Party&quot; captures the devastation of Katrina without belaboring what we've all seen on the news. Even when the specific tragedies of recent years don't figure into the songs, the aging rebels turned working stiffs of the title cut, the couple struggling to make their lives and relationship work in &quot;Ruby and Carlos,&quot; and the drifter with a shaky sense of her own history in &quot;Fire Line Road&quot; are characters whose lives have been battered by the circumstances of the past seven years. As a performer, McMurtry still doesn't possess the most expressive voice in American music, but his lean, plain-spoken drawl has gained a wealth of nuance in recent years, communicating a laconic swagger, an ominous air of menace, or a simple acceptance of the quirks of fate with wisdom and clarity. McMurtry also produced Just Us Kids, and the spare, funky growl of this rootsy rock &amp; roll is a perfect match for the tone of these songs, a sound that's thoroughly American while conjuring the dark clouds gathering on the horizon. Just Us Kids is an album very much of its time that also speaks to the larger ideas of life in America in an uncertain age, and it's brave, smart, and pithy music that captures James McMurtry at the top of his game.\n\ncd ripped by EAC\n\nPLEASE SEED\n\n[url]http://dickthespic.org/2011/12/20/james-mcmurtry/[/url]","torrent":{"xt":"urn:btih:f7bbe905b09863c5c9ac64e7c4e3f9a0be10d044","amp;dn":"James+McMurtry...Just+Us+Kids%282008%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7bbe905b09863c5c9ac64e7c4e3f9a0be10d044","infoHashBuffer":{"type":"Buffer","data":[247,187,233,5,176,152,99,197,201,172,100,231,196,227,249,160,190,16,208,68]},"announce":[],"urlList":[]}}