{"title":"Current Therapy in Vascular &amp; Endovascular Surgery 5th Ed [t","uid":10553862,"size":128961343,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f827687a496fd42c166239b22af9629580a74546&amp;dn=Current+Therapy+in+Vascular+%26amp%3B+Endovascular+Surgery+5th+Ed+%5Bt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tahir99","files":-1,"time":1405369894,"description":"Current Therapy in Vascular and Endovascular Surgery, 5th Edition\n\nBy James C. Stanley, MD, Frank Veith, MD and Thomas W Wakefield, MD\n\nTRUE PDF, BOOKMARKED and INDEXED\n\nISBN-13: 9781455709847 | Publisher: Elsevier | Publication date: 5/12/2014 | Edition number: 5 | Pages: 1040\n\nCurrent Therapy in Vascular and Endovascular Surgery is an ideal medical reference book to consult for information in this ever-changing field! Thoroughly revised to reflect the most recent innovations in vascular and endovascular surgery, it features more than 150 chapters on topics new to this edition, and equips residents and practitioners alike with the latest procedures and techniques in this rapidly growing area. Internationally recognized experts present expanded coverage of a wide array of topics, keeping you abreast of all of today's developments!\n\nNew to This Edition\n\nExplore brand-new coverage of endovascular procedures and techniques.\nLearn from leaders in the field, including internationally recognized editors and numerous global experts in specialized disciplines.\nAccess in-depth, detailed coverage of various vascular diseases, each sub-divided into discrete topics for a more focused approach.\nView procedures more clearly than ever before with the help of more than 800 full-color illustrations throughout.\nAccess the full text and videos online at Expert Consult.\n\nKey Features\nQuickly locate key information with concise, to-the-point chapters.\nPrepare for boards or certification exams through coverage that spans the entire spectrum of vascular surgery.","torrent":{"xt":"urn:btih:f827687a496fd42c166239b22af9629580a74546","amp;dn":"Current+Therapy+in+Vascular+%26amp%3B+Endovascular+Surgery+5th+Ed+%5Bt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f827687a496fd42c166239b22af9629580a74546","infoHashBuffer":{"type":"Buffer","data":[248,39,104,122,73,111,212,44,22,98,57,178,42,249,98,149,128,167,69,70]},"announce":[],"urlList":[]}}