{"title":"Kim Harrison - Into the Woods - Rachel Morgan Hollows Companion","uid":8670719,"size":1157118519,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f8ea8efb9ce671bb7e4e1b10ff9e1e1c57fcf2b7&amp;dn=Kim+Harrison+-+Into+the+Woods+-+Rachel+Morgan+Hollows+Companion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"katelynor","files":3,"time":1373490930,"description":"Enter the woods...if you dare.\n\nFor centuries, the woods have been a pivotal part of the wonder and danger of fairy tales, for once you enter anything can happen. Elves, druids, fairies - who knows what you will find once you dare step into the forest?\n\nAnd now, New York Times best-selling author Kim Harrison ventures into these mysterious, hidden lands of magic and mystery in her first short-story collection. Into the Woods brings together an enchanting mix of brand-new, never-before-published stories and tales from Harrison's beloved, best-selling Hollows series.\n\nThe tales here include an original Hollows novella, &quot;Million-Dollar Baby&quot;, about Trent Kalamack's secret elven quest in Pale Demon; two original short stories, &quot;Pet Shop Boys&quot; and &quot;Temson Woods,&quot; that explore just what happens when humanity and the supernatural collide; and two novelettes, &quot;Spider Silk&quot; and &quot;Grace,&quot; set in new worlds of imagination and adventure. Into the Woods also contains all of the previously published Hollows short stories - together in one volume for the very first time.\n\nStep into the woods and discover the magic for yourself.\n\n\n\n\nFrom my first conversions from audible aa format to mp3 - \nConverted using SoundTaxi 128kbps - \nI checked the beginning and end of each file to make sure the conversion was complete - please let me know if there are any issues.\n","torrent":{"xt":"urn:btih:f8ea8efb9ce671bb7e4e1b10ff9e1e1c57fcf2b7","amp;dn":"Kim+Harrison+-+Into+the+Woods+-+Rachel+Morgan+Hollows+Companion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8ea8efb9ce671bb7e4e1b10ff9e1e1c57fcf2b7","infoHashBuffer":{"type":"Buffer","data":[248,234,142,251,156,230,113,187,126,78,27,16,255,158,30,28,87,252,242,183]},"announce":[],"urlList":[]}}