{"title":"Sans Sec542 - Web App Penetration Testing and Ethical Hacking (2","uid":10083315,"size":26311564,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9420b11e6fef674c9a4d661b85a5a445a960bc7&amp;dn=Sans+Sec542+-+Web+App+Penetration+Testing+and+Ethical+Hacking+%282&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"omfgtpb","files":5,"time":1399050466,"description":"\n\n\nSans Sec542 - Web App Penetration Testing and Ethical Hacking (2010)\n\n\n\n\nDescription:\n\n\nAssess Your Web Apps in Depth\n\nWeb applications are a major point of vulnerability in organizations today. Web app holes have resulted in the theft of millions of credit cards, major financial and reputational damage for hundreds of enterprises, and even the compromise of thousands of browsing machines that visited Web sites altered by attackers. In this intermediate to advanced level class, you'll learn the art of exploiting Web applications so you can find flaws in your enterprise's Web apps before the bad guys do. Through detailed, hands-on exercises and training from a seasoned professional, you will be taught the four-step process for Web application penetration testing. You will inject SQL into back-end databases, learning how attackers exfiltrate sensitive data. You will utilize cross-site scripting attacks to dominate a target infrastructure in our unique hands-on laboratory environment. And you will explore various other Web app vulnerabilities in-depth with tried-and-true techniques for finding them using a structured testing regimen. You will learn the tools and methods of the attacker, so that you can be a powerful defender.\n\nOn day one, we will study the attacker's view of the Web as well as learn an attack methodology and how the pen-tester uses JavaScript within the test. On day two, we will study the art of reconnaissance, specifically targeted to Web applications. We will also examine the mapping phase as we interact with a real application to determine its internal structure. During day three we will continue our test by starting the discovery phase using the information we gathered on day two. We will focus on application/server-side discovery. On day four we will continue discovery, focusing on client-side portions of the application, such as Flash objects and Java applets. On day five, we will move into the final stage of exploitation. Students will use advanced exploitation methods to gain further access within the application. Day six will be a Capture the Flag event where the students will be able to use the methodology and techniques explored during class to find and exploit the vulnerabilities within an intranet site.\n\nThroughout the class, you will learn the context behind the attacks so that you intuitively understand the real-life applications of our exploitation. In the end, you will be able to assess your own organization's Web applications to find some of the most common and damaging Web application vulnerabilities today.\n\nBy knowing your enemy, you can defeat your enemy. General security practitioners, as well as Web site designers, architects, and developers, will benefit from learning the practical art of Web application penetration testing in this class.\n\n\n\nContents:\n\n\n1. Five PDFs: 542.1 - The Attacker's View of the Web, 542.2 - Reconnaissance and   Mapping, 542.3 - Server-Side Discovery, 542.4 - Client-Side Discovery, &amp; 542.5 - Exploitation\n\n\n","torrent":{"xt":"urn:btih:f9420b11e6fef674c9a4d661b85a5a445a960bc7","amp;dn":"Sans+Sec542+-+Web+App+Penetration+Testing+and+Ethical+Hacking+%282","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9420b11e6fef674c9a4d661b85a5a445a960bc7","infoHashBuffer":{"type":"Buffer","data":[249,66,11,17,230,254,246,116,201,164,214,97,184,90,90,68,90,150,11,199]},"announce":[],"urlList":[]}}