{"title":"Orbital - Orbital 2 (Brown Album) (FLAC - EAC)","uid":6507747,"size":460083964,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fa2e8bbf2015e385764597e020db6a9b5782b1be&amp;dn=Orbital+-+Orbital+2+%28Brown+Album%29+%28FLAC+-+EAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":null,"files":-1,"time":1309481467,"description":"Orbital: Profile\n\nOne of techno's most celebrated and accomplished partnerships, the brothers Paul and Phil Hartnoll trace\ntheir beginnings as Orbital back to the late 1980's, when their first single, &quot;Chime&quot; was released on\nOh-Zone/FFRR and broke into the British Top 20 in the spring of 1990. The single was made in their\ngarage using their father's four-track recorder and mastered directly onto cassette, but became a smash hit,\ngiving them the momentum for a handful of other singles and their untitled first CD (the &quot;green album&quot;) in 1991.\n\nTheir career took off in 1993-1994, with the release of the EPs &quot;Lush&quot; and &quot;Radiccio&quot; and their second\nuntitled album (the &quot;brown album&quot;), which took the public by storm and made the UK Top 30.\nThey also continued to hone their famous live act, which featured live projections, live musical arranging\nand sequencing on the fly, making their shows entertaining, improvised and truly &quot;live&quot;.\nTheir appearance at the 1994 Glastonbury Festival in the UK became the stuff of legend and cemented\ntheir reputation as one of the best techno groups of the 1990's. Their subsequent albums saw them taking\na more varied, introspective angle to their music, while at the same time captivating audiences worldwide\nwith their relentlessly energetic live shows. In addition to their own productions, they have done remixes\nfor EMF, Queen Latifah, Meat Beat Manifesto, Madonna, Kraftwerk and more. More recently,\nthey compiled a volume for the Back To Mine series, released a retrospective compilation called Work,\nand put out The Blue Album, their last album.\n\nIn mid-2004, Orbital released one final single, &quot;One Perfect Sunrise&quot;, and then seemingly split up for good.\nHowever, after several years of solo production, Paul &amp; Phil reunited in 2009, and a long series of live gigs\nhas followed, as well as a new double A single, &quot;Don't Stop Me&quot; / &quot;The Gun is Good&quot;.\n\n\n\nAlbum Reviews (c/o www.discog.com)\n\nOrbital's finest moment without question and one of the greatest electronic albums of all time.\nThis is intelligent techno that is full of ideas, inventiveness, beauty, sonic landscapes and breathtaking production.\nAn album that rocks and is incredibly dancefloor friendly but at the same time it's a stunning long player that needs\nto be heard at home to appreciate it's undenying beauty. A perfect dance music album from start to finish.\n\nThis album took me by surprise, not only because I hadnt really heard of Orbital before,\nbut because no other album is quite as good as an &quot;album&quot; as this one. That is, one you listen to all the way through\nevery time, not one you &quot;liked this or that track&quot; off. Quite simply put, if I want to listen to some Orbital, I never waste\ntime debating which song to put on, just stick this on and get on with it!\nI could go into each song and give individual ratings but to be honest the whole is greater than the sum of its parts,\nnot only as an overall album but the way the tracks subtly blend from one to the next creating differences which\naren't massive, but when you listen to say, the second track then skip forward a few, the change is quite large.\nIn summary then; get this album, whack it on and leave it on. Just listen to it. All the way through. More than once.\nI just wish there were other albums of similar quality by them, or maybe I haven't looked hard enough yet.\n\nOrbital produced two great albums when they started their career, and although it has been up and\ndown since then, this seems to be the album that everyone knows best.\nAlso known as 'The Brown Album', it continues where 'Orbital' left off, but the direction is probably a little more\ntowards conventional techno, albeit with a much wider range of influence behind it. The rhythms aren't too conventional\nhere, and it was the start of the break from pure dance music and a nod in the direction of experimental music.\n'Lush 3-1' and 'Lush 3-2' are the standout tracks for me, but when you listen to this album, you don't really think about\nseparate tracks too much, as the CD needs to be appreciated as a whole rather than concentrating on any of it's constituent tracks.\n\n\n\n---------------------------------------------------------------------\nOrbital - Orbital 2 (Brown Album)\n---------------------------------------------------------------------\n\n\nArtist...................................: Orbital\nAlbum....................: Orbital 2 (Brown Album)\nGenre.................................: Electronic\nSource........................................: CD\nYear........................................: 1993\n\nRipper: Exact Audio Copy 1.0 b1 &amp; HL-DT-STDVDRRW GSA-H20L\n\nCodec...........: Free Lossless Audio Codec (FLAC)\nVersion.........: reference libFLAC 1.2.1 20070917\nQuality.......: Lossless, (avg. compression: 61 %)\nChannels..............: Stereo / 44100 HZ / 16 Bit\nTags...............................: VorbisComment\n\nInformation...: Original 1992 14 track UK pressing\n\nRipped by.............: BSW on 7/1/2011\nPosted by.............: BSW on 7/1/2011\nNews Server.........: news.astraweb.com\n\nNews Group(s).: alt.binaries.sounds.mp3.metal.full.albums\n\nIncluded....: NFO, SFV, M3U, LOG, CUE\nCovers................: Front Back CD\n\n\n\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n\n1. Time Becomes [01:43]\n2. Planet Of The Shapes [09:36]\n3. Lush 3-1 [05:39]\n4. Lush 3-2 [04:40]\n5. Impact (The Earth Is Burning) [10:27]\n6. Remind [07:57]\n7. Walk Now... [06:48]\n8. Monday [07:07]\n9. Halcyon + On + On [09:27]\n10. Input Out [02:11]\n\n\nPlaying Time.........: 01:05:40\nTotal Size..........: 420.61 MB\n\nNFO generated on.....: 6/26/2011 12:51:04 AM\n\n\n\n---------------------------------------------------------------------\n\nBarcode: 0 42282 83862 9\nMatrix Number: S TRUCD 2 01 DISCTRONICS IFPI L502 IFPI 8730\n\n---------------------------------------------------------------------\n\n\n:: Generated by Music NFO Builder v1.21a - www.nfobuilder.com ::","torrent":{"xt":"urn:btih:fa2e8bbf2015e385764597e020db6a9b5782b1be","amp;dn":"Orbital+-+Orbital+2+%28Brown+Album%29+%28FLAC+-+EAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa2e8bbf2015e385764597e020db6a9b5782b1be","infoHashBuffer":{"type":"Buffer","data":[250,46,139,191,32,21,227,133,118,69,151,224,32,219,106,155,87,130,177,190]},"announce":[],"urlList":[]}}