{"title":"NetStumbler and MiniStumbler (Working)","uid":3440827,"size":2619266,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fa4c3f66fba73b7ce297359b2ed6388e78984dbe&amp;dn=NetStumbler+and+MiniStumbler+%28Working%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"blingblong","files":1,"time":1139206472,"description":" &lt;a href=&quot;http://www.netstumbler.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.netstumbler.com&lt;/a&gt; \n\nWhat is NetStumbler? \nNetStumbler is a tool for Windows that allows you to detect Wireless Local Area Networks (WLANs) using 802.11b, 802.11a and 802.11g. It has many uses: \nVerify that your network is set up the way you intended. \nFind locations with poor coverage in your WLAN. \nDetect other networks that may be causing interference on your network. \nDetect unauthorized &quot;rogue&quot; access points in your workplace. \nHelp aim directional antennas for long-haul WLAN links. \nUse it recreationally for WarDriving. \nWhat is Wardriving? \nWardriving is an activity consisting of driving around with a laptop or a PDA in one&amp;#039;s vehicle, detecting Wi-Fi wireless networks. It is also known (as of 2002) as WiLDing(Wireless Lan Driving), originating with the Bay Area Wireless Users Group (BAWUG). It is similar to using a scanner for radio. Most wardrivers will use GPS devices to find the exact location of the network found and log it on a website. For better range, antennas are built or bought, and vary from omnidirectional to fully directional. Software for wardriving is freely available on the internet, notably, NetStumbler for Windows, MacStumbler for Macintosh, and Kismet for Linux. \nWardriving shares similarities to Wardialing in name only. \nWhile some wardrivers do engage in malicious activity, the average wardriver is typically only out to log and collect information from the Access Points (AP&amp;#039;s) they find while driving. \nLess law-abiding &amp;#039;wardrivers&amp;#039; search for open file servers from which to copy software or media files, or freely use high-speed Internet access while on the road, which is presumably illegal. Most wardrivers do not in fact use services without authorization. What is &quot;Beggarware&quot;? \nThis means that you do not have to pay for a license to use it. However if you use it and like it, please consider making a donation at http://www.stumbler.net/donate to support future development, web hosting and other costs that I incur as a result of making this software available to you. Please bear in mind that I do this as a hobby in my spare time, not as a full time job. \nCommercial and Government users are strongly encouraged to donate. The suggested donation is US $50 per copy. You may donate by visiting the web site http://www.stumbler.net/donate. You can pay in a variety of ways and may send a Purchase Order if needed. What do the numbers on the bottom right window of NetStumbler mean? \nThe numbers are: number of APs filtered vs. the number of total APs. So if you have 8 APs, 2 with Wep and have Wep as a filter it would show 2/8. With no filters, it would show 8/8. \n\t\t","torrent":{"xt":"urn:btih:fa4c3f66fba73b7ce297359b2ed6388e78984dbe","amp;dn":"NetStumbler+and+MiniStumbler+%28Working%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa4c3f66fba73b7ce297359b2ed6388e78984dbe","infoHashBuffer":{"type":"Buffer","data":[250,76,63,102,251,167,59,124,226,151,53,155,46,214,56,142,120,152,77,190]},"announce":[],"urlList":[]}}