{"title":"The Museum Of Curiosity - S01 to 03 - Audio Comedy - MP3 - Slimo","uid":5627884,"size":482384365,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fa78c3b1296164ac33f34c4c00fcb032389aa970&amp;dn=The+Museum+Of+Curiosity+-+S01+to+03+-+Audio+Comedy+-+MP3+-+Slimo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"_Slimoo_","files":18,"time":1276550818,"description":"The Museum Of Curiosity - Series 01 to 03 - Audio Comedy - BBC Radio 4 via DVB-T\n18 x 30 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\nThis show is built on the concept that the (fictional) Museum of Curiosity is a vast building with a mission statement of housing everything in the universe that is in some way curious. Each week a panel made up of entertainers and academic experts put forward their curiosities to the head of the museum \n\nThe only rule for donation is that the exhibit has to be in some way curious. It doesn't matter if something is big, small, expensive, or even if it doesn't exist. Current exhibits in the Museum include a yeti, the Holy Grail, the Big Bang when it was the size of a grapefruit, and the urge to press red buttons that should not be pressed.\n\nwww.comedy.org.uk Review: \n[quote]A curious programme which is in many ways a spin-off from the hit TV series QI. What is mainly notable about this programme is that it not only features comedians, but it also gives guest spots to academics such as historians, mathematicians and paleontologists. However, the programme still manages to maintain an amusing edge. There are some listeners however, who feel that too much time is taken with the guests and not with the exhibits they donate.[/quote]\n\nThe series has achieved a considerable following and plans are underway to build a website devoted to the show with forums, podcasts and exhibits.\n\n\n\nCast:\nBill Bailey - Curator Series 01\nSean Lock - Curator Series 02\nJon Richardson - Curator Series 03\n\nJohn Lloyd - The Professor of Ignorance at the University of Buckingham\n\n\nGuests Include:\nSean Lock\nBrian Blessed.\nBen Elton\nArthur Smith\nKevin Day\nJonathan Miller\nAlan Davies \nDave Gorman\nChris Addison\nKate Adie\nClive James\nJonathan Miller\nBrian Eno\nDave Gorman\nBettany Hughes\nChris Addison\nCharlotte Uhlenbroek\nTim Minchin\nSir Terry Pratchett\nShappi Khorsandi\nLeigh Francis\nRonni Ancona\nSarah Millican\n &lt;a href=&quot;\nhttp://www.comedy.org.uk/guide/radio/museum_curiosity/episodes/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.comedy.org.uk/guide/radio/museum_curiosity/episodes/&lt;/a&gt;\n\nThe Museum Of Curiosity - S01 - E01 - Meeting One \nThe Museum Of Curiosity - S01 - E02 - Meeting Two \nThe Museum Of Curiosity - S01 - E03 - Meeting Three \nThe Museum Of Curiosity - S01 - E04 - Meeting Four \nThe Museum Of Curiosity - S01 - E05 - Meeting Five \nThe Museum Of Curiosity - S01 - E06 - Meeting Six \n\nThe Museum Of Curiosity - S02 - E01 - Meeting Seven \nThe Museum Of Curiosity - S02 - E02 - Meeting Eight \nThe Museum Of Curiosity - S02 - E03 - Meeting Nine \nThe Museum Of Curiosity - S02 - E04 - Meeting Ten \nThe Museum Of Curiosity - S02 - E05 - Meeting Eleven \nThe Museum Of Curiosity - S02 - E06 - Meeting Twelve \n\nThe Museum Of Curiosity - S03 - E01 - Meeting Thirteen\nThe Museum Of Curiosity - S03 - E02 - Meeting Fourteen\nThe Museum Of Curiosity - S03 - E03 - Meeting Fifteen\nThe Museum Of Curiosity - S03 - E04 - Meeting Sixteen\nThe Museum Of Curiosity - S03 - E05 - Meeting Seventeen\nThe Museum Of Curiosity - S03 - E06 - Meeting Eighteen\n\n\nAudio Format    : MP3\nDuration        : 28mn 1s\nBit rate mode   : Constant\nBit rate        : 128 Kbps\nChannel(s)      : 2 channels\nSampling rate   : 44.1 KHz\nResolution      : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:fa78c3b1296164ac33f34c4c00fcb032389aa970","amp;dn":"The+Museum+Of+Curiosity+-+S01+to+03+-+Audio+Comedy+-+MP3+-+Slimo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa78c3b1296164ac33f34c4c00fcb032389aa970","infoHashBuffer":{"type":"Buffer","data":[250,120,195,177,41,97,100,172,51,243,76,76,0,252,176,50,56,154,169,112]},"announce":[],"urlList":[]}}