{"title":"2014 - The Year In Christian Music (Bundle 05)","uid":9610751,"size":2174156533,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fad49c56c165ae454b5c2dc4c940d8d7c27da5c7&amp;dn=2014+-+The+Year+In+Christian+Music+%28Bundle+05%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":3,"uploader":"TorrentTracts","files":247,"time":1392315101,"description":"-----------------------------------------------------------------------\n2014 - THE YEAR IN CHRISTIAN MUSIC\n-----------------------------------------------------------------------\n\nI've been reading from Luke this past week.  And in it, I have learned a lesson I hadn't noticed before.  Setting the stage ... Jesus is traveling near Samaria and Galilee.  There, he sees ten beggars with leprosy, pleading with Jesus for pity, and no doubt a cure for their condition.  Jesus commands all ten men to go to the priests, where He assures them they will be cleansed.\n\nAll ten go.  All ten are cleansed.  Yet only one of the ten men bothers to return to Jesus to thank Him.\n\nLuke 17:11-19\n\nThe lesson?  Not to judge the Lord's effectiveness based upon the lack of response of the men He was serving.  And I think that's true here with these torrents too.  I don't need someone patting me on the back saying &quot;Ata Boy.&quot;  Sure I enjoy and appreciate your correspondence.  D'uh!  What Christian wouldn't appreciate genuine fellowship with other like-minded Christians?  I do!  It is, after all, a source of strength for us.  Amen?\n\nBut sometimes when those within our fellowship turn on one another, that has always troubled me.  And surely it must trouble the Lord too.\n\nThis past week Lategrad, a person I previously had pleasant correspondence with, decided to try and discourage my ministry.  Suggesting that what I do here is unimportant, and completely effortless.  And that compared to others serving the Lord (such as his own Mom), I wasn't.\n\nAt first I was angry.  Why was I continuing to waste my time waiting on unthankful so-called &quot;Christians&quot; here.  I don't get this type of grief elsewhere online from Christians I share with.  Certainly I had enough on my plate, I didn't need the drama.  Right?  So I started to share on other websites that evening and following morning, once again dismissing The Pirate Bay from my continued participation.\n\nBut that's not the answer.  Who among us hasn't stumbled or wandered?  Who among us hasn't made mistakes?  We're not perfect.  And dare I say, we're not even religious.  We're merely redeemed.  Period.  Redeemed sinners.  Amen?  And although I'm upset that Lategrad felt the need to discourage my ministry (without considering the consequences of his comments perhaps robbing that one unsaved person out there who might use this music to someday bow before the cross), he still doesn't deserve my anger.  Instead he deserves my prayers.  And my friendship.  And I hope some of you will consider praying for him too.\n\nLategrad's not a bad person.  I would think that maybe he's just a little lost right now in being able to perhaps see the bigger picture.  And in being able to see the damage his comments can have towards &quot;ANY&quot; ministry for the Lord.  Because someone who loves the Lord doesn't discourage and/or trivialize the ministries of others.  Any calling by the Lord, big or small, (and yes, including my own here) is indeed very meaningful work.\n\nLategrad, I forgive you brother.\n\nSINGER-SONGWRITER: Alex Davis, Cageless Birds.  POP: Allistair, Katy Hudson, Kyle Kupecky.  PRAISE &amp; WORSHIP: The Anchor Fellowship, Living Word Worship.  HIP-HOP/RAP: Authentic, D'Andre Martin, Gregory Elijah, Nico Wells, Prestige, SoulzSquad.  ROCK: Carrollton, Jaron Touhey, Kutless, Sumerlin, We Shot The Moon.  CONTEMPORARY: City Harbor, Jason Chatham.  ALTERNATIVE: The Civil Wars, Needtobreathe,  Stephen Hample.  ELECTRONIC: David And Goliath.  JAZZ: Gregory Tardy.  HARDCORE/METAL: Monolith.  R&amp;B: Noel Gourdin.  FOLK: Rachel Laderoute.  DANCE: Various.\n\nOur year-to-date count is up to 185 releases for 2014.\n\nBundle #5 contains the following 31 releases...\n\n * Alex Davis - 2014 - Letters EP\n * Allistair - 2014 - Just A Little Bit - Single\n * Anchor Fellowship, The - 2014 - My Song Is Jesus\n * Authentic - 2014 - Rebirth The Mixtape\n * Cageless Birds - 2014 - Live At Home\n * Carrollton - 2014 - Breathe In Deep EP\n * Carrollton - 2014 - Pass You By - Single\n * City Harbor - 2014 - City Harbor - Deluxe Edition\n * Civil Wars, The - 2014 - Between The Bars EP\n * D'Andre Martin - 2014 - Space Cadet - Dreamality\n * David And Goliath - 2014 - Creatures\n * Gregory Elijah - 2014 - Welcome Home\n * Gregory Tardy - 2014 - Hope\n * Jaron Touhey - 2014 - Seasons\n * Jason Chatham - 2014 - Between Wind And Water\n * Katy Hudson - 2014 - Katy Hudson - Re-Release\n * Kutless - 2014 - Glory - Deluxe Edition\n * Kyle Kupecky - 2014 - Give You The World - Single\n * Living Word Worship - 2014 - Be Lifted Up\n * Monolith - 2014 - Near Crash EP\n * Needtobreathe - 2014 - The Heart - Difference Maker\n * Nico Wells - 2014 - No Eyes Allowes\n * Noel Gourdin - 2014 - Heaven Knows - Single\n * Prestige - 2014 - FOURplay EP\n * Rachel Laderoute - 2014 - Country Mile\n * SoulzSquad - 2014 - One More Chance\n * Stephen Hample - 2014 - I Wanna Sing Praises\n * Stephen Hample - 2014 - Real Life - Single\n * Sumerlin - 2014 - Runaways\n * Various - 2014 - Christian ElectroMixx, Vol 8\n * We Shot The Moon - 2014 - The Finish Line\n\nFor Him,\nTorrentTracts, February 2014","torrent":{"xt":"urn:btih:fad49c56c165ae454b5c2dc4c940d8d7c27da5c7","amp;dn":"2014+-+The+Year+In+Christian+Music+%28Bundle+05%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fad49c56c165ae454b5c2dc4c940d8d7c27da5c7","infoHashBuffer":{"type":"Buffer","data":[250,212,156,86,193,101,174,69,75,92,45,196,201,64,216,215,194,125,165,199]},"announce":[],"urlList":[]}}