{"title":"Harry Smith's Anthology of American Folk Music Vol. 4 {FLAC]","uid":4699916,"size":329158159,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fae989af9bf891ef7de131e27f5ef6e829b1ef95&amp;dn=Harry+Smith%5C%27s+Anthology+of+American+Folk+Music+Vol.+4+%7BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"storoa","files":34,"time":1233685004,"description":"Review\tby Richie Unterberger\n\nThe Harry Smith-compiled three-volume Anthology of American Folk Music set, originally released in the 1950s and reissued to much brouhaha in 1997, was one of the most important records in launching the folk revival. It was not well known, though, that Smith compiled a fourth volume that was unissued. Revenant finally put it out in 2000, and like its three predecessors, it contains classic pre-World War II American country, blues, and folk music, with some gospel and Cajun too. It does differ from the first three volumes in its focus on a slightly later period, with all the tracks culled from the years 1928-1940. Leadbelly, Robert Johnson, Joe Williams, Bukka White, Memphis Minnie, and John Estes are all major blues artists; the Monroe Brothers, the Carter Family, Uncle Dave Macon, and the Blue Sky Boys all giant country/bluegrass pioneers; and the Hackberry Ramblers are one of the pre-eminent Cajun groups. A few of these songs are archetypes that have burned their way into the American collective musical consciousness: John Estes' &quot;Milk Cow Blues,&quot; the Carter Family's &quot;No Depression in Heaven,&quot; Joe Williams' &quot;Baby Please Don't Go,&quot; and the Monroe Brothers' &quot;Nine Pound Hammer Is Too Heavy.&quot; Other less famous performances are quite intriguing, like Sister Clara Hudmon's &quot;Stand By Me&quot; (believed by some to be Bessie Smith recording under a pseudonym) and Jesse James' raw and rollicking piano blues &quot;Southern Casey Jones.&quot; At 28 songs spread over two CDs, it's a little shorter than might be expected for a box set, though as compensation, it's enclosed in a pretty incredible 96-page liner-note-sized hardcover book with writing by Dick Spottswood and John Fahey. ","torrent":{"xt":"urn:btih:fae989af9bf891ef7de131e27f5ef6e829b1ef95","amp;dn":"Harry+Smith%5C%27s+Anthology+of+American+Folk+Music+Vol.+4+%7BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fae989af9bf891ef7de131e27f5ef6e829b1ef95","infoHashBuffer":{"type":"Buffer","data":[250,233,137,175,155,248,145,239,125,225,49,226,127,94,246,232,41,177,239,149]},"announce":[],"urlList":[]}}