{"title":"Vietnam War Almanac","uid":11739372,"size":7894682,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb81199d684fb38fb31490e25309288514b6d1a6&amp;dn=Vietnam+War+Almanac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425710613,"description":"This is the essential one-stop source for history buffs interested in the Vietnam War. The Vietnam War was one of the most controversial and divisive events in American history since the Civil War. Stretching from approximately 1957 to 1973, this watershed event cost billions of dollars and claimed the lives of thousands of Americans. Containing a detailed, day-by-day chronology of the events and people involved in the Vietnam War, the new &quot;Vietnam War Almanac&quot; also features an A-to-Z biographical dictionary of the key figures involved in the conflict, along with a comprehensive listing of vital statistics in the appendix. Maps, illustrations, and an extensive bibliography aid further research and complete this invaluable almanac. Coverage of this title includes: Creighton W. Abrams; George W. Ball; William E. Colby; Walter L. Cronkite; Ngo Dinh Diem; Vo Nguyen Giap; David Halberstam; Ho Chi Minh; Hubert Humphrey; Lyndon B. Johnson; John F. Kennedy; Henry A. Kissinger; Henry Cabot Lodge; Robert S. McNamara; Richard M. Nixon; Dean Rusk; Cao Van Vien; and, William C. Westmoreland","torrent":{"xt":"urn:btih:fb81199d684fb38fb31490e25309288514b6d1a6","amp;dn":"Vietnam+War+Almanac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb81199d684fb38fb31490e25309288514b6d1a6","infoHashBuffer":{"type":"Buffer","data":[251,129,25,157,104,79,179,143,179,20,144,226,83,9,40,133,20,182,209,166]},"announce":[],"urlList":[]}}