{"title":"Steve Martin-The Crow New Songs For The Five-String Banjo-2009","uid":4712917,"size":41876063,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fb891dc398af70244f06164d5f8764919cf7166d&amp;dn=Steve+Martin-The+Crow+New+Songs+For+The+Five-String+Banjo-2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1234130933,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nStephen Glenn &quot;Steve&quot; Martin, fÃƒÂ¶dd 14 augusti 1945 i Waco i Texas, ÃƒÂ¤r en amerikansk skÃƒÂ¥despelare, komiker, filmproducent, fÃƒÂ¶rfattare, musiker och kompositÃƒÂ¶r.\nMartin fÃƒÂ¶ddes i Waco i Texas, men flyttade som barn till Kalifornien, dÃƒÂ¤r han vÃƒÂ¤xte upp i Garden Grove i Orange County.\nMartin bÃƒÂ¶rjade som stÃƒÂ¥uppkomiker. Han hade en olistad roll i Bruce Lee-filmen Tang shan da xiong (1971). Den fÃƒÂ¶rsta officiella rollen i en lÃƒÂ¥ngfilm var dock i Sgt. Pepper's Lonely Hearts Club Band (1978). Har varit vÃƒÂ¤rd fÃƒÂ¶r Saturday Night Live femton gÃƒÂ¥nger.\nMartin ÃƒÂ¤r medlem i Mensa, en fÃƒÂ¶rening fÃƒÂ¶r mÃƒÂ¤nniskor med hÃƒÂ¶gt IQ.\nMartin var gift med den brittiska skÃƒÂ¥despelerskan Victoria Tennant frÃƒÂ¥n 20 november 1986 till 1994. Den 28 juli 2007 gifte han sig med Anne Stringfield.\n\nActor/comedian/musician and bestselling author Steve Martin will release his first full-length music album The Crow: New Songs for the Five-String Banjo on January 27, 2009. The bluegrass flavored album will be available exclusively on Amazon.com for the first 90 days. Martin is scheduled to host and perform on &quot;Saturday Night Live &quot; on January 31st as well as make several more television appearances, including the &quot;The Late Show with David Letterman&quot; on February 2, and &quot;Good Morning America&quot; and &quot;Live with Regis &amp; Kelly&quot; on February 3 in support of the The Crow and the major motion picture release of Pink Panther 2. A three-time Grammy winner, two for comedy albums Wild and Crazy Guy (1978) and Let's Get Small (1977) and one in music for his collaboration with Earl Scruggs on Foggy Mountain Breakdown (2001), Martin is currently nominated for Born Standing Up (2008) in the Best Spoken Word Album category. \nAfter playing on the Grammy Award  winning Foggy Mountain Breakdown with Earl Scruggs, Martin began writing a string of new banjo songs, some with lyrics and some as instrumentals. \n\nAn album 45 years in the making, The Crow: New Songs for the Five-String \nBanjo features special vocal appearances by Mary Black, Vince Gill, Tim O'Brien, Dolly Parton and musicians Earl Scruggs, Pete Wernick and Tony Trischka. Recorded in Dublin, Hollywood, Nashville and New Jersey and produced by John McEuen, of the Nitty Gritty Dirt Band, the record consists of 15 original tracks written by Martin. \n&quot;I have loved the banjo my whole life,&quot; says Martin. &quot;The songs on this record represent the influence of a dozen players and a thousand tunes, and I thank them all. But it's the banjo itself I thank most for generating nostalgia for experiences I never had, joy I was yet to experience, and melancholy that was yet to come.&quot; \nMartin will reprise the role of intrepid-if-bumbling French police detective, Inspector Jacques Clouseau in MGM's The Pink Panther 2, in theaters February 6, 2009. When legendary treasures from around the world are stolen, including the priceless Pink Panther Diamond, Chief Inspector Dreyfus (John Cleese) is forced to assign Clouseau to a team of international detectives and experts charged with catching the thief and retrieving the stolen artifacts. Martin is joined by his co-stars Jean Reno (as Ponton, his partner) and Emily Mortimer (as Nicole, the object of his awkward affections). The investigative dream team is played by Andy Garcia, Alfred Molina, Yuki Matsuzaki and Bollywood star Aishwarya Rai Bachchan. Lily Tomlin also stars. \n\n\n\n","torrent":{"xt":"urn:btih:fb891dc398af70244f06164d5f8764919cf7166d","amp;dn":"Steve+Martin-The+Crow+New+Songs+For+The+Five-String+Banjo-2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb891dc398af70244f06164d5f8764919cf7166d","infoHashBuffer":{"type":"Buffer","data":[251,137,29,195,152,175,112,36,79,6,22,77,95,135,100,145,156,247,22,109]},"announce":[],"urlList":[]}}