{"title":"Brother Cadfael Mysteries (1-3)  -  Ellis Peters","uid":11684604,"size":541426548,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fc71c856bb2855f4485b5a6613f3f90807a8572b&amp;dn=Brother+Cadfael+Mysteries+%281-3%29++-++Ellis+Peters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":5,"uploader":"davieboy1966","files":71,"time":1423265481,"description":"Audio Books : Mystery and Suspense : Other quality : English\n\n\nAll from MP3CD. 48 kbps / 44 kHz Mono, Fraunhofer CBR MP3.\nAll are narrated by Stephen Thorne.\n\n\n\nAt and around Shrewsbury abbey in the 12th-century, Brother Cadfael is a Benedictine monk with a difference. Given a choice, he would enjoy just being a simple gardener and herbalist for his home.\nHowever too often, events force him to use his other talent as a master sleuth in response to mysterious crimes happening in his community.\nWhile he investigates these crimes, he often finds himself at odds with the church and contemporary attitudes of the times. (KC)\n\n1. A Morbid Taste for Bones [1977], 7 hours 20 mins, 162 MB\nIn the 12th-century Benedictine monastery of Shrewsbury, Brother Cadfael has settled down to a quiet life in charge of the herbarium, but the ambitious head of Shrewsbury Abbey has decided to acquire the remains of Saint Winifred for his Benedictine order, and Brother Cadfael is chosen as part of the expedition to be sent to her final resting place in Wales, where they find the villagers passionately divided by the Benedictines? offer. Canny and all too worldly, Cadfael isn't surprised when this taste for bones leads to bloody murder. The leading opponent to moving the grave has been shot dead with a mysterious arrow, and some say Winifred herself dealt the blow. Brother Cadfael knows that a carnal hand did the killings, but he doesn't know that his plan to unearth a murderer may dig up a case of love and justice...\n\n2. One Corpse Too Many [1979], 8 hours 5 mins, 180 MB\nIn the summer of 1138, war between King Stephen and the Empress Maud takes brother Cadfael from the quiet world of his garden to the bloody battlefield. Not far from the safety of the Abbey walls, Shrewsbury Castle falls, leaving its 94 defenders loyal to the empress to hang as traitors. With a heavy heart, Brother Cadfael agrees to bury the dead, only to make a grisly discovery: 95 bodies lie in a row, and the extra corpse tells Cadfael that the killer is both clever and ruthless. But one death among so many seems unimportant to all but the good Benedictine. He vows to find the truth behind disparate clues.\n\n3. Monk's Hood [1980], 7 hours 48 mins, 173 MB\nGervase Bonel, with his wife and servants, is a guest of Shrewsbury Abbey of Saint Peter and Saint Paul when he is suddenly taken ill. Luckily, the Abbey boasts the services of clever and kindly Brother Cadfael, a skilled herbalist. Cadfael hurries to the man's bedside, only to be confronted by two very different surprises. In Master Bonel's wife, the good monk recognises Richildis, whom he loved many years ago before he took his vows. And Master Bonel has been fatally poisoned by a dose of deadly monk's-hood oil from Cadfael's herbarium. The Sheriff is convinced that the murderer is Richildis' son Edwin, who had reasons aplenty to hate his stepfather. But Cadfael, guided in part by his tender concern for a woman to whom he was once betrothed, is certain of her son's innocence. Using his knowledge of both herbs and the human heart, Cadfael deciphers a deadly recipe for murder...\n\n* These are new CD quality rips of the first three titles in the Cadfael Medieval Mystery series. Only the cassette versions were available in the past. Stephen Thorne's excellent narration is as compelling as always.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:fc71c856bb2855f4485b5a6613f3f90807a8572b","amp;dn":"Brother+Cadfael+Mysteries+%281-3%29++-++Ellis+Peters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc71c856bb2855f4485b5a6613f3f90807a8572b","infoHashBuffer":{"type":"Buffer","data":[252,113,200,86,187,40,85,244,72,91,90,102,19,243,249,8,7,168,87,43]},"announce":[],"urlList":[]}}