{"title":"Bird Hunter Wild Wings Edition","uid":9470480,"size":481546240,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fdc3e628a79c75a4b66297d8253d2c561d448b10&amp;dn=Bird+Hunter+Wild+Wings+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"twfh","files":-1,"time":1389555495,"description":"Endorsed by both the National Wild Turkey Federation and Pheasants Forever associations, Bird Hunter: Wild Wings Edition brings turkey, waterfowl, and upland birds into easy reach for the intrepid fowl hunter. An arsenal with nine models of shotguns, bow equipment, and a muzzleloader provides firepower for hunting through six virtual locations in Arkansas, California, and Nebraska.\n\nBird dogs, including the German shorthaired pointer, Hungarian shorthaired Viszla, Weimaraner, English setter, golden retriever, black and yellow Labrador, and the Chesapeake Bay retriever (male and female of each), are available for stalking 15 species of wild birds. Turkey, pheasant, dove, quail, grouse, prairie chicken, woodcock, goose, and duck are but some of the targets awaiting entry into your trophy room.\n\nBird Hunter: Wild Wings Edition features multiplayer action via the Internet or a LAN, a variety of hunting accessories such as calls, decoys, blinds, multiple shell selections, keyboard mapping, and Global Positioning, as well as a practice target range (skeet and trap), hints, tips, and recipes. Hunter models can be customized with name, appearance (camouflage), and weapon of choice, each with a unique trophy room, profile, and statistics.","torrent":{"xt":"urn:btih:fdc3e628a79c75a4b66297d8253d2c561d448b10","amp;dn":"Bird+Hunter+Wild+Wings+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdc3e628a79c75a4b66297d8253d2c561d448b10","infoHashBuffer":{"type":"Buffer","data":[253,195,230,40,167,156,117,164,182,98,151,216,37,61,44,86,29,68,139,16]},"announce":[],"urlList":[]}}