{"title":"CreativeLive - Sales, Sales, Sales.","uid":8151227,"size":6297881052,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fe1fb350d78244f435c65870ae59486552fe12ac&amp;dn=CreativeLive+-+Sales%2C+Sales%2C+Sales.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":2,"uploader":"eliadias","files":-1,"time":1361041150,"description":"Sick and tired with the password protected torrents I found on piratebay, I decided to download them myself and post it for all to view. Please enjoy, this is my first batch of torrents.\n\nJust unzip all the files and view it using your preferred media player..\n\nSincerly,\n\neliadias.\n\n\n\nCourse Summary:\n\nPeople love to buy ... but people hate to be sold to. If this is true for you, too, why would you ever want to be perceived as a salesperson? Most of us don't.This three-day course is dubbed &quot;The Comprehensive Course&quot; because it not only covers the nuts and bolts of achieving great sales but goes far beyond, with the intention of priming you to consistently sell your work for what it's truly worth - and to create even better relationships with clients who will appreciate a better experience.\n\nIf you own your own small business, you are in a 100% sales commission job. Tamara Lackey has worked in a 100%-commission based sales role for 15 years, achieving remarkable success in sales before she ever picked up a camera professionally. Tamara will show you exactly how she maintains a consistently high sales average in multiple genres, sharing how to conquer fear of criticism and self-doubt to make the entire process significantly more enjoyable and - a first for creativeLIVE - she will showcase detailed evaluations of each in-studio audience member's sales sessions to show what works, what doesn't, and how you may be killing your sales!\n","torrent":{"xt":"urn:btih:fe1fb350d78244f435c65870ae59486552fe12ac","amp;dn":"CreativeLive+-+Sales%2C+Sales%2C+Sales.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe1fb350d78244f435c65870ae59486552fe12ac","infoHashBuffer":{"type":"Buffer","data":[254,31,179,80,215,130,68,244,53,198,88,112,174,89,72,101,82,254,18,172]},"announce":[],"urlList":[]}}