{"title":"Tag&amp;Rename 3.5.7    (Add Tags to Music Files - MP3, FLAC, etc)","uid":6031082,"size":3505410,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fe82a932fc020dc271f9d12f920d79a7c24078cd&amp;dn=Tag%26Rename+3.5.7++++%28Add+Tags+to+Music+Files+-+MP3%2C+FLAC%2C+etc%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Lucy1948","files":3,"time":1292084646,"description":"Tag&amp;Rename is a music files tag editor that easily handles all popular digital audio formats. No matter what music compressor you prefer, you can keep your music collection organized with Tag&amp;Rename. It is the only tag editor and organizer which has full native support for: mp3 (ID3v1, ID3v2.2, ID3v2.3 and ID3v2.4 tags), MusePack mpc/mp+ (APEv1, APEv2 and ID3v1 tags), Windows Media wma, asf and wmv files, Ogg Vorbis/Flac/Speex (vorbis comments), Apple iTunes and iPod aac (m4a) files including mp4, lossless m4a and protected m4p files, most popular lossless codecs including Monkey's Audio, Flac, Wav Pack, Optim Frog, True Audio, Apple, Windows Media lossless, Wav and Aiff.\n\nTag&amp;Rename include full Unicode support.\n\nTag&amp;Rename supports many additional tag fields including lyrics, cover art, rating, mood, disc #, part of a compilation, album artist, classical music fields (Composer, Conductor, etc.), file related URL's and so on. With Tag&amp;Rename, you can:\n\n* manual and batch id3 tag editor\n* automatically fix and complete file tags using online freedb database\n* automatic load titles and cover art from amazon.com servers\n* automatic load album titles from tracktype.org server\n* get tags data from mp3's file names and its folders structures\n* rename your mp3 files and folders according to its music information in a batch\n* create play lists\n* export files information to CSV, HTML, XML and text formats and more\n\nTag&amp;Rename supports many files and tags standards in an easy and intuitive way, so you can work with music metadata and not have to think about files codecs and tags versions - Tag&amp;Rename does it all. This is a must have software for any mp3 or mp4 player owner.\n\nNew in this version:\n\n* added online &quot;Search for cover art&quot; function in web import and freedb import\n* added ability to use users own Amazon access keys\n* minor fixes in APEv2 support\n* minor fixes","torrent":{"xt":"urn:btih:fe82a932fc020dc271f9d12f920d79a7c24078cd","amp;dn":"Tag%26Rename+3.5.7++++%28Add+Tags+to+Music+Files+-+MP3%2C+FLAC%2C+etc%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe82a932fc020dc271f9d12f920d79a7c24078cd","infoHashBuffer":{"type":"Buffer","data":[254,130,169,50,252,2,13,194,113,249,209,47,146,13,121,167,194,64,120,205]},"announce":[],"urlList":[]}}