{"title":"It Takes a Village - Hillary Rodham Clinton","uid":11914941,"size":2082546,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fee16eb1d6fa06caffbb1c2db06d04b4a9dc0383&amp;dn=It+Takes+a+Village+-+Hillary+Rodham+Clinton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1431478231,"description":"In celebration of the tenth anniversary of It Takes a Village, this splendid edition includes photographs and a new Introduction by Senator Hillary Rodham Clinton.\n\nA decade ago, then First Lady Hillary Rodham Clinton chronicled her quest -- both deeply personal and, in the truest sense, public -- to help make our society into the kind of village that enables children to become smart, able, resilient adults. It Takes a Village is &quot;a textbook for caring.... Filled with truths that are worth a read, and a reread&quot; (The Dallas Morning News).\n\nFor more than thirty-five years, Senator Clinton has made children her passion and her cause. Her long experience -- not only through her roles as mother, daughter, sister, and wife but also as advocate, legal expert, and public servant -- has strengthened her conviction that how children develop and what they need to succeed are inextricably entwined with the society in which they live and how well it sustains and supports its families and individuals. In other words, it takes a village to raise a child.\n\nIn her new Introduction, Senator Clinton reflects on how our village has changed over the last decade -- from the impact of the Internet to new research in early child development and education. She discusses issues of increasing concern -- security, the environment, the national debt -- and looks at where we have made progress and where there is still work to be done.\n\nIt Takes a Village has become a classic. As relevant as ever, this anniversary edition makes it abundantly clear that the choices we make today about how we raise our children and how we support families will determine how our nation will face the challenges of this century","torrent":{"xt":"urn:btih:fee16eb1d6fa06caffbb1c2db06d04b4a9dc0383","amp;dn":"It+Takes+a+Village+-+Hillary+Rodham+Clinton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fee16eb1d6fa06caffbb1c2db06d04b4a9dc0383","infoHashBuffer":{"type":"Buffer","data":[254,225,110,177,214,250,6,202,255,187,28,45,176,109,4,180,169,220,3,131]},"announce":[],"urlList":[]}}