{"title":"Hitler's Hangman - The Life of Heydrich.pdf Gooner","uid":8675289,"size":3315639,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff0ec0fb492bb4546136e0b947bda501bfdff1dd&amp;dn=Hitler%27s+Hangman+-+The+Life+of+Heydrich.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":4,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1373576182,"description":"Reinhard Heydrich is widely recognized as one of the great iconic villains of the twentieth century, an appalling figure even within the context of the Nazi leadership. Chief of the Nazi Criminal Police, the SS Security Service, and the Gestapo, ruthless overlord of Nazi-occupied Bohemia and Moravia, and leading planner of the &quot;Final Solution,&quot; Heydrich played a central role in Hitler's Germany. He shouldered a major share of responsibility for some of the worst Nazi atrocities, and up to his assassination in Prague in 1942, he was widely seen as one of the most dangerous men in Nazi Germany. Yet Heydrich has received remarkably modest attention in the extensive literature of the Third Reich.\n\nRobert Gerwarth weaves together little-known stories of Heydrich's private life with his deeds as head of the Nazi Reich Security Main Office. Fully exploring Heydrich's progression from a privileged middle-class youth to a rapacious mass murderer, Gerwarth sheds new light on the complexity of Heydrich's adult character, his motivations, the incremental steps that led to unimaginable atrocities, and the consequences of his murderous efforts toward re-creating the entire ethnic makeup of Europe.","torrent":{"xt":"urn:btih:ff0ec0fb492bb4546136e0b947bda501bfdff1dd","amp;dn":"Hitler%27s+Hangman+-+The+Life+of+Heydrich.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff0ec0fb492bb4546136e0b947bda501bfdff1dd","infoHashBuffer":{"type":"Buffer","data":[255,14,192,251,73,43,180,84,97,54,224,185,71,189,165,1,191,223,241,221]},"announce":[],"urlList":[]}}